{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23898v1\", \"title\": \"An Explainable Neural Radiomic Sequence Model with Spatiotemporal\\n  Continuity for Quantifying 4DCT-based Pulmonary Ventilation\", \"summary\": \"Accurate evaluation of regional lung ventilation is essential for the\\nmanagement and treatment of lung cancer patients, supporting assessments of\\npulmonary function, optimization of therapeutic strategies, and monitoring of\\ntreatment response. Currently, ventilation scintigraphy using nuclear medicine\\ntechniques is widely employed in clinical practice; however, it is often\\ntime-consuming, costly, and entails additional radiation exposure. In this\\nstudy, we propose an explainable neural radiomic sequence model to identify\\nregions of compromised pulmonary ventilation based on four-dimensional computed\\ntomography (4DCT). A cohort of 45 lung cancer patients from the VAMPIRE dataset\\nwas analyzed. For each patient, lung volumes were segmented from 4DCT, and\\nvoxel-wise radiomic features (56-dimensional) were extracted across the\\nrespiratory cycle to capture local intensity and texture dynamics, forming\\ntemporal radiomic sequences. Ground truth ventilation defects were delineated\\nvoxel-wise using Galligas-PET and DTPA-SPECT. To identify compromised regions,\\nwe developed a temporal saliency-enhanced explainable long short-term memory\\n(LSTM) network trained on the radiomic sequences. Temporal saliency maps were\\ngenerated to highlight key features contributing to the model's predictions.\\nThe proposed model demonstrated robust performance, achieving average (range)\\nDice similarity coefficients of 0.78 (0.74-0.79) for 25 PET cases and 0.78\\n(0.74-0.82) for 20 SPECT cases. The temporal saliency map explained three key\\nradiomic sequences in ventilation quantification: during lung exhalation,\\ncompromised pulmonary function region typically exhibits (1) an increasing\\ntrend of intensity and (2) a decreasing trend of homogeneity, in contrast to\\nhealthy lung tissue.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph,cs.CV\", \"published\": \"2025-03-31T09:47:03Z\"}"}
