{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07519v1\", \"title\": \"VideoExpert: Augmented LLM for Temporal-Sensitive Video Understanding\", \"summary\": \"The core challenge in video understanding lies in perceiving dynamic content\\nchanges over time. However, multimodal large language models struggle with\\ntemporal-sensitive video tasks, which requires generating timestamps to mark\\nthe occurrence of specific events. Existing strategies require MLLMs to\\ngenerate absolute or relative timestamps directly. We have observed that those\\nMLLMs tend to rely more on language patterns than visual cues when generating\\ntimestamps, affecting their performance. To address this problem, we propose\\nVideoExpert, a general-purpose MLLM suitable for several temporal-sensitive\\nvideo tasks. Inspired by the expert concept, VideoExpert integrates two\\nparallel modules: the Temporal Expert and the Spatial Expert. The Temporal\\nExpert is responsible for modeling time sequences and performing temporal\\ngrounding. It processes high-frame-rate yet compressed tokens to capture\\ndynamic variations in videos and includes a lightweight prediction head for\\nprecise event localization. The Spatial Expert focuses on content detail\\nanalysis and instruction following. It handles specially designed spatial\\ntokens and language input, aiming to generate content-related responses. These\\ntwo experts collaborate seamlessly via a special token, ensuring coordinated\\ntemporal grounding and content generation. Notably, the Temporal and Spatial\\nExperts maintain independent parameter sets. By offloading temporal grounding\\nfrom content generation, VideoExpert prevents text pattern biases in timestamp\\npredictions. Moreover, we introduce a Spatial Compress module to obtain spatial\\ntokens. This module filters and compresses patch tokens while preserving key\\ninformation, delivering compact yet detail-rich input for the Spatial Expert.\\nExtensive experiments demonstrate the effectiveness and versatility of the\\nVideoExpert.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-10T07:33:39Z\"}"}
