{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05641v1\", \"title\": \"Testing black holes in a perfect fluid dark matter environment using\\n  quasinormal modes\", \"summary\": \"This research explores the quasinormal modes (QNMs) characteristics of\\ncharged black holes in a perfect fluid dark matter (PFDM) environment. Based on\\nthe Event Horizon Telescope (EHT) observations of the M87* black hole shadow,\\nwe implemented necessary constraints on the parameter\\nspace($a/M$,$\\\\lambda/M$).We found that for lower values of the magnetic charge\\nparameter, the effective range of the PFDM parameter is approximately between\\n-0.2 and 0, while as the magnetic charge parameter increases, this effective\\nrange gradually extends toward more negative values. Then through sixth-order\\nWKB method and time-domain method, we systematically analyzed the quasinormal\\noscillation spectra under scalar field and electromagnetic field perturbations.\\nThe results reveal that: the magnetic charge $a$ and PFDM parameters $\\\\lambda$\\nmodulate the effective potential barrier of black hole spacetime, profoundly\\ninfluencing the response frequency and energy dissipation characteristics of\\nexternal perturbations. The consistently negative imaginary part of QNMs across\\nthe entire physical parameter domain substantiates the dynamical stability of\\nthe investigated system. Moreover, we discovered differences in the parameter\\nvariation sensitivity between scalar field and electromagnetic field\\nperturbations, providing a theoretical basis for distinguishing different field\\ndisturbances. These results not only unveil the modulation mechanisms of\\nelectromagnetic interactions and dark matter distribution on black hole\\nspacetime structures but also offer potential observational evidence for future\\ngravitational wave detection and black hole environment identification.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc\", \"published\": \"2025-04-08T03:36:50Z\"}"}
