{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01360v1\", \"title\": \"A Bayesian approach for inverse potential problem with\\n  topological-Gaussian prior\", \"summary\": \"This paper addresses the reconstruction of a potential coefficient in an\\nelliptic problem from distributed observations within the Bayesian framework.\\nIn such problems, the selection of an appropriate prior distribution is\\ncrucial, particularly when the function to be inferred exhibits sharp\\ndiscontinuities, as traditional Gaussian priors often prove inadequate. To\\ntackle this challenge, we develop the topological prior (TP), a new prior\\nconstructed using persistent homology. The proposed prior utilizes persistent\\npairs to characterize and record the topological variations of the functions\\nunder reconstruction, thereby encoding prior information about the structure\\nand discontinuities of the function. The TP prior, however, only exists in a\\ndiscretized formulation, which leads to the absence of a well-defined posterior\\nmeasure in function spaces. To resolve this issue, we propose a TP-Gaussian\\nhybrid prior, where the TP component detects sharp discontinuities in the\\nfunction, while the Gaussian distribution acts as a reference measure, ensuring\\na well-defined posterior measure in the function space. The proposed TP prior\\ndemonstrates effects similar to the classical total variation (TV) prior but\\noffers greater flexibility and broader applicability due to three key\\nadvantages. First, it is defined on a general topological space, making it\\neasily adaptable to a wider range of applications. Second, the persistent\\ndistance captures richer topological information compared to the discrete TV\\nprior. Third, it incorporates more adjustable parameters, providing enhanced\\nflexibility to achieve robust numerical results. These features make the TP\\nprior a powerful tool for addressing inverse problems involving functions with\\nsharp discontinuities.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA\", \"published\": \"2025-04-02T05:06:42Z\"}"}
