{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23969v1\", \"title\": \"Electronic structure of UGe$_2$ at ambient pressure: comparison with\\n  X-ray photoemission spectra\", \"summary\": \"Based on experimental crystallographic data, electronic structure of UGe$_2$\\nhave been calculated and compared with our results of X-ray photoelectron\\nspectroscopy (XPS) measurements. We employed two different advanced full\\npotential (FP) methods: FP-local-orbital (FPLO) and FP-linear augmented plane\\nwaves (Wien2k) codes for non-magnetic and ferromagnetic states. Starting from\\nthe local spin-density approximation (LSDA) or generalised gradient\\napproximation (GGA), we verified either the orbital polarisation (OP)\\ncorrection or the GGA+U approach for the U 5f-electrons, changing\\nCoulomb-repulsion energies U in the range 0-4 eV. Satisfying agreement was\\nachieved between experimental and our calculated magnetic moments using\\nab-initio LSDA+OP and non-ab-initio GGA+U approaches, the latter for realistic\\nU values of 2-3 eV. We proved by the LSDA+OP approach an existence of the Fermi\\nsurface nesting vector along the a axis, possibly responsible for the triplet\\nsuperconducting pairing. The calculated data reveal predominantly an itinerant\\nU 5f-electron character of bands near the Fermi level, EF, with only small\\ncontributions from the U 6d and Ge 4p states. The experimental XPS spectrum of\\nvalence bands (VB) also contains the sharp main 5f-electron peak at EF, a wide\\nhump (around -2 eV), and broad small peaks at higher energies. In the\\ncalculated XPS spectrum, the width of the main 5f-electron peak varies between\\n0.8 and 1.4 eV, depending on a method used in computations, but the hump\\nremains unresolved. A newly observed asymmetric 1-eV satellite in the\\nexperimental 4f-core XPS spectrum together with known 3-eV and 7-eV satellites\\nsuggest dual behaviour of U-5f-electrons in UGe$_2$, the feature is inferred\\nalso from the VB studies.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,cond-mat.str-el,physics.comp-ph\", \"published\": \"2025-03-31T11:34:09Z\"}"}
