{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07491v1\", \"title\": \"Kimi-VL Technical Report\", \"summary\": \"We present Kimi-VL, an efficient open-source Mixture-of-Experts (MoE)\\nvision-language model (VLM) that offers advanced multimodal reasoning,\\nlong-context understanding, and strong agent capabilities - all while\\nactivating only 2.8B parameters in its language decoder (Kimi-VL-A3B). Kimi-VL\\ndemonstrates strong performance across challenging domains: as a\\ngeneral-purpose VLM, Kimi-VL excels in multi-turn agent tasks (e.g., OSWorld),\\nmatching flagship models. Furthermore, it exhibits remarkable capabilities\\nacross diverse challenging vision language tasks, including college-level image\\nand video comprehension, OCR, mathematical reasoning, and multi-image\\nunderstanding. In comparative evaluations, it effectively competes with\\ncutting-edge efficient VLMs such as GPT-4o-mini, Qwen2.5-VL-7B, and\\nGemma-3-12B-IT, while surpassing GPT-4o in several key domains. Kimi-VL also\\nadvances in processing long contexts and perceiving clearly. With a 128K\\nextended context window, Kimi-VL can process diverse long inputs, achieving\\nimpressive scores of 64.5 on LongVideoBench and 35.1 on MMLongBench-Doc. Its\\nnative-resolution vision encoder, MoonViT, further allows it to see and\\nunderstand ultra-high-resolution visual inputs, achieving 83.2 on InfoVQA and\\n34.5 on ScreenSpot-Pro, while maintaining lower computational cost for common\\ntasks. Building upon Kimi-VL, we introduce an advanced long-thinking variant:\\nKimi-VL-Thinking. Developed through long chain-of-thought (CoT) supervised\\nfine-tuning (SFT) and reinforcement learning (RL), this model exhibits strong\\nlong-horizon reasoning capabilities. It achieves scores of 61.7 on MMMU, 36.8\\non MathVision, and 71.3 on MathVista while maintaining the compact 2.8B\\nactivated LLM parameters, setting a new standard for efficient multimodal\\nthinking models. Code and models are publicly accessible at\\nhttps://github.com/MoonshotAI/Kimi-VL.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-10T06:48:26Z\"}"}
