{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06987v1\", \"title\": \"Enhancing Metabolic Syndrome Prediction with Hybrid Data Balancing and\\n  Counterfactuals\", \"summary\": \"Metabolic Syndrome (MetS) is a cluster of interrelated risk factors that\\nsignificantly increases the risk of cardiovascular diseases and type 2\\ndiabetes. Despite its global prevalence, accurate prediction of MetS remains\\nchallenging due to issues such as class imbalance, data scarcity, and\\nmethodological inconsistencies in existing studies. In this paper, we address\\nthese challenges by systematically evaluating and optimizing machine learning\\n(ML) models for MetS prediction, leveraging advanced data balancing techniques\\nand counterfactual analysis. Multiple ML models, including XGBoost, Random\\nForest, TabNet, etc., were trained and compared under various data balancing\\ntechniques such as random oversampling (ROS), SMOTE, ADASYN, and CTGAN.\\nAdditionally, we introduce MetaBoost, a novel hybrid framework that integrates\\nSMOTE, ADASYN, and CTGAN, optimizing synthetic data generation through weighted\\naveraging and iterative weight tuning to enhance the model's performance\\n(achieving a 1.14% accuracy improvement over individual balancing techniques).\\nA comprehensive counterfactual analysis is conducted to quantify feature-level\\nchanges required to shift individuals from high-risk to low-risk categories.\\nThe results indicate that blood glucose (50.3%) and triglycerides (46.7%) were\\nthe most frequently modified features, highlighting their clinical significance\\nin MetS risk reduction. Additionally, probabilistic analysis shows elevated\\nblood glucose (85.5% likelihood) and triglycerides (74.9% posterior\\nprobability) as the strongest predictors. This study not only advances the\\nmethodological rigor of MetS prediction but also provides actionable insights\\nfor clinicians and researchers, highlighting the potential of ML in mitigating\\nthe public health burden of metabolic syndrome.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-09T15:51:10Z\"}"}
