{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23872v1\", \"title\": \"European Strategy for Particle Physics 2026: the NA60+/DiCE experiment\\n  at the SPS\", \"summary\": \"The exploration of the phase diagram of Quantum ChromoDynamics (QCD) is\\ncarried out by studying ultrarelativistic heavy-ion collisions. The energy\\nrange covered by the CERN SPS ($\\\\sqrt{s_{\\\\rm {NN}}} \\\\sim 6-17$ GeV) is ideal\\nfor the investigation of the region corresponding to finite baryochemical\\npotential ($\\\\mu_{\\\\rm B}$), and was little explored up to now. We propose in\\nthis document a new experiment, NA60+/DiCE (Dilepton and Charm Experiment),\\nthat will address several observables which are fundamental for the\\nunderstanding of the phase transition from hadronic matter towards a\\nQuark-Gluon Plasma (QGP) at finite $\\\\mu_B$. In particular, we propose to study,\\nin Pb-Pb collisions, as a function of the collision energy, the production of\\nthermal dimuons, from which one can obtain a caloric curve of the QCD phase\\ndiagram that may be sensitive to the order of the phase transition. In\\naddition, the measurement of a $\\\\rho-{\\\\rm a}_1$ mixing contribution will\\nprovide conclusive insights into the restoration of the chiral symmetry of QCD.\\nStudies of open charm and charmonium production will also be carried out,\\naddressing the measurement of transport properties of the QGP and the\\ninvestigation of the onset of the deconfinement transition. Reference\\nmeasurements with proton-nucleus collisions are an essential part of this\\nprogram. The experimental set-up couples a vertex telescope based on monolithic\\nactive pixel sensors (MAPS) to a muon spectrometer with MWPC detectors. Two\\nexisting CERN dipole magnets, MEP48 and MNP33, will be used for the vertex and\\nmuon spectrometers, respectively. The continuing availability of Pb ion beams\\nin the CERN SPS is a crucial requirement for the experimental program. After\\nthe submission of a LoI, the experiment proposal is currently in preparation\\nand is due by mid 2025. The start of the data taking is foreseen by 2029/2030,\\nand should last about 7 years.\", \"main_category\": \"nucl-ex\", \"categories\": \"nucl-ex,hep-ex\", \"published\": \"2025-03-31T09:23:01Z\"}"}
