{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02405v1\", \"title\": \"Impact of helium ion irradiation on the thermal properties of\\n  superconducting nanowire single-photon detectors\", \"summary\": \"SNSPDs are indispensable for applications ranging from quantum information\\nprocessing to deep-space optical communications, owing to their high detection\\nefficiency, low dark counts, and excellent timing resolution. However, further\\nimproving the intrinsic detection efficiency (IDE) remains crucial for\\noptimizing SNSPD performance. Ion irradiation has recently emerged as a\\npowerful post-fabrication method to enhance SNSPD characteristics. Here, the\\neffects of He-ion irradiation on the thermal properties of NbN SNSPDs. We\\nsystematically examine the evolution of thermal boundary conductance as a\\nfunction of ion fluence (0-1.1E17 ions/cm2), observing a 57% decrease from 127\\nto 54 W/m^2K^4 with increasing fluence, followed by saturation at approximately\\n9E16 ions/cm2. At this fluence, the minimum hotspot relaxation time\\nmeasurements indicate a 41% increase, rising from 17 to 24 ps, while the\\nelectron-phonon interaction time extends by 14%, from 11.2 to 12.8 ps at 10 K.\\nTEM reveals defect formation at the NbN/SiO2 interface (6-8 nm) and He-bubble\\nformation within the SiO2 layer (30-260 nm), contributing to the extended\\nthermal relaxation time. These irradiation-induced modifications play a key\\nrole in enhancing the IDE of the treated devices. Furthermore, we demonstrate\\nan irradiated NbN SNSPD exhibiting a well-defined saturated IDE plateau at 2000\\nnm from 2.7 K to 28 mK, enabled by irradiation-induced modifications and an\\navalanche-assisted detection mechanism with weak wavelength dependence. Our\\nfindings provide valuable insights into ion irradiation as a post-processing\\ntechnique for SNSPDs, offering a pathway to enhancing IDE and tailoring thermal\\nproperties. This work also advances the understanding of SNSPD physics and\\ndefect engineering in superconducting thin films, expanding the potential\\napplications of irradiation techniques in superconducting optoelectronics.\", \"main_category\": \"physics.app-ph\", \"categories\": \"physics.app-ph,physics.ins-det,quant-ph\", \"published\": \"2025-04-03T08:54:30Z\"}"}
