{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01542v1\", \"title\": \"Register Always Matters: Analysis of LLM Pretraining Data Through the\\n  Lens of Language Variation\", \"summary\": \"Pretraining data curation is a cornerstone in Large Language Model (LLM)\\ndevelopment, leading to growing research on quality filtering of large web\\ncorpora. From statistical quality flags to LLM-based labeling systems, datasets\\nare divided into categories, frequently reducing to a binary: those passing the\\nfilters deemed as valuable examples, others discarded as useless or\\ndetrimental. However, a more detailed understanding of the contribution of\\ndifferent kinds of texts to model performance is still largely lacking. In this\\narticle, we present the first study utilizing registers (also known as genres)\\n- a widely used standard in corpus linguistics to model linguistic variation -\\nto curate pretraining datasets and investigate the effect of register on the\\nperformance of LLMs. We perform comparative studies by training models with\\nregister classified data and evaluating them using standard benchmarks, and\\nshow that the register of pretraining data substantially affects model\\nperformance. We uncover surprising relationships between the pretraining\\nmaterial and the resulting models: using the News register results in subpar\\nperformance, and on the contrary, including the Opinion class, covering texts\\nsuch as reviews and opinion blogs, is highly beneficial. While a model trained\\non the entire unfiltered dataset outperforms those trained on datasets limited\\nto a single register, combining well-performing registers like\\nHow-to-Instructions, Informational Description, and Opinion leads to major\\nimprovements. Furthermore, analysis of individual benchmark results reveals key\\ndifferences in the strengths and drawbacks of specific register classes as\\npretraining data. These findings show that register is an important explainer\\nof model variation and can facilitate more deliberate future data selection\\npractices.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-04-02T09:30:24Z\"}"}
