{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05055v1\", \"title\": \"Detecting relevant dependencies under measurement error with\\n  applications to the analysis of planetary system evolution\", \"summary\": \"Exoplanets play an important role in understanding the mechanics of planetary\\nsystem formation and orbital evolution. In this context the correlations of\\ndifferent parameters of the planets and their host star are useful guides in\\nthe search for explanatory mechanisms. Based on a reanalysis of the data set\\nfrom \\\\cite{figueria14} we study the as of now still poorly understood\\ncorrelation between planetary surface gravity and stellar activity of Hot\\nJupiters. Unfortunately, data collection often suffers from measurement errors\\ndue to complicated and indirect measurement setups, rendering standard\\ninference techniques unreliable.\\n  We present new methods to estimate and test for correlations in a\\ndeconvolution framework and thereby improve the state of the art analysis of\\nthe data in two directions. First, we are now able to account for additive\\nmeasurement errors which facilitates reliable inference. Second we test for\\nrelevant changes, i.e. we are testing for correlations exceeding a certain\\nthreshold $\\\\Delta$. This reflects the fact that small nonzero correlations are\\nto be expected for real life data almost always and that standard statistical\\ntests will therefore always reject the null of no correlation given sufficient\\ndata. Our theory focuses on quantities that can be estimated by U-Statistics\\nwhich contain a variety of correlation measures. We propose a bootstrap test\\nand establish its theoretical validity. As a by product we also obtain\\nconfidence intervals. Applying our methods to the Hot Jupiter data set from\\n\\\\cite{figueria14}, we observe that taking into account the measurement errors\\nyields smaller point estimates and the null of no relevant correlation is\\nrejected only for very small $\\\\Delta$. This demonstrates the importance of\\nconsidering the impact of measurement errors to avoid misleading conclusions\\nfrom the resulting statistical analysis.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME,astro-ph.EP,astro-ph.IM,math.ST,stat.TH\", \"published\": \"2025-04-07T13:25:33Z\"}"}
