{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21755v1\", \"title\": \"VBench-2.0: Advancing Video Generation Benchmark Suite for Intrinsic\\n  Faithfulness\", \"summary\": \"Video generation has advanced significantly, evolving from producing\\nunrealistic outputs to generating videos that appear visually convincing and\\ntemporally coherent. To evaluate these video generative models, benchmarks such\\nas VBench have been developed to assess their faithfulness, measuring factors\\nlike per-frame aesthetics, temporal consistency, and basic prompt adherence.\\nHowever, these aspects mainly represent superficial faithfulness, which focus\\non whether the video appears visually convincing rather than whether it adheres\\nto real-world principles. While recent models perform increasingly well on\\nthese metrics, they still struggle to generate videos that are not just\\nvisually plausible but fundamentally realistic. To achieve real \\\"world models\\\"\\nthrough video generation, the next frontier lies in intrinsic faithfulness to\\nensure that generated videos adhere to physical laws, commonsense reasoning,\\nanatomical correctness, and compositional integrity. Achieving this level of\\nrealism is essential for applications such as AI-assisted filmmaking and\\nsimulated world modeling. To bridge this gap, we introduce VBench-2.0, a\\nnext-generation benchmark designed to automatically evaluate video generative\\nmodels for their intrinsic faithfulness. VBench-2.0 assesses five key\\ndimensions: Human Fidelity, Controllability, Creativity, Physics, and\\nCommonsense, each further broken down into fine-grained capabilities. Tailored\\nfor individual dimensions, our evaluation framework integrates generalists such\\nas state-of-the-art VLMs and LLMs, and specialists, including anomaly detection\\nmethods proposed for video generation. We conduct extensive annotations to\\nensure alignment with human judgment. By pushing beyond superficial\\nfaithfulness toward intrinsic faithfulness, VBench-2.0 aims to set a new\\nstandard for the next generation of video generative models in pursuit of\\nintrinsic faithfulness.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-03-27T17:57:01Z\"}"}
