{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06802v1\", \"title\": \"The ALMA-ATOMS survey: A sample of weak hot core candidates identified\\n  through line stacking\", \"summary\": \"Hot cores represent critical astrophysical environments for high-mass star\\nformation, distinguished by their rich spectra of organic molecular emission\\nlines. We aim to utilize high-angular resolution molecular line data from ALMA\\nto identify hot cores, with a particular focus on weak-emission candidates, and\\nto provide one of the largest samples of hot core candidates. We propose to use\\nspectral stacking and imaging techniques of complex organic molecules (COMs) in\\nthe ALMA-ATOMS survey, including line identification & weights, segmentation of\\nline datacubes, resampling, stacking and normalization, moment 0 maps, and data\\nanalysis, to search for hot core candidates. We classify cores with dense\\nemission of CH3OH and at least one molecule from the other six molecules as hot\\ncore candidates. In addition to the existing sample of 60 strong hot cores from\\nthe ALMA-ATOMS survey, we have detected 40 new weak candidates through\\nstacking. All hot core candidates display compact emission from at least one of\\nthe other six COM species. For the strong sample, the stacking method provides\\nmolecular column density estimates that are consistent with previous fitting\\nresults. For the newly identified weak candidates, all species except CH3CHO\\nshow compact emission in the stacked image, which cannot be fully resolved\\nspatially. These weak candidates exhibit column densities of COMs that are\\napproximately one order of magnitude lower than those of the strong sample. The\\nentire hot core sample, including the weak candidates, reveals tight\\ncorrelations between the compact emission of CH3OH and other COM species,\\nsuggesting they may share a similar chemical environment for COMs, with CH3OH\\npotentially acting as a precursor for other COMs. The molecular line stacking\\ntechnique is used to identify hot core candidates in this work, leading to the\\nidentification of 40 new hot core candidates.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-09T11:47:53Z\"}"}
