{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24077v1\", \"title\": \"Dust in the wind of outbursting young stars\", \"summary\": \"Context. Young Stellar Objects (YSOs) are observed to undergo powerful\\naccretion events known as FU Orionis outbursts (FUors). Such events of episodic\\naccretion are now considered to be common during low mass star formation,\\nwherein the accretion onto the protostar occurs through a surrounding\\ncentrifugal disk. Increasing evidence suggests that the magnetic disk winds are\\ncrucial for driving disk accretion, as they carry both mass and momentum away\\nfrom the disk. Aims. We aim to investigate the phenomenon of the ejection of\\nmagnetic disk winds during episodic accretion, with a focus on the dust\\ncontained within these winds. Methods. We conduct magnetohydrodynamic (MHD)\\nsimulations of formation and evolution of protoplanetary disk (PPD) in the\\nthin-disk limit. We include evolution of dust with two populations and a\\nrealistic prescription for viscosity during outbursts, which depends on the\\nlocal thermal ionization fraction. The disk evolves with the concurrent action\\nof viscosity, self-gravity and magnetic disk winds. Results. The simulated disk\\ndisplays outbursting behavior in the early stages, with the duration and\\nfrequency of the bursts, their rise times, and brightness amplitudes resembling\\nthe observations of FUors. We find that during the outbursts, the winds are\\nover an order of magnitude more dusty, as compared to in quiescence. However,\\ndespite this increased dust content, the winds are still dust-depleted as the\\ndust-to-gas ratio is about an order of magnitude lower than the canonical\\ninterstellar value of 0.01. The results of our numerical experiments are in\\ngeneral agreement with the available observational findings and they shed a\\nlight on the mechanism behind production of dusty winds during outbursting\\nevents in YSOs.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.EP\", \"published\": \"2025-03-31T13:32:53Z\"}"}
