{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02301v1\", \"title\": \"Synchronization in bus systems with partially overlapping routes\", \"summary\": \"In an increasingly interconnected world, understanding congestion-related\\nphenomena in transportation and their underlying mechanisms is crucial for\\nimproving efficiency. As the transportation system becomes denser, different\\nmodes of transportation have more opportunities to interact with each other,\\ngiving rise to emergent dynamics that simple models cannot explain. In this\\nstudy, we investigate the synchronized motion of indirectly coupled\\ntransportation modes. We develop a numerical simulation model on a\\none-dimensional periodic lattice, where each point represents a bus station. In\\nthis system, two types of buses operate: multiple local buses with\\nnon-overlapping routes, each serving a specific zone, and a single global bus\\nthat partially overlaps with the routes of the local buses. We perform\\nnumerical simulations to examine how close the arrival times of these buses are\\nto each other -- that is, how synchronized their motions are. When the number\\nof zones is two, three, or five, robust synchronization occurs not only between\\nthe global bus and the local buses, but also among the local buses themselves.\\nIn contrast, no synchronization is found for other numbers of zones. We\\ndeveloped a mathematical model using self-consistent equations and found that\\ntwo distinct arrival patterns at the terminals must be considered. A stability\\nanalysis reveals which pattern is ultimately realized in the simulations. Our\\nresults show that transportation modes can exhibit coherent motion even when\\nsharing only partial or no direct route overlaps. This outcome highlights that\\nemergent behavior depends not only on local interactions but is also strongly\\nshaped by the system's overall structural configuration.\", \"main_category\": \"physics.soc-ph\", \"categories\": \"physics.soc-ph,nlin.AO\", \"published\": \"2025-04-03T06:18:22Z\"}"}
