{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05790v1\", \"title\": \"ViralQC: A Tool for Assessing Completeness and Contamination of\\n  Predicted Viral Contigs\", \"summary\": \"Motivation: Viruses represent the most abundant biological entities on the\\nplanet and play vital roles in diverse ecosystems. Cataloging viruses across\\nvarious environments is essential for understanding their properties and\\nfunctions. Metagenomic sequencing has emerged as the most comprehensive method\\nfor virus discovery, enabling the sequencing of all genetic materials,\\nincluding viruses, from host or environmental samples. However, distinguishing\\nviral sequences from the vast background of cellular organism-derived reads in\\nmetagenomic data remains a significant challenge. While several learning-based\\ntools, such as VirSorter2 and geNomad, have shown promise in identifying viral\\ncontigs, they often experience varying degrees of false positive rates due to\\nnoise in sequencing and assembly, shared genes between viruses and their hosts,\\nand the formation of proviruses within host genomes. This highlights the urgent\\nneed for an accurate and efficient method to evaluate the quality of viral\\ncontigs. Results: To address these challenges, we introduce ViralQC, a tool\\ndesigned to assess the quality of reported viral contigs or bins. ViralQC\\nidentifies contamination regions within putative viral sequences using\\nfoundation models trained on viral and cellular genomes and estimates viral\\ncompleteness through protein organization alignment. We evaluate ViralQC on\\nmultiple datasets and compare its performance against CheckV, the\\nstate-of-the-art in virus quality assessment. Notably, ViralQC correctly\\nidentifies 38% more contamination than CheckV, while maintaining a median\\nabsolute error of only 3%. In addition, ViralQC delivers more accurate results\\nfor medium- to high-quality (>50% completeness) contigs, demonstrating its\\nsuperior performance in completeness estimation.\", \"main_category\": \"q-bio.GN\", \"categories\": \"q-bio.GN\", \"published\": \"2025-04-08T08:14:44Z\"}"}
