{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06176v1\", \"title\": \"A Self-Supervised Framework for Space Object Behaviour Characterisation\", \"summary\": \"Foundation Models, pre-trained on large unlabelled datasets before\\ntask-specific fine-tuning, are increasingly being applied to specialised\\ndomains. Recent examples include ClimaX for climate and Clay for satellite\\nEarth observation, but a Foundation Model for Space Object Behavioural Analysis\\nhas not yet been developed. As orbital populations grow, automated methods for\\ncharacterising space object behaviour are crucial for space safety. We present\\na Space Safety and Sustainability Foundation Model focusing on space object\\nbehavioural analysis using light curves (LCs). We implemented a\\nPerceiver-Variational Autoencoder (VAE) architecture, pre-trained with\\nself-supervised reconstruction and masked reconstruction on 227,000 LCs from\\nthe MMT-9 observatory. The VAE enables anomaly detection, motion prediction,\\nand LC generation. We fine-tuned the model for anomaly detection & motion\\nprediction using two independent LC simulators (CASSANDRA and GRIAL\\nrespectively), using CAD models of boxwing, Sentinel-3, SMOS, and Starlink\\nplatforms. Our pre-trained model achieved a reconstruction error of 0.01%,\\nidentifying potentially anomalous light curves through reconstruction\\ndifficulty. After fine-tuning, the model scored 88% and 82% accuracy, with 0.90\\nand 0.95 ROC AUC scores respectively in both anomaly detection and motion mode\\nprediction (sun-pointing, spin, etc.). Analysis of high-confidence anomaly\\npredictions on real data revealed distinct patterns including characteristic\\nobject profiles and satellite glinting. Here, we demonstrate how\\nself-supervised learning can simultaneously enable anomaly detection, motion\\nprediction, and synthetic data generation from rich representations learned in\\npre-training. Our work therefore supports space safety and sustainability\\nthrough automated monitoring and simulation capabilities.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI,physics.space-ph\", \"published\": \"2025-04-08T16:19:19Z\"}"}
