{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06010v1\", \"title\": \"Latent Multimodal Reconstruction for Misinformation Detection\", \"summary\": \"Multimodal misinformation, such as miscaptioned images, where captions\\nmisrepresent an image's origin, context, or meaning, poses a growing challenge\\nin the digital age. To support fact-checkers, researchers have been focusing on\\ncreating datasets and developing methods for multimodal misinformation\\ndetection (MMD). Due to the scarcity of large-scale annotated MMD datasets,\\nrecent studies leverage synthetic training data via out-of-context\\nimage-caption pairs or named entity manipulations; altering names, dates, and\\nlocations. However, these approaches often produce simplistic misinformation\\nthat fails to reflect real-world complexity, limiting the robustness of\\ndetection models trained on them. Meanwhile, despite recent advancements, Large\\nVision-Language Models (LVLMs) remain underutilized for generating diverse,\\nrealistic synthetic training data for MMD. To address this gap, we introduce\\n\\\"MisCaption This!\\\", a training dataset comprising LVLM-generated miscaptioned\\nimages. Additionally, we introduce \\\"Latent Multimodal Reconstruction\\\" (LAMAR),\\na network trained to reconstruct the embeddings of truthful captions, providing\\na strong auxiliary signal to the detection process. To optimize LAMAR, we\\nexplore different training strategies (end-to-end training and large-scale\\npre-training) and integration approaches (direct, mask, gate, and attention).\\nExtensive experiments show that models trained on \\\"MisCaption This!\\\" generalize\\nbetter on real-world misinformation, while LAMAR sets new state-of-the-art on\\nboth NewsCLIPpings and VERITE benchmarks; highlighting the potential of\\nLVLM-generated data and reconstruction-based approaches for advancing MMD. We\\nrelease our code at:\\nhttps://github.com/stevejpapad/miscaptioned-image-reconstruction\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.MM\", \"published\": \"2025-04-08T13:16:48Z\"}"}
