{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05135v1\", \"title\": \"DA2Diff: Exploring Degradation-aware Adaptive Diffusion Priors for\\n  All-in-One Weather Restoration\", \"summary\": \"Image restoration under adverse weather conditions is a critical task for\\nmany vision-based applications. Recent all-in-one frameworks that handle\\nmultiple weather degradations within a unified model have shown potential.\\nHowever, the diversity of degradation patterns across different weather\\nconditions, as well as the complex and varied nature of real-world\\ndegradations, pose significant challenges for multiple weather removal. To\\naddress these challenges, we propose an innovative diffusion paradigm with\\ndegradation-aware adaptive priors for all-in-one weather restoration, termed\\nDA2Diff. It is a new exploration that applies CLIP to perceive\\ndegradation-aware properties for better multi-weather restoration.\\nSpecifically, we deploy a set of learnable prompts to capture degradation-aware\\nrepresentations by the prompt-image similarity constraints in the CLIP space.\\nBy aligning the snowy/hazy/rainy images with snow/haze/rain prompts, each\\nprompt contributes to different weather degradation characteristics. The\\nlearned prompts are then integrated into the diffusion model via the designed\\nweather specific prompt guidance module, making it possible to restore multiple\\nweather types. To further improve the adaptiveness to complex weather\\ndegradations, we propose a dynamic expert selection modulator that employs a\\ndynamic weather-aware router to flexibly dispatch varying numbers of\\nrestoration experts for each weather-distorted image, allowing the diffusion\\nmodel to restore diverse degradations adaptively. Experimental results\\nsubstantiate the favorable performance of DA2Diff over state-of-the-arts in\\nquantitative and qualitative evaluation. Source code will be available after\\nacceptance.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-07T14:38:57Z\"}"}
