{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05155v1\", \"title\": \"Phonon properties and unconventional heat transfer in quasi-2D\\n  $Bi_2O_2Se$ crystal\", \"summary\": \"Bi2O2Se belongs to a group of quasi-2D semiconductors that can replace\\nsilicon in future high-speed/low-power electronics. However, the correlation\\nbetween crystal/band structure and other physical properties still eludes\\nunderstanding: carrier mobility increases non-intuitively with carrier\\nconcentration; the observed $T^2$ temperature dependence of resistivity lacks\\nexplanation. Moreover, a very high relative out-of-plane permittivity of about\\n150 has been reported in the literature. A proper explanation for such a high\\npermittivity is still lacking. We have performed infrared (IR) reflectivity and\\nRaman scattering experiments on a large perfect single crystal with defined\\nmosaicity, carrier concentration and mobility. Five of the eight phonons\\nallowed by factor group theory have been observed and their symmetries\\ndetermined. The IR spectra show that the permittivity measured in the\\ntetragonal plane is as high as ${\\\\epsilon}_r{\\\\approx}500$, and this high value\\nis due to a strong polar phonon with a low frequency of ~34 $cm^{-1}$ (~1 THz).\\nSuch an unusually high permittivity allows the screening of charge defects,\\nleading to the observation of high electron mobility at low temperatures. It\\nalso allows effective modulation doping providing a platform for high\\nperformance 2D electronics. DFT calculations suggest the existence of a very\\nlow frequency acoustic phonon ~14 $cm^{-1}$ (~0.4 THz). Both the low frequency\\nphonons cause anomalous phonon DOS, which is reflected in the unconventional\\ntemperature dependence of the heat capacity, $c_M{\\\\approx}T^{3.5}$. The\\ntemperature-dependent, two-component group velocity is proposed to explains the\\nunusual temperature dependence of the thermal conductivity,\\n${\\\\kappa}{\\\\approx}T^{1.5}$\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-07T14:58:41Z\"}"}
