{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01748v1\", \"title\": \"Quantifying the scale of star formation across the Perseus spiral arm\\n  using young clusters around Cas OB5\", \"summary\": \"Cas OB5 is an OB association located at a distance of 2.5-3 kpc that\\nintercepts the Perseus spiral arm. It carries a moderate amount of reddening\\n($A_V \\\\sim$ 2-3 mag) and contains several well-known open clusters within its\\nboundaries, such as King 12, NGC 7788, and NGC 7790. The availability of modern\\nclustering algorithms, together with \\\\textit{Gaia} DR3 kinematics and\\ncomplementary spectroscopic data, makes it a suitable site for studies of\\nGalactic structure. We seek to quantify the spatial scale of star formation in\\nthe spiral arms, using Cas OB5 as a pilot target before extending our study to\\nmore distant and extinguished regions of the Galaxy. We selected 129,695\\ncandidate OBA stars in a 6x8 deg$^2$ region around Cas OB5. We applied a\\nspectral energy distribution (SED) fitting process to this sample to derive the\\nphysical parameters. Through this process, we found 56 379 OBA stars, which we\\nthen clustered using HDBSCAN. We identified 17 open clusters inside this area,\\nfour of which appear to form a coherent structure that we identify as Cas OB5.\\nNevertheless, our findings suggest that these clusters belong to two different\\nage groups despite sharing a similar position and kinematics. Spectroscopic\\nobservations confirm the youth of NGC 7788 (10-15 Myr) compared to NGC 7790\\n($110\\\\pm15\\\\:$Myr). We have determined a spatial scale for star formation of a\\nfew tens of pc to a few hundreds of pc, comparing the clustered to the diffuse\\npopulation of Cas~OB5 across this part of the Perseus arm. A spectroscopic\\nanalysis was required to complement the clustering algorithm, so that we could\\nseparate younger OCs (tracers of the spiral arm) from older ones. These results\\nhighlight the need to combine these techniques to fully disentangle the Milky\\nWay structure.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.SR\", \"published\": \"2025-04-02T14:00:29Z\"}"}
