{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01624v1\", \"title\": \"Glycemic Variability Before And After Hypoglycemia Across Different\\n  Timeframes In Type 1 Diabetes With And Without Automated Insulin Delivery\", \"summary\": \"Managing Type 1 diabetes (T1D) aims to optimize glucose levels within the\\ntarget range while minimizing hyperglycemia and hypoglycemia. Exercise presents\\nadditional challenges due to complex effects on glucose dynamics. Despite\\nadvancements in diabetes technology, significant gaps remain in understanding\\nthe relationship between exercise, glycemic variability (GV), and hypoglycemia\\nin both automated insulin delivery (AID) and non-AID users. Additionally,\\nlimited research explores the temporal progression of GV before and after\\nhypoglycemia and the impact of long-duration episodes on glucose recovery. This\\nstudy analyses the Type 1 Diabetes and Exercise Initiative (T1DEXI) dataset,\\nassessing GV, hypoglycemia, gender, and exercise interactions in AID (n=222)\\nand non-AID (n=276) users. The study examined patterns of glycemic variability\\nmetrics like time below range (TBR) surrounding hypoglycemia events, focusing\\non the 48 hours before and after these events. We further assess the impact of\\ndifferent hypoglycemia levels (41-50 mg/dL, 51-60 mg/dL, and 61-70 mg/dL) on\\npost-event glucose stability. GV increased before and after hypoglycemia up to\\n48 hours in both AID and non-AID users, with statistically significant\\ndifferences. TBR elevation persisted across all groups, peaking around\\nhypoglycemic episodes. Notably, females using AID achieved significantly\\nimproved glucose stability compared to non-AID females - a larger within-group\\ndifference than that observed in males. Individual-level AID analyses showed\\nthat long hypoglycemia episodes (>40 minutes) led to prolonged TBR elevation,\\nsuggesting slower recovery despite AID intervention. GV trends may aid in\\npredicting hypoglycemia over extended periods. Integrating GV patterns into AID\\nsystems could enhance glucose stability and mitigate hypoglycemia cycles.\", \"main_category\": \"q-bio.QM\", \"categories\": \"q-bio.QM\", \"published\": \"2025-04-02T11:30:34Z\"}"}
