{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01934v1\", \"title\": \"ILLUME+: Illuminating Unified MLLM with Dual Visual Tokenization and\\n  Diffusion Refinement\", \"summary\": \"We present ILLUME+ that leverages dual visual tokenization and a diffusion\\ndecoder to improve both deep semantic understanding and high-fidelity image\\ngeneration. Existing unified models have struggled to simultaneously handle the\\nthree fundamental capabilities in a unified model: understanding, generation,\\nand editing. Models like Chameleon and EMU3 utilize VQGAN for image\\ndiscretization, due to the lack of deep semantic interaction, they lag behind\\nspecialist models like LLaVA in visual understanding tasks. To mitigate this,\\nLaViT and ILLUME employ semantic encoders for tokenization, but they struggle\\nwith image editing due to poor texture preservation. Meanwhile, Janus series\\ndecouples the input and output image representation, limiting their abilities\\nto seamlessly handle interleaved image-text understanding and generation. In\\ncontrast, ILLUME+ introduces a unified dual visual tokenizer, DualViTok, which\\npreserves both fine-grained textures and text-aligned semantics while enabling\\na coarse-to-fine image representation strategy for multimodal understanding and\\ngeneration. Additionally, we employ a diffusion model as the image detokenizer\\nfor enhanced generation quality and efficient super-resolution. ILLUME+ follows\\na continuous-input, discrete-output scheme within the unified MLLM and adopts a\\nprogressive training procedure that supports dynamic resolution across the\\nvision tokenizer, MLLM, and diffusion decoder. This design allows for flexible\\nand efficient context-aware image editing and generation across diverse tasks.\\nILLUME+ (3B) exhibits competitive performance against existing unified MLLMs\\nand specialized models across multimodal understanding, generation, and editing\\nbenchmarks. With its strong performance, ILLUME+ provides a scalable and\\nversatile foundation for future multimodal applications. Project Page:\\nhttps://illume-unified-mllm.github.io/.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-02T17:45:00Z\"}"}
