{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02566v1\", \"title\": \"Local Flow Estimation at the top of the Earth's Core using Physics\\n  Informed Neural Networks\", \"summary\": \"The Earth's main geomagnetic field arises from the constant motion of the\\nfluid outer core. By assuming that the field changes are advection-dominated,\\nthe fluid motion at the core surface can be related to the secular variation of\\nthe geomagnetic field. The majority of existing core flow models are global,\\nshowing features such as an eccentric planetary gyre, with some evidence of\\nrapid regional changes. By construction, the flow defined at any location by\\nsuch a model depends on all magnetic field variations across the entire\\ncore-mantle boundary making it challenging to interpret local structures in the\\nflow as due to specific local changes in magnetic field. Here we present an\\nalternative strategy in which we construct regional flow models that rely only\\non local secular changes. We use a novel technique based on machine learning\\ntermed Physics-Informed Neural Networks (PINNs), in which we seek a regional\\nflow model that simultaneously fits both the local magnetic field variation and\\ndynamical conditions assumed satisfied by the flow. Although we present results\\nusing the Tangentially Geostrophic flow constraint, we set out a modelling\\nframework for which the physics constraint can be easily changed by altering a\\nsingle line of code. After validating the PINN-based method on synthetic flows,\\nwe apply our method to the CHAOS-8.1 geomagnetic field model, itself based on\\ndata from Swarm. Constructing a global mosaic of regional flows, we reproduce\\nthe planetary gyre, providing independent evidence that the strong secular\\nchanges at high latitude and in equatorial regions are part of the same global\\nfeature. Our models also corroborate regional changes in core flows over the\\nlast decade. Furthermore, our models endorse the existence of a dynamic high\\nlatitude jet, which began accelerating around 2005 but has been weakening since\\n2017.\", \"main_category\": \"physics.geo-ph\", \"categories\": \"physics.geo-ph\", \"published\": \"2025-04-03T13:27:45Z\"}"}
