{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01767v1\", \"title\": \"Leveraging Embedding Techniques in Multimodal Machine Learning for\\n  Mental Illness Assessment\", \"summary\": \"The increasing global prevalence of mental disorders, such as depression and\\nPTSD, requires objective and scalable diagnostic tools. Traditional clinical\\nassessments often face limitations in accessibility, objectivity, and\\nconsistency. This paper investigates the potential of multimodal machine\\nlearning to address these challenges, leveraging the complementary information\\navailable in text, audio, and video data. Our approach involves a comprehensive\\nanalysis of various data preprocessing techniques, including novel chunking and\\nutterance-based formatting strategies. We systematically evaluate a range of\\nstate-of-the-art embedding models for each modality and employ Convolutional\\nNeural Networks (CNNs) and Bidirectional LSTM Networks (BiLSTMs) for feature\\nextraction. We explore data-level, feature-level, and decision-level fusion\\ntechniques, including a novel integration of Large Language Model (LLM)\\npredictions. We also investigate the impact of replacing Multilayer Perceptron\\nclassifiers with Support Vector Machines. We extend our analysis to severity\\nprediction using PHQ-8 and PCL-C scores and multi-class classification\\n(considering co-occurring conditions). Our results demonstrate that\\nutterance-based chunking significantly improves performance, particularly for\\ntext and audio modalities. Decision-level fusion, incorporating LLM\\npredictions, achieves the highest accuracy, with a balanced accuracy of 94.8%\\nfor depression and 96.2% for PTSD detection. The combination of CNN-BiLSTM\\narchitectures with utterance-level chunking, coupled with the integration of\\nexternal LLM, provides a powerful and nuanced approach to the detection and\\nassessment of mental health conditions. Our findings highlight the potential of\\nMMML for developing more accurate, accessible, and personalized mental\\nhealthcare tools.\", \"main_category\": \"eess.AS\", \"categories\": \"eess.AS,cs.AI,cs.CV\", \"published\": \"2025-04-02T14:19:06Z\"}"}
