{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02357v1\", \"title\": \"ReuseDroid: A VLM-empowered Android UI Test Migrator Boosted by Active\\n  Feedback\", \"summary\": \"GUI testing is an essential quality assurance process in mobile app\\ndevelopment. However, the creation and maintenance of GUI tests for mobile apps\\nare resource-intensive and costly. Recognizing that many apps share similar\\nfunctionalities, researchers have proposed various techniques to migrate GUI\\ntests from one app to another with similar features. For example, some\\ntechniques employ mapping-based approaches to align the GUI elements traversed\\nby the tests of a source app to those present in the target app. Other test\\nmigration techniques have also been proposed to leverage large language models\\n(LLMs) by adapting the GUI tasks in source tests. However, these techniques are\\nineffective in dealing with different operational logic between the source and\\ntarget apps. The semantics of GUI elements may not be correctly inferred due to\\nthe missing analysis of these flows. In this work, we propose REUSEDROID, a\\nnovel multiagent framework for GUI test migration empowered by Large\\nVision-Language Models (VLMs). REUSEDROID is powered by multiple VLM-based\\nagents, each tackling a stage of the test migration process by leveraging the\\nrelevant visual and textual information embedded in GUI pages. An insight of\\nREUSEDROID is to migrate tests based only on the core logic shared across\\nsimilar apps, while their entire operational logic could differ. We evaluate\\nREUSEDROID on LinPro, a new test migration dataset that consists of 578\\nmigration tasks for 39 popular apps across 4 categories. The experimental\\nresult shows that REUSEDROID can successfully migrate 90.3% of the migration\\ntasks, outperforming the best mapping-based and LLM-based baselines by 318.1%\\nand 109.1%, respectively.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-03T07:45:09Z\"}"}
