{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02750v1\", \"title\": \"Investigation of the influence of electrostatic excitation on\\n  instabilities and electron transport in ExB plasma configurations\", \"summary\": \"Partially magnetized plasmas in ExB configurations - where the electric and\\nmagnetic fields are mutually perpendicular - exhibit a cross-field transport\\nbehavior, which is widely believed to be dominantly governed by complex\\ninstability-driven mechanisms. This phenomenon plays a crucial role in a\\nvariety of plasma technologies, including Hall thrusters, where azimuthal\\ninstabilities significantly influence electron confinement and, hence, device\\nperformance. While the impact of prominent plasma instabilities, such as the\\nelectron cyclotron drift instability (ECDI) and the modified two-stream\\ninstability (MTSI) on cross-field transport of electron species is well\\nrecognized and widely studied, strategies for actively manipulating these\\ndynamics remain underexplored. In this study, we investigate the effect of\\ntargeted wave excitation on instability evolution and electron transport using\\none- and two-dimensional particle-in-cell simulations of representative plasma\\ndischarge configurations. A time-varying electric field is applied axially to\\nmodulate the spectral energy distribution of the instabilities across a range\\nof forcing frequencies and amplitudes. Our results reveal that the so-called\\n\\\"unsteady forcing\\\" can both suppress and amplify instability modes depending on\\nexcitation parameters. In particular, across both 1D and 2D simulation\\nconfigurations, forcing near 40 MHz effectively reduces ECDI amplitude and\\ndecreases axial electron transport by about 30%, while high-frequency\\nexcitation near the electron cyclotron frequency induces spectral broadening,\\ninverse energy cascades, and enhanced transport. These findings point to the\\nrole of nonlinear frequency locking and energy pathway disruption as mechanisms\\nfor modifying instability-driven transport. Our results offer insights into\\npotential pathways to enhance plasma confinement and control in next-generation\\nExB devices.\", \"main_category\": \"physics.plasm-ph\", \"categories\": \"physics.plasm-ph\", \"published\": \"2025-04-03T16:36:08Z\"}"}
