{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24183v1\", \"title\": \"Ride-Sourcing Vehicle Rebalancing with Service Accessibility Guarantees\\n  via Constrained Mean-Field Reinforcement Learning\", \"summary\": \"The rapid expansion of ride-sourcing services such as Uber, Lyft, and Didi\\nChuxing has fundamentally reshaped urban transportation by offering flexible,\\non-demand mobility via mobile applications. Despite their convenience, these\\nplatforms confront significant operational challenges, particularly vehicle\\nrebalancing - the strategic repositioning of thousands of vehicles to address\\nspatiotemporal mismatches in supply and demand. Inadequate rebalancing results\\nin prolonged rider waiting times, inefficient vehicle utilization, and\\ninequitable distribution of services, leading to disparities in driver\\navailability and income.\\n  To tackle these complexities, we introduce scalable continuous-state\\nmean-field control (MFC) and reinforcement learning (MFRL) models that\\nexplicitly represent each vehicle's precise location and employ continuous\\nrepositioning actions guided by the distribution of other vehicles. To ensure\\nequitable service distribution, an accessibility constraint is integrated\\nwithin our optimal control formulation, balancing operational efficiency with\\nequitable access to the service across geographic regions. Our approach\\nacknowledges realistic conditions, including inherent stochasticity in\\ntransitions, the simultaneous occurrence of vehicle-rider matching, vehicles'\\nrebalancing and cruising, and variability in rider behaviors. Crucially, we\\nrelax the traditional mean-field assumption of equal supply-demand volume,\\nbetter reflecting practical scenarios. Extensive empirical evaluation using\\nreal-world data-driven simulation of Shenzhen demonstrates the real-time\\nefficiency and robustness of our approach at the scale of tens of thousands of\\nvehicles.\\n  The code is available at\\nhttps://github.com/mjusup1501/mf-vehicle-rebalancing.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.MA\", \"published\": \"2025-03-31T15:00:11Z\"}"}
