{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24248v1\", \"title\": \"Optimizing PCA for Health and Care Research: A Reliable Approach to\\n  Component Selection\", \"summary\": \"PCA is widely used in health and care research to analyze complex HD\\ndatasets, such as patient health records, genetic data, and medical imaging. By\\nreducing dimensionality, PCA helps identify key patterns and trends, which can\\naid in disease diagnosis, treatment optimization, and the discovery of new\\nbiomarkers. However, the primary goal of any dimensional reduction technique is\\nto reduce the dimensionality in a data set while keeping the essential\\ninformation and variability. There are a few ways to do this in practice, such\\nas the Kaiser-Guttman criterion, Cattell's Scree Test, and the percent\\ncumulative variance approach. Unfortunately, the results of these methods are\\nentirely different. That means using inappropriate methods to find the optimal\\nnumber of PCs retained in PCA may lead to misinterpreted and inaccurate results\\nin PCA and PCA-related health and care research applications. This\\ncontradiction becomes even more pronounced in HD settings where n < p, making\\nit even more critical to determine the best approach. Therefore, it is\\nnecessary to identify the issues of different techniques to select the optimal\\nnumber of PCs retained in PCA. Kaiser-Guttman criterion retains fewer PCs,\\ncausing overdispersion, while Cattell's scree test retains more PCs,\\ncompromising reliability. The percentage of cumulative variation criterion\\noffers greater stability, consistently selecting the optimal number of\\ncomponents. Therefore, the Pareto chart, which shows both the cumulative\\npercentage and the cut-off point for retained PCs, provides the most reliable\\nmethod of selecting components, ensuring stability and enhancing PCA\\neffectiveness, particularly in health-related research applications.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME\", \"published\": \"2025-03-31T15:58:50Z\"}"}
