{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05189v1\", \"title\": \"Influence of pore-confined water on the thermal expansion of a\\n  zinc-based metal-organic framework\", \"summary\": \"Understanding the reversible intercalation of guest molecules into\\nmetal-organic frameworks is crucial for advancing their design for practical\\napplications. In this work, we explore the impact of H$_{\\\\mathrm{2}}\\\\!$O as a\\nguest molecule on the thermal expansion of the zinc-based metal-organic\\nframework GUT-2. Dehydration is achieved by thermal treatment of hydrated\\nGUT-2. Rietveld refinement performed on temperature-dependent X-ray powder\\ndiffraction data confirms the reversible structural transformation.\\nAdditionally, it allows the determination of anisotropic thermal expansion\\ncoefficients for both phases. The hydrated form exhibits near-zero thermal\\nexpansion along the polymer chain direction, moderate expansion In the\\ndirection of predominantly hydrogen bonds, and the highest expansion in the\\ndirection with only Van der Waals bonding. Upon activation, the removal of\\nH$_{\\\\mathrm{2}}\\\\!$O molecules triggers a doubling of the thermal expansion\\ncoefficient in the direction, where the hydrogen bonds have been removed.\\nRegarding the dynamics of the process, thermal activation in air occurs within\\n6 hours at a temperature of 50{\\\\deg}C and takes only 30 minutes when heating to\\n90{\\\\deg}C. In contrast, full rehydration under standard lab conditions (30 %\\nrelative humidity) requires two days. During the activation/dehydration\\nprocesses no change of the widths of the X-ray diffraction peaks is observed,\\nwhich shows that the underlying crystal structures remains fully intact during\\nthe transition processes. Fitting the transformations by the Avrami equation\\nreveals a quasi one-dimensional evolution of the dehydrated areas for the\\nactivation process and a more intricate, predominantly two-dimensional\\nmechanism for the rehydration.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-07T15:41:29Z\"}"}
