{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05281v1\", \"title\": \"Decoding the variability in the star-formation histories of z ~ 0.8\\n  galaxies\", \"summary\": \"The scatter of the star-forming main sequence (SFMS) holds a wealth of\\ninformation about how galaxies evolve. The timescales encoded in this scatter\\ncan provide valuable insight into the relative importance of the physical\\nprocesses regulating star formation. In this paper, we present a detailed\\nobservational analysis of the timescales imprinted in galaxy star-formation\\nhistory (SFH) fluctuations by using the stochastic SFH model to fit 1928\\nmassive, z ~ 0.8 galaxies in the LEGA-C survey. We find that the total\\nintrinsic scatter of the SFMS is ~0.3 dex in galaxies with stellar masses\\n$\\\\gtrsim 10^{10}~\\\\mathrm{M}_\\\\odot$. This scatter decreases as the timescale\\nover which SFRs are averaged increases, declining to a non-negligible ~0.15 -\\n0.25 dex at 2 Gyr, underscoring the importance of long-timescale SFH diversity\\nto the SFMS scatter. Furthermore, galaxies currently above (below) the SFMS\\ntend to have been above (below) the SFMS for at least ~1 Gyr, providing\\nevidence that individual galaxies may follow different median tracks through\\nSFR$-\\\\mathrm{M}_*$ space. On shorter timescales (~30 - 100 Myr), galaxies' SFRs\\nalso vary on the order of ~0.1 - 0.2 dex. Our work supports the idea that the\\nSFMS emerges from a population average of the pathways that individual galaxies\\ntrace through the SFR$-\\\\mathrm{M}_*$ plane. The scatter reflects the long-term\\nheterogeneity of these paths likely set by the evolutionary timescales of halo\\ngrowth and cooling, accentuated by short-term variations reflecting the\\ndynamical timescale of the galaxy and its interstellar medium. Our results\\nemphasize the dynamic nature of the SFMS and the importance of understanding\\nthe diverse processes governing star formation.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-07T17:31:27Z\"}"}
