{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05679v1\", \"title\": \"Event-based Civil Infrastructure Visual Defect Detection: ev-CIVIL\\n  Dataset and Benchmark\", \"summary\": \"Small Unmanned Aerial Vehicle (UAV) based visual inspections are a more\\nefficient alternative to manual methods for examining civil structural defects,\\noffering safe access to hazardous areas and significant cost savings by\\nreducing labor requirements. However, traditional frame-based cameras, widely\\nused in UAV-based inspections, often struggle to capture defects under low or\\ndynamic lighting conditions. In contrast, Dynamic Vision Sensors (DVS), or\\nevent-based cameras, excel in such scenarios by minimizing motion blur,\\nenhancing power efficiency, and maintaining high-quality imaging across diverse\\nlighting conditions without saturation or information loss. Despite these\\nadvantages, existing research lacks studies exploring the feasibility of using\\nDVS for detecting civil structural defects.Moreover, there is no dedicated\\nevent-based dataset tailored for this purpose. Addressing this gap, this study\\nintroduces the first event-based civil infrastructure defect detection dataset,\\ncapturing defective surfaces as a spatio-temporal event stream using DVS.In\\naddition to event-based data, the dataset includes grayscale intensity image\\nframes captured simultaneously using an Active Pixel Sensor (APS). Both data\\ntypes were collected using the DAVIS346 camera, which integrates DVS and APS\\nsensors.The dataset focuses on two types of defects: cracks and spalling, and\\nincludes data from both field and laboratory environments. The field dataset\\ncomprises 318 recording sequences,documenting 458 distinct cracks and 121\\ndistinct spalling instances.The laboratory dataset includes 362 recording\\nsequences, covering 220 distinct cracks and 308 spalling instances.Four\\nrealtime object detection models were evaluated on it to validate the dataset\\neffectiveness.The results demonstrate the dataset robustness in enabling\\naccurate defect detection and classification,even under challenging lighting\\nconditions.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-08T04:44:33Z\"}"}
