{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01565v1\", \"title\": \"Learning and criticality in a self-organizing model of connectome growth\", \"summary\": \"The exploration of brain networks has reached an important milestone as\\nrelatively large and reliable information has been gathered for connectomes of\\ndifferent species. Analyses of connectome data sets reveal that the structural\\nlength and the distributions of in- and out-node strengths follow heavy-tailed\\nlognormal statistics, while the functional network properties exhibit powerlaw\\ntails, suggesting that the brain operates close to a critical point where\\ncomputational capabilities and sensitivity to stimulus is optimal. Because\\nthese universal network features emerge from bottom-up (self-)organization, one\\ncan pose the question of whether they can be modeled via a common framework,\\nparticularly through the lens of criticality of statistical physical systems.\\nHere, we simultaneously reproduce the powerlaw statistics of connectome edge\\nweights and the lognormal distributions of node strengths from an\\navalanche-type model with learning that operates on baseline networks that\\nmimic the neuronal circuitry. We observe that the avalanches created by a\\nsandpile-like model on simulated neurons connected by a hierarchical modular\\nnetwork (HMN) produce robust powerlaw avalanche size distributions with\\ncritical exponents of 3/2 characteristic of neuronal systems. Introducing\\nHebbian learning, wherein neurons that `fire together, wire together,' recovers\\nthe powerlaw distribution of edge weights and the lognormal distributions of\\nnode degrees, comparable to those obtained from connectome data. Our results\\nstrengthen the notion of a critical brain, one whose local interactions drive\\nconnectivity and learning without a need for external intervention and precise\\ntuning.\", \"main_category\": \"physics.bio-ph\", \"categories\": \"physics.bio-ph,cond-mat.dis-nn,cond-mat.stat-mech\", \"published\": \"2025-04-02T10:07:43Z\"}"}
