{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02755v1\", \"title\": \"The MaNGA Dwarf Galaxy Sample (MaNDala): stellar profiles and gradients\\n  characterization\", \"summary\": \"We derived radial profiles and inner/outer gradients of various stellar\\npopulation (SP) properties for 124 bright dwarf galaxies, $10^{7.53}\\\\leq\\nM_*/M_\\\\odot\\\\leq 10^{9.06}$, from the MaNDala sample, using integral field\\nspectroscopy observations. Given the complex structure of dwarf galaxies, we\\nused four different methods to derive SP radial profiles: two based on\\nconcentric elliptical rings, and two exploiting the spatially resolved data.\\nFor each method, we applied four approaches to calculate the inner ($0 \\\\leq\\nR/R_e \\\\leq 1$) and outer ($0.75 \\\\leq R/R_e \\\\leq 1.5$) gradients of: luminosity-\\nand mass-weighted age and stellar metallicity, dust attenuation, $D_{n4000}$\\nindex, stellar mass and star formation rate (SFR) surface densities, and\\nspecific SFR. While the PSF has a minor impact on the SP gradients, the\\nmethodology for characterizing radial profiles significantly affects them. At\\nfixed property, differences in inner gradients from concentric rings methods\\nare $\\\\sim0.05\\\\text{-}0.1 \\\\text{ dex/}R_e$, while outer gradients can reach\\n$0.5\\\\text{-}1 \\\\text{ dex/}R_e$, relative to the median of all gradients of that\\nproperty, $\\\\text{med}\\\\left(\\\\{\\\\nabla \\\\mathcal{G}\\\\}_i\\\\right)$. Spatially resolved\\nmethods yield smaller differences, $\\\\lesssim0.1 \\\\text{ dex/}R_e$. For some SP\\ngradients, e.g. $\\\\nabla_\\\\text{SFR}$, the dispersion among the methods is\\ncomparable to $\\\\text{med}\\\\left(\\\\{\\\\nabla \\\\mathcal{G}\\\\}_i\\\\right)$. While it is\\nnot possible to select a single preferred method for determining SP gradients,\\nwe suggest to use $\\\\text{med}\\\\left(\\\\{\\\\nabla \\\\mathcal{G}\\\\}_i\\\\right)$ for each SP\\nproperty. The resulting median age and metallicity suggest that, overall,\\nbright dwarfs experienced moderate inside-out formation, and significant early\\nSF from low-metallicity gas with outward radial migration of old SPs. The\\nderived SP gradients provide strong constraints on feedback mechanisms in dwarf\\ngalaxies.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-03T16:49:08Z\"}"}
