{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02473v1\", \"title\": \"Adaptive path planning for efficient object search by UAVs in\\n  agricultural fields\", \"summary\": \"This paper presents an adaptive path planner for object search in\\nagricultural fields using UAVs. The path planner uses a high-altitude coverage\\nflight path and plans additional low-altitude inspections when the detection\\nnetwork is uncertain. The path planner was evaluated in an offline simulation\\nenvironment containing real-world images. We trained a YOLOv8 detection network\\nto detect artificial plants placed in grass fields to showcase the potential of\\nour path planner. We evaluated the effect of different detection certainty\\nmeasures, optimized the path planning parameters, investigated the effects of\\nlocalization errors and different numbers of objects in the field. The YOLOv8\\ndetection confidence worked best to differentiate between true and false\\npositive detections and was therefore used in the adaptive planner. The optimal\\nparameters of the path planner depended on the distribution of objects in the\\nfield, when the objects were uniformly distributed, more low-altitude\\ninspections were needed compared to a non-uniform distribution of objects,\\nresulting in a longer path length. The adaptive planner proved to be robust\\nagainst localization uncertainty. When increasing the number of objects, the\\nflight path length increased, especially when the objects were uniformly\\ndistributed. When the objects were non-uniformly distributed, the adaptive path\\nplanner yielded a shorter path than a low-altitude coverage path, even with\\nhigh number of objects. Overall, the presented adaptive path planner allowed to\\nfind non-uniformly distributed objects in a field faster than a coverage path\\nplanner and resulted in a compatible detection accuracy. The path planner is\\nmade available at https://github.com/wur-abe/uav_adaptive_planner.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.CV\", \"published\": \"2025-04-03T10:47:31Z\"}"}
