{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02758v1\", \"title\": \"ALMA uncovers optically thin and multi-component CO gas in the\\n  outflowing circumnuclear disk of NGC1068\", \"summary\": \"Active galactic nuclei (AGNs) influence their host galaxies through winds and\\njets that can drive molecular outflows, traceable with CO line emissions using\\nthe Atacama Large Millimeter Array (ALMA). Recent studies leveraging ALMA data\\nhave proposed a three-dimensional outflow geometry in the nearby Seyfert II\\ngalaxy NGC 1068, a key target for AGN unification theories. Using ALMA\\nobservations of CO(2-1), CO(3-2), and CO(6-5) transitions at roughly 0.1\\narcseconds (approximately 7 parsecs) resolution, we analyzed the temperature,\\ndensity, and kinematics of NGC 1068's circumnuclear disk (CND), focusing on the\\nmolecular outflow. Through local thermodynamic equilibrium (LTE) analysis, we\\nderived column densities and rotational temperatures, indicating optically thin\\ngas and CO-to-H2 (XCO) conversion factors between 4.8 and 9.6 times smaller\\nthan the Milky Way value. The inferred molecular mass outflow rate is mostly\\nbelow 5.5 solar masses per year, with the dominant contribution northeast of\\nthe AGN. After subtracting the rotation curve of the CND, we modeled averaged\\nline profiles in each region using single and multi-component Gaussian fits.\\nSeveral profiles within or near the AGN wind bicone required multiple\\ncomponents with significant velocity shifts, suggesting multi-component complex\\noutflow kinematics. We observe lateral variation in CO kinematics along the AGN\\nwind bicone and a misalignment between the molecular and ionized outflow\\ndirections. These results imply that the dynamic impact of the ionized AGN wind\\non the molecular gas in the CND may be limited. However, the molecular outflow\\nshows a complex, asymmetric structure.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-03T16:53:14Z\"}"}
