{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07926v1\", \"title\": \"One-loop renormalization of the effective field theory of inflationary\\n  fluctuations from gravitational interactions\", \"summary\": \"We dig into the semi-classical description of gravity by studying one-loop\\ncorrections to primordial power spectra generated during cosmic inflation from\\ngravitational nonlinear interactions. In the realm of the Effective Field\\nTheory (EFT) of inflationary fluctuations, we renormalize the quadratic\\nLagrangian dictating the linear dynamics of gauge-invariant perturbations.\\nSince gravity is a non-renormalizable theory, this procedure is performed\\nperturbatively in terms of negative powers of the EFT strong coupling scales.\\nSince the interactions we consider are purely gravitational, they are\\nubiquitous and independent of the details of the EFT. Our results are thus\\nrelevant for a large class of approximately scale-invariant inflationary\\nscenarios, be them driven by a single scalar field with canonical kinetic\\nterms, or with a non-canonical structure \\\\textit{\\\\`a la} $P(X,\\\\phi)$, or for an\\neffective single-field description at the level of fluctuations only and\\nemerging from a covariant multifield theory. Using dimensional regularization,\\nwe show that time-dependent Ultra-Violet (UV) divergences appearing at the loop\\nlevel can be canceled at all times by an appropriate splitting of the bare\\nLagrangian into renormalized operators and counterterms. Moreover, we\\nexplicitly compute all finite contributions to the loops and we prove that,\\ntaking into account backreaction, the final one-loop renormalized power spectra\\nof both the primordial curvature perturbation and of gravitational waves are\\nexactly conserved on super-horizon scales. Conclusions of our work imply that\\nthe scalar and tensor propagation speeds are immune to radiative corrections\\nfrom gravitational nonlinearities. We discuss a first application to multifield\\ninflation.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,gr-qc,hep-th\", \"published\": \"2025-04-10T17:41:58Z\"}"}
