{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07056v1\", \"title\": \"The Lyman-alpha and Continuum Origins Survey I: Survey description and\\n  Ly$\\u03b1$ imaging\", \"summary\": \"Understanding the mechanisms driving the escape of ionizing or Lyman\\ncontinuum (LyC) emission from the interstellar medium of galaxies is necessary\\nto constrain the evolution of Reionization, and the sources responsible for it.\\nWhile progress has been made into identifying the global galaxy properties\\nlinked to the escape fraction of ionizing radiation, f$_{esc}^{LyC}$, little is\\ncurrently known about how spatially resolved galaxy properties impact this\\nparameter. We present Hubble Space Telescope (HST) imaging data obtained as\\npart of the Lyman $\\\\alpha$ and Continuum Origins Survey (LaCOS). LaCOS consists\\nof HST imaging in 5 filters covering rest-frame optical and UV bands for a\\nsubsample of 42 galaxies in the Low redshift Lyman Continuum Survey, 22 being\\nLyman continuum emitters ($f_{esc}^{LyC}=0.01-0.49$). These data allow for\\ninvestigations of the connection between sub-kpc stellar and nebular\\nproperties, including Ly$\\\\alpha$ emission, and $f_{esc}^{LyC}$. Here, we\\ndescribe the sample selection, observations and data reduction methods.\\nAdditionally, we present results on the link between global and resolved\\nLy$\\\\alpha$ photometry and $f_{esc}^{LyC}$. We find similar trends between\\nglobal photometric observables ($L_{Ly\\\\alpha}$, $EW_{Ly\\\\alpha}$,\\n$f_{esc}^{Ly\\\\alpha}$, $r_{50}$, $\\\\Sigma_{SFR}$) and $f_{esc}^{LyC}$ as\\npreviously found with spectroscopy, but the correlations generally show a\\nslightly smaller degree of correlations. However, we do find strong\\ncorrelations between Ly$\\\\alpha$ observables ($L_{Ly\\\\alpha}$,$EW_{Ly\\\\alpha}$)\\nand $f_{esc}^{LyC}$ when measured in a small aperture around the brightest UV\\nsource in each galaxy. We interpret these results as evidence that LyC photons\\nescaping on the line-of-sight are contributed by a small number of UV-bright\\ncompact regions in most galaxies in our sample.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.CO\", \"published\": \"2025-04-09T17:16:55Z\"}"}
