{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02356v1\", \"title\": \"All-day Depth Completion via Thermal-LiDAR Fusion\", \"summary\": \"Depth completion, which estimates dense depth from sparse LiDAR and RGB\\nimages, has demonstrated outstanding performance in well-lit conditions.\\nHowever, due to the limitations of RGB sensors, existing methods often struggle\\nto achieve reliable performance in harsh environments, such as heavy rain and\\nlow-light conditions. Furthermore, we observe that ground truth depth maps\\noften suffer from large missing measurements in adverse weather conditions such\\nas heavy rain, leading to insufficient supervision. In contrast, thermal\\ncameras are known for providing clear and reliable visibility in such\\nconditions, yet research on thermal-LiDAR depth completion remains\\nunderexplored. Moreover, the characteristics of thermal images, such as\\nblurriness, low contrast, and noise, bring unclear depth boundary problems. To\\naddress these challenges, we first evaluate the feasibility and robustness of\\nthermal-LiDAR depth completion across diverse lighting (eg., well-lit,\\nlow-light), weather (eg., clear-sky, rainy), and environment (eg., indoor,\\noutdoor) conditions, by conducting extensive benchmarks on the MS$^2$ and ViViD\\ndatasets. In addition, we propose a framework that utilizes COntrastive\\nlearning and Pseudo-Supervision (COPS) to enhance depth boundary clarity and\\nimprove completion accuracy by leveraging a depth foundation model in two key\\nways. First, COPS enforces a depth-aware contrastive loss between different\\ndepth points by mining positive and negative samples using a monocular depth\\nfoundation model to sharpen depth boundaries. Second, it mitigates the issue of\\nincomplete supervision from ground truth depth maps by leveraging foundation\\nmodel predictions as dense depth priors. We also provide in-depth analyses of\\nthe key challenges in thermal-LiDAR depth completion to aid in understanding\\nthe task and encourage future research.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.RO\", \"published\": \"2025-04-03T07:45:03Z\"}"}
