{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06605v1\", \"title\": \"Sensing-Oriented Adaptive Resource Allocation Designs for OFDM-ISAC\\n  Systems\", \"summary\": \"Orthogonal frequency division multiplexing - integrated sensing and\\ncommunication (OFDM-ISAC) has emerged as a key enabler for future wireless\\nnetworks, leveraging the widely adopted OFDM waveform to seamlessly integrate\\nwireless communication and radar sensing within a unified framework. In this\\npaper, we propose adaptive resource allocation strategies for OFDM-ISAC systems\\nto achieve optimal trade-offs between diverse sensing requirements and\\ncommunication quality-of-service (QoS). We first develop a comprehensive\\nresource allocation framework for OFDM-ISAC systems, deriving closed-form\\nexpressions for key sensing performance metrics, including delay resolution,\\nDoppler resolution, delay-Doppler peak sidelobe level (PSL), and received\\nsignal-to-noise ratio (SNR). Building on this theoretical foundation, we\\nintroduce two novel resource allocation algorithms tailored to distinct sensing\\nobjectives. The resolution-oriented algorithm aims to maximize the weighted\\ndelay-Doppler resolution while satisfying constraints on PSL, sensing SNR,\\ncommunication sum-rate, and transmit power. The sidelobe-oriented algorithm\\nfocuses on minimizing delay-Doppler PSL while satisfying resolution, SNR, and\\ncommunication constraints. To efficiently solve the resulting non-convex\\noptimization problems, we develop two adaptive resource allocation algorithms\\nbased on Dinkelbach's transform and majorization-minimization (MM). Extensive\\nsimulations validate the effectiveness of the proposed sensing-oriented\\nadaptive resource allocation strategies in enhancing resolution and sidelobe\\nsuppression. Remarkably, these strategies achieve sensing performance nearly\\nidentical to that of a radar-only scheme, which dedicates all resources to\\nsensing. These results highlight the superior performance of the proposed\\nmethods in optimizing the trade-off between sensing and communication\\nobjectives within OFDM-ISAC systems.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-09T06:08:13Z\"}"}
