{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02769v1\", \"title\": \"Curbing the Ramifications of Authorship Abuse in Science\", \"summary\": \"Research performance is often measured using bibliometric indicators, such as\\npublication count, total citations, and $h$-index. These metrics influence\\ncareer advancements, salary adjustments, administrative opportunities, funding\\nprospects, and professional recognition. However, the reliance on these metrics\\nhas also made them targets for manipulation, misuse, and abuse. One primary\\nethical concern is authorship abuse, which includes paid, ornamental,\\nexploitative, and cartel authorships. These practices are prevalent because\\nthey artificially enhance multiple bibliometric indicators all at once. Our\\nstudy confirms a significant rise in the mean and median number of authors per\\npublication across multiple disciplines over the last 34 years. While it is\\nimportant to identify the cases of authorship abuse, a thorough investigation\\nof every paper proves impractical. In this study, we propose a credit\\nallocation scheme based on the reciprocals of the Fibonacci numbers, designed\\nto adjust credit for individual contributions while systematically reducing\\ncredit for potential authorship abuse. The proposed scheme aligns with rigorous\\nauthorship guidelines from scientific associations, which mandate significant\\ncontributions across most phases of a study, while accommodating more lenient\\nguidelines from scientific publishers, which recognize authorship for minimal\\ncontributions. We recalibrate the traditional bibliometric indicators to\\nemphasize author contribution rather than participation in publications.\\nAdditionally, we propose a new indicator, $T^{\\\\prime}$-index, to assess\\nresearchers' leading and contributing roles in their publications. Our proposed\\ncredit allocation scheme mitigates the effects of authorship abuse and promotes\\na more ethical scientific ecosystem.\", \"main_category\": \"cs.DL\", \"categories\": \"cs.DL\", \"published\": \"2025-04-03T17:06:25Z\"}"}
