{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06266v1\", \"title\": \"Constraining the [CII] luminosity function from the power spectrum of\\n  line intensity maps at redshift 3.6\", \"summary\": \"Forthcoming measurements of the line-intensity-mapping power spectrum (PS)\\nare expected to set precious constraints on several quantities of astrophysical\\nand cosmological interest. Our study targets the [CII] luminosity function (LF)\\nat high redshift, which is still highly uncertain, in particular at the faint\\nend. As an example of future opportunities, we present forecasts for the Deep\\nSpectroscopic Survey (DSS) that will be conducted with the Fred Young\\nSubmillimeter Telescope at $z \\\\simeq 3.6$ and also make predictions for\\neventual $10\\\\times$ wider and/or $\\\\sqrt{10}\\\\times$ more sensitive surveys. The\\nhalo-occupation properties of [CII] emitters in the MARIGOLD simulations\\nprovide us with the motivation to abundance match two versions of the ALPINE LF\\nagainst the halo mass function. We employ the resulting luminosity-mass\\nrelation within the halo model to predict the expected PS signal and its\\nuncertainty. Finally, we use Bayesian inference to analyse mock PS data and\\nforecast what constraints could be achieved on the first two moments of the LF\\nand on Schechter fits. Depending on the actual LF, the DSS will measure the\\nclustering and shot-noise amplitudes of the PS with a signal-to-noise ratio of\\n$\\\\sim 3$ or higher. However, degeneracies with the bias parameter and\\nredshift-space distortions make it unfeasible to extract the first moment of\\nthe LF. Even the widest and most sensitive survey we consider can only\\nconstrain it with a $50\\\\%$ uncertainty. By jointly fitting the PS and the LF,\\nwe directly constrain Schechter-function parameters. We find that the\\nnormalisation and the cutoff luminosity are precisely and accurately measured\\nwhile the faint-end slope remains highly uncertain (unless the true value\\napproaches $-2$). Overall, increasing the survey sensitivity at fixed sky\\ncoverage yields greater improvements than covering a larger area at fixed\\nsensitivity.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,astro-ph.GA\", \"published\": \"2025-04-08T17:59:59Z\"}"}
