{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01856v1\", \"title\": \"Lower Bounds for Leader Election and Collective Coin Flipping, Revisited\", \"summary\": \"We study the tasks of collective coin flipping and leader election in the\\nfull-information model.\\n  We prove new lower bounds for coin flipping protocols, implying lower bounds\\nfor leader election protocols. We show that any $k$-round coin flipping\\nprotocol, where each of $\\\\ell$ players sends 1 bit per round, can be biased by\\n$O(\\\\ell/\\\\log^{(k)}(\\\\ell))$ bad players. For all $k>1$ this strengthens previous\\nlower bounds [RSZ, SICOMP 2002], which ruled out protocols resilient to\\nadversaries controlling $O(\\\\ell/\\\\log^{(2k-1)}(\\\\ell))$ players. Consequently, we\\nestablish that any protocol tolerating a linear fraction of corrupt players,\\nwith only 1 bit per round, must run for at least $\\\\log^*\\\\ell-O(1)$ rounds,\\nimproving on the prior best lower bound of $\\\\frac12\\n\\\\log^*\\\\ell-\\\\log^*\\\\log^*\\\\ell$. This lower bound matches the number of rounds,\\n$\\\\log^*\\\\ell$, taken by the current best coin flipping protocols from [RZ, JCSS\\n2001], [F, FOCS 1999] that can handle a linear sized coalition of bad players,\\nbut with players sending unlimited bits per round. We also derive lower bounds\\nfor protocols allowing multi-bit messages per round. Our results show that the\\nprotocols from [RZ, JCSS 2001], [F, FOCS 1999] that handle a linear number of\\ncorrupt players are almost optimal in terms of round complexity and\\ncommunication per player in a round.\\n  A key technical ingredient in proving our lower bounds is a new result\\nregarding biasing most functions from a family of functions using a common set\\nof bad players and a small specialized set of bad players specific to each\\nfunction that is biased.\\n  We give improved constant-round coin flipping protocols in the setting that\\neach player can send 1 bit per round. For two rounds, our protocol can handle\\n$O(\\\\ell/(\\\\log\\\\ell)(\\\\log\\\\log\\\\ell)^2)$ sized coalition of bad players; better\\nthan the best one-round protocol by [AL, Combinatorica 1993] in this setting.\", \"main_category\": \"cs.CC\", \"categories\": \"cs.CC,cs.CR,cs.DC,F.0\", \"published\": \"2025-04-02T16:08:39Z\"}"}
