{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01870v1\", \"title\": \"Tidal interaction can stop galactic bars: on the LMC non-rotating bar\", \"summary\": \"Context: Using Gaia DR3 data, Jim\\\\'enez-Arranz et al. (2024a) computed the\\nLMC bar pattern speed using three different methods. One of them suggested that\\nthe LMC might be hosting a bar that barely rotates, and is slightly\\ncounter-rotating with respect to the LMC disc, with a pattern speed of\\n$\\\\Omega_p = -1.0 \\\\pm 0.5$ km/s/kpc. Aims: To confirm that tidal interactions\\ncan trigger the LMC hosting a non-rotating bar due to its interaction with the\\nSMC, which could cause the LMC bar to slow down significantly until it\\n(momentarily) stops. Methods: We analyse a subset of models (K9 and K21) from\\nthe KRATOS suite (Jim\\\\'enez-Arranz et al. 2024b) where we detected non-rotating\\nbars. We make use of two different methods to track the evolution of the bar\\npattern speed: the program patternSpeed.py (Dehnen et al. 2023), and temporal\\nfinite-differences of the change rate the bar major axis' phase angle. Results:\\nIn the second LMC-SMC-like pericenter passage of K9, the bar of the LMC-like\\ngalaxy weakens to almost disappear and regenerates with a pattern speed that\\nsuffers a slowdown from $\\\\Omega_p \\\\sim 20$ km/s/kpc to $\\\\Omega_p \\\\sim 0$\\nkm/s/kpc in less than 75 Myr. Then, the bar rotates at less than $\\\\Omega_p \\\\sim\\n3-5$ km/s/kpc for around 100 Myr, until it recovers the initial (before\\ninteraction) pattern speed of $\\\\Omega_p \\\\sim 10$ km/s/kpc. The results for the\\nK21 simulation are comparable. Conclusions: This work is the first direct\\nevidence that galactic bars can be slowed down or even stopped by tidal\\ninteraction, which strengthens the possibility of the LMC hosting a\\nnon-rotating bar, and can add an alternative formation scenario for observed\\nslow-rotating bars.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-02T16:24:01Z\"}"}
