{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06727v1\", \"title\": \"A Survey of New Mid-Band/FR3 for 6G: Channel Measurement,\\n  Characterization and Modeling in Outdoor Environment\", \"summary\": \"The new mid-band (6-24 GHz) has attracted significant attention from both\\nacademia and industry, which is the spectrum with continuous bandwidth that\\ncombines the coverage benefits of low frequency with the capacity advantages of\\nhigh frequency. Since outdoor environments represent the primary application\\nscenario for mobile communications, this paper presents the first comprehensive\\nreview and summary of multi-scenario and multi-frequency channel\\ncharacteristics based on extensive outdoor new mid-band channel measurement\\ndata, including UMa, UMi, and O2I. Specifically, a survey of the progress of\\nthe channel characteristics is presented, such as path loss, delay spread,\\nangular spread, channel sparsity, capacity and near-field spatial\\nnon-stationary characteristics. Then, considering that satellite communication\\nwill be an important component of future communication systems, we examine the\\nimpact of clutter loss in air-ground communications. Our analysis of the\\nfrequency dependence of mid-band clutter loss suggests that its impact is not\\nsignificant. Additionally, given that penetration loss is frequency-dependent,\\nwe summarize its variation within the FR3 band. Based on experimental results,\\ncomparisons with the standard model reveal that while the 3GPP TR 38.901 model\\nremains a useful reference for penetration loss in wood and glass, it shows\\nsignificant deviations for concrete and glass, indicating the need for further\\nrefinement. In summary, the findings of this survey provide both empirical data\\nand theoretical support for the deployment of mid-band in future communication\\nsystems, as well as guidance for optimizing mid-band base station deployment in\\nthe outdoor environment. This survey offers the reference for improving\\nstandard models and advancing channel modeling.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-09T09:32:52Z\"}"}
