{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07731v1\", \"title\": \"Adaptive Robust Unscented Kalman Filter for Dynamic State Estimation of\\n  Power System\", \"summary\": \"Non-Gaussian noise and the uncertainty of noise distribution are the common\\nfactors that reduce accuracy in dynamic state estimation of power systems (PS).\\nIn addition, the optimal value of the free coefficients in the unscented Kalman\\nfilter (UKF) based on information theoretic criteria is also an urgent problem.\\nIn this paper, a robust adaptive UKF (AUKF) under generalized minimum mixture\\nerror entropy with fiducial points (GMMEEF) over improve Snow Geese algorithm\\n(ISGA) (ISGA-GMMEEF-AUKF) is proposed to overcome the above difficulties. The\\nestimation process of the proposed algorithm is based on several key steps\\nincluding augmented regression error model (AREM) construction, adaptive state\\nestimation, and free coefficients optimization. Specifically, an AREM\\nconsisting of state prediction and measurement errors is established at the\\nfirst step. Then, GMMEEF-AUKF is developed by solving the optimization problem\\nbased on GMMEEF, which uses a generalized Gaussian kernel combined with mixture\\ncorrentropy to enhance the flexibility further and resolve the data problem\\nwith complex attributes and update the noise covariance matrix according to the\\nAREM framework. Finally, the ISGA is designed to automatically calculate the\\noptimal value of coefficients such as the shape coefficients of the kernel in\\nthe GMMEEF criterion, the coefficients selection sigma points in unscented\\ntransform, and the update coefficient of the noise covariance matrices fit with\\nthe PS model. Simulation results on the IEEE 14, 30, and 57-bus test systems in\\ncomplex scenarios have confirmed that the proposed algorithm outperforms the\\nMEEF-UKF and UKF by an average efficiency of 26% and 65%, respectively.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-10T13:27:54Z\"}"}
