{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02787v1\", \"title\": \"A 3D view of dwarf galaxies with Gaia and VLT/FLAMES II. The Sextans\\n  dwarf spheroidal\", \"summary\": \"The Sextans dwarf spheroidal galaxy has been challenging to study in a\\ncomprehensive way as it is highly extended on the sky, with an uncertain but\\nlarge tidal radius of between 80-160 arcminutes (or 3-4kpc), and an extremely\\nlow central surface brightness of SigmaV = 26.2 mag/arcsec2. Here we present a\\nnew homogeneous survey of 41 VLT/FLAMES multi-fibre spectroscopic pointings\\nthat contain 2108 individual spectra, and combined with Gaia DR3 photometry and\\nastrometry we present v-los measurements for 333 individual Red Giant Branch\\nstars that are consistent with membership in the Sextans dwarf spheroidal\\ngalaxy. In addition, we provide the metallicity, [Fe/H], determined from the\\ntwo strongest CaII triplet lines, for 312 of these stars. We look again at the\\nglobal characteristics of Sextans, deriving a mean line-of-sight velocity of\\n<v-los> = +227.1km/s and a mean metallicity of <[Fe/H]> = -2.37. The\\nmetallicity distribution is clearly double peaked, with the highest peak at\\n[Fe/H]= -2.81 and another broader peak at [Fe/H]= -2.09. Thus it appears that\\nSextans hosts two populations and the superposition leads to a radial variation\\nin the mean metallicity, with the more metal rich population being centrally\\nconcentrated. In addition there is an intriguing group of 9 probable members in\\nthe outer region of Sextans at higher [Fe/H] than the mean in this region. If\\nthis group could be confirmed as members they would eliminate the metallicity\\ngradient. We also look again at the Colour-Magnitude Diagram of the resolved\\nstellar population in Sextans. We also look again at the relation between\\nSextans and the intriguingly nearby globular cluster, Pal3. The global\\nproperties of Sextans have not changed significantly compared to previous\\nstudies, but they are now more precise, and the sample of known members in the\\nouter regions is now more complete.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-03T17:31:23Z\"}"}
