{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05029v1\", \"title\": \"Graph-based Diffusion Model for Collaborative Filtering\", \"summary\": \"Recently, diffusion-based recommendation methods have achieved impressive\\nresults. However, existing approaches predominantly treat each user's\\nhistorical interactions as independent training samples, overlooking the\\npotential of higher-order collaborative signals between users and items. Such\\nsignals, which encapsulate richer and more nuanced relationships, can be\\nnaturally captured using graph-based data structures. To address this\\nlimitation, we extend diffusion-based recommendation methods to the graph\\ndomain by directly modeling user-item bipartite graphs with diffusion models.\\nThis enables better modeling of the higher-order connectivity inherent in\\ncomplex interaction dynamics. However, this extension introduces two primary\\nchallenges: (1) Noise Heterogeneity, where interactions are influenced by\\nvarious forms of continuous and discrete noise, and (2) Relation Explosion,\\nreferring to the high computational costs of processing large-scale graphs. To\\ntackle these challenges, we propose a Graph-based Diffusion Model for\\nCollaborative Filtering (GDMCF). To address noise heterogeneity, we introduce a\\nmulti-level noise corruption mechanism that integrates both continuous and\\ndiscrete noise, effectively simulating real-world interaction complexities. To\\nmitigate relation explosion, we design a user-active guided diffusion process\\nthat selectively focuses on the most meaningful edges and active users,\\nreducing inference costs while preserving the graph's topological integrity.\\nExtensive experiments on three benchmark datasets demonstrate that GDMCF\\nconsistently outperforms state-of-the-art methods, highlighting its\\neffectiveness in capturing higher-order collaborative signals and improving\\nrecommendation performance.\", \"main_category\": \"cs.SI\", \"categories\": \"cs.SI,cs.AI,cs.LG\", \"published\": \"2025-04-07T12:51:18Z\"}"}
