{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07531v1\", \"title\": \"A taxonomy of epistemic injustice in the context of AI and the case for\\n  generative hermeneutical erasure\", \"summary\": \"Whether related to machine learning models' epistemic opacity, algorithmic\\nclassification systems' discriminatory automation of testimonial prejudice, the\\ndistortion of human beliefs via the 'hallucinations' of generative AI, the\\ninclusion of the global South in global AI governance, the execution of\\nbureaucratic violence via algorithmic systems, or located in the interaction\\nwith conversational artificial agents epistemic injustice related to AI is a\\ngrowing concern. Based on a proposed general taxonomy of epistemic injustice,\\nthis paper first sketches a taxonomy of the types of epistemic injustice in the\\ncontext of AI, relying on the work of scholars from the fields of philosophy of\\ntechnology, political philosophy and social epistemology. Secondly, an\\nadditional perspective on epistemic injustice in the context of AI: generative\\nhermeneutical erasure. I argue that this injustice that can come about through\\nthe application of Large Language Models (LLMs) and contend that generative AI,\\nwhen being deployed outside of its Western space of conception, can have\\neffects of conceptual erasure, particularly in the epistemic domain, followed\\nby forms of conceptual disruption caused by a mismatch between AI system and\\nthe interlocutor in terms of conceptual frameworks. AI systems' 'view from\\nnowhere' epistemically inferiorizes non-Western epistemologies and thereby\\ncontributes to the erosion of their epistemic particulars, gradually\\ncontributing to hermeneutical erasure. This work's relevance lies in proposal\\nof a taxonomy that allows epistemic injustices to be mapped in the AI domain\\nand the proposal of a novel form of AI-related epistemic injustice.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.CY,K.4\", \"published\": \"2025-04-10T07:54:47Z\"}"}
