{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07503v1\", \"title\": \"Event Signal Filtering via Probability Flux Estimation\", \"summary\": \"Events offer a novel paradigm for capturing scene dynamics via asynchronous\\nsensing, but their inherent randomness often leads to degraded signal quality.\\nEvent signal filtering is thus essential for enhancing fidelity by reducing\\nthis internal randomness and ensuring consistent outputs across diverse\\nacquisition conditions. Unlike traditional time series that rely on fixed\\ntemporal sampling to capture steady-state behaviors, events encode transient\\ndynamics through polarity and event intervals, making signal modeling\\nsignificantly more complex. To address this, the theoretical foundation of\\nevent generation is revisited through the lens of diffusion processes. The\\nstate and process information within events is modeled as continuous\\nprobability flux at threshold boundaries of the underlying irradiance\\ndiffusion. Building on this insight, a generative, online filtering framework\\ncalled Event Density Flow Filter (EDFilter) is introduced. EDFilter estimates\\nevent correlation by reconstructing the continuous probability flux from\\ndiscrete events using nonparametric kernel smoothing, and then resamples\\nfiltered events from this flux. To optimize fidelity over time, spatial and\\ntemporal kernels are employed in a time-varying optimization framework. A fast\\nrecursive solver with O(1) complexity is proposed, leveraging state-space\\nmodels and lookup tables for efficient likelihood computation. Furthermore, a\\nnew real-world benchmark Rotary Event Dataset (RED) is released, offering\\nmicrosecond-level ground truth irradiance for full-reference event filtering\\nevaluation. Extensive experiments validate EDFilter's performance across tasks\\nlike event filtering, super-resolution, and direct event-based blob tracking.\\nSignificant gains in downstream applications such as SLAM and video\\nreconstruction underscore its robustness and effectiveness.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-10T07:03:08Z\"}"}
