{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04884v1\", \"title\": \"Parallelization is All System Identification Needs: End-to-end Vibration\\n  Diagnostics on a multi-core RISC-V edge device\", \"summary\": \"The early detection of structural malfunctions requires the installation of\\nreal-time monitoring systems ensuring continuous access to the damage-sensitive\\ninformation; nevertheless, it can generate bottlenecks in terms of bandwidth\\nand storage. Deploying data reduction techniques at the edge is recognized as a\\nproficient solution to reduce the system's network traffic. However, the most\\neffective solutions currently employed for the purpose are based on memory and\\npower-hungry algorithms, making their embedding on resource-constrained devices\\nvery challenging; this is the case of vibration data reduction based on System\\nIdentification models. This paper presents PARSY-VDD, a fully optimized\\nPArallel end-to-end software framework based on SYstem identification for\\nVibration-based Damage Detection, as a suitable solution to perform damage\\ndetection at the edge in a time and energy-efficient manner, avoiding streaming\\nraw data to the cloud. We evaluate the damage detection capabilities of\\nPARSY-VDD with two benchmarks: a bridge and a wind turbine blade, showcasing\\nthe robustness of the end-to-end approach. Then, we deploy PARSY-VDD on both\\ncommercial single-core and a specific multi-core edge device. We introduce an\\narchitecture-agnostic algorithmic optimization for SysId, improving the\\nexecution by 90x and reducing the consumption by 85x compared with the\\nstate-of-the-art SysId implementation on GAP9. Results show that by utilizing\\nthe unique parallel computing capabilities of GAP9, the execution time is\\n751{\\\\mu}s with the high-performance multi-core solution operating at 370MHz and\\n0.8V, while the energy consumption is 37{\\\\mu}J with the low-power solution\\noperating at 240MHz and 0.65V. Compared with other single-core implementations\\nbased on STM32 microcontrollers, the GAP9 high-performance configuration is 76x\\nfaster, while the low-power configuration is 360x more energy efficient.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-07T09:51:02Z\"}"}
