{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07515v1\", \"title\": \"Sequential Filtering Techniques for Simultaneous Tracking and Parameter\\n  Estimation\", \"summary\": \"The number of resident space objects is rising at an alarming rate.\\nMega-constellations and breakup events are proliferating in most orbital\\nregimes, and safe navigation is becoming increasingly problematic. It is\\nimportant to be able to track RSOs accurately and at an affordable\\ncomputational cost. Orbital dynamics are highly nonlinear, and current\\noperational methods assume Gaussian representations of the objects' states and\\nemploy linearizations which cease to hold true in observation-free propagation.\\nMonte Carlo-based filters can provide a means to approximate the a posteriori\\nprobability distribution of the states more accurately by providing support in\\nthe portion of the state space which overlaps the most with the processed\\nobservations. Moreover, dynamical models are not able to capture the full\\nextent of realistic forces experienced in the near-Earth space environment, and\\nhence fully deterministic propagation methods may fail to achieve the desired\\naccuracy. By modeling orbital dynamics as a stochastic system and solving it\\nusing stochastic numerical integrators, we are able to simultaneously estimate\\nthe scale of the process noise incurred by the assumed uncertainty in the\\nsystem, and robustly track the state of the spacecraft. In order to find an\\nadequate balance between accuracy and computational cost, we propose three\\nalgorithms which are capable of tracking a space object and estimating the\\nmagnitude of the system's uncertainty. The proposed filters are successfully\\napplied to a LEO scenario, demonstrating the ability to accurately track a\\nspacecraft state and estimate the scale of the uncertainty online, in various\\nsimulation setups.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM,stat.AP\", \"published\": \"2025-04-10T07:23:00Z\"}"}
