{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01897v1\", \"title\": \"Threshold for Fault-tolerant Quantum Advantage with the Quantum\\n  Approximate Optimization Algorithm\", \"summary\": \"Optimization is often cited as a promising application of quantum computers.\\nHowever, the low degree of provable quantum speedups has led prior rigorous\\nend-to-end resource analyses to conclude that a quantum computer is unlikely to\\nsurpass classical state-of-the-art on optimization problems under realistic\\nassumptions. In this work, we compile and analyze the Quantum Approximate\\nOptimization Algorithm (QAOA) combined with Amplitude Amplification (AA)\\napplied to random 8-SAT at the satisfiability threshold. Our compilation\\ninvolves careful optimization of circuits for Hamiltonian simulation, which may\\nbe of independent interest. We use the analytical scaling of the\\ntime-to-solution for QAOA identified by PRX Quantum 5, 030348 (2024) and find\\nthat with QAOA depth $p=623$, QAOA+AA achieves a crossover with\\nstate-of-the-art classical heuristics at 179 variables and 14.99 hours of\\nruntime when executed on a surface-code-based fault-tolerant quantum computer\\nwith 73.91 million physical qubits, a physical error rate of $10^{-3}$, and a\\n$1~\\\\mu$s code cycle time. Notably, we allow the classical solver to be\\nparallelized as long as its total energy consumption is equal to that required\\nfor decoding in the surface code. We further show that this restriction on\\nclassical solver energy consumption can be relaxed given optimistic but\\nplausible reductions in physical error rates and fault-tolerance overheads,\\nenabling a crossover of 2.94 hours using 8.88 million physical qubits against a\\nclassical solver running on a supercomputer with $725,760$ CPU cores. These\\nfindings support the hypothesis that large-scale fault-tolerant quantum\\ncomputers will be useful for optimization.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-02T16:57:28Z\"}"}
