{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04764v1\", \"title\": \"Enhancing Leaf Disease Classification Using GAT-GCN Hybrid Model\", \"summary\": \"Agriculture plays a critical role in the global economy, providing\\nlivelihoods and ensuring food security for billions. As innovative agricultural\\npractices become more widespread, the risk of crop diseases has increased,\\nhighlighting the urgent need for efficient, low-intervention disease\\nidentification methods. This research presents a hybrid model combining Graph\\nAttention Networks (GATs) and Graph Convolution Networks (GCNs) for leaf\\ndisease classification. GCNs have been widely used for learning from\\ngraph-structured data, and GATs enhance this by incorporating attention\\nmechanisms to focus on the most important neighbors. The methodology integrates\\nsuperpixel segmentation for efficient feature extraction, partitioning images\\ninto meaningful, homogeneous regions that better capture localized features.\\nThe authors have employed an edge augmentation technique to enhance the\\nrobustness of the model. The edge augmentation technique has introduced a\\nsignificant degree of generalization in the detection capabilities of the\\nmodel. To further optimize training, weight initialization techniques are\\napplied. The hybrid model is evaluated against the individual performance of\\nthe GCN and GAT models and the hybrid model achieved a precision of 0.9822,\\nrecall of 0.9818, and F1-score of 0.9818 in apple leaf disease classification,\\na precision of 0.9746, recall of 0.9744, and F1-score of 0.9743 in potato leaf\\ndisease classification, and a precision of 0.8801, recall of 0.8801, and\\nF1-score of 0.8799 in sugarcane leaf disease classification. These results\\ndemonstrate the robustness and performance of the model, suggesting its\\npotential to support sustainable agricultural practices through precise and\\neffective disease detection. This work is a small step towards reducing the\\nloss of crops and hence supporting sustainable goals of zero hunger and life on\\nland.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-07T06:31:38Z\"}"}
