{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02408v1\", \"title\": \"Translation of Fetal Brain Ultrasound Images into Pseudo-MRI Images\\n  using Artificial Intelligence\", \"summary\": \"Ultrasound is a widely accessible and cost-effective medical imaging tool\\ncommonly used for prenatal evaluation of the fetal brain. However, it has\\nlimitations, particularly in the third trimester, where the complexity of the\\nfetal brain requires high image quality for extracting quantitative data. In\\ncontrast, magnetic resonance imaging (MRI) offers superior image quality and\\ntissue differentiation but is less available, expensive, and requires\\ntime-consuming acquisition. Thus, transforming ultrasonic images into an\\nMRI-mimicking display may be advantageous and allow better tissue anatomy\\npresentation. To address this goal, we have examined the use of artificial\\nintelligence, implementing a diffusion model renowned for generating\\nhigh-quality images. The proposed method, termed \\\"Dual Diffusion Imposed\\nCorrelation\\\" (DDIC), leverages a diffusion-based translation methodology,\\nassuming a shared latent space between ultrasound and MRI domains. Model\\ntraining was obtained utilizing the \\\"HC18\\\" dataset for ultrasound and the \\\"CRL\\nfetal brain atlas\\\" along with the \\\"FeTA \\\" datasets for MRI. The generated\\npseudo-MRI images provide notable improvements in visual discrimination of\\nbrain tissue, especially in the lateral ventricles and the Sylvian fissure,\\ncharacterized by enhanced contrast clarity. Improvement was demonstrated in\\nMutual information, Peak signal-to-noise ratio, Fr\\\\'echet Inception Distance,\\nand Contrast-to-noise ratio. Findings from these evaluations indicate\\nstatistically significant superior performance of the DDIC compared to other\\ntranslation methodologies. In addition, a Medical Opinion Test was obtained\\nfrom 5 gynecologists. The results demonstrated display improvement in 81% of\\nthe tested images. In conclusion, the presented pseudo-MRI images hold the\\npotential for streamlining diagnosis and enhancing clinical outcomes through\\nimproved representation.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.AI,cs.CV\", \"published\": \"2025-04-03T08:59:33Z\"}"}
