{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07916v1\", \"title\": \"Semantically Encoding Activity Labels for Context-Aware Human Activity\\n  Recognition\", \"summary\": \"Prior work has primarily formulated CA-HAR as a multi-label classification\\nproblem, where model inputs are time-series sensor data and target labels are\\nbinary encodings representing whether a given activity or context occurs. These\\nCA-HAR methods either predicted each label independently or manually imposed\\nrelationships using graphs. However, both strategies often neglect an essential\\naspect: activity labels have rich semantic relationships. For instance,\\nwalking, jogging, and running activities share similar movement patterns but\\ndiffer in pace and intensity, indicating that they are semantically related.\\nConsequently, prior CA-HAR methods often struggled to accurately capture these\\ninherent and nuanced relationships, particularly on datasets with noisy labels\\ntypically used for CA-HAR or situations where the ideal sensor type is\\nunavailable (e.g., recognizing speech without audio sensors). To address this\\nlimitation, we propose SEAL, which leverage LMs to encode CA-HAR activity\\nlabels to capture semantic relationships. LMs generate vector embeddings that\\npreserve rich semantic information from natural language. Our SEAL approach\\nencodes input-time series sensor data from smart devices and their associated\\nactivity and context labels (text) as vector embeddings. During training, SEAL\\naligns the sensor data representations with their corresponding\\nactivity/context label embeddings in a shared embedding space. At inference\\ntime, SEAL performs a similarity search, returning the CA-HAR label with the\\nembedding representation closest to the input data. Although LMs have been\\nwidely explored in other domains, surprisingly, their potential in CA-HAR has\\nbeen underexplored, making our approach a novel contribution to the field. Our\\nresearch opens up new possibilities for integrating more advanced LMs into\\nCA-HAR tasks.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-10T17:30:07Z\"}"}
