{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02610v1\", \"title\": \"Do evidence-based active-engagement courses reduce the gender gap in\\n  introductory physics?\", \"summary\": \"Prior research suggests that using evidence-based pedagogies can not only\\nimprove learning for all students, it can also reduce the gender gap. We\\ndescribe the impact of physics education research based pedagogical techniques\\nin flipped and active-engagement non-flipped courses on the gender gap observed\\nwith validated conceptual surveys. We compare male and female students'\\nperformance in courses which make significant use of evidence-based active\\nengagement (EBAE) strategies with courses that primarily use lecture-based (LB)\\ninstruction. The analysis presented here includes data from two-semester\\nsequences of introductory algebra-based and calculus-based introductory physics\\ncourses. The surveys used to assess student learning in the first and second\\nsemester courses were the Force Concept Inventory and the Conceptual Survey of\\nElectricity and Magnetism, respectively. The performance of male and female\\nstudents in EBAE courses at a particular level is compared with LB courses in\\ntwo situations: (I) the same instructor taught two courses, one of which was an\\nEBAE course and the other an LB course, while the homework, recitations and\\nfinal exams were kept the same, (II) student performance in all of the EBAE\\ncourses taught by different instructors was averaged and compared with LB\\ncourses of the same type also averaged over different instructors. In all\\ncases, we find that students in courses which make significant use of EBAE\\nstrategies, on average, outperformed students in courses of the same type using\\nprimarily LB instruction even though there was no statistically significant\\ndifference on the pretest before instruction. However, the gender gap persisted\\neven in courses using EBAE methods. We also discuss correlations between the\\nperformance of male and female students on the validated conceptual surveys and\\nthe final exam, which had a heavy weight on quantitative problem solving.\", \"main_category\": \"physics.ed-ph\", \"categories\": \"physics.ed-ph\", \"published\": \"2025-04-03T14:11:00Z\"}"}
