{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07057v1\", \"title\": \"Substantial Diel Changes of Cloud Adjustments to Aerosols in Ship-tracks\", \"summary\": \"Human induced changes in atmospheric aerosols have introduced a climate\\nforcing by modifying cloud droplet number concentration, liquid water, and\\ncloud fraction. This forcing is subject to large uncertainties as cloud\\nadjustments have not only complex dependence on background conditions, but also\\ntemporal fluctuations, especially those driven by diel variations in solar\\nheating. However, direct observations of such diel changes are still limited.\\nHere, we present observational evidence of substantial diel changes in the\\ncloud adjustments to aerosols within ship tracks, linear lines of polluted\\nclouds captured in satellite images. We developed a novel method to\\nautomatically determine the age of each ship-track segment and analyze cloud\\nadjustments to aerosols. We show that more aged polluted clouds with extended\\nnighttime exposure exhibit higher increases in cloud fraction. By contrast,\\nliquid water path adjustments follow a non-monotonic pattern: they generally\\ndecrease with time before reversing trend in clouds formed at nighttime. Most\\nof these diel contrasts are statistically significant and likely stem from\\ndifferences in solar heating and cloud precipitation. The increase in cloud\\nfraction adjustment suggests a larger aerosol effective radiative forcing, -0.1\\nto -0.4 W per meter squared, than the estimate without considering temporal\\nvariations, while the temporal changes in liquid water path adjustments may\\npartially offset it. These findings underscore the importance of diel\\nvariations in aerosol cloud interactions. Our approach demonstrates that ship\\ntracks, despite appearing as instantaneous observations, yield valuable\\ninsights into the temporal evolution of cloud adjustments.\", \"main_category\": \"physics.ao-ph\", \"categories\": \"physics.ao-ph\", \"published\": \"2025-04-09T17:20:00Z\"}"}
