{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21720v1\", \"title\": \"Collab: Controlled Decoding using Mixture of Agents for LLM Alignment\", \"summary\": \"Alignment of Large Language models (LLMs) is crucial for safe and trustworthy\\ndeployment in applications. Reinforcement learning from human feedback (RLHF)\\nhas emerged as an effective technique to align LLMs to human preferences and\\nbroader utilities, but it requires updating billions of model parameters, which\\nis computationally expensive. Controlled Decoding, by contrast, provides a\\nmechanism for aligning a model at inference time without retraining. However,\\nsingle-agent decoding approaches often struggle to adapt to diverse tasks due\\nto the complexity and variability inherent in these tasks. To strengthen the\\ntest-time performance w.r.t the target task, we propose a mixture of\\nagent-based decoding strategies leveraging the existing off-the-shelf aligned\\nLLM policies. Treating each prior policy as an agent in the spirit of mixture\\nof agent collaboration, we develop a decoding method that allows for\\ninference-time alignment through a token-level selection strategy among\\nmultiple agents. For each token, the most suitable LLM is dynamically chosen\\nfrom a pool of models based on a long-term utility metric. This\\npolicy-switching mechanism ensures optimal model selection at each step,\\nenabling efficient collaboration and alignment among LLMs during decoding.\\nTheoretical analysis of our proposed algorithm establishes optimal performance\\nwith respect to the target task represented via a target reward for the given\\noff-the-shelf models. We conduct comprehensive empirical evaluations with\\nopen-source aligned models on diverse tasks and preferences, which demonstrates\\nthe merits of this approach over single-agent decoding baselines. Notably,\\nCollab surpasses the current SoTA decoding strategy, achieving an improvement\\nof up to 1.56x in average reward and 71.89% in GPT-4 based win-tie rate.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.AI\", \"published\": \"2025-03-27T17:34:25Z\"}"}
