{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24142v1\", \"title\": \"Dust Concentration Via Coupled Vertical Settling and Radial Migration in\\n  Substructured Non-Ideal MHD Discs and Early Planet Formation\", \"summary\": \"We investigate the dynamics of dust concentration in actively accreting,\\nsubstructured, non-ideal MHD wind-launching disks using 2D and 3D simulations\\nincorporating pressureless dust fluids of various grain sizes and their\\naerodynamic feedback on gas dynamics. Our results reveal that mm/cm-sized\\ngrains are preferentially concentrated within the inner 5-10 au of the disk,\\nwhere the dust-to-gas surface density ratio (local metalicity Z) significantly\\nexceeds the canonical 0.01, reaching values up to 0.25. This enhancement arises\\nfrom the interplay of dust settling and complex gas flows in the meridional\\nplane, including midplane accretion streams at early times, midplane expansion\\ndriven by magnetically braked surface accretion at later times, and vigorous\\nmeridional circulation in spontaneously formed gas rings. The resulting\\nsize-dependent dust distribution has a strong spatial variation, with large\\ngrains preferentially accumulating in dense rings, particularly in the inner\\ndisk, while being depleted in low-density gas gaps. In 3D, these rings and gaps\\nare unstable to Rossby wave instability (RWI), generating arc-shaped vortices\\nthat stand out more prominently than their gas counterparts in the inner disk\\nbecause of preferential dust concentration at small radii. The substantial\\nlocal enhancement of the dust relative to the gas could promote planetesimal\\nformation via streaming instability, potentially aided by the \\\"azimuthal drift\\\"\\nstreaming instability (AdSI) that operates efficiently in accreting disks and a\\nlower Toomre Q expected in younger disks. Our findings suggest that actively\\naccreting young disks may provide favorable conditions for early planetesimal\\nformation, which warrants further investigation.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-03-31T14:26:32Z\"}"}
