{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23878v1\", \"title\": \"Populations of evolved massive binary stars in the Small Magellanic\\n  Cloud II: Predictions from rapid binary evolution\", \"summary\": \"Massive star evolution plays a crucial role in astrophysics but bares large\\nuncertainties. This problem becomes more severe by the majority of massive\\nstars being born in close binary systems, whose evolution is affected by the\\ninteraction of their components. We want to constrain major uncertainties in\\nmassive binary star evolution, in particular the efficiency and the stability\\nof the first mass transfer phase. We use the rapid population synthesis code\\nComBinE to generate synthetic populations of post-interaction binaries,\\nassuming constant mass-transfer efficiency. We employ a new merger criterion\\nthat adjusts self-consistently to any prescribed mass-transfer efficiency. We\\ntailor our synthetic populations to be comparable to the expected binary\\npopulations in the Small Magellanic Cloud (SMC). We find that the observed\\npopulations of evolved massive binaries can not be reproduced with a single\\nmass-transfer efficiency. Instead, a rather high efficiency (>50%) is needed to\\nreproduce the number of Be stars and Be/X-ray binaries in the SMC, while a low\\nefficiency (~10%) leads to a better agreement with the observed number of\\nWolf-Rayet stars. We construct a corresponding mass-dependent mass-transfer\\nefficiency recipe to produce our fiducial synthetic SMC post-interaction binary\\npopulation. It reproduces the observed number and properties of the Be/X-ray\\nand WR-binaries rather well, and is not in stark disagreement with the observed\\nOBe star population. It further predicts two large, yet unobserved populations\\nof OB+BH binaries, that is ~100 OB+BH systems with rather small orbital periods\\n(<20 days) and ~40 longer period OBe+BH systems.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA,astro-ph.HE\", \"published\": \"2025-03-31T09:27:04Z\"}"}
