{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06579v1\", \"title\": \"Coherence-decoherence interplay in quantum systems due to projective\\n  stochastic pulses: The case of Rabi oscillations\", \"summary\": \"The interplay of coherence and decoherence is played out in a three-level\\nquantum system, in which the third level is incoherently coupled to the second\\none which itself is in coherent interaction with the first level. The study is\\nbased on a stochastic scenario in which the coherent, unitary evolution of the\\nsystem is randomly interrupted by a Poisson-driven pulse sequence. In the\\nabsence of an external pulse, the system undergoes coherent, unitary evolution\\nrestricted to the subspace spanned by the first level (level $1$) and the\\nsecond level (level $2$). The application of a pulse induces transitions\\nbetween the second and the third level (level $3$), thereby introducing\\nnon-unitary effects that perturb the otherwise isolated two-level dynamics. The\\npulses are assumed to have infinitesimal duration, with strengths modeled as\\nrandom variables that are uncorrelated across different pulses. A\\nrepresentative model for the stochastically-averaged transition (super)operator\\nmimicking the dynamics induced by the application of pulses allows for an\\nanalytical derivation of the matrix elements of the averaged density operator.\\nWhen the system is initially in level $1$, we obtain in particular the temporal\\nbehavior of the stay-put probability, that is, the probability $P_1(t)$ that\\nthe system is still in level $1$ at time $t$. As a function of time, the\\nquantity $P_1(t)$ exhibits a coherence-to-decoherence crossover behavior. At\\nshort times $t \\\\ll 1/\\\\lambda$, where $\\\\lambda$ is the average frequency at\\nwhich pulses are applied to the system, coherent dynamics dominate.\\nConsequently, $P_1(t)$ displays pronounced Rabi-like oscillations. At long\\ntimes $t \\\\gg 1/\\\\lambda$, decoherence effects prevail, leading to an exponential\\ndecay of the form $P_1(t) \\\\sim \\\\exp(-\\\\lambda t)$.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cond-mat.stat-mech\", \"published\": \"2025-04-09T05:02:08Z\"}"}
