{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24027v1\", \"title\": \"Crossing Boundaries: Leveraging Semantic Divergences to Explore Cultural\\n  Novelty in Cooking Recipes\", \"summary\": \"Novelty modeling and detection is a core topic in Natural Language Processing\\n(NLP), central to numerous tasks such as recommender systems and automatic\\nsummarization. It involves identifying pieces of text that deviate in some way\\nfrom previously known information. However, novelty is also a crucial\\ndeterminant of the unique perception of relevance and quality of an experience,\\nas it rests upon each individual's understanding of the world. Social factors,\\nparticularly cultural background, profoundly influence perceptions of novelty\\nand innovation. Cultural novelty arises from differences in salience and\\nnovelty as shaped by the distance between distinct communities. While cultural\\ndiversity has garnered increasing attention in artificial intelligence (AI),\\nthe lack of robust metrics for quantifying cultural novelty hinders a deeper\\nunderstanding of these divergences. This gap limits quantifying and\\nunderstanding cultural differences within computational frameworks. To address\\nthis, we propose an interdisciplinary framework that integrates knowledge from\\nsociology and management. Central to our approach is GlobalFusion, a novel\\ndataset comprising 500 dishes and approximately 100,000 cooking recipes\\ncapturing cultural adaptation from over 150 countries. By introducing a set of\\nJensen-Shannon Divergence metrics for novelty, we leverage this dataset to\\nanalyze textual divergences when recipes from one community are modified by\\nanother with a different cultural background. The results reveal significant\\ncorrelations between our cultural novelty metrics and established cultural\\nmeasures based on linguistic, religious, and geographical distances. Our\\nfindings highlight the potential of our framework to advance the understanding\\nand measurement of cultural diversity in AI.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-03-31T12:52:52Z\"}"}
