{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04998v1\", \"title\": \"CONCERT: a Modular Reconfigurable Robot for Construction\", \"summary\": \"This paper presents CONCERT, a fully reconfigurable modular collaborative\\nrobot (cobot) for multiple on-site operations in a construction site. CONCERT\\nhas been designed to support human activities in construction sites by\\nleveraging two main characteristics: high-power density motors and modularity.\\nIn this way, the robot is able to perform a wide range of highly demanding\\ntasks by acting as a co-worker of the human operator or by autonomously\\nexecuting them following user instructions. Most of its versatility comes from\\nthe possibility of rapidly changing its kinematic structure by adding or\\nremoving passive or active modules. In this way, the robot can be set up in a\\nvast set of morphologies, consequently changing its workspace and capabilities\\ndepending on the task to be executed. In the same way, distal end-effectors can\\nbe replaced for the execution of different operations. This paper also includes\\na full description of the software pipeline employed to automatically discover\\nand deploy the robot morphology. Specifically, depending on the modules\\ninstalled, the robot updates the kinematic, dynamic, and geometric parameters,\\ntaking into account the information embedded in each module. In this way, we\\ndemonstrate how the robot can be fully reassembled and made operational in less\\nthan ten minutes. We validated the CONCERT robot across different use cases,\\nincluding drilling, sanding, plastering, and collaborative transportation with\\nobstacle avoidance, all performed in a real construction site scenario. We\\ndemonstrated the robot's adaptivity and performance in multiple scenarios\\ncharacterized by different requirements in terms of power and workspace.\\nCONCERT has been designed and built by the Humanoid and Human-Centered\\nMechatronics Laboratory (HHCM) at the Istituto Italiano di Tecnologia in the\\ncontext of the European Project Horizon 2020 CONCERT.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-07T12:25:52Z\"}"}
