{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04880v1\", \"title\": \"Investigation of the baryon time-like electromagnetic form factors in\\n  the electron-positron annihilation reactions\", \"summary\": \"Based on the experimental measurements of the electron-positron annihilation\\nreactions into a baryon ($B$) and anti-baryon ($\\\\bar{B}$) pair, the\\nelectromagnetic form factors of hyperons in the time-like region can be\\ninvestigated within the vector meson dominance model. The theoretical model\\nparameters are determined by fitting them to the total cross sections of the\\nprocess $e^+e^-\\\\to B \\\\bar{B}$, and it is found that the current experimental\\ndata on the baryon electromagnetic form factors in the time-like region can be\\nwell reproduced. In addition to the total cross sections, the electromagnetic\\nform factors $G_E$ and $G_M$, and the charge radii of those baryons are also\\nestimated, which are in agreement with the experimental data. On the other\\nhand, we have also investigated the nonmonotonic behavior of the time-like\\nbaryon electromagnetic form factors, and it is found that the previously\\nproposed periodic behaviour of the nucleon time-like electromagnetic form\\nfactor is not confirmed. However, we do observe the nonmonotonic structures in\\nthe line shape of the baryon effective form factors or the ratio $|G_E/G_M|$\\nfor the charmed baryon $\\\\Lambda^+_c$. These features can be naturally explained\\nby incorporating contributions from excited vector states. More precise\\nmeasurements of the $e^+e^-\\\\to B \\\\bar{B}$ reaction offer a valuable opportunity\\nto probe the properties of excited vector states, which are at present poorly\\nknown. Additionally, comprehensive theoretical and experimental studies of\\nbaryon timelike electromagnetic form factors can provide critical insights into\\nthe underlying mechanisms of electron-positron annihilation processes.\", \"main_category\": \"hep-ph\", \"categories\": \"hep-ph,hep-ex,nucl-ex,nucl-th\", \"published\": \"2025-04-07T09:42:07Z\"}"}
