{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04838v1\", \"title\": \"Palatable pellets -- a fundamental framework to produce sustainable\\n  pellets via extrusion\", \"summary\": \"In pellet manufacturing various ingredients in powder or particle form are\\npressed together into a dense product, a pellet, with better nutritional,\\ncalorific, and handling properties than the individual input ingredients\\nthemselves. For this reason, pellet manufacturing is applied to up-convert\\nindustrial co-products from various sectors like agriculture, forestry, human\\nfood, or bio-energy production, to valorize their waste-streams into more\\nvaluable products. However, processing such diverse ingredient streams presents\\nan industrial challenge and raises the important scientific question: \\\"Under\\nwhich process conditions do loose pellet ingredients bind together to form a\\nmechanically rigid and durable pellet?\\\" In this work we provide new answers to\\nthis old research question by determining the causal relationships between\\nprocessing parameters and physical pellet quality. Systematic pelleting\\nexperiments reveal that the interplay of typical process parameters such as\\nsteam conditioning temperature, production rate, and die geometry, can be\\nunderstood in an overarching framework of process interactions. We introduce\\nthe concept of the \\\"stickiness temperature,\\\" $\\\\mathrm{T^*}$, marking the onset\\nof critical enthalpic reactions necessary for pellet agglomeration, the\\nboundary condition for bond formation within a pellet. Our framework\\ndemonstrates how $T^*$ is achieved through a combination of steam conditioning\\nand friction, and how these conditions can be controlled by adjusting process\\nparameters. Our findings underscore the significance of pellet temperature in\\nconjunction with die residence time, for optimizing physical pellet quality\\nwhile reducing energy consumption per kilogram of product. Validating our\\nresults in a trial and leveraging existing literature data, our framework\\nprovides handles to intelligently enhance the efficiency and sustainability of\\npelleting processes.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-04-07T08:48:12Z\"}"}
