{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05717v1\", \"title\": \"Rainbow gravity effects on Klein-Gordon particles in a quantized\\n  nonuniform external magnetic field in the Bonnor-Melvin domain walls\\n  background\", \"summary\": \"We investigate the effect of rainbow gravity on Klein-Gordon (KG) bosons in a\\nquantized nonuniform magnetic field in the background of Bonnor-Melvin (BM)\\nspacetime with a cosmological constant. In the process, we show that the BM\\nspacetime introduces domain walls (i.e., infinitely impenetrable hard walls) at\\n\\\\(r = 0\\\\) and \\\\(r = \\\\pi/\\\\sqrt{2\\\\Lambda}\\\\), as a consequence of the effective\\ngravitational potential field generated by such a magnetized BM spacetime. As a\\nresult, the motion of KG particles/antiparticles is restricted indefinitely\\nwithin the range \\\\(r \\\\in [0, \\\\pi/\\\\sqrt{2\\\\Lambda}]\\\\), and the particles and\\nantiparticles cannot be found elsewhere. Next, we provide a conditionally exact\\nsolution in the form of the general Heun function \\\\(H_G(a, q, \\\\alpha, \\\\beta,\\n\\\\gamma, \\\\delta, z)\\\\). Within the BM domain walls and under the condition of\\nexact solvability, we study the effects of rainbow gravity on KG bosonic fields\\nin a quantized nonuniform external magnetic field in the BM spacetime\\nbackground. We use three pairs of rainbow functions: \\\\( f(u) = (1 -\\n\\\\tilde{\\\\beta} |E|)^{-1}, \\\\, h(u) = 1 \\\\); and \\\\( f(u) = 1, \\\\, h(u) = \\\\sqrt{1 -\\n\\\\tilde{\\\\beta} |E|^\\\\upsilon} \\\\), with \\\\(\\\\upsilon = 1,2\\\\), where \\\\(u = |E| /\\nE_p\\\\), \\\\(\\\\tilde{\\\\beta} = \\\\beta / E_p\\\\), and \\\\(\\\\beta\\\\) is the rainbow parameter.\\nWe find that such pairs of rainbow functions, \\\\((f(u), h(u))\\\\), fully comply\\nwith the theory of rainbow gravity, ensuring that \\\\(E_p\\\\) is the maximum\\npossible energy for particles and antiparticles alike. Moreover, we show that\\nthe corresponding bosonic states form magnetized, rotating vortices, as\\nintriguing consequences of such a magnetized BM spacetime background.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc,astro-ph.HE\", \"published\": \"2025-04-08T06:36:54Z\"}"}
