{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04857v1\", \"title\": \"3D Gaussian Particle Approximation of VDB Datasets: A Study for\\n  Scientific Visualization\", \"summary\": \"The complexity and scale of Volumetric and Simulation datasets for Scientific\\nVisualization(SciVis) continue to grow. And the approaches and advantages of\\nmemory-efficient data formats and storage techniques for such datasets vary.\\nOpenVDB library and its VDB data format excels in memory efficiency through its\\nhierarchical and dynamic tree structure, with active and inactive sub-trees for\\ndata storage. It is heavily used in current production renderers for both\\nanimation and rendering stages in VFX pipelines and photorealistic rendering of\\nvolumes and fluids. However, it still remains to be fully leveraged in SciVis\\nwhere domains dealing with sparse scalar fields like porous media, time varying\\nvolumes such as tornado and weather simulation or high resolution simulation of\\nComputational Fluid Dynamics present ample number of large challenging data\\nsets.Goal of this paper is not only to explore the use of OpenVDB in SciVis but\\nalso to explore a level of detail(LOD) technique using 3D Gaussian particles\\napproximating voxel regions. For rendering, we utilize NVIDIA OptiX library for\\nray marching through the Gaussians particles. Data modeling using 3D Gaussians\\nhas been very popular lately due to success in stereoscopic image to 3D scene\\nconversion using Gaussian Splatting and Gaussian approximation and mixture\\nmodels aren't entirely new in SciVis as well. Our work explores the integration\\nwith rendering software libraries like OpenVDB and OptiX to take advantage of\\ntheir built-in memory compaction and hardware acceleration features, while also\\nleveraging the performance capabilities of modern GPUs. Thus, we present a\\nSciVis rendering approach that uses 3D Gaussians at varying LOD in a lossy\\nscheme derived from VDB datasets, rather than focusing on photorealistic volume\\nrendering.\", \"main_category\": \"cs.GR\", \"categories\": \"cs.GR\", \"published\": \"2025-04-07T09:14:15Z\"}"}
