{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01800v1\", \"title\": \"Motility and rotation of multi-timescale microswimmers in linear\\n  background flows\", \"summary\": \"Microswimming cells and robots exhibit diverse behaviours due to both their\\nswimming and their environment. One of the core environmental features\\nimpacting inertialess swimming is background flows. While the influence of\\nselect flows, particularly shear flows, have been extensively investigated,\\nthese are special cases. Here, we examine inertialess swimmers in more general\\nflows, specifically general linear planar flows that may also possess rapid\\noscillations. Relatively weak symmetry constraints are imposed on the swimmer\\nto ensure planarity and to reduce complexity. A further constraint reflecting\\ncommon observation is imposed, namely that the swimmer is inefficient, which we\\nsuitably define. This introduces two separate timescales: a fast timescale\\nassociated with swimmer actuation, and a second timescale associated with net\\nswimmer movement, with inefficiency dictating that this latter timescale is\\nmuch slower, allowing for a multiple timescale simplification of the governing\\nequations. With the exception of mathematically precise edge cases, we find\\nthat the behaviour of the swimmer is dictated by two parameter groupings, both\\nof which measure balances between the angular velocity and rate of strain of\\nthe background flow. While the measures of flow angular velocity and strain\\nrates that primarily govern the rotational dynamics are modulated by swimmer\\nproperties, the primary features of the translational motion are determined\\nsolely by a ratio of flow angular velocity to strain rate. Hence, a simple\\nclassification of the swimmer dynamics emerges. For example, this illustrates\\nthe limited extent to which, and how, microswimmers may control their\\norientations and trajectories in flows.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-02T15:09:50Z\"}"}
