{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02492v1\", \"title\": \"Industrial Internet Robot Collaboration System and Edge Computing\\n  Optimization\", \"summary\": \"In a complex environment, for a mobile robot to safely and collision - free\\navoid all obstacles, it poses high requirements for its intelligence level.\\nGiven that the information such as the position and geometric characteristics\\nof obstacles is random, the control parameters of the robot, such as velocity\\nand angular velocity, are also prone to random deviations. To address this\\nissue in the framework of the Industrial Internet Robot Collaboration System,\\nthis paper proposes a global path control scheme for mobile robots based on\\ndeep learning. First of all, the dynamic equation of the mobile robot is\\nestablished. According to the linear velocity and angular velocity of the\\nmobile robot, its motion behaviors are divided into obstacle - avoidance\\nbehavior, target - turning behavior, and target approaching behavior.\\nSubsequently, the neural network method in deep learning is used to build a\\nglobal path planning model for the robot. On this basis, a fuzzy controller is\\ndesigned with the help of a fuzzy control algorithm to correct the deviations\\nthat occur during path planning, thereby achieving optimized control of the\\nrobot's global path. In addition, considering edge computing optimization, the\\nproposed model can process local data at the edge device, reducing the\\ncommunication burden between the robot and the central server, and improving\\nthe real time performance of path planning. The experimental results show that\\nfor the mobile robot controlled by the research method in this paper, the\\ndeviation distance of the path angle is within 5 cm, the deviation convergence\\ncan be completed within 10 ms, and the planned path is shorter. This indicates\\nthat the proposed scheme can effectively improve the global path planning\\nability of mobile robots in the industrial Internet environment and promote the\\ncollaborative operation of robots through edge computing optimization.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.AI\", \"published\": \"2025-04-03T11:15:10Z\"}"}
