{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04827v1\", \"title\": \"From Specificity to Generality: Revisiting Generalizable Artifacts in\\n  Detecting Face Deepfakes\", \"summary\": \"Detecting deepfakes has been an increasingly important topic, especially\\ngiven the rapid development of AI generation techniques. In this paper, we ask:\\nHow can we build a universal detection framework that is effective for most\\nfacial deepfakes? One significant challenge is the wide variety of deepfake\\ngenerators available, resulting in varying forgery artifacts (e.g., lighting\\ninconsistency, color mismatch, etc). But should we ``teach\\\" the detector to\\nlearn all these artifacts separately? It is impossible and impractical to\\nelaborate on them all. So the core idea is to pinpoint the more common and\\ngeneral artifacts across different deepfakes. Accordingly, we categorize\\ndeepfake artifacts into two distinct yet complementary types: Face\\nInconsistency Artifacts (FIA) and Up-Sampling Artifacts (USA). FIA arise from\\nthe challenge of generating all intricate details, inevitably causing\\ninconsistencies between the complex facial features and relatively uniform\\nsurrounding areas. USA, on the other hand, are the inevitable traces left by\\nthe generator's decoder during the up-sampling process. This categorization\\nstems from the observation that all existing deepfakes typically exhibit one or\\nboth of these artifacts. To achieve this, we propose a new data-level\\npseudo-fake creation framework that constructs fake samples with only the FIA\\nand USA, without introducing extra less-general artifacts. Specifically, we\\nemploy a super-resolution to simulate the USA, while design a Blender module\\nthat uses image-level self-blending on diverse facial regions to create the\\nFIA. We surprisingly found that, with this intuitive design, a standard image\\nclassifier trained only with our pseudo-fake data can non-trivially generalize\\nwell to unseen deepfakes.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-07T08:34:28Z\"}"}
