{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23808v1\", \"title\": \"Why does tinnitus vary with naps? A polysomnographic prospective study\\n  exploring the somatosensory hypothesis\", \"summary\": \"Background: Tinnitus, defined as the conscious awareness of a noise without\\nany identifiable corresponding external acoustic source, can be modulated by\\nvarious factors. Among these factors, tinnitus patients commonly report drastic\\nincreases of tinnitus loudness following nap sleep. Previous studies have\\nsuggested that this clinical pattern could be attributed to a somatosensory\\nmodulation of tinnitus. To our knowledge, no polysomnographic study has been\\ncarried out to assess this hypothesis. Methods: For this observational\\nprospective study, 37 participants reporting frequent increases of tinnitus\\nfollowing naps were recruited. They participated to six full-polysomnography\\nnap attempts over two days. Audiological and kinesiologic tests were conducted\\nbefore and after each nap attempt. Results: 197 naps were collected. Each nap\\nat each time of day elicited an overall significant increase in tinnitus\\nminimum masking level (MML). Each inter nap period elicited an overall\\nsignificant decrease. Tinnitus modulations were found significantly correlated\\nwith nap sleep duration (Visual numeric scale on tinnitus loudness, VNS-L, p <\\n0.05), with snoring duration (MML, p < 0.001), with snoring average sound level\\n(VNS on tinnitus intrusiveness, VNS-I, p < 0.05) and with sleep apnea count\\n(VNS-I, p < 0.001). Conclusions: This study confirms objectively that tinnitus\\nmay increase following naps. No association was found between these modulations\\nand somatosensory modulations involving the temporomandibular joint and\\ncervical areas. However, it may be possible that nap-induced tinnitus\\nmodulations are a hidden form of somatosensory modulation as snoring and sleep\\napnea events are often related to tensor veli palatini muscle dysfunction.\", \"main_category\": \"q-bio.NC\", \"categories\": \"q-bio.NC\", \"published\": \"2025-03-31T07:42:33Z\"}"}
