{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23907v1\", \"title\": \"HumanAesExpert: Advancing a Multi-Modality Foundation Model for Human\\n  Image Aesthetic Assessment\", \"summary\": \"Image Aesthetic Assessment (IAA) is a long-standing and challenging research\\ntask. However, its subset, Human Image Aesthetic Assessment (HIAA), has been\\nscarcely explored, even though HIAA is widely used in social media, AI\\nworkflows, and related domains. To bridge this research gap, our work pioneers\\na holistic implementation framework tailored for HIAA. Specifically, we\\nintroduce HumanBeauty, the first dataset purpose-built for HIAA, which\\ncomprises 108k high-quality human images with manual annotations. To achieve\\ncomprehensive and fine-grained HIAA, 50K human images are manually collected\\nthrough a rigorous curation process and annotated leveraging our trailblazing\\n12-dimensional aesthetic standard, while the remaining 58K with overall\\naesthetic labels are systematically filtered from public datasets. Based on the\\nHumanBeauty database, we propose HumanAesExpert, a powerful Vision Language\\nModel for aesthetic evaluation of human images. We innovatively design an\\nExpert head to incorporate human knowledge of aesthetic sub-dimensions while\\njointly utilizing the Language Modeling (LM) and Regression head. This approach\\nempowers our model to achieve superior proficiency in both overall and\\nfine-grained HIAA. Furthermore, we introduce a MetaVoter, which aggregates\\nscores from all three heads, to effectively balance the capabilities of each\\nhead, thereby realizing improved assessment precision. Extensive experiments\\ndemonstrate that our HumanAesExpert models deliver significantly better\\nperformance in HIAA than other state-of-the-art models. Our datasets, models,\\nand codes are publicly released to advance the HIAA community. Project webpage:\\nhttps://humanaesexpert.github.io/HumanAesExpert/\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-03-31T09:58:11Z\"}"}
