{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24168v1\", \"title\": \"The Compact Linear e$^+$e$^-$ Collider (CLIC)\", \"summary\": \"The Compact Linear Collider (CLIC) is a TeV-scale high-luminosity linear\\ne$^+$e$^-$ collider studied by the international CLIC and CLICdp\\ncollaborations. CLIC uses a two-beam acceleration scheme, in which\\nnormal-conducting high-gradient 12 GHz accelerating structures are powered via\\na high-current drive beam. CLIC is foreseen to be built and operated in stages.\\nThe initial 380 GeV stage, with a site length of 11 km, optimally combines the\\nexploration of Higgs and top-quark physics, including a top threshold scan near\\n350 GeV. A higher-energy stage, still using the initial single drive-beam\\ncomplex, can be optimised for any energy up to 2 TeV. Parameters are presented\\nin detail for a 1.5 TeV stage, with a site length of 29 km. Since the 2018\\nESPPU reporting, significant effort was invested in CLIC accelerator\\noptimisation, technology developments and system tests, including collaboration\\nwith new-generation light sources and free-electron lasers. CLIC implementation\\naspects at CERN have covered detailed studies of civil engineering, electrical\\nnetworks, cooling and ventilation, scheduling, and costing. The CLIC baseline\\nat 380 GeV is now 100 Hz operation, with a luminosity of 4.5$\\\\times\\n10^{34}$\\\\,cm$^{-2}$s$^{-1}$ and a power consumption of 166 MW. Compared to the\\n2018 design, this gives three times higher luminosity-per-power. The new\\nbaseline has two beam-delivery systems, allowing for two detectors operating in\\nparallel. The cost estimate of the 380 GeV baseline is approximately 7.17\\nbillion CHF. The construction of the first CLIC energy stage could start as\\nearly as 2033 with first beams available by 2041. This report summarises the\\nCLIC project, its implementation and running scenarios, with emphasis on new\\ndevelopments and recent progress. It concludes with an update on the CLIC\\ndetector studies and on the physics potential in light of the improved\\naccelerator performance.\", \"main_category\": \"physics.acc-ph\", \"categories\": \"physics.acc-ph\", \"published\": \"2025-03-31T14:48:58Z\"}"}
