{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05645v1\", \"title\": \"A Study of Multiple Molecular Lines at the 3 mm Band toward Gas\\n  Infalling Sources\", \"summary\": \"The study of multiple molecular spectral lines in gas infalling sources can\\nprovide the physical and chemical properties of these sources and help us\\nestimate their evolutionary stages. We report line detections within the 3 mm\\nband using the FTS wide-sideband mode of the IRAM 30 m telescope toward 20\\ngas-infalling sources. Using XCLASS, we identify the emission lines of up to 22\\nmolecular species (including a few isotopologues) and one hydrogen radio\\nrecombination line in these sources. H$^{13}$CO$^+$, HCO$^+$, HCN, HNC,\\nc-C$_3$H$_2$, and CCH lines are detected in 15 sources. We estimate the\\nrotation temperatures and column densities of these molecular species using the\\nLTE radiative transfer model, and compare the molecular abundances of these\\nsources with those from nine high-mass star-forming regions reported in\\nprevious studies and with those from the chemical model. Our results suggest\\nthat G012.79-0.20, G012.87-0.22 clump A and B, and G012.96-0.23 clump A may be\\nin the high-mass protostellar object stage, while sources with fewer detected\\nspecies may be in the earlier evolutionary stage. Additionally, the CCH and\\nc-C$_3$H$_2$ column densities in our sources reveal a linear correlation, with\\na ratio of N(CCH)/N(c-C$_3$H$_2$) = 89.2$\\\\pm$5.6, which is higher than the\\nratios reported in the literature. When considering only sources with lower\\ncolumn densities, this ratio decreases to 29.0$\\\\pm$6.1, consistent with those\\nof diffuse clouds. Furthermore, a comparison between the N(CCH)/N(c-C$_3$H$_2$)\\nratio and the sources' physical parameters reveals a correlation, with sources\\nexhibiting higher ratios tending to have higher kinetic temperatures and H$_2$\\ncolumn densities.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-08T03:40:53Z\"}"}
