{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07468v1\", \"title\": \"Novel Pooling-based VGG-Lite for Pneumonia and Covid-19 Detection from\\n  Imbalanced Chest X-Ray Datasets\", \"summary\": \"This paper proposes a novel pooling-based VGG-Lite model in order to mitigate\\nclass imbalance issues in Chest X-Ray (CXR) datasets. Automatic Pneumonia\\ndetection from CXR images by deep learning model has emerged as a prominent and\\ndynamic area of research, since the inception of the new Covid-19 variant in\\n2020. However, the standard Convolutional Neural Network (CNN) models encounter\\nchallenges associated with class imbalance, a prevalent issue found in many\\nmedical datasets. The innovations introduced in the proposed model architecture\\ninclude: (I) A very lightweight CNN model, `VGG-Lite', is proposed as a base\\nmodel, inspired by VGG-16 and MobileNet-V2 architecture. (II) On top of this\\nbase model, we leverage an ``Edge Enhanced Module (EEM)\\\" through a parallel\\nbranch, consisting of a ``negative image layer\\\", and a novel custom pooling\\nlayer ``2Max-Min Pooling\\\". This 2Max-Min Pooling layer is entirely novel in\\nthis investigation, providing more attention to edge components within\\npneumonia CXR images. Thus, it works as an efficient spatial attention module\\n(SAM). We have implemented the proposed framework on two separate CXR datasets.\\nThe first dataset is obtained from a readily available source on the internet,\\nand the second dataset is a more challenging CXR dataset, assembled by our\\nresearch team from three different sources. Experimental results reveal that\\nour proposed framework has outperformed pre-trained CNN models, and three\\nrecent trend existing models ``Vision Transformer\\\", ``Pooling-based Vision\\nTransformer (PiT)'' and ``PneuNet\\\", by substantial margins on both datasets.\\nThe proposed framework VGG-Lite with EEM, has achieved a macro average of 95%\\naccuracy, 97.1% precision, 96.1% recall, and 96.6% F1 score on the ``Pneumonia\\nImbalance CXR dataset\\\", without employing any pre-processing technique.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.CV\", \"published\": \"2025-04-10T05:38:46Z\"}"}
