{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07930v1\", \"title\": \"Localization and Topology in Noncentrosymmetric Superconductors with\\n  Disorder\", \"summary\": \"The celebrated Kitaev chain reveals a captivating phase diagram in the\\npresence of various disorders, encompassing multifractal states and topological\\nAnderson phases. In this work, we investigate the localization and topological\\nproperties of a dimerized topological noncentrosymmetric superconductor (NCS)\\nunder quasiperiodic and Anderson disorders. Using both global and local\\ncharacterization methods, we identify energy-dependent transitions from ergodic\\nto multifractal and localized states. Extended multifractal regimes emerge from\\nthe competition between dimerization, NCS order, and quasiperiodic modulation.\\nThis interplay causes localization to occur preferentially in different energy\\nbands depending on the disorder strength, with the lowest bands exhibiting the\\nhighest sensitivity to parameter variations. We employ the real-space\\npolarization method to compute the $\\\\mathbb{Z}_2$ topological invariant,\\nrevealing alternating topological and trivial phases as the quasiperiodic\\npotential increases, a behavior distinct from the typical topological Anderson\\nphase diagram. Additionally, the topological states show remarkable robustness\\nagainst Anderson disorder, providing new insights into topological phase\\nstability in non-centrosymmetric systems. Finally, we propose a feasible\\nexperimental scheme based on superconducting Josephson junctions, where\\nNCS-like behavior can be engineered via spatially modulated supercurrents. Our\\nfindings highlight the distinct roles of different disorder types in shaping\\nlocalization and topology, providing insight into the engineering of Majorana\\nzero modes and offering profound implications for topological quantum\\nencryption schemes.\", \"main_category\": \"cond-mat.other\", \"categories\": \"cond-mat.other\", \"published\": \"2025-04-10T17:45:28Z\"}"}
