{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02496v1\", \"title\": \"Group-based Distinctive Image Captioning with Memory Difference Encoding\\n  and Attention\", \"summary\": \"Recent advances in image captioning have focused on enhancing accuracy by\\nsubstantially increasing the dataset and model size. While conventional\\ncaptioning models exhibit high performance on established metrics such as BLEU,\\nCIDEr, and SPICE, the capability of captions to distinguish the target image\\nfrom other similar images is under-explored. To generate distinctive captions,\\na few pioneers employed contrastive learning or re-weighted the ground-truth\\ncaptions. However, these approaches often overlook the relationships among\\nobjects in a similar image group (e.g., items or properties within the same\\nalbum or fine-grained events). In this paper, we introduce a novel approach to\\nenhance the distinctiveness of image captions, namely Group-based Differential\\nDistinctive Captioning Method, which visually compares each image with other\\nimages in one similar group and highlights the uniqueness of each image. In\\nparticular, we introduce a Group-based Differential Memory Attention (GDMA)\\nmodule, designed to identify and emphasize object features in an image that are\\nuniquely distinguishable within its image group, i.e., those exhibiting low\\nsimilarity with objects in other images. This mechanism ensures that such\\nunique object features are prioritized during caption generation for the image,\\nthereby enhancing the distinctiveness of the resulting captions. To further\\nrefine this process, we select distinctive words from the ground-truth captions\\nto guide both the language decoder and the GDMA module. Additionally, we\\npropose a new evaluation metric, the Distinctive Word Rate (DisWordRate), to\\nquantitatively assess caption distinctiveness. Quantitative results indicate\\nthat the proposed method significantly improves the distinctiveness of several\\nbaseline models, and achieves state-of-the-art performance on distinctiveness\\nwhile not excessively sacrificing accuracy...\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.MM\", \"published\": \"2025-04-03T11:19:51Z\"}"}
