{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06847v1\", \"title\": \"Extended study of crystal structures, optical properties and vibrational\\n  spectra of polar 2-aminopyrimidinium hydrogen phosphite and\\n  bis(2-aminopyrimidinium) sulfate monohydrate and two 2-aminopyrimidinium\\n  hydrogen sulfate polymorphs\", \"summary\": \"This study aimed primarily at completing and extending the characterization\\nof the crystallographic, spectroscopic and optical properties of polar,\\nbiaxial, optically negative 2-aminopyrimidinium(1+) hydrogen phosphite. Besides\\nthe redetermination of the low-temperature crystal structure (space group P21),\\nhigh-quality single crystals of this salt were grown from an aqueous solution,\\nand their optical properties were studied. The determination of the refractive\\nindices in the wavelength range of 435-1083 nm showed anomalous dispersion of\\nthe refractive indices, resulting in a point of uniaxiality. The crystal allows\\nphase matching for collinear second harmonic generation (SHG) processes of both\\ntype I and type II in a broad wavelength range. SHG properties were studied for\\npowdered size-fractioned samples and oriented single-crystal cuts. The optical\\ndamage threshold experiments confirmed excellent optical resistance - at least\\n220 TWm-2 and 70 TWm-2 for 800 and 1000 nm irradiation, respectively. The\\nlow-temperature crystallographic study was also extended for three monoclinic\\nsalts of 2-aminopyrimidine and sulfuric acid - i.e. bis(2-aminopyrimidinium(1+)\\nsulfate monohydrate (space group P21/n) and two polymorphs of\\n2-aminopyrimidinium(1+) hydrogen sulfate (both with space group P21/c). The\\nvibrational spectra of all title compounds were assigned using single-molecule\\nquantum chemical computations (including Potential Energy Distribution\\nanalysis) in combination with the nuclear site group analysis. Spectroscopic\\nresults concerning sulfates of 2-aminopyrimidine provided valuable reference\\nmaterials for the vibrational spectroscopic study and also addressed the\\nquestion of their polymorphism. An optimal computational approach employing\\nsolid-state DFT calculations has also been sought to model the vibrational\\nspectra of 2-aminopyrimidinium (1+) hydrogen phosphite crystals.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,physics.chem-ph\", \"published\": \"2025-04-09T13:02:52Z\"}"}
