{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04825v1\", \"title\": \"Binary neutron star merger offsets from their host galaxies II.\\n  Short-duration gamma-ray bursts\", \"summary\": \"The mergers of binary neutron stars (BNSs) and neutron star-black holes\\n(NSBHs) binaries have long been linked to short-duration gamma-ray bursts\\n(SGRBs). However, despite their stellar progenitors, SGRBs are often found\\noutside the stellar light of the host galaxy. This is commonly attributed to\\nsupernova kicks, which displace the SGRB progenitors from the original stellar\\npopulation. Our goal is to use stellar population synthesis models to reproduce\\nand interpret the observed offsets of a statistical sample of SGRBs, using\\nrealistic galactic models based on the observed host properties. We derive the\\nhost galaxy potentials from the observed properties on a case-by-case basis,\\nand simulate the galactic trajectories of synthetic BNSs and NSBHs from the\\nBPASS code using three different kick prescriptions. We compare predicted and\\nobserved offsets to investigate the impact of velocity kicks, host galaxy\\ntypes, and host association criteria. The results confirm that the locations of\\nthe SGRB population are consistent with the expectations of kicked BNS or BHNS\\nprogenitors, implying that such mergers are the dominant (if not only)\\nprogenitor system. Predictions for NSBHs provide a significantly worse fit\\ncompared to BNSs, while we find no significant difference when comparing\\ndifferent kick prescriptions. For late-type hosts, we find the best agreement\\nwhen including hosts with a probability of chance alignment Pch up to 20%,\\nwhile lower Pch thresholds lead us to overestimate SGRB offsets. We argue that\\nPch is biased against viable hosts at the largest offsets, and suggest the use\\nof less conservative Pch thresholds for late-type hosts. For early-type hosts,\\nthe predictions underestimate SGRB offsets in a few cases regardless of the Pch\\nthreshold applied. We argue that this is likely due to the models missing\\ngalaxy evolution, or spurious host associations.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.GA\", \"published\": \"2025-04-07T08:31:12Z\"}"}
