{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06785v1\", \"title\": \"Zero-Shot Image-Based Large Language Model Approach to Road Pavement\\n  Monitoring\", \"summary\": \"Effective and rapid evaluation of pavement surface condition is critical for\\nprioritizing maintenance, ensuring transportation safety, and minimizing\\nvehicle wear and tear. While conventional manual inspections suffer from\\nsubjectivity, existing machine learning-based methods are constrained by their\\nreliance on large and high-quality labeled datasets, which require significant\\nresources and limit adaptability across varied road conditions. The\\nrevolutionary advancements in Large Language Models (LLMs) present significant\\npotential for overcoming these challenges. In this study, we propose an\\ninnovative automated zero-shot learning approach that leverages the image\\nrecognition and natural language understanding capabilities of LLMs to assess\\nroad conditions effectively. Multiple LLM-based assessment models were\\ndeveloped, employing prompt engineering strategies aligned with the Pavement\\nSurface Condition Index (PSCI) standards. These models' accuracy and\\nreliability were evaluated against official PSCI results, with an optimized\\nmodel ultimately selected. Extensive tests benchmarked the optimized model\\nagainst evaluations from various levels experts using Google Street View road\\nimages. The results reveal that the LLM-based approach can effectively assess\\nroad conditions, with the optimized model -employing comprehensive and\\nstructured prompt engineering strategies -outperforming simpler configurations\\nby achieving high accuracy and consistency, even surpassing expert evaluations.\\nMoreover, successfully applying the optimized model to Google Street View\\nimages demonstrates its potential for future city-scale deployments. These\\nfindings highlight the transformative potential of LLMs in automating road\\ndamage evaluations and underscore the pivotal role of detailed prompt\\nengineering in achieving reliable assessments.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-09T11:19:17Z\"}"}
