{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07060v1\", \"title\": \"Generalized Semantic Contrastive Learning via Embedding Side Information\\n  for Few-Shot Object Detection\", \"summary\": \"The objective of few-shot object detection (FSOD) is to detect novel objects\\nwith few training samples. The core challenge of this task is how to construct\\na generalized feature space for novel categories with limited data on the basis\\nof the base category space, which could adapt the learned detection model to\\nunknown scenarios. However, limited by insufficient samples for novel\\ncategories, two issues still exist: (1) the features of the novel category are\\neasily implicitly represented by the features of the base category, leading to\\ninseparable classifier boundaries, (2) novel categories with fewer data are not\\nenough to fully represent the distribution, where the model fine-tuning is\\nprone to overfitting. To address these issues, we introduce the side\\ninformation to alleviate the negative influences derived from the feature space\\nand sample viewpoints and formulate a novel generalized feature representation\\nlearning method for FSOD. Specifically, we first utilize embedding side\\ninformation to construct a knowledge matrix to quantify the semantic\\nrelationship between the base and novel categories. Then, to strengthen the\\ndiscrimination between semantically similar categories, we further develop\\ncontextual semantic supervised contrastive learning which embeds side\\ninformation. Furthermore, to prevent overfitting problems caused by sparse\\nsamples, a side-information guided region-aware masked module is introduced to\\naugment the diversity of samples, which finds and abandons biased information\\nthat discriminates between similar categories via counterfactual explanation,\\nand refines the discriminative representation space further. Extensive\\nexperiments using ResNet and ViT backbones on PASCAL VOC, MS COCO, LVIS V1,\\nFSOD-1K, and FSVOD-500 benchmarks demonstrate that our model outperforms the\\nprevious state-of-the-art methods, significantly improving the ability of FSOD\\nin most shots/splits.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-09T17:24:05Z\"}"}
