{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02628v1\", \"title\": \"Towards Computation- and Communication-efficient Computational Pathology\", \"summary\": \"Despite the impressive performance across a wide range of applications,\\ncurrent computational pathology models face significant diagnostic efficiency\\nchallenges due to their reliance on high-magnification whole-slide image\\nanalysis. This limitation severely compromises their clinical utility,\\nespecially in time-sensitive diagnostic scenarios and situations requiring\\nefficient data transfer. To address these issues, we present a novel\\ncomputation- and communication-efficient framework called Magnification-Aligned\\nGlobal-Local Transformer (MAGA-GLTrans). Our approach significantly reduces\\ncomputational time, file transfer requirements, and storage overhead by\\nenabling effective analysis using low-magnification inputs rather than\\nhigh-magnification ones. The key innovation lies in our proposed magnification\\nalignment (MAGA) mechanism, which employs self-supervised learning to bridge\\nthe information gap between low and high magnification levels by effectively\\naligning their feature representations. Through extensive evaluation across\\nvarious fundamental CPath tasks, MAGA-GLTrans demonstrates state-of-the-art\\nclassification performance while achieving remarkable efficiency gains: up to\\n10.7 times reduction in computational time and over 20 times reduction in file\\ntransfer and storage requirements. Furthermore, we highlight the versatility of\\nour MAGA framework through two significant extensions: (1) its applicability as\\na feature extractor to enhance the efficiency of any CPath architecture, and\\n(2) its compatibility with existing foundation models and\\nhistopathology-specific encoders, enabling them to process low-magnification\\ninputs with minimal information loss. These advancements position MAGA-GLTrans\\nas a particularly promising solution for time-sensitive applications,\\nespecially in the context of intraoperative frozen section diagnosis where both\\naccuracy and efficiency are paramount.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.CV\", \"published\": \"2025-04-03T14:25:19Z\"}"}
