{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02464v1\", \"title\": \"CornerPoint3D: Look at the Nearest Corner Instead of the Center\", \"summary\": \"3D object detection aims to predict object centers, dimensions, and rotations\\nfrom LiDAR point clouds. Despite its simplicity, LiDAR captures only the near\\nside of objects, making center-based detectors prone to poor localization\\naccuracy in cross-domain tasks with varying point distributions. Meanwhile,\\nexisting evaluation metrics designed for single-domain assessment also suffer\\nfrom overfitting due to dataset-specific size variations. A key question\\narises: Do we really need models to maintain excellent performance in the\\nentire 3D bounding boxes after being applied across domains? Actually, one of\\nour main focuses is on preventing collisions between vehicles and other\\nobstacles, especially in cross-domain scenarios where correctly predicting the\\nsizes is much more difficult. To address these issues, we rethink cross-domain\\n3D object detection from a practical perspective. We propose two new metrics\\nthat evaluate a model's ability to detect objects' closer-surfaces to the LiDAR\\nsensor. Additionally, we introduce EdgeHead, a refinement head that guides\\nmodels to focus more on learnable closer surfaces, significantly improving\\ncross-domain performance under both our new and traditional BEV/3D metrics.\\nFurthermore, we argue that predicting the nearest corner rather than the object\\ncenter enhances robustness. We propose a novel 3D object detector, coined as\\nCornerPoint3D, which is built upon CenterPoint and uses heatmaps to supervise\\nthe learning and detection of the nearest corner of each object. Our proposed\\nmethods realize a balanced trade-off between the detection quality of entire\\nbounding boxes and the locating accuracy of closer surfaces to the LiDAR\\nsensor, outperforming the traditional center-based detector CenterPoint in\\nmultiple cross-domain tasks and providing a more practically reasonable and\\nrobust cross-domain 3D object detection solution.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-03T10:33:43Z\"}"}
