{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01531v1\", \"title\": \"DRAN: A Distribution and Relation Adaptive Network for Spatio-temporal\\n  Forecasting\", \"summary\": \"Accurate predictions of spatio-temporal systems' states are crucial for tasks\\nsuch as system management, control, and crisis prevention. However, the\\ninherent time variance of spatio-temporal systems poses challenges to achieving\\naccurate predictions whenever stationarity is not granted. To address\\nnon-stationarity frameworks, we propose a Distribution and Relation Adaptive\\nNetwork (DRAN) capable of dynamically adapting to relation and distribution\\nchanges over time. While temporal normalization and de-normalization are\\nfrequently used techniques to adapt to distribution shifts, this operation is\\nnot suitable for the spatio-temporal context as temporal normalization scales\\nthe time series of nodes and possibly disrupts the spatial relations among\\nnodes. In order to address this problem, we develop a Spatial Factor Learner\\n(SFL) module that enables the normalization and de-normalization process in\\nspatio-temporal systems. To adapt to dynamic changes in spatial relationships\\namong sensors, we propose a Dynamic-Static Fusion Learner (DSFL) module that\\neffectively integrates features learned from both dynamic and static relations\\nthrough an adaptive fusion ratio mechanism. Furthermore, we introduce a\\nStochastic Learner to capture the noisy components of spatio-temporal\\nrepresentations. Our approach outperforms state of the art methods in weather\\nprediction and traffic flows forecasting tasks. Experimental results show that\\nour SFL efficiently preserves spatial relationships across various temporal\\nnormalization operations. Visualizations of the learned dynamic and static\\nrelations demonstrate that DSFL can capture both local and distant\\nrelationships between nodes. Moreover, ablation studies confirm the\\neffectiveness of each component.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-02T09:18:43Z\"}"}
