{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05893v1\", \"title\": \"Pushing JWST to the extremes: search and scrutiny of bright galaxy\\n  candidates at z$\\\\simeq$15-30\", \"summary\": \"We designed customized Lyman-break color selection techniques to identify\\ngalaxy candidates in the redshift ranges $15 \\\\leq z \\\\leq 20$ and $20 \\\\leq z\\n\\\\leq 28$. The selection was performed on the ASTRODEEP-JWST multi-band catalogs\\nof the CEERS, Abell-2744, JADES, NGDEEP, and PRIMER survey fields, covering a\\ntotal area of $\\\\sim0.2$ sq. deg. We identify nine candidates at $15 \\\\leq z \\\\leq\\n20$, while no objects are found based on the $z\\\\gtrsim20$ color selection\\ncriteria. Despite exhibiting a $>$1.5 mag break, all the objects display\\nmultimodal redshift probability distributions across different SED-fitting\\ncodes and methodologies. The alternative solutions correspond to poorly\\nunderstood populations of low-mass quiescent or dusty galaxies at z$\\\\sim$3-7.\\nThis conclusion is supported by the analysis of a NIRSpec spectrum recently\\nacquired by the CAPERS program for one interloper object, which is confirmed to\\nbe a dusty ($E(B-V)=0.8$ mag) starburst galaxy at $z=6.56$. We measured the UV\\nluminosity function under different assumptions on the contamination level\\nwithin our sample. We find that if even a fraction of the candidates is indeed\\nat $z\\\\gtrsim15$, the resulting UV LF points to a very mild evolution compared\\nto estimates at $z<15$, implying a significant tension with existing\\ntheoretical models. In particular, confirming our bright ($M_{\\\\text{UV}}<-21$)\\ncandidates would require substantial revisions to the theoretical framework. In\\nturn, if all these candidates will be confirmed to be interlopers, we conclude\\nthat future surveys may need ten times wider areas to select\\n$M_{\\\\text{UV}}\\\\lesssim-20$ galaxies at $z>15$. Observations in the F150W and\\nF200W filters at depths comparable to those in the NIRCam LW bands are also\\nrequired to mitigate contamination from rare red objects at z$\\\\lesssim$8.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.CO\", \"published\": \"2025-04-08T10:42:35Z\"}"}
