{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01474v1\", \"title\": \"Dual first-order methods for efficient computation of convex hull prices\", \"summary\": \"Convex Hull (CH) pricing, used in US electricity markets and raising interest\\nin Europe, is a pricing rule designed to handle markets with non-convexities\\nsuch as startup costs and minimum up and down times. In such markets, the\\nmarket operator makes side payments to generators to cover lost opportunity\\ncosts, and CH prices minimize the total \\\"lost opportunity costs\\\", which include\\nboth actual losses and missed profit opportunities. These prices can also be\\nobtained by solving a (partial) Lagrangian dual of the original mixed-integer\\nprogram, where power balance constraints are dualized. Computing CH prices then\\namounts to minimizing a sum of nonsmooth convex objective functions, where each\\nterm depends only on a single generator. The subgradient of each of those terms\\ncan be obtained independently by solving smaller mixed-integer programs. In\\nthis work, we benchmark a large panel of first-order methods to solve the above\\ndual CH pricing problem. We test several dual methods, most of which not\\npreviously considered for CH pricing, namely a proximal variant of the bundle\\nlevel method, subgradient methods with three different stepsize strategies, two\\nrecent parameter-free methods and an accelerated gradient method combined with\\nsmoothing. We compare those methods on two representative sets of real-world\\nlarge-scale instances and complement the comparison with a (Dantzig-Wolfe)\\nprimal column generation method shown to be efficient at computing CH prices,\\nfor reference. Our numerical experiments show that the bundle proximal level\\nmethod and two variants of the subgradient method perform the best among all\\ndual methods and compare favorably with the Dantzig-Wolfe primal method.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC,cs.SY,econ.GN,eess.SY,q-fin.EC\", \"published\": \"2025-04-02T08:28:35Z\"}"}
