{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23876v1\", \"title\": \"Populations of evolved massive binary stars in the Small Magellanic\\n  Cloud I: Predictions from detailed evolution models\", \"summary\": \"Context. The majority of massive stars are born with a close binary\\ncompanion. How this affects their evolution and fate is still largely\\nuncertain, especially at low metallicity. Aims. We derive synthetic populations\\nof massive post-interaction binary products and compare them with corresponding\\nobserved populations in the Small Magellanic Cloud (SMC). Methods. We analyse\\n53298 detailed binary evolutionary models computed with MESA. Our models\\ninclude the physics of rotation, mass and angular momentum transfer, magnetic\\ninternal angular momentum transport, and tidal spin-orbit coupling. They cover\\ninitial primary masses of 5-100Msun, initial mass ratios of 0.3-0.95, and all\\ninitial periods for which interaction is expected. They are evolved through the\\nfirst mass transfer and the donor star death, a possible ensuing Be/X-ray\\nbinary phase, and they end when the mass gainer leaves the main sequence.\\nResults.In our fiducial synthetic population, 8% of the OB stars in the SMC are\\npost-mass transfer systems, and 7% are merger products. In many of our models,\\nthe mass gainers are spun up and form Oe/Be stars. While our model\\nunderpredicts the number of Be/X-ray binaries in the SMC, it reproduces the\\nmain features of their orbital period distribution and the observed number of\\nSMC binary WR stars. We expect $\\\\sim$50 OB+BH binaries below and $\\\\sim$170\\nabove 20d orbital period. The latter might produce merging double BHs. However,\\ntheir progenitors, the predicted long-period WR+OB binaries, are not observed.\\nConclusions. While the comparison with the observed SMC stars supports many\\nphysics assumptions in our high-mass binary models, a better match of the large\\nnumber of observed OBe stars and Be/X-ray binaries likely requires a lower\\nmerger rate and/or a higher mass transfer efficiency during the first mass\\ntransfer. The fate of the initially wide O star binaries remains uncertain.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA,astro-ph.HE\", \"published\": \"2025-03-31T09:26:52Z\"}"}
