{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23686v1\", \"title\": \"Data-Driven Forecasting of High-Dimensional Transient and Stationary\\n  Processes via Space-Time Projection\", \"summary\": \"Space-Time Projection (STP) is introduced as a data-driven forecasting\\napproach for high-dimensional and time-resolved data. The method computes\\nextended space-time proper orthogonal modes from training data spanning a\\nprediction horizon comprising both hindcast and forecast intervals. Forecasts\\nare then generated by projecting the hindcast portion of these modes onto new\\ndata, simultaneously leveraging their orthogonality and optimal correlation\\nwith the forecast extension. Rooted in Proper Orthogonal Decomposition (POD)\\ntheory, dimensionality reduction and time-delay embedding are intrinsic to the\\napproach. For a given ensemble and fixed prediction horizon, the only tunable\\nparameter is the truncation rank--no additional hyperparameters are required.\\nThe hindcast accuracy serves as a reliable indicator for short-term forecast\\naccuracy and establishes a lower bound on forecast errors. The efficacy of the\\nmethod is demonstrated using two datasets: transient, highly anisotropic\\nsimulations of supernova explosions in a turbulent interstellar medium, and\\nexperimental velocity fields of a turbulent high-subsonic engineering flow. In\\na comparative study with standard Long Short-Term Memory (LSTM) neural\\nnetworks--acknowledging that alternative architectures or training strategies\\nmay yield different outcomes--the method consistently provided more accurate\\nforecasts. Considering its simplicity and robust performance, STP offers an\\ninterpretable and competitive benchmark for forecasting high-dimensional\\ntransient and chaotic processes, relying purely on spatiotemporal correlation\\ninformation.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,astro-ph.GA,nlin.CD,physics.comp-ph,physics.data-an,physics.flu-dyn\", \"published\": \"2025-03-31T03:36:59Z\"}"}
