{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06557v1\", \"title\": \"Market, power, gift, and concession economies: Comparison using\\n  four-mode primitive network models\", \"summary\": \"Reducing wealth inequality is a global challenge, and the problems of\\ncapitalism stem from the enclosure of the commons and the breakdown of the\\ncommunity. According to previous studies by Polanyi, Karatani, and Graeber,\\neconomic modes can be divided into capitalist market economy (enclosure and\\nexchange), power economy (de-enclosure and redistribution), gift economy\\n(obligation to return and reciprocity), and concession economy (de-obligation\\nto return). The concession economy reflects Graeber's baseline communism (from\\neach according to their abilities, to each according to their needs) and\\nDeguchi's We-turn philosophy (the \\\"I\\\" as an individual has a \\\"fundamental\\nincapability\\\" and the subject of physical action, responsibility, and freedom\\nis \\\"We\\\" as a multi-agent system, including the \\\"I\\\"). In this study, we\\nconstructed novel network models for these four modes and compared their\\nproperties (cluster coefficient, graph density, reciprocity, assortativity,\\ncentrality, and Gini coefficient). From the calculation results, it became\\nclear that the market economy leads to inequality; the power economy mitigates\\ninequality but cannot eliminate it; the gift and concession economies lead to a\\nhealthy and equal economy; and the concession economy, free from the ties of\\nobligation to return, is possible without guaranteeing reciprocity. We intend\\nto promote the transformation from a capitalist economy to a concession economy\\nthrough activities that disseminate baseline communism and the We-turn\\nphilosophy that promotes concession, that is, developing a cooperative platform\\nto support concession through information technology and empirical research\\nthrough fieldwork.\", \"main_category\": \"econ.TH\", \"categories\": \"econ.TH,cs.SI,physics.soc-ph\", \"published\": \"2025-04-09T03:37:14Z\"}"}
