{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04933v1\", \"title\": \"Deformation of the Heisenberg-Weyl algebra and the Lie superalgebra\\n  $\\\\mathfrak{osp}\\\\left( {1|2} \\\\right)$: exact solution for the quantum harmonic\\n  oscillator with a position-dependent mass\", \"summary\": \"We propose a new deformation of the quantum harmonic oscillator\\nHeisenberg-Weyl algebra with a parameter $a>-1$. This parameter is introduced\\nthrough the replacement of the homogeneous mass $m_0$ in the definition of the\\nmomentum operator $\\\\hat p_x$ as well as in the creation-annihilation operators\\n$\\\\hat a^\\\\pm$ with a mass varying with position $x$. The realization of such a\\ndeformation is shown through the exact solution of the corresponding\\nSchr\\\\\\\"odinger equation for the non-relativistic quantum harmonic oscillator\\nwithin the canonical approach. The obtained analytical expression of the energy\\nspectrum consists of an infinite number of equidistant levels, whereas the\\nwavefunctions of the stationary states of the problem under construction are\\nexpressed through the Hermite polynomials. Then, the Heisenberg-Weyl algebra\\ndeformation is generalized to the case of the Lie superalgebra\\n$\\\\mathfrak{osp}\\\\left( {1|2} \\\\right)$. It is shown that the realization of such\\na generalized superalgebra can be performed for the parabose quantum harmonic\\noscillator problem, the mass of which possesses a behavior completely\\noverlapping with the position-dependent mass of the canonically deformed\\nharmonic oscillator problem. This problem is solved exactly for both even and\\nodd stationary states. It is shown that the energy spectrum of the deformed\\nparabose oscillator is still equidistant, however, both even and odd state\\nwavefunctions are now expressed through the Laguerre polynomials. Some basic\\nlimit relations recovering the canonical harmonic oscillator with constant mass\\nare also discussed briefly.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cond-mat.other,math-ph,math.MP\", \"published\": \"2025-04-07T11:18:38Z\"}"}
