{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24205v1\", \"title\": \"A Comparison of Parametric Dynamic Mode Decomposition Algorithms for\\n  Thermal-Hydraulics Applications\", \"summary\": \"In recent years, algorithms aiming at learning models from available data\\nhave become quite popular due to two factors: 1) the significant developments\\nin Artificial Intelligence techniques and 2) the availability of large amounts\\nof data. Nevertheless, this topic has already been addressed by methodologies\\nbelonging to the Reduced Order Modelling framework, of which perhaps the most\\nfamous equation-free technique is Dynamic Mode Decomposition. This algorithm\\naims to learn the best linear model that represents the physical phenomena\\ndescribed by a time series dataset: its output is a best state operator of the\\nunderlying dynamical system that can be used, in principle, to advance the\\noriginal dataset in time even beyond its span. However, in its standard\\nformulation, this technique cannot deal with parametric time series, meaning\\nthat a different linear model has to be derived for each parameter realization.\\nResearch on this is ongoing, and some versions of a parametric Dynamic Mode\\nDecomposition already exist. This work contributes to this research field by\\ncomparing the different algorithms presently deployed and assessing their\\nadvantages and shortcomings compared to each other. To this aim, three\\ndifferent thermal-hydraulics problems are considered: two benchmark 'flow over\\ncylinder' test cases at diverse Reynolds numbers, whose datasets are,\\nrespectively, obtained with the FEniCS finite element solver and retrieved from\\nthe CFDbench dataset, and the DYNASTY experimental facility operating at\\nPolitecnico di Milano, which studies the natural circulation established by\\ninternally heated fluids for Generation IV nuclear applications, whose dataset\\nwas generated using the RELAP5 nodal solver.\", \"main_category\": \"math.DS\", \"categories\": \"math.DS,cs.LG\", \"published\": \"2025-03-31T15:23:22Z\"}"}
