{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21697v1\", \"title\": \"The commutativity problem for effective varieties of formal series, and\\n  applications\", \"summary\": \"A formal series in noncommuting variables $\\\\Sigma$ over the rationals is a\\nmapping $\\\\Sigma^* \\\\to \\\\mathbb Q$. We say that a series is commutative if the\\nvalue in the output does not depend on the order of the symbols in the input.\\nThe commutativity problem for a class of series takes as input a (finite\\npresentation of) a series from the class and amounts to establishing whether it\\nis commutative. This is a very natural, albeit nontrivial problem, which has\\nnot been considered before from an algorithmic perspective.\\n  We show that commutativity is decidable for all classes of series that\\nconstitute a so-called effective prevariety, a notion generalising Reutenauer's\\nvarieties of formal series. For example, the class of rational series,\\nintroduced by Sch\\\\\\\"utzenberger in the 1960's, is well-known to be an effective\\n(pre)variety, and thus commutativity is decidable for it.\\n  In order to showcase the applicability of our result, we consider classes of\\nformal series generalising the rational ones. We consider polynomial automata,\\nshuffle automata, and infiltration automata, and we show that each of these\\nmodels recognises an effective prevariety of formal series. Consequently, their\\ncommutativity problem is decidable, which is a novel result. We find it\\nremarkable that commutativity can be decided in a uniform way for such\\ndisparate computation models.\\n  Finally, we present applications of commutativity outside the theory of\\nformal series. We show that we can decide solvability in sequences and in power\\nseries for restricted classes of algebraic difference and differential\\nequations, for which such problems are undecidable in full generality. Thanks\\nto this, we can prove that the syntaxes of multivariate polynomial recursive\\nsequences and of constructible differentially algebraic power series are\\neffective, which are new results which were left open in previous work.\", \"main_category\": \"cs.FL\", \"categories\": \"cs.FL,cs.DM,cs.LO\", \"published\": \"2025-03-27T17:01:19Z\"}"}
