{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06597v1\", \"title\": \"Dynamics of two Interacting Drops in a Microfluidic Confinement under\\n  imposed Temperature Gradient\", \"summary\": \"Thermocapillary motion is widespread in both natural and engineering\\napplications. A tiny drop of one liquid, suspended within another, may be set\\ninto motion aligned with an imposed thermal gradient, as influenced by\\nthermocapillary action stemming from the gradients in interfacial tension due\\nto the local variations in temperature. In real-world situations, however, such\\ndrops do not remain in isolation, as they interact with their neighboring\\nentities, including other drops in proximity as well as a nearby solid\\nboundary, setting up a complex interplay between the confinement-mediated\\ninteractions and the three-dimensional nature of the droplet dynamics. In this\\nstudy, we present numerical solutions for the migration dynamics of a tightly\\nconfined drop couple, incorporating deformable interfaces, film flow, and\\nMarangoni effects in the presence of dynamically evolving thermocapillary\\nstresses induced by an imposed uniform temperature gradient. Unlike prior\\ninvestigations, our work highlights the influence of the confinement towards\\norchestrating non-trivial features of drop migration, as dictated by an\\nintricate coupling of the thermal and flow fields amidst the interferences of\\nthe domain boundaries. The study reveals that hydrodynamic interactions\\nresulting from a juxtaposition of these influences deform the drops in a unique\\nmanner as compared to the characteristics evidenced by previously reported\\nstudies, causing a distortion of the local thermal fields around them. This, in\\nturn, leads to changes in the local thermocapillary stress, affecting the local\\nshear gradient in a manner that alters the local flow field in accordance with\\nensuring the interfacial stress balance.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-09T05:48:53Z\"}"}
