{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24345v1\", \"title\": \"PathOrchestra: A Comprehensive Foundation Model for Computational\\n  Pathology with Over 100 Diverse Clinical-Grade Tasks\", \"summary\": \"The complexity and variability inherent in high-resolution pathological\\nimages present significant challenges in computational pathology. While\\npathology foundation models leveraging AI have catalyzed transformative\\nadvancements, their development demands large-scale datasets, considerable\\nstorage capacity, and substantial computational resources. Furthermore,\\nensuring their clinical applicability and generalizability requires rigorous\\nvalidation across a broad spectrum of clinical tasks. Here, we present\\nPathOrchestra, a versatile pathology foundation model trained via\\nself-supervised learning on a dataset comprising 300K pathological slides from\\n20 tissue and organ types across multiple centers. The model was rigorously\\nevaluated on 112 clinical tasks using a combination of 61 private and 51 public\\ndatasets. These tasks encompass digital slide preprocessing, pan-cancer\\nclassification, lesion identification, multi-cancer subtype classification,\\nbiomarker assessment, gene expression prediction, and the generation of\\nstructured reports. PathOrchestra demonstrated exceptional performance across\\n27,755 WSIs and 9,415,729 ROIs, achieving over 0.950 accuracy in 47 tasks,\\nincluding pan-cancer classification across various organs, lymphoma subtype\\ndiagnosis, and bladder cancer screening. Notably, it is the first model to\\ngenerate structured reports for high-incidence colorectal cancer and\\ndiagnostically complex lymphoma-areas that are infrequently addressed by\\nfoundational models but hold immense clinical potential. Overall, PathOrchestra\\nexemplifies the feasibility and efficacy of a large-scale, self-supervised\\npathology foundation model, validated across a broad range of clinical-grade\\ntasks. Its high accuracy and reduced reliance on extensive data annotation\\nunderline its potential for clinical integration, offering a pathway toward\\nmore efficient and high-quality medical services.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-03-31T17:28:02Z\"}"}
