{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01638v1\", \"title\": \"Convex Computations for Controlled Safety Invariant Sets of Black-box\\n  Discrete-time Dynamical Systems\", \"summary\": \"Identifying controlled safety invariant sets (CSISs) is essential in\\nsafety-critical applications. This paper tackles the problem of identifying\\nCSISs for black-box discrete-time systems, where the model is unknown and only\\nlimited simulation data is accessible. Traditionally, a CSIS is defined as a\\nsubset of a safe set, encompassing initial states for which a control input\\nexists that keeps the system within the set at the next time step-this is\\nreferred to as the one-step invariance property. However, the requirement for\\none-step invariance can be equivalently translated into a stricter condition of\\n``always-invariance'', meaning that there exist control inputs capable of\\nkeeping the system within this set indefinitely. Such a condition may prove\\noverly stringent or impractical for black-box systems, where predictions can\\nbecome unreliable beyond a single time step or a limited number of finite time\\nsteps. To overcome the challenges posed by black-box systems, we reformulate\\nthe one-step invariance property in a ``Probably Approximately Correct'' (PAC)\\nsense. This approach allows us to assess the probability that a control input\\nexists to keep the system within the CSIS at the next time step, with a\\npredefined level of confidence. If the system successfully remains within the\\nset at the next time step, we can then reapply the invariance evaluation to the\\nnew state, thereby facilitating a recursive assurance of invariance. Our method\\nemploys barrier functions and scenario optimization, resulting in a linear\\nprogramming method to estimate PAC CSISs. Finally, the effectiveness of our\\napproach is demonstrated on several examples.\", \"main_category\": \"eess.SY\", \"categories\": \"eess.SY,cs.SY\", \"published\": \"2025-04-02T11:43:03Z\"}"}
