{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07528v1\", \"title\": \"Deep Learning Based Service Composition in Integrated Aerial-Terrestrial\\n  Networks\", \"summary\": \"The explosive growth of user devices and emerging applications is driving\\nunprecedented traffic demands, accompanied by stringent Quality of Service\\n(QoS) requirements. Addressing these challenges necessitates innovative service\\norchestration methods capable of seamless integration across the edge-cloud\\ncontinuum. Terrestrial network-based service orchestration methods struggle to\\ndeliver timely responses to growing traffic demands or support users with poor\\nor lack of access to terrestrial infrastructure. Exploiting both aerial and\\nterrestrial resources in service composition increases coverage and facilitates\\nthe use of full computing and communication potentials. This paper proposes a\\nservice placement and composition mechanism for integrated aerial-terrestrial\\nnetworks over the edge-cloud continuum while considering the dynamic nature of\\nthe network. The service function placement and service orchestration are\\nmodeled in an optimization framework. Considering the dynamicity, the Aerial\\nBase Station (ABS) trajectory might not be deterministic, and their mobility\\npattern might not be known as assumed knowledge. Also, service requests can\\ntraverse through access nodes due to users' mobility. By incorporating\\npredictive algorithms, including Deep Reinforcement Learning (DRL) approaches,\\nthe proposed method predicts ABS locations and service requests. Subsequently,\\na heuristic isomorphic graph matching approach is proposed to enable efficient,\\nlatency-aware service orchestration. Simulation results demonstrate the\\nefficiency of the proposed prediction and service composition schemes in terms\\nof accuracy, cost optimization, scalability, and responsiveness, ensuring\\ntimely and reliable service delivery under diverse network conditions.\", \"main_category\": \"cs.NI\", \"categories\": \"cs.NI\", \"published\": \"2025-04-10T07:52:00Z\"}"}
