{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24209v1\", \"title\": \"Optimal low-rank approximations for linear Gaussian inverse problems on\\n  Hilbert spaces, Part II: posterior mean approximation\", \"summary\": \"In this work, we construct optimal low-rank approximations for the Gaussian\\nposterior distribution in linear Gaussian inverse problems. The parameter space\\nis a separable Hilbert space of possibly infinite dimension, and the data space\\nis assumed to be finite-dimensional. We consider various types of approximation\\nfamilies for the posterior. We first consider approximate posteriors in which\\nthe means vary among a class of either structure-preserving or\\nstructure-ignoring low-rank transformations of the data, and in which the\\nposterior covariance is kept fixed. We give necessary and sufficient conditions\\nfor these approximating posteriors to be equivalent to the exact posterior, for\\nall possible realisations of the data simultaneously. For such approximations,\\nwe measure approximation error with the Kullback-Leibler, R\\\\'enyi and Amari\\n$\\\\alpha$-divergences for $\\\\alpha\\\\in(0,1)$, and with the Hellinger distance, all\\naveraged over the data distribution. With these losses, we find the optimal\\napproximations and formulate an equivalent condition for their uniqueness,\\nextending the work in finite dimensions of Spantini et al. (SIAM J. Sci.\\nComput. 2015). We then consider joint approximation of the mean and covariance,\\nby also varying the posterior covariance over the low-rank updates considered\\nin Part I of this work. For the reverse Kullback-Leibler divergence, we show\\nthat the separate optimal approximations of the mean and of the covariance can\\nbe combined to yield an optimal joint approximation of the mean and covariance.\\nIn addition, we interpret the joint approximation with the optimal\\nstructure-ignoring approximate mean in terms of an optimal projector in\\nparameter space.\", \"main_category\": \"math.ST\", \"categories\": \"math.ST,math.PR,stat.TH\", \"published\": \"2025-03-31T15:26:48Z\"}"}
