{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07606v1\", \"title\": \"Heart Failure Prediction using Modal Decomposition and Masked\\n  Autoencoders for Scarce Echocardiography Databases\", \"summary\": \"Heart diseases constitute the main cause of international human defunction.\\nAccording to the World Health Organization (WHO), approximately 18 million\\ndeaths happen each year due to precisely heart diseases. In particular, heart\\nfailures (HF) press the healthcare industry to develop systems for their early,\\nrapid and effective prediction. In this work, an automatic system which\\nanalyses in real-time echocardiography video sequences is proposed for the\\nchallenging and more specific task of prediction of heart failure times. This\\nsystem is based on a novel deep learning framework, and works in two stages.\\nThe first one transforms the data included in a database of echocardiography\\nvideo sequences into a machine learning-compatible collection of annotated\\nimages which can be used in the training phase of any kind of machine\\nlearning-based framework, including a deep learning one. This initial stage\\nincludes the use of the Higher Order Dynamic Mode Decomposition (HODMD)\\nalgorithm for both data augmentation and feature extraction. The second stage\\nis focused on building and training a Vision Transformer (ViT). Self-supervised\\nlearning (SSL) methods, which have been so far barely explored in the\\nliterature about heart failure prediction, are applied to effectively train the\\nViT from scratch, even with scarce databases of echocardiograms. The designed\\nneural network analyses images from echocardiography sequences to estimate the\\ntime in which a heart failure will happen. The results obtained show the\\nefficacy of the HODMD algorithm and the superiority of the proposed system with\\nrespect to several established ViT and Convolutional Neural Network (CNN)\\narchitectures.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.CV\", \"published\": \"2025-04-10T09:57:09Z\"}"}
