{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07522v1\", \"title\": \"Adversarial Subspace Generation for Outlier Detection in\\n  High-Dimensional Data\", \"summary\": \"Outlier detection in high-dimensional tabular data is challenging since data\\nis often distributed across multiple lower-dimensional subspaces -- a\\nphenomenon known as the Multiple Views effect (MV). This effect led to a large\\nbody of research focused on mining such subspaces, known as subspace selection.\\nHowever, as the precise nature of the MV effect was not well understood,\\ntraditional methods had to rely on heuristic-driven search schemes that\\nstruggle to accurately capture the true structure of the data. Properly\\nidentifying these subspaces is critical for unsupervised tasks such as outlier\\ndetection or clustering, where misrepresenting the underlying data structure\\ncan hinder the performance. We introduce Myopic Subspace Theory (MST), a new\\ntheoretical framework that mathematically formulates the Multiple Views effect\\nand writes subspace selection as a stochastic optimization problem. Based on\\nMST, we introduce V-GAN, a generative method trained to solve such an\\noptimization problem. This approach avoids any exhaustive search over the\\nfeature space while ensuring that the intrinsic data structure is preserved.\\nExperiments on 42 real-world datasets show that using V-GAN subspaces to build\\nensemble methods leads to a significant increase in one-class classification\\nperformance -- compared to existing subspace selection, feature selection, and\\nembedding methods. Further experiments on synthetic data show that V-GAN\\nidentifies subspaces more accurately while scaling better than other relevant\\nsubspace selection methods. These results confirm the theoretical guarantees of\\nour approach and also highlight its practical viability in high-dimensional\\nsettings.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI,math.ST,stat.TH\", \"published\": \"2025-04-10T07:40:02Z\"}"}
