{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05990v1\", \"title\": \"AI analysis of medical images at scale as a health disparities probe: a\\n  feasibility demonstration using chest radiographs\", \"summary\": \"Health disparities (differences in non-genetic conditions that influence\\nhealth) can be associated with differences in burden of disease by groups\\nwithin a population. Social determinants of health (SDOH) are domains such as\\nhealth care access, dietary access, and economics frequently studied for\\npotential association with health disparities. Evaluating SDOH-related\\nphenotypes using routine medical images as data sources may enhance health\\ndisparities research. We developed a pipeline for using quantitative measures\\nautomatically extracted from medical images as inputs into health disparities\\nindex calculations. Our study focused on the use case of two SDOH demographic\\ncorrelates (sex and race) and data extracted from chest radiographs of 1,571\\nunique patients. The likelihood of severe disease within the lung parenchyma\\nfrom each image type, measured using an established deep learning model, was\\nmerged into a single numerical image-based phenotype for each patient. Patients\\nwere then separated into phenogroups by unsupervised clustering of the\\nimage-based phenotypes. The health rate for each phenogroup was defined as the\\nmedian image-based phenotype for each SDOH used as inputs to four\\nimaging-derived health disparities indices (iHDIs): one absolute measure\\n(between-group variance) and three relative measures (index of disparity, Theil\\nindex, and mean log deviation). The iHDI measures demonstrated feasible values\\nfor each SDOH demographic correlate, showing potential for medical images to\\nserve as a novel probe for health disparities. Large-scale AI analysis of\\nmedical images can serve as a probe for a novel data source for health\\ndisparities research.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph,cs.CV\", \"published\": \"2025-04-08T12:53:14Z\"}"}
