{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04806v1\", \"title\": \"Interplay Between Structural Defects and Charge Transport Dynamics in MA\\n  and FA Modified CsSnI3 Thin Film Semiconductors\", \"summary\": \"Owing high conductivity in microcrystalline thin-films, CsSnI3 perovskite is\\na promising semiconductor for thermoelectrics and optoelectronics. Rapid\\noxidation of thin-film and intrinsic lattice strain hinders stabilization of\\nthe device performance. Cation engineering of perovskite molecule was\\nconsidered as an effective strategy to tailor the structural properties and\\nsuppress the degradation processes. However, molecular engineering demands a\\nthorough analysis of defect behavior, as it can influence ionic motion,\\nrecombination dynamics, and capacitive effects. The effective implementation of\\nCsSnI3 in energy conversion devices requires careful consideration of the\\nspecific properties of thin films electrical conductivity, Seebeck coefficient,\\npower factor, as well as electronic transients, and charge transport in the\\ndevice structures. In this work, we performed a complex investigation for\\nmodified CsSnI3 through cation substitution with methyl ammonium (MA) and\\nformamidinium (FA). Our findings highlight a complex interplay between\\nelectrical parameters of the bare thin films and stability of the devices\\n(p-i-n diodes) after thermal stress. FA-CsSnI3 showed beneficial results for\\nstabilization under elevated temperatures with improved non-ideality factor in\\ndiode structures, enhanced shunt properties and reduced trapping. The\\nphoto-induced voltage relaxation spectroscopy performed for MA-CsSnI3 showed\\nrelevant traps concentration of 1016 cm-3 with activation energy of 0.52\\neV(210K) likely attributed to Sn atom defect. The obtained results are deeply\\nanalyzed and discussed.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,physics.app-ph\", \"published\": \"2025-04-07T08:02:17Z\"}"}
