{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23849v1\", \"title\": \"Narrow-Line Seyfert 1 Galaxies Beyond the Local X-ray Universe: An X-ray\\n  spectral sample\", \"summary\": \"Narrow-line Seyfert 1 AGNs (NLS1s) represent a unique stage in the black hole\\ngrowth history, characterised by low black hole masses of approximately\\n$10^{6}$-$10^{8}$ solar masses and around-Eddington accretion rates. X-ray\\nstudies of NLS1s have largely been confined to the local Universe ($z < 0.2$),\\nwhile their broad-line counterparts and radio-loud quasars have been more\\nextensively investigated at higher redshifts. In this work, we conducted an\\nX-ray spectral analysis for 14 SDSS-observed NLS1s at $z\\\\approx1$ in the eRASS1\\ncatalogue. We found that all of their eROSITA observations agree with the\\nexpected rest-frame 2 keV monochromatic luminosity given their rest-frame 2500\\nangstrom monochromatic luminosity, further supporting evidence of AGN emission.\\nSecond, when fitted with a power-law model, most continuum spectra between\\n0.7-7 keV in their rest frames necessitate photon indices $\\\\Gamma\\\\gtrsim2.5$.\\nNotably, the highest photon index of around 4.7 in one of our NLS1 AGNs hints\\nat a significant contribution from soft excess emission. Finally, our analysis\\ndemonstrates that we can align the Eddington ratios with optical measurements\\nby applying a correction factor between 10-120 to their X-ray luminosity.\\nAlthough measurement uncertainty remains considerable, our findings suggest\\nthat assumptions for the standard geometrically thin accretion disc model made\\nin previous estimations of this correction factor may not apply to near or\\nsuper-Eddington NLS1 AGNs. Finally, we also compare this sample with extremely\\nvariable nearby NLS1s and other X-ray-weak AGNs, such as JWST-observed,\\nbroad-line AGNs at $z=5-6$, and underscores the importance of deeper X-ray\\nsurveys for more X-ray-weak NLS1s.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-03-31T08:55:07Z\"}"}
