{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07090v1\", \"title\": \"A Differentiable, End-to-End Forward Model for 21 cm Cosmology:\\n  Estimating the Foreground, Instrument, and Signal Joint Posterior\", \"summary\": \"We present a differentiable, end-to-end Bayesian forward modeling framework\\nfor line intensity mapping cosmology experiments, with a specific focus on\\nlow-frequency radio telescopes targeting the redshifted 21 cm line from neutral\\nhydrogen as a cosmological probe. Our framework is capable of posterior density\\nestimation of the cosmological signal jointly with foreground and telescope\\nparameters at the field level. Our key aim is to be able to optimize the\\nmodel's high-dimensional, non-linear, and ill-conditioned parameter space,\\nwhile also sampling from it to perform robust uncertainty quantification within\\na Bayesian framework. We show how a differentiable programming paradigm,\\naccelerated by recent advances in machine learning software and hardware, can\\nmake this computationally-demanding, end-to-end Bayesian approach feasible. We\\ndemonstrate a proof-of-concept on a simplified signal recovery problem for the\\nHydrogen Epoch of Reionization Array experiment, highlighting the framework's\\nability to build confidence in early 21 cm signal detections even in the\\npresence of poorly understood foregrounds and instrumental systematics. We use\\na Hessian-preconditioned Hamiltonian Monte Carlo algorithm to efficiently\\nsample our parameter space with a dimensionality approaching $N\\\\sim10^5$, which\\nenables joint, end-to-end nuisance parameter marginalization over foreground\\nand instrumental terms. Lastly, we introduce a new spherical harmonic formalism\\nthat is a complete and orthogonal basis on the cut sky relevant to drift-scan\\nradio surveys, which we call the spherical stripe harmonic formalism, and it's\\nassociated three-dimensional basis, the spherical stripe Fourier-Bessel\\nformalism.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,astro-ph.IM\", \"published\": \"2025-04-09T17:59:03Z\"}"}
