{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24059v1\", \"title\": \"Robust Magnetic Polaron Percolation in the Antiferromagnetic CMR System\\n  EuCd$_2$P$_2$\", \"summary\": \"Antiferromagnetic EuCd$_2$P$_2$ has attracted considerable attention due to\\nits unconventional (magneto)transport properties. At a temperature $T_{\\\\rm\\npeak}$ significantly above the magnetic ordering temperature $T_\\\\textrm{N} =\\n11\\\\,$K a large peak in resistivity is observed which gets strongly suppressed\\nin magnetic field, resulting in a colossal magnetoresistance (CMR), for which\\nmagnetic fluctuations and the formation of ferromagnetic clusters have been\\nproposed as underlying mechanisms. Employing a selection of sensitive probes\\nincluding fluctuation spectroscopy and third-harmonic resistance, Hall effect,\\nAC susceptibility and $\\\\mu$SR measurements, allows for a direct comparison of\\nelectronic and magnetic properties on multiple time scales. We find compelling\\nevidence for the formation and percolation of magnetic polarons, which explains\\nthe CMR of the system. Large peaks in the weakly-nonlinear transport and the\\nresistance noise power spectral density at zero magnetic field signify an\\ninhomogeneous, percolating electronic system below $T^\\\\ast \\\\approx\\n2\\\\,T_\\\\textrm{N}$ with a percolation threshold at $T_{\\\\rm peak}$. In magnetic\\nfields, the onset of large negative MR in the paramagnetic regime occurs at a\\nuniversal critical magnetization similar to ferromagnetic CMR materials. The\\nsize of the magnetic polarons at the percolation threshold is estimated to\\n$\\\\sim 1 - 2\\\\,$nm. The mechanism of magntic cluster formation and percolation in\\nEuCd$_2$P$_2$ appears to be rather robust despite large variations in carrier\\nconcentration and likely is relevant for other Eu-based antiferromagnetic CMR\\nsystems.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el\", \"published\": \"2025-03-31T13:21:07Z\"}"}
