{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06826v1\", \"title\": \"Long-period double-lined eclipsing binaries: the system V454 Aur with\\n  the secondary eclipse caused by the occultation of the hotter component\", \"summary\": \"We present the results of our study of the long-period eclipsing binary star\\n\\\\Aur. The results are based on spectroscopic data obtained with the UFES\\n\\\\'echelle spectrograph and photometric observations from TESS. The derived\\nradial velocity curve is based on 17 spectra obtained between 2021 and 2023,\\ncovering all orbital phases of this binary system. The orbital period\\ndetermined from TESS data, $P = 27.019803 \\\\pm 0.000003$ days, agrees within\\nuncertainties with the period established in previous studies. The model\\nconstructed for the TESS photometric light curve achieves a precision of\\n0.01\\\\%. The effective temperatures of both components, as well as the system\\nmetallicity, were directly derived from the spectra and are $T_\\\\mathrm{eff, A}\\n= 6250 \\\\pm 50$\\\\,K, $T_\\\\mathrm{eff, B} = 5855 \\\\pm 50$\\\\,K, and $\\\\mathrm{[Fe/H]} =\\n-0.10 \\\\pm 0.08$, respectively. Our analysis of the photometric and\\nspectroscopic data allowed us to directly compute the luminosities of the\\ncomponents, $L_A = 1.82\\\\,L_\\\\odot$ and $L_B = 1.07\\\\,L_\\\\odot$, their radii, $R_A\\n= 1.15\\\\,R_\\\\odot$ and $R_B = 1.00\\\\,R_\\\\odot$, and their masses, $M_A =\\n1.137\\\\,M_\\\\odot$ and $M_B = 1.023\\\\,M_\\\\odot$, with uncertainties below 1\\\\%.\\nComparison with evolutionary tracks indicates that the system's age is $1.18\\n\\\\pm 0.10$\\\\,Gyr, and both components are still on the main sequence. The \\\\Aur\\\\\\nsystem is particularly interesting due to the partial eclipse of the primary\\ncomponent, which results in the ``inversion'' of the primary and secondary\\nminima in the photometric light curve.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-09T12:34:35Z\"}"}
