{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02216v1\", \"title\": \"Image Coding for Machines via Feature-Preserving Rate-Distortion\\n  Optimization\", \"summary\": \"Many images and videos are primarily processed by computer vision algorithms,\\ninvolving only occasional human inspection. When this content requires\\ncompression before processing, e.g., in distributed applications, coding\\nmethods must optimize for both visual quality and downstream task performance.\\nWe first show that, given the features obtained from the original and the\\ndecoded images, an approach to reduce the effect of compression on a task loss\\nis to perform rate-distortion optimization (RDO) using the distance between\\nfeatures as a distortion metric. However, optimizing directly such a\\nrate-distortion trade-off requires an iterative workflow of encoding, decoding,\\nand feature evaluation for each coding parameter, which is computationally\\nimpractical. We address this problem by simplifying the RDO formulation to make\\nthe distortion term computable using block-based encoders. We first apply\\nTaylor's expansion to the feature extractor, recasting the feature distance as\\na quadratic metric with the Jacobian matrix of the neural network. Then, we\\nreplace the linearized metric with a block-wise approximation, which we call\\ninput-dependent squared error (IDSE). To reduce computational complexity, we\\napproximate IDSE using Jacobian sketches. The resulting loss can be evaluated\\nblock-wise in the transform domain and combined with the sum of squared errors\\n(SSE) to address both visual quality and computer vision performance.\\nSimulations with AVC across multiple feature extractors and downstream neural\\nnetworks show up to 10% bit-rate savings for the same computer vision accuracy\\ncompared to RDO based on SSE, with no decoder complexity overhead and just a 7%\\nencoder complexity increase.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.CV\", \"published\": \"2025-04-03T02:11:26Z\"}"}
