{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21739v1\", \"title\": \"Emergent Non-Markovian Gain in Open Quantum Systems\", \"summary\": \"Non-Markovian dynamics go beyond the Markovian approximation by capturing\\nmemory effects and information backflow in open quantum systems, which are\\ncrucial for describing realistic physical processes. In this work, we study the\\nexact non-Markovian dynamics of a driven cavity coupled to an anisotropic\\nthree-dimensional photonic-crystal environment via counterrotating-wave\\ninteractions. We derive an exact analytical expression for the cavity amplitude\\nsatisfying the integro-differential equation, which includes the contributions\\nof the bound states outside the continuum and the dissipative parts with the\\ncontinuum spectrum. Based on the characteristic function method, we derive the\\nexact non-Markovian master equation for the cavity, which contributes to the\\ngain of the cavity. We give the physical origin of non-Markovian gain in the\\npresence of bound states in the system consisting of cavity and environment,\\nwhich has no Markovian counterparts due to the nonexponential gain in the\\nnon-Markovian structured environment. We find that three different types of\\nbound states can be formed in the system, containing one bound state with no\\ninversion of photon number, two bound states with the periodic equal-amplitude\\noscillation, and the gain with two complex roots without the bound states\\nformation. We derive a current equation including the source from the driving\\nfield, the transient current induced by the change in the number of photons,\\nand the two-photon current caused by the counterrotating-wave term. The results\\nare compared with those given by the rotating-wave interactions and extended to\\na more general quantum network involving an arbitrary number of coupled\\ncavities. Our findings may pave the way for a deeper understanding of\\nnon-Markovian dynamics with gain in quantum networks involving\\ncounterrotating-wave effects.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics\", \"published\": \"2025-03-27T17:50:46Z\"}"}
