{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06035v1\", \"title\": \"Cosmic inflation in non-perturbative quantum gravity\", \"summary\": \"String field theory motivated infinite-derivative models lead to non-local\\ngravity modifications which form a promising class of quantum gravity\\ncandidates. In this paper we investigate effects of non-locality on the\\nthree-point function (the bi-spectrum) during cosmic inflation. The study is\\ndone in an Einstein frame with an infinite-derivative scalar field Lagrangian\\nminimally coupled to the Einstein-Hilbert term. A non-local generalization of\\nthe Mukhanov-Sasaki equation is derived. Infinite-derivative operators present\\nin this equation lead to an appearance of infinitely many new background\\ninduced states in the perturbation spectrum during inflation with complex\\nmasses on top of a usual nearly massless inflaton. On contrary to a flat\\nbackground such states can be classically stable in a de Sitter space-time.\\nThis helps preserving observational constraints on the scalar power-spectrum.\\nWe proceed by studying a particular configuration assuming that the generalized\\nMukhanov-Sasaki equation gives rise to an inflaton and one pair of new states\\nwith complex conjugate masses as perturbative degrees of freedom. The\\ncorresponding scalar bi-spectrum is computed numerically in squeezed and\\nequilateral limits. We use the latest observational constraints on amplitude of\\nthe bi-spectrum $f_{NL}$ from Planck 2018 dataset as a guideline for possible\\nvalues of masses of new emerging states. We find that $f_{NL}$ is non-trivially\\nsensitive to the values of complex masses and this can reduce the parameter\\nspace of gravity modifications. In particular we find that the amplitude of the\\nsqueezed limit gets easily enhanced while of the equilateral limit can stay\\nlike in a local single-field model of inflation. We end up discussing open\\nquestions relevant for this class of models of inflation.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc,astro-ph.CO,hep-th\", \"published\": \"2025-04-08T13:36:28Z\"}"}
