{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23810v1\", \"title\": \"Adaptive Attention-Based Model for 5G Radio-based Outdoor Localization\", \"summary\": \"Radio-based localization in dynamic environments, such as urban and vehicular\\nsettings, requires systems that can efficiently adapt to varying signal\\nconditions and environmental changes. Factors such as multipath interference\\nand obstructions introduce different levels of complexity that affect the\\naccuracy of the localization. Although generalized models offer broad\\napplicability, they often struggle to capture the nuances of specific\\nenvironments, leading to suboptimal performance in real-world deployments. In\\ncontrast, specialized models can be tailored to particular conditions, enabling\\nmore precise localization by effectively handling domain-specific variations\\nand noise patterns. However, deploying multiple specialized models requires an\\nefficient mechanism to select the most appropriate one for a given scenario. In\\nthis work, we develop an adaptive localization framework that combines shallow\\nattention-based models with a router/switching mechanism based on a\\nsingle-layer perceptron (SLP). This enables seamless transitions between\\nspecialized localization models optimized for different conditions, balancing\\naccuracy, computational efficiency, and robustness to environmental variations.\\nWe design three low-complex localization models tailored for distinct\\nscenarios, optimized for reduced computational complexity, test time, and model\\nsize. The router dynamically selects the most suitable model based on real-time\\ninput characteristics. The proposed framework is validated using real-world\\nvehicle localization data collected from a massive MIMO base station (BS),\\ndemonstrating its ability to seamlessly adapt to diverse deployment conditions\\nwhile maintaining high localization accuracy.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP,cs.LG\", \"published\": \"2025-03-31T07:44:14Z\"}"}
