{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05197v1\", \"title\": \"P2Mark: Plug-and-play Parameter-intrinsic Watermarking for Neural Speech\\n  Generation\", \"summary\": \"Recently, a large number of advanced neural speech generation methods have\\nemerged in the open-source community. Although this has facilitated the\\napplication and development of technology, it has also increased the difficulty\\nof preventing the abuse of generated speech and protecting copyrights. Audio\\nwatermarking technology is an effective method for proactively protecting\\ngenerated speech, but when the source codes and model weights of the neural\\nspeech generation methods are open-sourced, audio watermarks based on previous\\nwatermarking methods can be easily removed or manipulated. This paper proposes\\na Plug-and-play Parameter-intrinsic WaterMarking (P2Mark) method for neural\\nspeech generation system protection. The main advantage of P2Mark is that the\\nwatermark information is flexibly integrated into the neural speech generation\\nmodel in the form of parameters by training a watermark adapter rather than\\ninjecting the watermark into the model in the form of features. After the\\nwatermark adapter with the watermark embedding is merged with the pre-trained\\ngeneration model, the watermark information cannot be easily removed or\\nmanipulated. Therefore, P2Mark will be a reliable choice for proactively\\ntracing and protecting the copyrights of neural speech generation models in\\nopen-source white-box scenarios. We validated P2Mark on two main types of\\ndecoders in neural speech generation: vocoder and codec. Experimental results\\nshow that P2Mark achieves performance comparable to state-of-the-art audio\\nwatermarking methods that cannot be used for open-source white-box protection\\nscenarios in terms of watermark extraction accuracy, watermark\\nimperceptibility, and robustness.\", \"main_category\": \"cs.SD\", \"categories\": \"cs.SD\", \"published\": \"2025-04-07T15:47:09Z\"}"}
