{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05222v1\", \"title\": \"Security Risks in Vision-Based Beam Prediction: From Spatial Proxy\\n  Attacks to Feature Refinement\", \"summary\": \"The rapid evolution towards the sixth-generation (6G) networks demands\\nadvanced beamforming techniques to address challenges in dynamic, high-mobility\\nscenarios, such as vehicular communications. Vision-based beam prediction\\nutilizing RGB camera images emerges as a promising solution for accurate and\\nresponsive beam selection. However, reliance on visual data introduces unique\\nvulnerabilities, particularly susceptibility to adversarial attacks, thus\\npotentially compromising beam accuracy and overall network reliability. In this\\npaper, we conduct the first systematic exploration of adversarial threats\\nspecifically targeting vision-based mmWave beam selection systems. Traditional\\nwhite-box attacks are impractical in this context because ground-truth beam\\nindices are inaccessible and spatial dynamics are complex. To address this, we\\npropose a novel black-box adversarial attack strategy, termed Spatial Proxy\\nAttack (SPA), which leverages spatial correlations between user positions and\\nbeam indices to craft effective perturbations without requiring access to model\\nparameters or labels. To counteract these adversarial vulnerabilities, we\\nformulate an optimization framework aimed at simultaneously enhancing beam\\nselection accuracy under clean conditions and robustness against adversarial\\nperturbations. We introduce a hybrid deep learning architecture integrated with\\na dedicated Feature Refinement Module (FRM), designed to systematically filter\\nirrelevant, noisy and adversarially perturbed visual features. Evaluations\\nusing standard backbone models such as ResNet-50 and MobileNetV2 demonstrate\\nthat our proposed method significantly improves performance, achieving up to an\\n+21.07\\\\% gain in Top-K accuracy under clean conditions and a 41.31\\\\% increase\\nin Top-1 adversarial robustness compared to different baseline models.\", \"main_category\": \"cs.NI\", \"categories\": \"cs.NI\", \"published\": \"2025-04-07T16:08:32Z\"}"}
