{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23889v1\", \"title\": \"Robust Predictive Routing for Internet of Vehicles Leveraging Both V2I\\n  and V2V Links\", \"summary\": \"With the developments of the Internet of Vehicles (IoV) from 4G to 5G,\\nvehicle-to-infrastructure (V2I) communications are becoming attractive for\\nvehicle users (VUEs) to obtain diverse cloud service through base stations\\n(BSs). To tackle V2I link deterioration caused by blockage and out-of-coverage\\ncases, multi-hop V2X routing with both vehicle-to-vehicle (V2V) and V2I links\\nneeds to be investigated. However, traditional routing reacts to statistical or\\nreal-time information, which may suffer link degradation during path switchover\\nin fast-changing vehicular networks. Predictive routing protocols take timely\\nactions by forecasting link connectivity, but they fail to satisfy specific QoS\\nrequirements. Low robustness to link failures is also incurred without\\nconsidering imperfect prediction. To build continual paths between VUEs and BSs\\nfor QoS provision of cloud service, a robust predictive routing framework\\n(ROPE) is proposed with three major components: 1) an early warning scheme\\ndetects V2I link deterioration in advance via predicting vehicle mobility and\\nlink signal strength to facilitate seamless path switchover; 2) a virtual\\nrouting mechanism finds top3 paths that have the highest path strength and\\nsatisfy the connectivity and hop count constraints based on the prediction\\nresults to fulfill QoS requirements of cloud service; 3) a path verification\\nprotocol checks availability and quality of the top3 paths shortly before\\nswitchover and activates one qualified path for switchover to ensure routing\\nrobustness. We implement ROPE in a simulation framework incorporating\\nreal-world urban maps, microscopic traffic generation, geometry-based channel\\nmodeling, and offline data analysis as well as online inference. Extensive\\nsimulations demonstrate the superiority of ROPE over direct V2I communications\\nand a connectivity-based predictive routing protocol under various scenarios.\", \"main_category\": \"cs.NI\", \"categories\": \"cs.NI\", \"published\": \"2025-03-31T09:41:16Z\"}"}
