{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23736v1\", \"title\": \"Every Painting Awakened: A Training-free Framework for\\n  Painting-to-Animation Generation\", \"summary\": \"We introduce a training-free framework specifically designed to bring\\nreal-world static paintings to life through image-to-video (I2V) synthesis,\\naddressing the persistent challenge of aligning these motions with textual\\nguidance while preserving fidelity to the original artworks. Existing I2V\\nmethods, primarily trained on natural video datasets, often struggle to\\ngenerate dynamic outputs from static paintings. It remains challenging to\\ngenerate motion while maintaining visual consistency with real-world paintings.\\nThis results in two distinct failure modes: either static outputs due to\\nlimited text-based motion interpretation or distorted dynamics caused by\\ninadequate alignment with real-world artistic styles. We leverage the advanced\\ntext-image alignment capabilities of pre-trained image models to guide the\\nanimation process. Our approach introduces synthetic proxy images through two\\nkey innovations: (1) Dual-path score distillation: We employ a dual-path\\narchitecture to distill motion priors from both real and synthetic data,\\npreserving static details from the original painting while learning dynamic\\ncharacteristics from synthetic frames. (2) Hybrid latent fusion: We integrate\\nhybrid features extracted from real paintings and synthetic proxy images via\\nspherical linear interpolation in the latent space, ensuring smooth transitions\\nand enhancing temporal consistency. Experimental evaluations confirm that our\\napproach significantly improves semantic alignment with text prompts while\\nfaithfully preserving the unique characteristics and integrity of the original\\npaintings. Crucially, by achieving enhanced dynamic effects without requiring\\nany model training or learnable parameters, our framework enables plug-and-play\\nintegration with existing I2V methods, making it an ideal solution for\\nanimating real-world paintings. More animated examples can be found on our\\nproject website.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.MM\", \"published\": \"2025-03-31T05:25:49Z\"}"}
