{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05673v1\", \"title\": \"VC-LLM: Automated Advertisement Video Creation from Raw Footage using\\n  Multi-modal LLMs\", \"summary\": \"As short videos have risen in popularity, the role of video content in\\nadvertising has become increasingly significant. Typically, advertisers record\\na large amount of raw footage about the product and then create numerous\\ndifferent short-form advertisement videos based on this raw footage. Creating\\nsuch videos mainly involves editing raw footage and writing advertisement\\nscripts, which requires a certain level of creative ability. It is usually\\nchallenging to create many different video contents for the same product, and\\nmanual efficiency is often low. In this paper, we present VC-LLM, a framework\\npowered by Large Language Models for the automatic creation of high-quality\\nshort-form advertisement videos. Our approach leverages high-resolution spatial\\ninput and low-resolution temporal input to represent video clips more\\neffectively, capturing both fine-grained visual details and broader temporal\\ndynamics. In addition, during training, we incorporate supplementary\\ninformation generated by rewriting the ground truth text, ensuring that all key\\noutput information can be directly traced back to the input, thereby reducing\\nmodel hallucinations. We also designed a benchmark to evaluate the quality of\\nthe created videos. Experiments show that VC-LLM based on GPT-4o can produce\\nvideos comparable to those created by humans. Furthermore, we collected\\nnumerous high-quality short advertisement videos to create a pre-training\\ndataset and manually cleaned a portion of the data to construct a high-quality\\nfine-tuning dataset. Experiments indicate that, on the benchmark, the VC-LLM\\nbased on fine-tuned LLM can produce videos with superior narrative logic\\ncompared to those created by the VC-LLM based on GPT-4o.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-08T04:35:23Z\"}"}
