{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06876v1\", \"title\": \"Anomalous transport models for fluid classification: insights from an\\n  experimentally driven approach\", \"summary\": \"In recent years, research and development in nanoscale science and technology\\nhave grown significantly, with electrical transport playing a key role. A\\nnatural challenge for its description is to shed light on anomalous behaviours\\nobserved in a variety of low-dimensional systems. We use a synergistic\\ncombination of experimental and mathematical modelling to explore the transport\\nproperties of the electrical discharge observed within a micro-gap based sensor\\nimmersed in fluids with different insulating properties. Data from laboratory\\nexperiments are collected and used to inform and calibrate four mathematical\\nmodels that comprise partial differential equations describing different kinds\\nof transport, including anomalous diffusion: the Gaussian Model with Time\\nDependent Diffusion Coefficient, the Porous Medium Equation, the\\nKardar-Parisi-Zhang Equation and the Telegrapher Equation. Performance analysis\\nof the models through data fitting reveals that the Gaussian Model with a\\nTime-Dependent Diffusion Coefficient most effectively describes the observed\\nphenomena. This model proves particularly valuable in characterizing the\\ntransport properties of electrical discharges when the micro-electrodes are\\nimmersed in a wide range of insulating as well as conductive fluids. Indeed, it\\ncan suitably reproduce a range of behaviours spanning from clogging to bursts,\\nallowing accurate and quite general fluid classification. Finally, we apply the\\ndata-driven mathematical modeling approach to ethanol-water mixtures. The\\nresults show the model's potential for accurate prediction, making it a\\npromising method for analyzing and classifying fluids with unknown insulating\\nproperties.\", \"main_category\": \"q-bio.PE\", \"categories\": \"q-bio.PE,physics.flu-dyn\", \"published\": \"2025-04-09T13:26:47Z\"}"}
