{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02636v1\", \"title\": \"A Framework for Developing University Policies on Generative AI\\n  Governance: A Cross-national Comparative Study\", \"summary\": \"As generative artificial intelligence (GAI) becomes more integrated into\\nhigher education and research, universities adopt varied approaches to GAI\\npolicy development. To explore these variations, this study conducts a\\ncomparative analysis of leading universities in the United States, Japan, and\\nChina, examining their institution-wide policies on GAI application and\\ngovernance. Based on these findings, the study proposes a University Policy\\nDevelopment Framework for GAI (UPDF-GAI) to provide both theoretical insights\\nand practical guidance for universities in developing and refining their GAI\\npolicies. A qualitative content analysis of 124 policy documents from 110\\nuniversities was conducted, employing thematic coding to synthesize 20 key\\nthemes and 9 sub-themes. These themes and sub-themes formed the basis for\\ndeveloping the framework. The analysis reveals varying priorities and focus of\\nGAI policy of universities in different countries. U.S. universities emphasize\\nfaculty autonomy, practical application, and policy adaptability, shaped by\\ncutting-edge research and peer collaboration. Japanese universities take a\\ngovernment-regulated approach, prioritizing ethics and risk management, but\\nprovide limited support for AI implementation and flexibility. Chinese\\nuniversities follow a centralized, government-led model, focusing on technology\\napplication over early policy development, while actively exploring GAI\\nintegration in education and research. The UPDF-GAI framework offers a\\nsystematic, adaptable framework for assessing and optimizing GAI policies\\nacross different educational contexts. By identifying key policy\\ncharacteristics, enhancing policy effectiveness, and balancing technology,\\nethics, and education, enabling universities to develop sustainable,\\ncontextually relevant policies that strengthen their digital competitiveness\\nand institutional readiness for AI-driven education.\", \"main_category\": \"cs.CY\", \"categories\": \"cs.CY\", \"published\": \"2025-04-03T14:33:35Z\"}"}
