{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05125v1\", \"title\": \"Interpretable Style Takagi-Sugeno-Kang Fuzzy Clustering\", \"summary\": \"Clustering is an efficient and essential technique for exploring latent\\nknowledge of data. However, limited attention has been given to the\\ninterpretability of the clusters detected by most clustering algorithms. In\\naddition, due to the homogeneity of data, different groups of data have their\\nown homogeneous styles. In this paper, the above two aspects are considered,\\nand an interpretable style Takagi-Sugeno-Kang (TSK) fuzzy clustering\\n(IS-TSK-FC) algorithm is proposed. The clustering behavior of IS-TSK-FC is\\nfully guided by the TSK fuzzy inference on fuzzy rules. In particular, samples\\nare grouped into clusters represented by the corresponding consequent vectors\\nof all fuzzy rules learned in an unsupervised manner. This can explain how the\\nclusters are generated in detail, thus making the underlying decision-making\\nprocess of the IS-TSK-FC interpretable. Moreover, a series of style matrices\\nare introduced to facilitate the consequents of fuzzy rules in IS-TSK-FC by\\ncapturing the styles of clusters as well as the nuances between different\\nstyles. Consequently, all the fuzzy rules in IS-TSK-FC have powerful data\\nrepresentation capability. After determining the antecedents of all the fuzzy\\nrules, the optimization problem of IS-TSK-FC can be iteratively solved in an\\nalternation manner. The effectiveness of IS-TSK-FC as an interpretable\\nclustering tool is validated through extensive experiments on benchmark\\ndatasets with unknown implicit/explicit styles. Specially, the superior\\nclustering performance of IS-TSK-FC is demonstrated on case studies where\\ndifferent groups of data present explicit styles. The source code of IS-TSK-FC\\ncan be downloaded from https://github.com/gusuhang10/IS-TSK-FC.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-07T14:28:56Z\"}"}
