{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06880v1\", \"title\": \"A Dataset of Software Bill of Materials for Evaluating SBOM Consumption\\n  Tools\", \"summary\": \"A Software Bill of Materials (SBOM) is becoming an essential tool for\\neffective software dependency management. An SBOM is a list of components used\\nin software, including details such as component names, versions, and licenses.\\nUsing SBOMs, developers can quickly identify software components and assess\\nwhether their software depends on vulnerable libraries. Numerous tools support\\nsoftware dependency management through SBOMs, which can be broadly categorized\\ninto two types: tools that generate SBOMs and tools that utilize SBOMs. A\\nsubstantial collection of accurate SBOMs is required to evaluate tools that\\nutilize SBOMs. However, there is no publicly available dataset specifically\\ndesigned for this purpose, and research on SBOM consumption tools remains\\nlimited. In this paper, we present a dataset of SBOMs to address this gap. The\\ndataset we constructed comprises 46 SBOMs generated from real-world Java\\nprojects, with plans to expand it to include a broader range of projects across\\nvarious programming languages. Accurate and well-structured SBOMs enable\\nresearchers to evaluate the functionality of SBOM consumption tools and\\nidentify potential issues. We collected 3,271 Java projects from GitHub and\\ngenerated SBOMs for 798 of them using Maven with an open-source SBOM generation\\ntool. These SBOMs were refined through both automatic and manual corrections to\\nensure accuracy, currently resulting in 46 SBOMs that comply with the SPDX Lite\\nprofile, which defines minimal requirements tailored to practical workflows in\\nindustries. This process also revealed issues with the SBOM generation tools\\nthemselves. The dataset is publicly available on Zenodo (DOI:\\n10.5281/zenodo.14233415).\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-09T13:35:02Z\"}"}
