{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07053v1\", \"title\": \"TASTE: Text-Aligned Speech Tokenization and Embedding for Spoken\\n  Language Modeling\", \"summary\": \"Large Language Models (LLMs) excel in text-based natural language processing\\ntasks but remain constrained by their reliance on textual inputs and outputs.\\nTo enable more natural human-LLM interaction, recent progress have focused on\\nderiving a spoken language model (SLM) that can not only listen but also\\ngenerate speech. To achieve this, a promising direction is to conduct\\nspeech-text joint modeling. However, recent SLM still lag behind text LLM due\\nto the modality mismatch. One significant mismatch can be the sequence lengths\\nbetween speech and text tokens. To address this, we introduce Text-Aligned\\nSpeech Tokenization and Embedding (TASTE), a method that directly addresses the\\nmodality gap by aligning speech token with the corresponding text transcription\\nduring the tokenization stage. We propose a method that can achieve this\\nthrough the special aggregation mechanism and with speech reconstruction as the\\ntraining objective. We conduct extensive experiments and show that TASTE can\\npreserve essential paralinguistic information while dramatically reducing the\\ntoken sequence length. Furthermore, by leveraging TASTE, we can adapt\\ntext-based LLMs into effective SLMs with parameter-efficient fine-tuning\\ntechniques such as Low-Rank Adaptation (LoRA). Experimental results on\\nbenchmark tasks, including SALMON and StoryCloze, demonstrate that TASTE-based\\nSLMs perform similarly to previous full-finetuning methods. To our knowledge,\\nTASTE is the first end-to-end approach that utilizes a reconstruction objective\\nto automatically learn a text-aligned speech tokenization and embedding\\nsuitable for spoken language modeling. Our demo, code, and models are publicly\\navailable at https://github.com/mtkresearch/TASTE-SpokenLM.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.SD,eess.AS\", \"published\": \"2025-04-09T17:14:33Z\"}"}
