{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07890v1\", \"title\": \"Stupendously Large Primordial Black Holes from the QCD axion\", \"summary\": \"The inflationary diffusion of (pseudo-)scalar fields with discrete symmetries\\ncan seed the formation of a gas of closed domain walls after inflation, when\\nthe distance between degenerate minima in field space is not too far from the\\ninflationary Hubble scale. Primordial black holes (PBHs) can then be formed\\nonce sufficiently heavy domain walls re-enter the Hubble sphere. In this\\nscenario, inflation determines a distinctive PBH mass distribution that is\\nrather flat and can thus lead to a sizable total abundance of PBHs, while\\navoiding some of the downsides of PBH formation from critical collapse. We show\\nthat generic QCD axion models, with decay constant close to the inflationary\\nHubble scale, can yield up to $1\\\\%$ of the dark matter (DM) today in the form\\nof PBHs, while being compatible with isocurvature constraints from Cosmic\\nMicrowave Background observations. This occurs for values of axion decay\\nconstants around $f_a\\\\simeq 10^{8}~\\\\text{GeV}$, that is the region targeted by\\naxion helioscopes and partially constrained by astrophysical observations. The\\nresulting PBHs have \\\\textit{stupendously} large masses, above $10^{11}M_\\\\odot$,\\nand their existence can be probed by Large Scale Structure observations. Larger\\nPBH abundances can be generated by axion-like particles. Alternatively, in\\nscenarios where isocurvature constraints can be relaxed, we find that the\\ntotality of the DM can be produced by the QCD axion misalignment mechanism,\\naccompanied by a ${\\\\cal O}(10^{-3})$ DM fraction in PBHs of masses\\n$(10^5-10^6)~M_\\\\odot$. These can act as seeds for the formation of massive\\nblack holes at large redshifts, as suggested by recent JWST observations.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,hep-ph\", \"published\": \"2025-04-10T16:03:25Z\"}"}
