{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23862v1\", \"title\": \"Learned Image Compression and Restoration for Digital Pathology\", \"summary\": \"Digital pathology images play a crucial role in medical diagnostics, but\\ntheir ultra-high resolution and large file sizes pose significant challenges\\nfor storage, transmission, and real-time visualization. To address these\\nissues, we propose CLERIC, a novel deep learning-based image compression\\nframework designed specifically for whole slide images (WSIs). CLERIC\\nintegrates a learnable lifting scheme and advanced convolutional techniques to\\nenhance compression efficiency while preserving critical pathological details.\\nOur framework employs a lifting-scheme transform in the analysis stage to\\ndecompose images into low- and high-frequency components, enabling more\\nstructured latent representations. These components are processed through\\nparallel encoders incorporating Deformable Residual Blocks (DRB) and Recurrent\\nResidual Blocks (R2B) to improve feature extraction and spatial adaptability.\\nThe synthesis stage applies an inverse lifting transform for effective image\\nreconstruction, ensuring high-fidelity restoration of fine-grained tissue\\nstructures. We evaluate CLERIC on a digital pathology image dataset and compare\\nits performance against state-of-the-art learned image compression (LIC)\\nmodels. Experimental results demonstrate that CLERIC achieves superior\\nrate-distortion (RD) performance, significantly reducing storage requirements\\nwhile maintaining high diagnostic image quality. Our study highlights the\\npotential of deep learning-based compression in digital pathology, facilitating\\nefficient data management and long-term storage while ensuring seamless\\nintegration into clinical workflows and AI-assisted diagnostic systems. Code\\nand models are available at: https://github.com/pnu-amilab/CLERIC.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-03-31T09:09:09Z\"}"}
