{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05830v1\", \"title\": \"Human Activity Recognition using RGB-Event based Sensors: A Multi-modal\\n  Heat Conduction Model and A Benchmark Dataset\", \"summary\": \"Human Activity Recognition (HAR) primarily relied on traditional RGB cameras\\nto achieve high-performance activity recognition. However, the challenging\\nfactors in real-world scenarios, such as insufficient lighting and rapid\\nmovements, inevitably degrade the performance of RGB cameras. To address these\\nchallenges, biologically inspired event cameras offer a promising solution to\\novercome the limitations of traditional RGB cameras. In this work, we rethink\\nhuman activity recognition by combining the RGB and event cameras. The first\\ncontribution is the proposed large-scale multi-modal RGB-Event human activity\\nrecognition benchmark dataset, termed HARDVS 2.0, which bridges the dataset\\ngaps. It contains 300 categories of everyday real-world actions with a total of\\n107,646 paired videos covering various challenging scenarios. Inspired by the\\nphysics-informed heat conduction model, we propose a novel multi-modal heat\\nconduction operation framework for effective activity recognition, termed\\nMMHCO-HAR. More in detail, given the RGB frames and event streams, we first\\nextract the feature embeddings using a stem network. Then, multi-modal Heat\\nConduction blocks are designed to fuse the dual features, the key module of\\nwhich is the multi-modal Heat Conduction Operation layer. We integrate RGB and\\nevent embeddings through a multi-modal DCT-IDCT layer while adaptively\\nincorporating the thermal conductivity coefficient via FVEs into this module.\\nAfter that, we propose an adaptive fusion module based on a policy routing\\nstrategy for high-performance classification. Comprehensive experiments\\ndemonstrate that our method consistently performs well, validating its\\neffectiveness and robustness. The source code and benchmark dataset will be\\nreleased on https://github.com/Event-AHU/HARDVS/tree/HARDVSv2\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-08T09:14:24Z\"}"}
