{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07948v1\", \"title\": \"Pushing the Accuracy Limit of Foundation Neural Network Models with\\n  Quantum Monte Carlo Forces and Path Integrals\", \"summary\": \"We propose an end-to-end integrated strategy for the production of highly\\naccurate quantum chemistry (QC) synthetic datasets aimed at deriving atomistic\\nFoundation Machine Learning (ML) Models. We first present a GPU-accelerated QC\\ndatabase generation Exascale protocol able to produce the required energies and\\nforces. A \\\"Jacob's Ladder\\\" approach leverages computationally-optimized layers\\nof massively parallel high performance software with increasing accuracy to\\ncompute: i) Density Functional Theory (DFT); ii) Quantum Monte Carlo (QMC);\\niii) Selected Configuration Interaction (s-CI), within large volumes and\\noptimized time-to-solution performances. Handling this ambitious computational\\npipeline would be impossible without exascale computing resources, particularly\\nfor the notoriously difficult and computationally intensive calculation of QMC\\nforces and for the combination of multi-determinant QMC energies and forces\\nusing selected CI wavefunctions methodologies. To our knowledge, this is the\\nfirst time that such quantities are computed at such scale. We combine these\\ndata with the FeNNix-Bio-1 foundation ML model to bridge the gap between highly\\naccurate QC calculations and condensed-phase Molecular Dynamics (MD). We\\ndemonstrate stable multi-ns simulations using the resulting beyond DFT accuracy\\nfully reactive model coupled to full path integrals adaptive sampling quantum\\ndynamics. A complete 1 million-atom plant virus solvated structure, including\\nits full genetic material, is simulated using Ring-Polymer MD quantum dynamics\\nalong as its response to acidification under physiological NaCl concentrations.\\nThese new capabilities open the door to the possibility to monitor bond\\nbreaking/creation and proton transfers chemical interactions taking place in\\nbiosystems allowing us to reach a deeper understanding of their complex\\ninternal machinery.\", \"main_category\": \"physics.chem-ph\", \"categories\": \"physics.chem-ph\", \"published\": \"2025-04-10T17:55:09Z\"}"}
