{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05093v1\", \"title\": \"Flexible Estimation of the Heterogeneous Non-Parametric Component in a\\n  Relative Survival Cure Model\", \"summary\": \"Estimating the cure fraction in a diseased population, especially in the\\npresence of competing mortality causes, is crucial for both patients and\\nclinicians. It offers a valuable measure for monitoring and interpreting trends\\nin disease outcomes. When information on the cause of death is unavailable or\\nunreliable, the Relative Survival (RS) framework is the preferred approach for\\nestimating Net Survival, which represents survival in a hypothetical scenario\\nwhere the disease of interest is the only possible cause of death. In the\\ncontext of cancer, RS often reaches a plateau, indicating that a portion of\\ndiagnosed patients is cured, as they have the same risk of dying as a\\ncomparable group of healthy individuals with similar demographic\\ncharacteristics. Classical RS cure models use logistic regression to estimate\\nthe fraction of cured patients. However, this functional form is somewhat\\narbitrary, and misspecifying it can severely distort the resulting cure\\nindicators. Consequently, evaluations of the efficacy of cancer treatments at\\nthe population level could be inaccurate, leading to biased decision-making\\nregarding patient care. In this paper, we address this issue by relaxing the\\nparametric assumption and considering flexible functions of the covariates\\nwithin the framework of \\\\textit{Generalized Models} and \\\\textit{Neural\\nNetworks}. We design an EM algorithm for these RS cure models and conduct a\\nsimulation study to compare our proposals with the classical approach. We apply\\nour methodology to a real-world dataset from a historical Italian cancer\\nregistry. The results demonstrate that our proposed models outperform the\\nclassical approach and provide valuable insights into the survival outcomes of\\nItalian colon cancer patients.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME,stat.AP\", \"published\": \"2025-04-07T14:00:37Z\"}"}
