{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21765v1\", \"title\": \"Exploring the Evolution of Physics Cognition in Video Generation: A\\n  Survey\", \"summary\": \"Recent advancements in video generation have witnessed significant progress,\\nespecially with the rapid advancement of diffusion models. Despite this, their\\ndeficiencies in physical cognition have gradually received widespread attention\\n- generated content often violates the fundamental laws of physics, falling\\ninto the dilemma of ''visual realism but physical absurdity\\\". Researchers began\\nto increasingly recognize the importance of physical fidelity in video\\ngeneration and attempted to integrate heuristic physical cognition such as\\nmotion representations and physical knowledge into generative systems to\\nsimulate real-world dynamic scenarios. Considering the lack of a systematic\\noverview in this field, this survey aims to provide a comprehensive summary of\\narchitecture designs and their applications to fill this gap. Specifically, we\\ndiscuss and organize the evolutionary process of physical cognition in video\\ngeneration from a cognitive science perspective, while proposing a three-tier\\ntaxonomy: 1) basic schema perception for generation, 2) passive cognition of\\nphysical knowledge for generation, and 3) active cognition for world\\nsimulation, encompassing state-of-the-art methods, classical paradigms, and\\nbenchmarks. Subsequently, we emphasize the inherent key challenges in this\\ndomain and delineate potential pathways for future research, contributing to\\nadvancing the frontiers of discussion in both academia and industry. Through\\nstructured review and interdisciplinary analysis, this survey aims to provide\\ndirectional guidance for developing interpretable, controllable, and physically\\nconsistent video generation paradigms, thereby propelling generative models\\nfrom the stage of ''visual mimicry'' towards a new phase of ''human-like\\nphysical comprehension''.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-03-27T17:58:33Z\"}"}
