{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06808v1\", \"title\": \"How do Copilot Suggestions Impact Developers' Frustration and\\n  Productivity?\", \"summary\": \"Context. AI-based development tools, such as GitHub Copilot, are transforming\\nthe software development process by offering real-time code suggestions. These\\ntools promise to improve the productivity by reducing cognitive load and\\nspeeding up task completion. Previous exploratory studies, however, show that\\ndevelopers sometimes perceive the automatic suggestions as intrusive. As a\\nresult, they feel like their productivity decreased. Theory. We propose two\\ntheories on the impact of automatic suggestions on frustration and\\nproductivity. First, we hypothesize that experienced developers are frustrated\\nfrom automatic suggestions (mostly from irrelevant ones), and this also\\nnegatively impacts their productivity. Second, we conjecture that novice\\ndevelopers benefit from automatic suggestions, which reduce the frustration\\ncaused from being stuck on a technical problem and thus increase their\\nproductivity. Objective. We plan to conduct a quasi-experimental study to test\\nour theories. The empirical evidence we will collect will allow us to either\\ncorroborate or reject our theories. Method. We will involve at least 32\\ndevelopers, both experts and novices. We will ask each of them to complete two\\nsoftware development tasks, one with automatic suggestions enabled and one with\\nthem disabled, allowing for within-subject comparisons. We will measure\\nindependent and dependent variables by monitoring developers' actions through\\nan IDE plugin and screen recording. Besides, we will collect physiological data\\nthrough a wearable device. We will use statistical hypothesis tests to study\\nthe effects of the treatments (i.e., automatic suggestions enabled/disabled) on\\nthe outcomes (frustration and productivity).\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-09T11:55:22Z\"}"}
