{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04936v1\", \"title\": \"Constrained Gaussian Process Motion Planning via Stein Variational\\n  Newton Inference\", \"summary\": \"Gaussian Process Motion Planning (GPMP) is a widely used framework for\\ngenerating smooth trajectories within a limited compute time--an essential\\nrequirement in many robotic applications. However, traditional GPMP approaches\\noften struggle with enforcing hard nonlinear constraints and rely on Maximum a\\nPosteriori (MAP) solutions that disregard the full Bayesian posterior. This\\nlimits planning diversity and ultimately hampers decision-making. Recent\\nefforts to integrate Stein Variational Gradient Descent (SVGD) into motion\\nplanning have shown promise in handling complex constraints. Nonetheless, these\\nmethods still face persistent challenges, such as difficulties in strictly\\nenforcing constraints and inefficiencies when the probabilistic inference\\nproblem is poorly conditioned. To address these issues, we propose a novel\\nconstrained Stein Variational Gaussian Process Motion Planning (cSGPMP)\\nframework, incorporating a GPMP prior specifically designed for trajectory\\noptimization under hard constraints. Our approach improves the efficiency of\\nparticle-based inference while explicitly handling nonlinear constraints. This\\nadvancement significantly broadens the applicability of GPMP to motion planning\\nscenarios demanding robust Bayesian inference, strict constraint adherence, and\\ncomputational efficiency within a limited time. We validate our method on\\nstandard benchmarks, achieving an average success rate of 98.57% across 350\\nplanning tasks, significantly outperforming competitive baselines. This\\ndemonstrates the ability of our method to discover and use diverse trajectory\\nmodes, enhancing flexibility and adaptability in complex environments, and\\ndelivering significant improvements over standard baselines without incurring\\nmajor computational costs.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.LG\", \"published\": \"2025-04-07T11:20:11Z\"}"}
