{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01683v1\", \"title\": \"Singularity-free cosmology from interactions in the dark sector\", \"summary\": \"We study the dynamics of Friedmann-Lema\\\\^itre-Robertson-Walker models where a\\ndark energy component with a quadratic equation of state (EoS) nonlinearly\\ninteracts with cold dark matter. Thus, two energy scales naturally come into\\nplay: $\\\\rho_*$ is the scale at which the nonlinearity of the EoS becomes\\nrelevant; $\\\\rho_i$ is the energy scale around which the interaction starts to\\nplay an important role in the dynamics. Our focus is to understand whether\\nthere are parameter ranges for this system that can produce non-singular\\nbouncing and emergent cosmologies for any initial condition. We complete a\\ndynamical systems analysis, and find the parameter range such that trajectories\\nalways expand from a high energy non-singular de Sitter state. For flat and\\nnegative curvature models this de Sitter state is represented by a fixed point,\\nthe asymptotic past from which the universe emerges from. We find a subset of\\npositive curvature models that during contraction get arbitrarily close to the\\nde Sitter state, thus having a quasi-de Sitter bounce, then emerge from the\\nbounce and expand, evolving toward spatial flatness. We find that the\\ndimensionless parameter $q\\\\equiv \\\\rho_*/\\\\rho_i$, which measures the relative\\nstrength of the nonlinear terms in the system, plays a crucial role in the\\ntopology of the phase space. When $q < 3$, some trajectories expand toward a\\nsingularity, while others evolve toward a low energy cosmological constant at\\nlate-times, with a subset going through a decelerated matter dominate era\\nbefore the final acceleration. When $q > 3$, all trajectories are non-singular,\\nand evolve toward a late-time cosmological constant. We find a subclass in this\\ncase in which all trajectories have at least one decelerated matter dominated\\nphase, and accelerate at late-times.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,gr-qc\", \"published\": \"2025-04-02T12:29:30Z\"}"}
