{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24359v1\", \"title\": \"Unveiling the Fast Acceleration of AGN-Driven Winds at Kiloparsec Scales\", \"summary\": \"Supermassive black holes at the centre of galaxies gain mass through\\naccretion disks. Models predict that quasi-spherical winds, expelled by the\\nblack hole during active accretion phases, have a key role in shaping galaxy\\nevolution by regulating star formation, the distribution of metals over\\nkiloparsec scales, and by sweeping ambient gas to the outskirts and beyond of\\ngalaxies. Nonetheless, the mechanism driving these outflows and the amount of\\nenergy exchanged between the wind and the galaxy's interstellar medium remain\\nunclear. Here, we present a detailed analysis of the kinematical properties of\\nwinds in a sample of nearby active galaxies using the novel kinematic tool\\nMOKA3D, which takes into account the clumpy nature of the ISM. We find\\nremarkable similarities among the properties of the outflows in all the\\ngalaxies examined. In particular, we provide the first evidence that outflows\\nexhibit a regular trend in radial velocity, initially constant or slightly\\ndecreasing, followed by rapid acceleration starting at approximately 1 kpc from\\nthe nucleus, despite the seemingly complex kinematics observed. The observed\\nbehavior aligns with our current theoretical understanding of Active Galactic\\nNuclei outflows, where a momentum-driven phase transitions to an\\nenergy-conserving phase just beyond approximately 1 kpc. The constant velocity\\nof the momentum-driven wind is then rapidly accelerated following the\\ninefficient Compton cooling of post-shock material and the transition to energy\\nconservation. The measured radial terminal velocities of the outflows are\\nalways larger than the escape velocities from the host galaxies, confirming the\\nkey role of outflows in shaping the galaxy properties and evolution, as a\\nmanifestation of AGN feedback. Our results, only made possible by our novel\\nkinematic analysis tool, are crucial to understand the origin and the powering\\nmechanism of these winds.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-03-31T17:37:44Z\"}"}
