{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02359v1\", \"title\": \"First observation of ultra-long-range azimuthal correlations in low\\n  multiplicity pp and p-Pb collisions at the LHC\", \"summary\": \"This study presents the first observation of ultra-long-range two-particle\\nazimuthal correlations with pseudorapidity separation of ($|\\\\Delta \\\\eta| >\\n5.0$) in proton-proton (pp) and ($|\\\\Delta \\\\eta| > 6.5$) in proton-lead (p-Pb)\\ncollisions at the LHC, down to and below the minimum-bias multiplicity.\\nTwo-particle correlation coefficients (${V}_{2\\\\Delta}$) are measured after\\nremoving non-flow (jets and resonance decays) contributions using the\\ntemplate-fit method across various multiplicity classes, providing novel\\ninsights into the origin of long-range correlations in small systems.\\nComparisons with the 3D-Glauber + MUSIC + UrQMD hydrodynamic model reveal\\nsignificant discrepancies at low multiplicities, indicating possible dynamics\\nbeyond typical hydrodynamic behavior. Initial-state models based on the Color\\nGlass Condensate framework generate only short-range correlations, while PYTHIA\\nsimulations implemented with the string-shoving mechanism also fail to describe\\nthese ultra-long-range correlations. The results challenge existing paradigms\\nand question the underlying mechanisms in low-multiplicity pp and p-Pb\\ncollisions. The findings impose significant constraints on models describing\\ncollective phenomena in small collision systems and advance the understanding\\nof origin of long-range correlations at Large Hadron Collider (LHC) energies.\", \"main_category\": \"nucl-ex\", \"categories\": \"nucl-ex,hep-ex\", \"published\": \"2025-04-03T07:46:09Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02375v1\", \"title\": \"A Comparative Study of MINLP and MPVC Formulations for Solving Complex\\n  Nonlinear Decision-Making Problems in Aerospace Applications\", \"summary\": \"High-level decision-making for dynamical systems often involves performance\\nand safety specifications that are activated or deactivated depending on\\nconditions related to the system state and commands. Such decision-making\\nproblems can be naturally formulated as optimization problems where these\\nconditional activations are regulated by discrete variables. However, solving\\nthese problems can be challenging numerically, even on powerful computing\\nplatforms, especially when the dynamics are nonlinear. In this work, we\\nconsider decision-making for nonlinear systems where certain constraints, as\\nwell as possible terms in the cost function, are activated or deactivated\\ndepending on the system state and commands. We show that these problems can be\\nformulated either as mixed-integer nonlinear programs (MINLPs) or as\\nmathematical programs with vanishing constraints (MPVCs), where the former\\nformulation involves discrete decision variables, whereas the latter relies on\\ncontinuous variables subject to structured nonconvex constraints. We discuss\\nthe different solution methods available for both formulations and demonstrate\\nthem on optimal trajectory planning problems in various aerospace applications.\\nFinally, we compare the strengths and weaknesses of the MINLP and MPVC\\napproaches through a focused case study on powered descent guidance with\\ndivert-feasible regions.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC,cs.SY,eess.SY\", \"published\": \"2025-04-03T08:08:52Z\"}"}
