{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02259v1\", \"title\": \"Re-thinking Temporal Search for Long-Form Video Understanding\", \"summary\": \"Efficient understanding of long-form videos remains a significant challenge\\nin computer vision. In this work, we revisit temporal search paradigms for\\nlong-form video understanding, studying a fundamental issue pertaining to all\\nstate-of-the-art (SOTA) long-context vision-language models (VLMs). In\\nparticular, our contributions are two-fold: First, we formulate temporal search\\nas a Long Video Haystack problem, i.e., finding a minimal set of relevant\\nframes (typically one to five) among tens of thousands of frames from\\nreal-world long videos given specific queries. To validate our formulation, we\\ncreate LV-Haystack, the first benchmark containing 3,874 human-annotated\\ninstances with fine-grained evaluation metrics for assessing keyframe search\\nquality and computational efficiency. Experimental results on LV-Haystack\\nhighlight a significant research gap in temporal search capabilities, with SOTA\\nkeyframe selection methods achieving only 2.1% temporal F1 score on the LVBench\\nsubset.\\n  Next, inspired by visual search in images, we re-think temporal searching and\\npropose a lightweight keyframe searching framework, T*, which casts the\\nexpensive temporal search as a spatial search problem. T* leverages superior\\nvisual localization capabilities typically used in images and introduces an\\nadaptive zooming-in mechanism that operates across both temporal and spatial\\ndimensions. Our extensive experiments show that when integrated with existing\\nmethods, T* significantly improves SOTA long-form video understanding\\nperformance. Specifically, under an inference budget of 32 frames, T* improves\\nGPT-4o's performance from 50.5% to 53.1% and LLaVA-OneVision-72B's performance\\nfrom 56.5% to 62.4% on LongVideoBench XL subset. Our PyTorch code, benchmark\\ndataset and models are included in the Supplementary material.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-03T04:03:10Z\"}"}
