{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24304v1\", \"title\": \"Gravitational Waves from Massive Black Hole Mergers in ASTRID:\\n  Predictions for LISA\", \"summary\": \"We use the ASTRID cosmological simulation to forecast massive black hole\\n(MBH) binary mergers detectable by LISA. A key result is a significant increase\\nin the predicted detection rate when MBH orbital eccentricity is included,\\nrising from 5.6 for circular orbits to 10.5 events per year. This boost is\\nlargely due to inspiral sources that will merge after LISA's mission period,\\nwhich make up 46% of detections in the eccentric case. This highlights LISA's\\nsensitivity to early inspiral phases, especially for eccentric binaries that\\nemit across a wider frequency band. Most LISA detections arise from\\n$M_{\\\\mathrm{BH}} \\\\sim 10^{5-6}~\\\\mathrm{M}_{\\\\odot}$, low-redshift ($z<2$), low\\nmass-ratio ($q\\\\sim 0.01$--$0.1$) mergers, complementing instruments like Pulsar\\nTiming Arrays (PTAs). Eccentricity also expands the detectable MBH mass range\\nto $10^9~\\\\mathrm{M}_{\\\\odot}$ (from $10^8~\\\\mathrm{M}_{\\\\odot}$), and shifts the\\nredshift peak from $z = 1.9$ (circular) to $z = 0.8$ (eccentric). We find LISA\\nwill detect MBH mergers in diverse host galaxies, including lower-mass and\\nsatellite galaxies. These hosts are $\\\\sim 50$ times more star-forming than\\ntypical galaxies of the same mass, forming a tight power-law in SFR--$M_{\\\\rm\\ngal}$ space: ${\\\\rm SFR} = 10^{-8} M_{\\\\rm\\ngal}^{0.9}~\\\\mathrm{M}_{\\\\odot}\\\\,\\\\mathrm{yr}^{-1}$, independent of redshift. This\\ncontrasts with expectations for PTA sources, which tend to reside in massive\\ncentral galaxies, suggesting LISA will probe distinct galactic environments.\\nOnly $\\\\sim 10\\\\%$ of the remnant MBHs are bright AGNs, mostly from mergers with\\n$M_{\\\\mathrm{BH}} > 10^{6.5}~\\\\mathrm{M}_{\\\\odot}$.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-03-31T16:49:49Z\"}"}
