{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06701v1\", \"title\": \"A multi-scale view of the magnetic field morphology in the hot molecular\\n  core G31.41+0.31\", \"summary\": \"Multiscale studies of the morphology and strength of the magnetic field are\\ncrucial to properly unveil its role and relative importance in high-mass star\\nand cluster formation. G31.41+0.31 (G31) is a hub-filament system that hosts a\\nhigh-mass protocluster embedded in a hot molecular core (HMC). G31 is one of\\nthe few sources showing a clear hourglass morphology of the magnetic field on\\nscales between 1000 au and a few 100 au in previous interferometric\\nobservations. This strongly suggests a field-regulated collapse. To complete\\nthe study of the magnetic field properties in this high-mass star-forming\\nregion, we carried out observations with the James Clerk Maxwell Telescope $850\\n\\\\mu$m of the polarized dust emission. These observations had a spatial\\nresolution of $\\\\sim$0.2 pc at 3.75 kpc. The aim was to study the magnetic field\\nin the whole cloud and to compare the magnetic field orientation toward the HMC\\nfrom $\\\\sim$50,000 au to $\\\\sim$260 au scales. The large-scale ($\\\\sim$5 pc)\\norientation of the magnetic field toward the position of the HMC is consistent\\nwith that observed at the core ($\\\\sim$4,000 au) and circumstellar ($\\\\sim$260\\nau) scales. The self-similarity of the magnetic field orientation at these\\ndifferent scales might arise from the brightest sources in the protocluster,\\nwhose collapse is dragging the magnetic field. These sources dominate the\\ngravitational potential and the collapse in the HMC. The cloud-scale magnetic\\nfield strength of the G31 hub-filament system, which we estimated using the\\nDavis-Chandrasekhar-Fermi method, is in the range 0.04--0.09 mG. The magnetic\\nfield orientation in the star-forming region shows a bimodal distribution, and\\nit changes from an NW--SE direction in the north to an E--W direction in the\\nsouth [abridged abstract].\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-09T09:05:54Z\"}"}
