{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06691v1\", \"title\": \"Wake instability of a fixed spherical droplet with a high drop-to-fluid\\n  viscosity ratio\", \"summary\": \"Direct numerical simulations of a uniform flow past a fixed spherical droplet\\nare performed to investigate the parameter range within which the axisymmetric\\nflow becomes unstable due to an external flow bifurcation. The hydrodynamics is\\ngoverned by three dimensionless numbers: the viscosity ratio, $\\\\mu^\\\\ast$, and\\nthe external and internal Reynolds numbers, $\\\\Rey^e$ and $\\\\Rey^i$,\\nrespectively. The drop-to-fluid density ratio is related to these parameters as\\n$\\\\rho^\\\\ast=\\\\mu^\\\\ast \\\\Rey^i/\\\\Rey^e$. This study focuses on highly viscous\\ndroplets with $\\\\mu^\\\\ast \\\\geq 5$, where wake instability is driven by the\\nvorticity flux transferred from the droplet surface into the surrounding fluid.\\nBy analysing the wake structure, we confirm that the onset of the external\\nbifurcation is linked to the tilting of the azimuthal vorticity, $\\\\omega_\\\\phi$,\\nin the wake and that the bifurcation occurs once the isocontours of\\n$\\\\omega_\\\\phi$ align nearly perpendicular to the symmetry axis. We propose an\\nempirical criterion for predicting the onset of the external bifurcation,\\nformulated in terms of the maximum vorticity on the external side of the\\ndroplet surface. This criterion is applicable for sufficiently high $\\\\Rey^i$\\nand holds over a wide range of $\\\\mu^\\\\ast$ and $\\\\Rey^e$. Additionally, we\\nexamine the bifurcation sequence for two specific external Reynolds numbers,\\n$\\\\Rey^e=300$ and $\\\\Rey^e=500$, and show that, beyond a critical viscosity\\nratio, the axisymmetric wake first transitions to a steady planar-symmetric\\nstate before undergoing a secondary Hopf bifurcation. Finally, we highlight the\\ninfluence of $\\\\Rey^i$ on external bifurcation and show that, at moderate\\n$\\\\Rey^i$, wake instability may set in at a lower vorticity threshold than\\npredicted by our criterion. These findings provide new insights into the\\nexternal flow bifurcation of viscous droplets.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-09T08:53:06Z\"}"}
