{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05146v1\", \"title\": \"Query Smarter, Trust Better? Exploring Search Behaviours for Verifying\\n  News Accuracy\", \"summary\": \"While it is often assumed that searching for information to evaluate\\nmisinformation will help identify false claims, recent work suggests that\\nsearch behaviours can instead reinforce belief in misleading news, particularly\\nwhen users generate queries using vocabulary from the source articles. Our\\nresearch explores how different query generation strategies affect news\\nverification and whether the way people search influences the accuracy of their\\ninformation evaluation. A mixed-methods approach was used, consisting of three\\nparts: (1) an analysis of existing data to understand how search behaviour\\ninfluences trust in fake news, (2) a simulation of query generation strategies\\nusing a Large Language Model (LLM) to assess the impact of different query\\nformulations on search result quality, and (3) a user study to examine how\\n'Boost' interventions in interface design can guide users to adopt more\\neffective query strategies. The results show that search behaviour\\nsignificantly affects trust in news, with successful searches involving\\nmultiple queries and yielding higher-quality results. Queries inspired by\\ndifferent parts of a news article produced search results of varying quality,\\nand weak initial queries improved when reformulated using full SERP\\ninformation. Although 'Boost' interventions had limited impact, the study\\nsuggests that interface design encouraging users to thoroughly review search\\nresults can enhance query formulation. This study highlights the importance of\\nquery strategies in evaluating news and proposes that interface design can play\\na key role in promoting more effective search practices, serving as one\\ncomponent of a broader set of interventions to combat misinformation.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-04-07T14:50:13Z\"}"}
