{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24325v1\", \"title\": \"Pro-Routing: Proactive Routing of Autonomous Multi-Capacity Robots for\\n  Pickup-and-Delivery Tasks\", \"summary\": \"We consider a multi-robot setting, where we have a fleet of multi-capacity\\nautonomous robots that must service spatially distributed pickup-and-delivery\\nrequests with fixed maximum wait times. Requests can be either scheduled ahead\\nof time or they can enter the system in real-time. In this setting, stability\\nfor a routing policy is defined as the cost of the policy being uniformly\\nbounded over time. Most previous work either solve the problem offline to\\ntheoretically maintain stability or they consider dynamically arriving requests\\nat the expense of the theoretical guarantees on stability. In this paper, we\\naim to bridge this gap by proposing a novel proactive rollout-based routing\\nframework that adapts to real-time demand while still provably maintaining the\\nstability of the learned routing policy. We derive provable stability\\nguarantees for our method by proposing a fleet sizing algorithm that obtains a\\nsufficiently large fleet that ensures stability by construction. To validate\\nour theoretical results, we consider a case study on real ride requests for\\nHarvard's evening Van System. We also evaluate the performance of our framework\\nusing the currently deployed smaller fleet size. In this smaller setup, we\\ncompare against the currently deployed routing algorithm, greedy heuristics,\\nand Monte-Carlo-Tree-Search-based algorithms. Our empirical results show that\\nour framework maintains stability when we use the sufficiently large fleet size\\nfound in our theoretical results. For the smaller currently deployed fleet\\nsize, our method services 6% more requests than the closest baseline while\\nreducing median passenger wait times by 33%.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.AI,cs.MA\", \"published\": \"2025-03-31T17:14:07Z\"}"}
