{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06750v1\", \"title\": \"Robust Capacity Expansion Modelling for Renewable Energy Systems under\\n  Weather and Demand Uncertainty\", \"summary\": \"Future greenhouse gas neutral energy systems will be dominated by variable\\nrenewable energy technologies. However, renewable electricity generation from\\nwind and solar technologies, as well as electricity demand, varies with the\\nweather. This work addresses the problem of determining optimal capacities for\\nrenewable technologies in energy systems that ensure sufficient electricity\\nsupply when dealing with multi-year time-series data. An iterative algorithm is\\nproposed that starts by optimising an arbitrary starting time-series, followed\\nby adding additional constraints and reoptimising the modified optimisation\\nproblem until sufficient energy supply is provided for all time--series, i.e.\\nthe solution is robust to weather and demand variations. This is evaluated in a\\ncomputational study on a German energy system model.The results show that the\\niterative algorithm finds robust solutions for an increase of 2-2.5% in total\\nannual cost for a simplified model in gurobipy and 2.9% for a model built in\\nthe model framework ETHOS.FINE. Testing the feasibility for non robust\\nsolutions showed that supply gaps occurred in at least some of the remaining\\nyears. Based on the results of this work, ensuring feasibility within an energy\\nsystem model for multiple time-series boils down to two factors: ensuring\\nsufficient back-up capacity to overcome periods of high demand combined with\\nlow electricity generation from wind and photovoltaic, and enforcing sufficient\\ntotal annual electricity generation. Our proposed open source iterative\\nalgorithm is able to ensure this. For general modelling, it is recommended to\\ncheck for systematic effects of different years' time--series on energy system\\nmodels especially for wind, but also for photovoltaics, include dark lull and\\ncold period effects on generation and demand in time--series, and assess the\\nfeasibility of energy system models using different time-series.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC,cs.SY,eess.SY,I.6\", \"published\": \"2025-04-09T10:13:46Z\"}"}
