{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02433v1\", \"title\": \"OmniTalker: Real-Time Text-Driven Talking Head Generation with\\n  In-Context Audio-Visual Style Replication\", \"summary\": \"Recent years have witnessed remarkable advances in talking head generation,\\nowing to its potential to revolutionize the human-AI interaction from text\\ninterfaces into realistic video chats. However, research on text-driven talking\\nheads remains underexplored, with existing methods predominantly adopting a\\ncascaded pipeline that combines TTS systems with audio-driven talking head\\nmodels. This conventional pipeline not only introduces system complexity and\\nlatency overhead but also fundamentally suffers from asynchronous audiovisual\\noutput and stylistic discrepancies between generated speech and visual\\nexpressions. To address these limitations, we introduce OmniTalker, an\\nend-to-end unified framework that simultaneously generates synchronized speech\\nand talking head videos from text and reference video in real-time zero-shot\\nscenarios, while preserving both speech style and facial styles. The framework\\nemploys a dual-branch diffusion transformer architecture: the audio branch\\nsynthesizes mel-spectrograms from text, while the visual branch predicts\\nfine-grained head poses and facial dynamics. To bridge modalities, we introduce\\na novel audio-visual fusion module that integrates cross-modal information to\\nensure temporal synchronization and stylistic coherence between audio and\\nvisual outputs. Furthermore, our in-context reference learning module\\neffectively captures both speech and facial style characteristics from a single\\nreference video without introducing an extra style extracting module. To the\\nbest of our knowledge, OmniTalker presents the first unified framework that\\njointly models speech style and facial style in a zero-shot setting, achieving\\nreal-time inference speed of 25 FPS. Extensive experiments demonstrate that our\\nmethod surpasses existing approaches in generation quality, particularly\\nexcelling in style preservation and audio-video synchronization.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-03T09:48:13Z\"}"}
