{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06170v1\", \"title\": \"Investigating Embedded Structures and Gas Kinematics in the IRDC Hosting\\n  Bubble N59-North\", \"summary\": \"We present a multi-wavelength study of an extended area hosting the bubble\\nN59-North to explore the physical processes driving massive star formation\\n(MSF). The Spitzer 8 $\\\\mu$m image reveals an elongated/filamentary\\ninfrared-dark cloud (length $\\\\sim$28 pc) associated with N59-North, which\\ncontains several protostars and seven ATLASGAL dust clumps at the same\\ndistance. The existence of this filament is confirmed through $^{13}$CO and\\nNH$_3$ molecular line data in a velocity range of [95, 106] km s$^{-1}$. All\\ndust clumps satisfy Kauffmann & Pillai's condition for MSF. Using Spitzer 8\\n$\\\\mu$m image, a new embedded hub-filament system candidate (C-HFS) is\\ninvestigated toward the ATLASGAL clump, located near the filament's central\\nregion. MeerKAT 1.3 GHz continuum emission, detected for the first time toward\\nC-HFS, reveals an ultracompact HII region driven by a B2-type star, suggesting\\nan early stage of HFS with minimal feedback from the young massive star. The\\ncomparison of the position-velocity (PV) and position-position-velocity (PPV)\\ndiagrams with existing theoretical models suggests that rotation, central\\ncollapse, and end-dominated collapse are not responsible for the observed gas\\nmotion in the filament. The PPV diagram indicates the expansion of N59-North by\\nrevealing blue- and red-shifted gas velocities at the edge of the bubble. Based\\non comparisons with magnetohydrodynamic simulations, this study suggests that\\ncloud-cloud collision (CCC) led to the formation of the filament, likely giving\\nit a conical structure with gas converging toward its central region, where\\nC-HFS is located. Overall, the study supports multi-scale filamentary mass\\naccretion for MSF, likely triggered by CCC.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-08T16:13:05Z\"}"}
