{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01882v1\", \"title\": \"CO-DEFEND: Continuous Decentralized Federated Learning for Secure\\n  DoH-Based Threat Detection\", \"summary\": \"The use of DNS over HTTPS (DoH) tunneling by an attacker to hide malicious\\nactivity within encrypted DNS traffic poses a serious threat to network\\nsecurity, as it allows malicious actors to bypass traditional monitoring and\\nintrusion detection systems while evading detection by conventional traffic\\nanalysis techniques. Machine Learning (ML) techniques can be used to detect DoH\\ntunnels; however, their effectiveness relies on large datasets containing both\\nbenign and malicious traffic. Sharing such datasets across entities is\\nchallenging due to privacy concerns. In this work, we propose CO-DEFEND\\n(Continuous Decentralized Federated Learning for Secure DoH-Based Threat\\nDetection), a Decentralized Federated Learning (DFL) framework that enables\\nmultiple entities to collaboratively train a classification machine learning\\nmodel while preserving data privacy and enhancing resilience against single\\npoints of failure. The proposed DFL framework, which is scalable and\\nprivacy-preserving, is based on a federation process that allows multiple\\nentities to train online their local models using incoming DoH flows in real\\ntime as they are processed by the entity. In addition, we adapt four classical\\nmachine learning algorithms, Support Vector Machines (SVM), Logistic Regression\\n(LR), Decision Trees (DT), and Random Forest (RF), for federated scenarios,\\ncomparing their results with more computationally complex alternatives such as\\nneural networks. We compare our proposed method by using the dataset\\nCIRA-CIC-DoHBrw-2020 with existing machine learning approaches to demonstrate\\nits effectiveness in detecting malicious DoH tunnels and the benefits it\\nbrings.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-02T16:40:01Z\"}"}
