{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06575v1\", \"title\": \"Defending LLM Watermarking Against Spoofing Attacks with Contrastive\\n  Representation Learning\", \"summary\": \"Watermarking has emerged as a promising technique for detecting texts\\ngenerated by LLMs. Current research has primarily focused on three design\\ncriteria: high quality of the watermarked text, high detectability, and\\nrobustness against removal attack. However, the security against spoofing\\nattacks remains relatively understudied. For example, a piggyback attack can\\nmaliciously alter the meaning of watermarked text-transforming it into hate\\nspeech-while preserving the original watermark, thereby damaging the reputation\\nof the LLM provider. We identify two core challenges that make defending\\nagainst spoofing difficult: (1) the need for watermarks to be both sensitive to\\nsemantic-distorting changes and insensitive to semantic-preserving edits, and\\n(2) the contradiction between the need to detect global semantic shifts and the\\nlocal, auto-regressive nature of most watermarking schemes. To address these\\nchallenges, we propose a semantic-aware watermarking algorithm that post-hoc\\nembeds watermarks into a given target text while preserving its original\\nmeaning. Our method introduces a semantic mapping model, which guides the\\ngeneration of a green-red token list, contrastively trained to be sensitive to\\nsemantic-distorting changes and insensitive to semantic-preserving changes.\\nExperiments on two standard benchmarks demonstrate strong robustness against\\nremoval attacks and security against spoofing attacks, including sentiment\\nreversal and toxic content insertion, while maintaining high watermark\\ndetectability. Our approach offers a significant step toward more secure and\\nsemantically aware watermarking for LLMs. Our code is available at\\nhttps://github.com/UCSB-NLP-Chang/contrastive-watermark.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.CL\", \"published\": \"2025-04-09T04:38:17Z\"}"}
