{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05672v1\", \"title\": \"Contrastive Decoupled Representation Learning and Regularization for\\n  Speech-Preserving Facial Expression Manipulation\", \"summary\": \"Speech-preserving facial expression manipulation (SPFEM) aims to modify a\\ntalking head to display a specific reference emotion while preserving the mouth\\nanimation of source spoken contents. Thus, emotion and content information\\nexisting in reference and source inputs can provide direct and accurate\\nsupervision signals for SPFEM models. However, the intrinsic intertwining of\\nthese elements during the talking process poses challenges to their\\neffectiveness as supervisory signals. In this work, we propose to learn content\\nand emotion priors as guidance augmented with contrastive learning to learn\\ndecoupled content and emotion representation via an innovative Contrastive\\nDecoupled Representation Learning (CDRL) algorithm. Specifically, a Contrastive\\nContent Representation Learning (CCRL) module is designed to learn audio\\nfeature, which primarily contains content information, as content priors to\\nguide learning content representation from the source input. Meanwhile, a\\nContrastive Emotion Representation Learning (CERL) module is proposed to make\\nuse of a pre-trained visual-language model to learn emotion prior, which is\\nthen used to guide learning emotion representation from the reference input. We\\nfurther introduce emotion-aware and emotion-augmented contrastive learning to\\ntrain CCRL and CERL modules, respectively, ensuring learning\\nemotion-independent content representation and content-independent emotion\\nrepresentation. During SPFEM model training, the decoupled content and emotion\\nrepresentations are used to supervise the generation process, ensuring more\\naccurate emotion manipulation together with audio-lip synchronization.\\nExtensive experiments and evaluations on various benchmarks show the\\neffectiveness of the proposed algorithm.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.SD\", \"published\": \"2025-04-08T04:34:38Z\"}"}
