{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05653v1\", \"title\": \"How communities shape epidemic spreading: A hierarchically structured\\n  metapopulation perspective\", \"summary\": \"Recent outbreaks of COVID-19, Zika, Ebola, and influenza have renewed\\ninterest in advancing epidemic models to better reflect the complexities of\\ndisease spreading. Modern approaches incorporate social norms, mobility\\npatterns, and heterogeneous community structures to capture the interplay\\nbetween social and biological dynamics. This study examines epidemic\\npropagation in hierarchically structured metapopulation networks, where\\nindividuals interact within localized communities -- such as schools,\\nworkplaces, and theaters -- and diffuse across them. Using mean-field\\naveraging, we derive a scaling law linking contagion rates to the mean\\nconnectivity degree, while stability analysis identifies thresholds for\\ninfection surges. In networks with heterogeneous mean degrees, spectral\\nperturbation theory reveals how structural variability accelerates and\\namplifies disease spreading. We find that nodes with above-average degrees are\\nnot only infected earlier but also act as key outbreak drivers. Framing\\nepidemic dynamics as a continuous phase transition, we apply pattern formation\\ntheory to show that the critical eigenvectors governing system stability are\\nshaped by the network's degree distribution. Crucially, by analyzing Laplacian\\neigenvector localization, we uncover a one-to-one correspondence between\\ncommunity infection densities and the entries of the critical eigenvector --\\nrevealing how internal community structure directly shapes global infection\\npatterns. This work provides a systematic framework for understanding and\\npredicting epidemic dynamics in structured populations, while highlighting the\\nfundamental role of community organization.\", \"main_category\": \"physics.soc-ph\", \"categories\": \"physics.soc-ph,nlin.AO\", \"published\": \"2025-04-08T04:02:06Z\"}"}
