{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02751v1\", \"title\": \"Roton Superconductivity from Loop-Current Chern Metal on the Kagome\\n  Lattice\", \"summary\": \"Motivated by the evidence for time-reversal symmetry (TRS) breaking in\\nnonmagnetic kagome metals AV3Sb5, a novel electronic order of persistent\\norbital loop-current (LC) has been proposed for the observed charge density\\nwave (CDW) state. The LC order and its impact on the succeeding superconducting\\n(SC) state are central to the new physics of the kagome materials. Here, we\\nshow that the LC order fundamentally changes the nature of the pairing\\ninstability and the SC state, leading to an extraordinary topological\\nsuperconductor, dubbed as a roton superconductor. In a single-orbital model on\\nthe kagome lattice near van Hove filling, the LC CDW is a Chern metal,\\nrealizable in concrete models, with a partially filled Chern band hosting three\\nChern Fermi pockets (CFPs). We show that Cooper pairing of quasiparticles on\\nthe CFPs is described by three SC components coupled by complex Josephson\\ncouplings due to LC. The pairing instability is determined by the eigenvalues\\nof the complex representation of the cubic group. We show that the Josephson\\nphase is controlled by the discrete quantum geometry associated with the\\nsublattice permutation group. A small LC can produce a large Josephson phase\\nthat drives the leading SC instability to a roton superconductor, where the\\ninternal phases of the three SC components are locked at 120^\\\\circ and loop\\nsupercurrents circulate around an emergent vortex-antivortex lattice with pair\\ndensity modulations. We demonstrate by self-consistent calculations the\\nproperties of the roton superconductor and make theoretical predictions related\\nto the recent experimental evidence for an exotic SC state in CsV3Sb5\\nexhibiting TRS breaking, anisotropic SC gap, pair density wave modulations, and\\ncharge-6e flux quantization. These findings are also relevant for the interplay\\nbetween the orbital-driven anomalous Hall and SC states in other systems such\\nas the moire structures.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el,cond-mat.supr-con\", \"published\": \"2025-04-03T16:43:02Z\"}"}
