{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02399v1\", \"title\": \"Bayesian eco-evolutionary game dynamics\", \"summary\": \"The symbiotic relationship between the frameworks of classical game theory\\nand evolutionary game theory is well-established. However, evolutionary game\\ntheorists have mostly tapped into the classical game of complete information\\nwhere players are completely informed of all other players' payoffs. Of late,\\nthere is a surge of interest in eco-evolutionary interactions where the\\nenvironment's state is changed by the players' actions which, in turn, are\\ninfluenced by the changing environment. However, in real life, the information\\nabout the true environmental state must pass through some noisy channel (like\\nusually imperfect sensory apparatus of the players) before it is perceived by\\nthe players: The players naturally are prone to sometimes perceive the true\\nstate erroneously. Given the uncertain perceived environment, the players may\\nadopt bet-hedging kind of strategies in which they play different actions in\\ndifferent perceptions. In a population of such ill-informed players, a player\\nwould be confused about the information state of her opponent, and an\\nincomplete information situation akin to a Bayesian game surfaces. In short, we\\ncontemplate possibility of natural emergence of symbiotic relationship between\\nthe frameworks of Bayesian games and eco-evolutionary games when the players\\nare equipped with inefficient sensory apparatus. Herein, we illustrate this\\nconnection using a setup of infinitely large, well-mixed population of players\\nequipped with two actions for exploiting a resource (the environment) at two\\ndifferent rates so that the resource state evolves accordingly. The state of\\nthe resource impacts every player's decision of playing particular action. We\\ninvestigate continuous state environment in the presence of a Gaussian noisy\\nchannel. Employing the formalism of replicator dynamics, we find that noisy\\ninformation can be effective in preventing resource from going extinct.\", \"main_category\": \"q-bio.PE\", \"categories\": \"q-bio.PE,econ.TH,nlin.CD,physics.bio-ph\", \"published\": \"2025-04-03T08:47:18Z\"}"}
