{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01768v1\", \"title\": \"Updating the Ephemeris and Physical Properties of Five Long-period\\n  Transiting Exoplanets Using TESS and CHEOPS\", \"summary\": \"The transiting long-period exoplanets are the most interesting follow-up\\ntargets for the next-generation instruments, using the most sophisticated\\nobservational techniques. However, the scarcity in their transit events often\\nleads to larger uncertainties in their known ephemeris, also resulting in\\nlarger biases in their known physical properties in many cases. In this work, I\\nhave used the newer publicly available observations from TESS and CHEOPS for\\nfive very interesting long-period transiting exoplanets, i.e., HD95338 b,\\nTOI-2134 c, K2-290 c, TOI-1898 b, and TOI-813 b, combined with the previously\\nreported observations, to reanalyze their transit properties and estimate the\\nupdated ephemeris. The analyses also incorporated a critical noise treatment\\nalgorithm, which uses well-tested techniques such as wavelet denoising and\\nGaussian process regression, to effectively reduce the impact of various noise\\ncomponents present in the lightcurves on the estimated parameters. The study\\nhas resulted in a more precise estimation of ephemeris for all the targets,\\nwith the precision in the estimated periods being better than 5 seconds, except\\nfor TOI-813 b, for which the precision in the estimated period is better than\\n21 seconds. The other transit parameters also got updated, with statistically\\nsignificant improvements seen in most of the cases, the major notable\\nimprovements being in the estimated value of the impact parameter of TOI-1898\\nb, the orbital semi-major axis of TOI-2134 c, and the radius of HD95338 b.\\nAlthough long-period exoplanets are expected to show more significant transit\\ntiming variations in the presence of other undetected planetary mass objects,\\nno such variations were recorded for these targets.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-02T14:23:54Z\"}"}
