{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01569v1\", \"title\": \"An advanced pulse-avalanche stochastic model of long gamma-ray burst\\n  light curves\", \"summary\": \"A unified explanation of the variety of long-duration gamma-ray burst (GRB)\\nlight curves (LCs) is essential for identifying the dissipation mechanism and\\npossibly the nature of their central engines. In the past, a model was proposed\\nto describe GRB LCs as the outcome of a stochastic pulse avalanche process,\\npossibly originating from a turbulent regime, and it was tested by comparing\\naverage temporal properties of simulated and real LCs. Recently, we revived\\nthis model and optimised its parameters using a genetic algorithm (GA), a\\nmachine-learning-based approach. Our findings suggested that GRB inner engines\\nmay operate near a critical regime. Here we present an advanced version of the\\nmodel, which allows us to constrain the peak flux distribution of individual\\npulses, and evaluate its performance on a new dataset of GRBs observed by the\\nFermi Gamma-ray Burst Monitor (GBM). After introducing new model parameters and\\na further comparison metric, that is the observed signal-to-noise (S/N)\\ndistribution, we test the new model on three complementary datasets:\\nCGRO/BATSE, Swift/BAT, and Fermi/GBM. As in our previous work, the model\\nparameters are optimised using a GA. The updated sets of parameters achieve a\\nfurther reduction in loss compared to both the original model and our earlier\\noptimisation. The different values of the parameters across the datasets are\\nshown to originate from the different energy passbands, effective areas,\\ntrigger algorithms, and, ultimately, different GRB populations of the three\\nexperiments. Our results further underpin the stochastic and avalanche\\ncharacter of the dissipation process behind long GRB prompt emission, with an\\nemphasis on the near-critical behaviour, and establish this new model as a\\nreliable tool for generating realistic GRB LCs as they would be seen with\\nfuture experiments.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-02T10:12:44Z\"}"}
