{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07499v1\", \"title\": \"Digital quantum simulation of the Su-Schrieffer-Heeger model using a\\n  parameterized quantum circuit\", \"summary\": \"We perform digital quantum simulations of the noninteracting\\nSu-Schrieffer-Heeger (SSH) model using a parameterized quantum circuit. The\\ncircuit comprises two main components: the first prepares the initial state\\nfrom the product state $|0\\\\rangle^{\\\\otimes L}$, where $L$ is the system size;\\nthe second consists of $M$ layers of brick-wall unitaries simulating time\\nevolution. The evolution times, encoded as the rotation angles of quantum gates\\nin the second part, are optimized variationally to minimize the energy. The SSH\\nmodel exhibits two distinct topological phases, depending on the relative\\nstrengths of inter- and intra-cell hopping amplitudes. We investigate the\\nevolution of the energy, entanglement entropy, and mutual information towards\\ntopologically trivial and nontrivial ground states. Our results find the\\nfollows: (i) When the initial and target ground states belong to the same\\ntopological phase, the variational energy decreases exponentially, the\\nentanglement entropy quickly saturates in a system-size-independent manner, and\\nthe mutual information remains spatially localized, as the number of layers\\nincreases. (ii) When the initial and target ground states belong to different\\ntopological phases, the variational energy decreases polynomially, the\\nentanglement entropy initially grows logarithmically before decreasing, and the\\nmutual information spreads ballistically across the entire system, with\\nincreasing the number of layers. Furthermore, by calculating the polarization,\\nwe identify a topological phase transition occurring at an intermediate circuit\\nlayer when the initial and final target states lie in different topological\\ncharacters. Finally, we experimentally confirm this topological phase\\ntransition in an 18-site system using 19 qubits on a trapped-ion quantum\\ncomputer provided by Quantinuum.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-10T06:54:10Z\"}"}
