{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01495v1\", \"title\": \"Are Autonomous Web Agents Good Testers?\", \"summary\": \"Despite advances in automated testing, manual testing remains prevalent due\\nto the high maintenance demands associated with test script fragility-scripts\\noften break with minor changes in application structure. Recent developments in\\nLarge Language Models (LLMs) offer a potential alternative by powering\\nAutonomous Web Agents (AWAs) that can autonomously interact with applications.\\nThese agents may serve as Autonomous Test Agents (ATAs), potentially reducing\\nthe need for maintenance-heavy automated scripts by utilising natural language\\ninstructions similar to those used by human testers. This paper investigates\\nthe feasibility of adapting AWAs for natural language test case execution and\\nhow to evaluate them. We contribute with (1) a benchmark of three offline web\\napplications, and a suite of 113 manual test cases, split between passing and\\nfailing cases, to evaluate and compare ATAs performance, (2) SeeAct-ATA and\\npinATA, two open-source ATA implementations capable of executing test steps,\\nverifying assertions and giving verdicts, and (3) comparative experiments using\\nour benchmark that quantifies our ATAs effectiveness. Finally we also proceed\\nto a qualitative evaluation to identify the limitations of PinATA, our best\\nperforming implementation. Our findings reveal that our simple implementation,\\nSeeAct-ATA, does not perform well compared to our more advanced PinATA\\nimplementation when executing test cases (50% performance improvement).\\nHowever, while PinATA obtains around 60% of correct verdict and up to a\\npromising 94% specificity, we identify several limitations that need to be\\naddressed to develop more resilient and reliable ATAs, paving the way for\\nrobust, low maintenance test automation. CCS Concepts: $\\\\bullet$ Software and\\nits engineering $\\\\rightarrow$ Software testing and debugging.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-02T08:48:01Z\"}"}
