{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02511v1\", \"title\": \"Analytical Discovery of Manifold with Machine Learning\", \"summary\": \"Understanding low-dimensional structures within high-dimensional data is\\ncrucial for visualization, interpretation, and denoising in complex datasets.\\nDespite the advancements in manifold learning techniques, key challenges-such\\nas limited global insight and the lack of interpretable analytical\\ndescriptions-remain unresolved. In this work, we introduce a novel framework,\\nGAMLA (Global Analytical Manifold Learning using Auto-encoding). GAMLA employs\\na two-round training process within an auto-encoding framework to derive both\\ncharacter and complementary representations for the underlying manifold. With\\nthe character representation, the manifold is represented by a parametric\\nfunction which unfold the manifold to provide a global coordinate. While with\\nthe complementary representation, an approximate explicit manifold description\\nis developed, offering a global and analytical representation of smooth\\nmanifolds underlying high-dimensional datasets. This enables the analytical\\nderivation of geometric properties such as curvature and normal vectors.\\nMoreover, we find the two representations together decompose the whole latent\\nspace and can thus characterize the local spatial structure surrounding the\\nmanifold, proving particularly effective in anomaly detection and\\ncategorization. Through extensive experiments on benchmark datasets and\\nreal-world applications, GAMLA demonstrates its ability to achieve\\ncomputational efficiency and interpretability while providing precise geometric\\nand structural insights. This framework bridges the gap between data-driven\\nmanifold learning and analytical geometry, presenting a versatile tool for\\nexploring the intrinsic properties of complex data sets.\", \"main_category\": \"stat.ML\", \"categories\": \"stat.ML,cs.LG\", \"published\": \"2025-04-03T11:53:00Z\"}"}
