{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05293v1\", \"title\": \"A BLE and UWB Beacon-Assist Framework for Multiuser Augmented Reality\\n  Synchronization Across Multiple Devices in Shared Environments\", \"summary\": \"The challenge to synchronize augmented reality (AR) across sessions/devices\\nhas been solved by relying solely on vision-feature mapping, which is\\nsuboptimal in scaling workable space and flaws under visual changes in\\nsurroundings. This study implemented AR synchronization solutions utilizing\\nlocation beacon technology, namely Bluetooth Low Energy (BLE) and\\nUltra-Wideband (UWB), to discourse scalability issues and inconsistencies in\\nthe existing AR system. The framework is bifurcated into two approaches:\\nBLE-assist and UWB-assist AR synchronization. The BLE-assist method utilizes\\niBeacon technology for room context recognition, integrating with Apple's ARKit\\nARWorldMap and Google's ARCore Cloud Anchors. The UWB-assist solution employs\\nprecise beacon ranging capabilities fusion with the device's azimuth to\\nestablish fixed spatial reference in AR across sessions/devices. Comparative\\nevaluations show that the UWB-assist approach outperforms the BLE-assist\\napproach in reliability across environmental variations, as it always\\nsuccessfully resolves virtual anchors with a near-constant latency average at\\n25 seconds, regardless of the physical setting changes. Conversely, the\\nBLE-assist implementation tends to be more accurate in resolving virtual\\nanchors with a mean of 0.02 metres in position error and within 0.03 radian in\\norientation error. In the UWB-assist approach, computed fixed spatial\\nreferences have an average disparity of 0.04 metres and 0.11 radians in pose.\\nThe UWB-assist approach is ideal for scenarios requiring consistently\\nsuccessful localization with acceptable accuracy. In contrast, the BLE-assist\\napproach is more suitable when demanding finer precision in virtual anchor\\nposes with the performance tradeoffs when the surroundings are altered, such as\\nfor destinated short-lived AR sessions.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-07T17:47:49Z\"}"}
