{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24269v1\", \"title\": \"A direct detection method of galaxy intrinsic ellipticity-gravitational\\n  shear correlation in non-linear regimes using self-calibration\", \"summary\": \"Intrinsic alignment (IA) of galaxies is a challenging source of contamination\\nin the Cosmic shear (GG) signals. The galaxy intrinsic\\nellipticity-gravitational shear (IG) correlation is generally the most dominant\\ncomponent of such contamination for cross-correlating redshift bins. The\\nself-calibration (SC) method is one of the most effective techniques to\\nmitigate such contamination from the GG signal. In a photometric survey, the SC\\nmethod first extracts the galaxy number density-galaxy intrinsic ellipticity\\n(gI) correlation from the observed galaxy-galaxy lensing correlation using the\\nredshift dependence of lens-source pairs. The IG correlation is computed\\nthrough a scaling relation using the gI correlation and other lensing\\nobservables. We extend the SC method beyond the linear regime by modifying its\\nscaling relation which can account for the non-linear galaxy bias model and\\nvarious IA models. In this study, we provide a framework to detect the IG\\ncorrelation for the redshift bins for source galaxies for the proposed year 1\\nsurvey of the Rubin Legacy Survey of Space and Time (LSST Y1). We tested the\\nmethod for the tidal alignment and tidal torquing (TATT) model of IA and we\\nfound that the scaling relation is accurate within 10$\\\\%$ and 20$\\\\%$ for\\ncross-correlating and auto-correlating redshift bins, respectively. Hence the\\nsuppression of IG contamination can be accomplished with a factor of 10 and 5,\\nfor cross-correlating and auto-correlating redshift bins, respectively. We\\ntested the method's robustness and found that the suppression of IG\\ncontamination by a factor of 5 is still achievable for all combinations of\\ncross-correlating bins even with the inclusion of a moderate amount of\\nuncertainties on IA and bias parameters, respectively. [Abridged]\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-03-31T16:15:37Z\"}"}
