{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01835v1\", \"title\": \"Autonomous optical navigation for DESTINY+: Enhancing misalignment\\n  robustness in flyby observations with a rotating telescope\", \"summary\": \"DESTINY+ is an upcoming JAXA Epsilon medium-class mission to flyby multiple\\nasteroids including Phaethon. As an asteroid flyby observation instrument, a\\ntelescope mechanically capable of single-axis rotation, named TCAP, is mounted\\non the spacecraft to track and observe the target asteroids during flyby. As in\\npast flyby missions utilizing rotating telescopes, TCAP is also used as a\\nnavigation camera for autonomous optical navigation during the closest-approach\\nphase. To mitigate the degradation of the navigation accuracy, past missions\\nperformed calibration of the navigation camera's alignment before starting\\noptical navigation. However, such calibration requires significant operational\\ntime to complete and imposes constraints on the operation sequence. From the\\nabove background, the DESTINY+ team has studied the possibility of reducing\\noperational costs by allowing TCAP alignment errors to remain. This paper\\ndescribes an autonomous optical navigation algorithm robust to the misalignment\\nof rotating telescopes, proposed in this context. In the proposed method, the\\nmisalignment of the telescope is estimated simultaneously with the spacecraft's\\norbit relative to the flyby target. To deal with the nonlinearity between the\\nmisalignment and the observation value, the proposed method utilizes the\\nunscented Kalman filter, instead of the extended Kalman filter widely used in\\npast studies. The proposed method was evaluated with numerical simulations on a\\nPC and with hardware-in-the-loop simulation, taking the Phaethon flyby in the\\nDESTINY+ mission as an example. The validation results suggest that the\\nproposed method can mitigate the misalignment-induced degradation of the\\noptical navigation accuracy with reasonable computational costs suited for\\nonboard computers.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM,astro-ph.EP,cs.LG\", \"published\": \"2025-04-02T15:42:37Z\"}"}
