{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06227v1\", \"title\": \"LExT: Towards Evaluating Trustworthiness of Natural Language\\n  Explanations\", \"summary\": \"As Large Language Models (LLMs) become increasingly integrated into\\nhigh-stakes domains, there have been several approaches proposed toward\\ngenerating natural language explanations. These explanations are crucial for\\nenhancing the interpretability of a model, especially in sensitive domains like\\nhealthcare, where transparency and reliability are key. In light of such\\nexplanations being generated by LLMs and its known concerns, there is a growing\\nneed for robust evaluation frameworks to assess model-generated explanations.\\nNatural Language Generation metrics like BLEU and ROUGE capture syntactic and\\nsemantic accuracies but overlook other crucial aspects such as factual\\naccuracy, consistency, and faithfulness. To address this gap, we propose a\\ngeneral framework for quantifying trustworthiness of natural language\\nexplanations, balancing Plausibility and Faithfulness, to derive a\\ncomprehensive Language Explanation Trustworthiness Score (LExT) (The code and\\nset up to reproduce our experiments are publicly available at\\nhttps://github.com/cerai-iitm/LExT). Applying our domain-agnostic framework to\\nthe healthcare domain using public medical datasets, we evaluate six models,\\nincluding domain-specific and general-purpose models. Our findings demonstrate\\nsignificant differences in their ability to generate trustworthy explanations.\\nOn comparing these explanations, we make interesting observations such as\\ninconsistencies in Faithfulness demonstrated by general-purpose models and\\ntheir tendency to outperform domain-specific fine-tuned models. This work\\nfurther highlights the importance of using a tailored evaluation framework to\\nassess natural language explanations in sensitive fields, providing a\\nfoundation for improving the trustworthiness and transparency of language\\nmodels in healthcare and beyond.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-04-08T17:16:52Z\"}"}
