{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06846v1\", \"title\": \"Solid-State Maser with Microwatt Output Power at Moderate Cryogenic\\n  Temperatures\", \"summary\": \"Solid-state masers are uniquely positioned to serve as ultra-low phase noise\\nmicrowave sources due to their exceptionally low noise temperatures. However,\\ntheir practical application has been historically limited by low output power\\nand the need for deep cryogenic cooling. In this work, we present a novel\\ndesign for a continuous-wave diamond-based maser oscillator operating at about\\n14.5 GHz and moderate cryogenic temperatures (about 180 K), achieving output\\npower levels exceeding -30 dBm (1 microW). This performance represents a\\ntwo-orders-of-magnitude improvement over previous diamond or ruby-based maser\\noscillators.Our system integrates a high-Q (about 2460) compact metallic\\nmicrowave cavity with optically pumped (111)-oriented NV-rich diamond crystals.\\nThe cavity supports efficient light coupling and thermal dissipation, enabling\\nsustained high-power optical excitation (>1 W) using cost-effective green LEDs.\\nWe demonstrate stable maser operation with good spectral quality and validate\\nits output through both frequency- and time-domain analysis with phase noise\\ndata when operated in \\\"free running\\\" mode. Additionally, we provide phase noise\\nestimations based on Leeson's model and show that, when coupled to a high-Q\\nexternal resonator, such masers could approach thermally limited phase noise\\nlevels. These predictions suggest strong potential for diamond masers to\\noutperform traditional ruby-based or similar maser systems, especially given\\ntheir ability to operate at higher temperatures using rugged, He-free Stirling\\ncoolers. Despite current limitations related to frequency stability and jitter,\\nthis work establishes diamond-based masers as promising candidates for\\nnext-generation ultra-low phase noise microwave oscillators. Further\\nengineering optimization - particularly in field stability, thermal regulation,\\nand feedback locking - will be key to unlocking their full potential.\", \"main_category\": \"cond-mat.other\", \"categories\": \"cond-mat.other\", \"published\": \"2025-04-09T13:02:43Z\"}"}
