{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02382v1\", \"title\": \"Benchmark of Segmentation Techniques for Pelvic Fracture in CT and\\n  X-ray: Summary of the PENGWIN 2024 Challenge\", \"summary\": \"The segmentation of pelvic fracture fragments in CT and X-ray images is\\ncrucial for trauma diagnosis, surgical planning, and intraoperative guidance.\\nHowever, accurately and efficiently delineating the bone fragments remains a\\nsignificant challenge due to complex anatomy and imaging limitations. The\\nPENGWIN challenge, organized as a MICCAI 2024 satellite event, aimed to advance\\nautomated fracture segmentation by benchmarking state-of-the-art algorithms on\\nthese complex tasks. A diverse dataset of 150 CT scans was collected from\\nmultiple clinical centers, and a large set of simulated X-ray images was\\ngenerated using the DeepDRR method. Final submissions from 16 teams worldwide\\nwere evaluated under a rigorous multi-metric testing scheme. The top-performing\\nCT algorithm achieved an average fragment-wise intersection over union (IoU) of\\n0.930, demonstrating satisfactory accuracy. However, in the X-ray task, the\\nbest algorithm attained an IoU of 0.774, highlighting the greater challenges\\nposed by overlapping anatomical structures. Beyond the quantitative evaluation,\\nthe challenge revealed methodological diversity in algorithm design. Variations\\nin instance representation, such as primary-secondary classification versus\\nboundary-core separation, led to differing segmentation strategies. Despite\\npromising results, the challenge also exposed inherent uncertainties in\\nfragment definition, particularly in cases of incomplete fractures. These\\nfindings suggest that interactive segmentation approaches, integrating human\\ndecision-making with task-relevant information, may be essential for improving\\nmodel reliability and clinical applicability.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.AI,cs.CV\", \"published\": \"2025-04-03T08:19:36Z\"}"}
