{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01728v1\", \"title\": \"Linear Time Iterative Decoders for Hypergraph-Product and Lifted-Product\\n  Codes\", \"summary\": \"Quantum low-density parity-check (QLDPC) codes with asymptotically non-zero\\nrates are prominent candidates for achieving fault-tolerant quantum\\ncomputation, primarily due to their syndrome-measurement circuit's low\\noperational depth. Numerous studies advocate for the necessity of fast decoders\\nto fully harness the capabilities of QLDPC codes, thus driving the focus\\ntowards designing low-complexity iterative decoders. However, empirical\\ninvestigations indicate that such iterative decoders are susceptible to having\\na high error floor while decoding QLDPC codes. The main objective of this paper\\nis to analyze the decoding failures of the \\\\emph{hypergraph-product} and\\n\\\\emph{lifted-product} codes and to design decoders that mitigate these\\nfailures, thus achieving a reduced error floor. The suboptimal performance of\\nthese codes can predominantly be ascribed to two structural phenomena: (1)\\nstabilizer-induced trapping sets, which are subgraphs formed by stabilizers,\\nand (2) classical trapping sets, which originate from the classical codes\\nutilized in the construction of hypergraph-product and lifted-product codes.\\nThe dynamics of stabilizer-induced trapping sets is examined and a\\nstraightforward modification of iterative decoders is proposed to circumvent\\nthese trapping sets. Moreover, this work proposes a systematic methodology for\\ndesigning decoders that can circumvent classical trapping sets in both\\nhypergraph product and lifted product codes, from decoders capable of avoiding\\ntheir trapping set in the parent classical LDPC code. When decoders that can\\navoid stabilizer-induced trapping sets are run in parallel with those that can\\nmitigate the effect of classical TS, the logical error rate improves\\nsignificantly in the error-floor region.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT,quant-ph\", \"published\": \"2025-04-02T13:37:29Z\"}"}
