{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06586v1\", \"title\": \"Diversity-aware Dual-promotion Poisoning Attack on Sequential\\n  Recommendation\", \"summary\": \"Sequential recommender systems (SRSs) excel in capturing users' dynamic\\ninterests, thus playing a key role in various industrial applications. The\\npopularity of SRSs has also driven emerging research on their security aspects,\\nwhere data poisoning attack for targeted item promotion is a typical example.\\nExisting attack mechanisms primarily focus on increasing the ranks of target\\nitems in the recommendation list by injecting carefully crafted interactions\\n(i.e., poisoning sequences), which comes at the cost of demoting users' real\\npreferences. Consequently, noticeable recommendation accuracy drops are\\nobserved, restricting the stealthiness of the attack. Additionally, the\\ngenerated poisoning sequences are prone to substantial repetition of target\\nitems, which is a result of the unitary objective of boosting their overall\\nexposure and lack of effective diversity regularizations. Such homogeneity not\\nonly compromises the authenticity of these sequences, but also limits the\\nattack effectiveness, as it ignores the opportunity to establish sequential\\ndependencies between the target and many more items in the SRS. To address the\\nissues outlined, we propose a Diversity-aware Dual-promotion Sequential\\nPoisoning attack method named DDSP for SRSs. Specifically, by theoretically\\nrevealing the conflict between recommendation and existing attack objectives,\\nwe design a revamped attack objective that promotes the target item while\\nmaintaining the relevance of preferred items in a user's ranking list. We\\nfurther develop a diversity-aware, auto-regressive poisoning sequence\\ngenerator, where a re-ranking method is in place to sequentially pick the\\noptimal items by integrating diversity constraints.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-04-09T05:28:41Z\"}"}
