{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21712v1\", \"title\": \"Complex Pressure Node Formation and Resonances Induced by Scatterers in\\n  a Standing-Wave Acoustic Cavity\", \"summary\": \"Acoustic pressure nodes in acoustophoretic devices are crucial for\\napplications in tissue engineering, cell analysis, and particle trapping.\\nTypically, a single primary node forms at the half-wavelength resonance\\ncondition, while its shape and position are constrained by the dimensions of\\nthe channel. The generation of additional nodes, along with control over their\\npositions and shapes, is highly desirable in biomedical applications and could\\nsignificantly enhance particle manipulation capabilities. To explore this\\npotential, we numerically demonstrate the formation of additional,\\ncomplex-shaped, nodes alongside the primary one, by a circular scatterer within\\na rectangular cavity. We identify three distinct types: ring, protuberant, and\\ncrescent nodes, whose formation depends on the size of the scatterer, its\\nplacement in the middle of the channel, and its corresponding resonant\\nfrequency. The key mechanism behind this formation is the enhancement of\\ninternal reflections, increasing destructive interference to promote node\\ngeneration. To achieve this, we employ three key concepts: using a low-aspect\\nratio channel, positioning a rigid circular scatterer in the middle of the\\nchannel, and modeling all surfaces as perfect reflectors. Furthermore, we\\nanalyze the impact of the scatterer on acoustic pressure and quality factor,\\nwhich is defined as the ratio of stored acoustic energy to damped acoustic\\nenergy per cycle. We show that additional nodes emerge in the presence of a\\nscatterer, but they come at the cost of reduced acoustic pressure and energy in\\nthe channel. In summary, this study provides information on generating complex\\nnodes in a standing wave acoustic cavity at the fundamental frequency, which\\nhas numerous applications for particle manipulation in acoustofluidic devices.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-03-27T17:24:41Z\"}"}
