{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02218v1\", \"title\": \"From short-sighted to far-sighted: A comparative study of recursive\\n  machine learning approaches for open quantum systems\", \"summary\": \"Accurately modeling open quantum system dynamics is crucial for advancing\\nquantum technologies, yet traditional methods struggle to balance accuracy and\\nefficiency. Machine learning (ML) provides a promising alternative,\\nparticularly through recursive models that predict system evolution based on\\npast history. While these models have shown success in predicting single\\nobservables, their effectiveness in more complex tasks, such as forecasting the\\nfull reduced density matrix (RDM), remains unclear. We extend history-based\\nrecursive ML approaches to complex quantum systems, comparing four\\nphysics-informed neural network (PINN) architectures: (i) single-RDM-predicting\\nPINN (SR-PINN), (ii) SR-PINN with simulation parameters (PSR-PINN), (iii)\\nmulti-RDMs-predicting PINN (MR-PINN), and (iv) MR-PINN with simulation\\nparameters (PMR-PINN). These models are applied to the spin-boson (SB) model\\nand the Fenna-Matthews-Olson (FMO) complex. Our results show that SR-PINN and\\nPSR-PINN, constrained by a narrow history window, fail to capture complex\\nquantum evolution, leading to unstable long-term predictions, especially in\\nnonlinear and highly correlated dynamics. In contrast, MR-PINN and PMR-PINN\\nimprove accuracy by extending the forecast horizon, incorporating long-range\\ncorrelations, and reducing error propagation. Surprisingly, explicitly\\nincluding simulation parameters such as temperature and reorganization energy\\nin PSR-PINN and PMR-PINN does not consistently enhance accuracy and can even\\nreduce performance, suggesting that these effects are already encoded in the\\nRDM evolution. These findings highlight the limitations of short-sighted\\nrecursive forecasting and demonstrate the superior stability and accuracy of\\nfar-sighted approaches for long-term predictions.\", \"main_category\": \"physics.chem-ph\", \"categories\": \"physics.chem-ph\", \"published\": \"2025-04-03T02:14:47Z\"}"}
