{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07074v1\", \"title\": \"The Lyman-alpha and Continuum Origins Survey II: the uneventful journey\\n  of escaping Ly$\\u03b1$ and ionizing radiation through the neutral ISM and CGM\\n  of galaxies\", \"summary\": \"One of the current challenges in galaxy evolution studies is to establish the\\nmechanisms that govern the escape of ionizing radiation from galaxies. In this\\nwork, we investigate the connection between Lyman Continuum (LyC) escape and\\nthe conditions of the Circumgalactic Medium (CGM), as probed by Ly$\\\\alpha$\\nhalos (LAHs) in emission. We use Ly$\\\\alpha$ and UV continuum imaging data from\\nthe Lyman alpha and Continuum Origins Survey (LaCOS), targeting 42 nearby ($z\\n\\\\simeq 0.3$), star-forming galaxies with LyC observations (escape fractions of\\n$f_{\\\\rm esc}^{\\\\rm LyC} \\\\simeq 0.01-0.49$). LaCOS galaxies show extended\\nLy$\\\\alpha$ emission ubiquitously, with LyC emitters (LCEs) having more compact\\nLy$\\\\alpha$ morphologies relative to the UV size than non-LCEs, and Ly$\\\\alpha$\\nspatial offsets that do not exceed the extent of the UV continuum. We model the\\ndiffuse LAHs using a combined Sersic plus exponential 2D profile, and find that\\nthe characteristic scale length of the Ly$\\\\alpha$ is ten times the scale length\\nof the UV, on average. We unveil a tight anti-correlation between $f_{\\\\rm\\nesc}^{\\\\rm LyC}$ and the Ly$\\\\alpha$ Halo Fraction (HF, or contribution of the\\nhalo to the total Ly$\\\\alpha$ luminosity), that we propose as a new LyC\\nindicator. Our observations also show that the HF scales positively with the\\nneutral gas in the ISM, revealing a picture in which Ly$\\\\alpha$ and LyC photons\\nin LCEs emerge through clear sight-lines directly from the central starbursts\\nand, in the case of Ly$\\\\alpha$, minimizing the number of scattering\\ninteractions in the CGM. The properties of LAHs in LaCOS resemble those of LAHs\\nat $z \\\\geq 3$, suggesting a lack of evolution in the $f_{\\\\rm esc}^{\\\\rm LyC}$\\npredictors that rely on the spatial properties of Ly$\\\\alpha$, and ensuring the\\napplicability of these indicators to observations of high-redshift galaxies.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-09T17:46:13Z\"}"}
