{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02401v1\", \"title\": \"Comparing the Sun to Sun-like stars. On the importance of addressing\\n  faculae/spot domination\", \"summary\": \"Whether the Sun is an ordinary G-type star is still an open scientific\\nquestion. Stellar surveys by Kepler and TESS, however, revealed that Sun-like\\nstars tend to show much stronger flare activity than the Sun. This study aims\\nto reassess observed flare and spot activity of Sun-like Kepler stars by\\nfine-tuning the criteria for a more robust definition of Sun-like conditions\\nand better comparability between the current Sun and Sun-like stars. We update\\none of the recent stellar Sun-like star samples by applying new empirical\\nstellar relations between the starspot size and the effective stellar\\ntemperature to derive more reliable starspot group sizes. From the 265\\nsolar-type stars, we could select 48 stars supporting the Kepler 30-minute\\ncadence light curves. These were analyzed by implementing the gradient of the\\npower spectra method to distinguish between spot- and faculae-dominated stars.\\nWe employed the $\\\\alpha$-factor to quantify the area ratio of bright and dark\\nfeatures on the stellar surface. We were able to group the 48 stars as being\\nspot- or faculae-dominated, revealing a preferential distribution of the Kepler\\nSun-like stars towards the spot-dominated (44 stars) and transitional (four\\nstars) regimes. As the current Sun is faculae-dominated, only the transitional\\nstars were utilized for further evaluation. Additionally, accounting for\\ncomparability in stellar mass, radius, and rotation period, we show that only\\none of the utilized 265 Sun-like stars in the Kepler sample (i.e., KIC\\n11599385) allows for direct comparison to the current Sun. We further show that\\nthe single flare observed on KIC 11599385 falls right within the flare energy\\nrange estimated for the AD774/775 event observed in the cosmogenic radionuclide\\narchives of $^{10}$Be, $^{14}$C, and $^{36}$Cl.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-03T08:51:00Z\"}"}
