{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21773v1\", \"title\": \"Simulating quantum circuits with restricted quantum computers\", \"summary\": \"It is one of the most fundamental objectives in quantum information science\\nto understand the boundary between the computational power of classical and\\nquantum computers. One possible avenue to explore this boundary is to identify\\nclasses of quantum circuits that can be efficiently simulated on a classical\\ncomputer. Instead of simulating a general quantum circuit with a classical\\ndevice, new schemes have recently emerged to simulate them on a quantum device\\nthat is restricted in some manner. As such, these techniques allow us to study\\nhow the restrictions impact the computational power of the device. One such\\ntechnique is called quasiprobability simulation (QPS) and it estimates the\\nresult of a quantum circuit with a Monte Carlo procedure that randomly replaces\\ncircuit elements with ones that can be executed on the restricted quantum\\ndevice.\\n  The main focus of this thesis is dedicated to the QPS-based simulation of\\nnonlocal quantum computation using local quantum operations. On the practical\\nside, this enables the simulation of large quantum circuits using multiple\\nsmaller quantum devices - a procedure that is sometimes called circuit\\nknitting. We uncover a rich mathematical formalism with many connections to the\\nresource theory of entanglement. We characterize the optimal simulation\\noverhead for a broad range of practically relevant nonlocal states and channels\\nand we explicitly provide achieving protocols. Moreover, we also investigate\\nthe utility of classical communication between the local parties. Our results\\naddress both the single-shot and asymptotic regime.\\n  We frame QPS in a quantum resource theoretic framework, which highlights\\nsimilarities that arise in the different instantiations of the technique.\\nFurthermore, we study the importance of classical side information in the QPS\\nprocedure and how it impacts the overhead and expressibility of QPS.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-03-27T17:59:45Z\"}"}
