{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04982v1\", \"title\": \"Transforming Future Data Center Operations and Management via Physical\\n  AI\", \"summary\": \"Data centers (DCs) as mission-critical infrastructures are pivotal in\\npowering the growth of artificial intelligence (AI) and the digital economy.\\nThe evolution from Internet DC to AI DC has introduced new challenges in\\noperating and managing data centers for improved business resilience and\\nreduced total cost of ownership. As a result, new paradigms, beyond the\\ntraditional approaches based on best practices, must be in order for future\\ndata centers. In this research, we propose and develop a novel Physical AI\\n(PhyAI) framework for advancing DC operations and management. Our system\\nleverages the emerging capabilities of state-of-the-art industrial products and\\nour in-house research and development. Specifically, it presents three core\\nmodules, namely: 1) an industry-grade in-house simulation engine to simulate DC\\noperations in a highly accurate manner, 2) an AI engine built upon NVIDIA\\nPhysicsNemo for the training and evaluation of physics-informed machine\\nlearning (PIML) models, and 3) a digital twin platform built upon NVIDIA\\nOmniverse for our proposed 5-tier digital twin framework. This system presents\\na scalable and adaptable solution to digitalize, optimize, and automate future\\ndata center operations and management, by enabling real-time digital twins for\\nfuture data centers. To illustrate its effectiveness, we present a compelling\\ncase study on building a surrogate model for predicting the thermal and airflow\\nprofiles of a large-scale DC in a real-time manner. Our results demonstrate its\\nsuperior performance over traditional time-consuming Computational Fluid\\nDynamics/Heat Transfer (CFD/HT) simulation, with a median absolute temperature\\nprediction error of 0.18 {\\\\deg}C. This emerging approach would open doors to\\nseveral potential research directions for advancing Physical AI in future DC\\noperations.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.DC\", \"published\": \"2025-04-07T12:09:22Z\"}"}
