{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02770v1\", \"title\": \"Efficient Algorithms for Cardinality Estimation and Conjunctive Query\\n  Evaluation With Simple Degree Constraints\", \"summary\": \"Cardinality estimation and conjunctive query evaluation are two of the most\\nfundamental problems in database query processing. Recent work proposed,\\nstudied, and implemented a robust and practical information-theoretic\\ncardinality estimation framework. In this framework, the estimator is the\\ncardinality upper bound of a conjunctive query subject to\\n``degree-constraints'', which model a rich set of input data statistics. For\\ngeneral degree constraints, computing this bound is computationally hard.\\nResearchers have naturally sought efficiently computable relaxed upper bounds\\nthat are as tight as possible. The polymatroid bound is the tightest among\\nthose relaxed upper bounds. While it is an open question whether the\\npolymatroid bound can be computed in polynomial-time in general, it is known to\\nbe computable in polynomial-time for some classes of degree constraints.\\n  Our focus is on a common class of degree constraints called simple degree\\nconstraints. Researchers had not previously determined how to compute the\\npolymatroid bound in polynomial time for this class of constraints. Our first\\nmain result is a polynomial time algorithm to compute the polymatroid bound\\ngiven simple degree constraints. Our second main result is a polynomial-time\\nalgorithm to compute a ``proof sequence'' establishing this bound. This proof\\nsequence can then be incorporated in the PANDA-framework to give a faster\\nalgorithm to evaluate a conjunctive query. In addition, we show computational\\nlimitations to extending our results to broader classes of degree constraints.\\nFinally, our technique leads naturally to a new relaxed upper bound called the\\n{\\\\em flow bound}, which is computationally tractable.\", \"main_category\": \"cs.DB\", \"categories\": \"cs.DB,cs.DS\", \"published\": \"2025-04-03T17:06:39Z\"}"}
