{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05052v1\", \"title\": \"Assess Space-Based Solar Power in European-Scale Power System\\n  Decarbonization\", \"summary\": \"Meeting net-zero targets remains formidable as terrestrial renewables grapple\\nwith intermittency and regional variability. Here, we integrate space-based\\nsolar power (SBSP) -- a potential near-constant, orbital solar technology --\\ninto a high-resolution, Europe-wide capacity-expansion and dispatch model to\\nquantify its contribution under net-zero constraints. We examine two advanced\\nSBSP designs: (1) a near-baseload, low Technology Readiness Level (TRL) concept\\n(heliostat-based Representative Design RD1) and (2) a partially intermittent,\\nhigher-TRL concept (planar-based RD2), both drawing on NASA's 2050 cost and\\nperformance projections. Our results show that RD1 can reduce total system\\ncosts by 7--15%, displace up to 80% of intermittent wind and solar, and cut\\nbattery usage by over 70%, if it meets its forecast cost reductions -- though\\nlong-duration storage (e.g., hydrogen) remains essential for seasonal\\nbalancing. By contrast, RD2 is economically unattractive at its projected 2050\\ncosts. Through extensive sensitivity analyses, we identify cost thresholds at\\nwhich SBSP shifts from cost-prohibitive to complementary and ultimately to a\\ndominant baseload technology. Specifically, RD1 becomes complementary at\\nroughly 14x and dominant at 9x the 2050 solar PV capital cost, benefiting from\\nits continuous power generation. Meanwhile, RD2 must achieve even lower cost\\nlevels (9x to be complementary and 6x to dominate) and would rely on\\nshort-duration storage to mitigate its partial intermittency. These findings\\nprovide quantified techno-economic benchmarks and reveal alternative net-zero\\npathways, offering critical guidance for policymakers and industry stakeholders\\nseeking large-scale, centrally coordinated renewable solutions with non- or\\nlow-intermittency.\", \"main_category\": \"physics.soc-ph\", \"categories\": \"physics.soc-ph\", \"published\": \"2025-04-07T13:21:01Z\"}"}
