{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06776v1\", \"title\": \"Photobombing for the Large Interferometer For Exoplanets (LIFE). A new\\n  criterion for target confusion and application to a MIR rotating nulling\\n  interferometer\", \"summary\": \"One of the primary objectives in modern astronomy is to discover and study\\nplanets with characteristics similar to Earth. This pursuit involves analyzing\\nthe spectra of exoplanets and searching for biosignatures. Contamination of\\nspectra by nearby objects (e.g., other planets and moons in the same system) is\\na significant concern and must be addressed for future exo-Earth searching\\nmissions. The aim is to estimate, for habitable planets, the probability of\\nspectral contamination by other planets within the same star system. This\\ninvestigation focuses on the Large Interferometer for Exoplanets (LIFE). Since\\nthe Rayleigh criterion is inapplicable to interferometers such as those\\nproposed for LIFE, we present new criteria based on the principle of parsimony,\\nwhich take into account two types of issues: contamination or blending of point\\nsources, and cancellation of point sources due to destructive interference. We\\ndefine a new spatial resolution metric associated with contamination or\\ncancellation that generalizes to a broader family of observing instruments. In\\nthe current baseline design, LIFE is an X-array architecture nulling\\ninterferometer. Our investigation reveals that its transmission map introduces\\nthe potential for two point sources to appear as one, even if they do not\\nappear in close proximity. We find that LIFE has a spatial resolution\\ncomparable to that of a traditional telescope with a diameter of $D =\\n600\\\\,\\\\text{m}$, observing at $\\\\lambda = 4 \\\\,\\\\mu\\\\text{m}$. Our survey of a star\\nsystem population shows that, out of 73.4 expected habitable planets detected,\\n71.3 are not contaminated on average.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,astro-ph.IM\", \"published\": \"2025-04-09T10:57:20Z\"}"}
