{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07611v1\", \"title\": \"Conditional Conformal Risk Adaptation\", \"summary\": \"Uncertainty quantification is becoming increasingly important in image\\nsegmentation, especially for high-stakes applications like medical imaging.\\nWhile conformal risk control generalizes conformal prediction beyond standard\\nmiscoverage to handle various loss functions such as false negative rate, its\\napplication to segmentation often yields inadequate conditional risk control:\\nsome images experience very high false negative rates while others have\\nnegligibly small ones. We develop Conformal Risk Adaptation (CRA), which\\nintroduces a new score function for creating adaptive prediction sets that\\nsignificantly improve conditional risk control for segmentation tasks. We\\nestablish a novel theoretical framework that demonstrates a fundamental\\nconnection between conformal risk control and conformal prediction through a\\nweighted quantile approach, applicable to any score function. To address the\\nchallenge of poorly calibrated probabilities in segmentation models, we\\nintroduce a specialized probability calibration framework that enhances the\\nreliability of pixel-wise inclusion estimates. Using these calibrated\\nprobabilities, we propose Calibrated Conformal Risk Adaptation (CCRA) and a\\nstratified variant (CCRA-S) that partitions images based on their\\ncharacteristics and applies group-specific thresholds to further enhance\\nconditional risk control. Our experiments on polyp segmentation demonstrate\\nthat all three methods (CRA, CCRA, and CCRA-S) provide valid marginal risk\\ncontrol and deliver more consistent conditional risk control across diverse\\nimages compared to standard approaches, offering a principled approach to\\nuncertainty quantification that is particularly valuable for high-stakes and\\npersonalized segmentation applications.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-10T10:01:06Z\"}"}
