{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06697v1\", \"title\": \"\\\"Sorry for bugging you so much.\\\" Exploring Developers' Behavior Towards\\n  Privacy-Compliant Implementation\", \"summary\": \"While protecting user data is essential, software developers often fail to\\nfulfill privacy requirements. However, the reasons why they struggle with\\nprivacy-compliant implementation remain unclear. Is it due to a lack of\\nknowledge, or is it because of insufficient support? To provide foundational\\ninsights in this field, we conducted a qualitative 5-hour programming study\\nwith 30 professional software developers implementing 3 privacy-sensitive\\nprogramming tasks that were designed with GDPR compliance in mind. To explore\\nif and how developers implement privacy requirements, participants were divided\\ninto 3 groups: control, privacy prompted, and privacy expert-supported. After\\ntask completion, we conducted follow-up interviews. Alarmingly, almost all\\nparticipants submitted non-GDPR-compliant solutions (79/90). In particular,\\nnone of the 3 tasks were solved privacy-compliant by all 30 participants, with\\nthe non-prompted group having the lowest number of 3 out of 30\\nprivacy-compliant solution attempts. Privacy prompting and expert support only\\nslightly improved participants' submissions, with 6/30 and 8/30\\nprivacy-compliant attempts, respectively. In fact, all participants reported\\nsevere issues addressing common privacy requirements such as purpose\\nlimitation, user consent, or data minimization. Counterintuitively, although\\nmost developers exhibited minimal confidence in their solutions, they rarely\\nsought online assistance or contacted the privacy expert, with only 4 out of 10\\nexpert-supported participants explicitly asking for compliance confirmation.\\nInstead, participants often relied on existing implementations and focused on\\nimplementing functionality and security first.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-09T08:59:17Z\"}"}
