{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01434v1\", \"title\": \"Contribution of ALEGRO to the Update of the European Strategy on\\n  Particle Physics\", \"summary\": \"Advanced and novel accelerators (ANAs), driven a by laser pulse or a\\nrelativistic particle bunch, have made remarkable progress over the last\\ndecades. They accelerated electrons by 10GeV in 30cm (laser driven) and by\\n42GeV in 85cm (particle bunch driven). Rapid progress continues with lasers,\\nplasma sources, computational methods, and more. In this document we highlight\\nthe main contributions made by the various major collaborations, facilities,\\nand experiments that develop ANAs for applications to particle and high-energy\\nphysics. These include: ALiVE, ANL-AWA, AWAKE, BNL-ATF, CEPC Injector,\\nDESY-KALDERA, ELI ERIC, EuPRAXIA, HALHF, LBNL-BELLA, LBNL-kBELLA, LCvison,\\nPETRA IV Injector, 10TeV Collider design, SLAC-FACET II, as well as the\\ndevelopment of structures, lasers and plasma sources, and sustainability, and\\ndemonstrate the intense activities in the field. ANAs can have, and already\\nhave, applications to particle and high-energy physics as subsystems, the\\nso-called intermediate applications: injectors, lower energy experiments, beam\\ndump experiments, test beds for detectors, etc. Additionally, an ANA could be\\nan upgrade for any Higgs factory based on a linear accelerator, as proposed in\\nthe LCvison project. ANAs have advantages over other concepts for reaching\\nmulti-TeV energies: lower geographical and environmental footprints, higher\\nluminosity to power ratio, and are thus more sustainable than other\\naccelerators. However, ANAs must still meet a number of challenges before they\\ncan produce bunches with parameters and the luminosity required for a linear\\ncollider at the energy frontier. It is therefore extremely important to\\nstrongly support vigorous R&D of ANAs, because they are, at this time, the most\\nsustainable acceleration scheme to reach very high energies with a linear\\naccelerator.\", \"main_category\": \"physics.acc-ph\", \"categories\": \"physics.acc-ph\", \"published\": \"2025-04-02T07:35:27Z\"}"}
