{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07766v1\", \"title\": \"Realigning Incentives to Build Better Software: a Holistic Approach to\\n  Vendor Accountability\", \"summary\": \"In this paper, we ask the question of why the quality of commercial software,\\nin terms of security and safety, does not measure up to that of other (durable)\\nconsumer goods we have come to expect. We examine this question through the\\nlens of incentives. We argue that the challenge around better quality software\\nis due in no small part to a sequence of misaligned incentives, the most\\ncritical of which being that the harm caused by software problems is by and\\nlarge shouldered by consumers, not developers. This lack of liability means\\nsoftware vendors have every incentive to rush low-quality software onto the\\nmarket and no incentive to enhance quality control. Within this context, this\\npaper outlines a holistic technical and policy framework we believe is needed\\nto incentivize better and more secure software development. At the heart of the\\nincentive realignment is the concept of software liability. This framework\\ntouches on various components, including legal, technical, and financial, that\\nare needed for software liability to work in practice; some currently exist,\\nsome will need to be re-imagined or established. This is primarily a\\nmarket-driven approach that emphasizes voluntary participation but highlights\\nthe role appropriate regulation can play. We connect and contrast this with the\\nEU legal environment and discuss what this framework means for open-source\\nsoftware (OSS) development and emerging AI risks. Moreover, we present a\\nCrowdStrike case study complete with a what-if analysis had our proposed\\nframework been in effect. Our intention is very much to stimulate a robust\\nconversation among both researchers and practitioners.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.SE,econ.TH\", \"published\": \"2025-04-10T14:05:24Z\"}"}
