{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23694v1\", \"title\": \"Derivative expansion in a two-scalar field theory\", \"summary\": \"The derivative expansion of the effective action is considered in the model\\nwith two interacting real scalar fields in curved spacetime. Using the\\nfunctional approach and local momentum representation, the coefficient of the\\nderivative term is calculated up to the first order in curvature in the\\none-scalar theory. The two-scalar problem is solved by extracting normal modes\\nand consequent reduction to the single-scalar case. The method can be applied\\nto a larger number of scalars. In the theory with strong hierarchy of masses,\\nthe renormalized effective potential and the coefficients of the second-order\\nderivative terms demonstrate the quantum decoupling in the low-energy limit.\", \"main_category\": \"hep-th\", \"categories\": \"hep-th\", \"published\": \"2025-03-31T03:48:03Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23712v1\", \"title\": \"ElimPCL: Eliminating Noise Accumulation with Progressive Curriculum\\n  Labeling for Source-Free Domain Adaptation\", \"summary\": \"Source-Free Domain Adaptation (SFDA) aims to train a target model without\\nsource data, and the key is to generate pseudo-labels using a pre-trained\\nsource model. However, we observe that the source model often produces highly\\nuncertain pseudo-labels for hard samples, particularly those heavily affected\\nby domain shifts, leading to these noisy pseudo-labels being introduced even\\nbefore adaptation and further reinforced through parameter updates.\\nAdditionally, they continuously influence neighbor samples through propagation\\nin the feature space.To eliminate the issue of noise accumulation, we propose a\\nnovel Progressive Curriculum Labeling (ElimPCL) method, which iteratively\\nfilters trustworthy pseudo-labeled samples based on prototype consistency to\\nexclude high-noise samples from training. Furthermore, a Dual MixUP technique\\nis designed in the feature space to enhance the separability of hard samples,\\nthereby mitigating the interference of noisy samples on their\\nneighbors.Extensive experiments validate the effectiveness of ElimPCL,\\nachieving up to a 3.4% improvement on challenging tasks compared to\\nstate-of-the-art methods.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-03-31T04:28:27Z\"}"}
