{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06937v1\", \"title\": \"Finite Field Multiple Access III: from 2-ary to p-ary\", \"summary\": \"This paper extends finite-field multiple-access (FFMA) techniques from binary\\nto general $p$-ary source transmission. We introduce element-assemblage (EA)\\ncodes over GF($p^m$), generalizing element-pair (EP) codes, and define two\\nspecific types for ternary transmission: orthogonal EA codes and double\\ncodeword EA (D-CWEA) codes. A unique sum-pattern mapping (USPM) constraint is\\nproposed for the design of uniquely-decodable CWEA (UD-CWEA) codes, including\\nadditive inverse D-CWEA (AI-D-CWEA) and basis decomposition D-CWEA (BD-D-CWEA)\\ncodes. Moreover, we extend EP-coding to EA-coding, focusing on non-orthogonal\\nCWEA (NO-CWEA) codes and their USPM constraint in the complex field.\\nAdditionally, $p$-ary CWEA codes are constructed using a basis decomposition\\nmethod, leveraging ternary decomposition for faster convergence and simplified\\nencoder/decoder design. We present a comprehensive performance analysis of the\\nproposed FFMA system from two complementary perspectives: channel capacity and\\nerror performance. We demonstrate that equal power allocation (EPA) achieves\\nthe theoretical channel capacity bound, while independently developing a\\nrate-driven capacity alignment (CA) theorem based on the capacity-to-rate ratio\\n(CRR) metric for error performance analysis. We then explore the multiuser\\nfinite blocklength (FBL) characteristics of FFMA systems. Finally, a\\ncomparative analysis of $p$-ary transmission systems against classical binary\\nsystems is conducted, revealing that low-order $p$-ary systems (e.g., $p=3$)\\noutperform binary systems at small loading factors, while higher-order systems\\n(e.g., $p=257$) excel at larger loading factors. These findings highlight the\\npotential of $p$-ary systems, although practical implementations may benefit\\nfrom decomposing $p$-ary systems into ternary systems to manage complexity.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-04-09T14:41:36Z\"}"}
