{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05030v1\", \"title\": \"AsyReC: A Multimodal Graph-based Framework for Spatio-Temporal\\n  Asymmetric Dyadic Relationship Classification\", \"summary\": \"Dyadic social relationships, which refer to relationships between two\\nindividuals who know each other through repeated interactions (or not), are\\nshaped by shared spatial and temporal experiences. Current computational\\nmethods for modeling these relationships face three major challenges: (1) the\\nfailure to model asymmetric relationships, e.g., one individual may perceive\\nthe other as a friend while the other perceives them as an acquaintance, (2)\\nthe disruption of continuous interactions by discrete frame sampling, which\\nsegments the temporal continuity of interaction in real-world scenarios, and\\n(3) the limitation to consider periodic behavioral cues, such as rhythmic\\nvocalizations or recurrent gestures, which are crucial for inferring the\\nevolution of dyadic relationships. To address these challenges, we propose\\nAsyReC, a multimodal graph-based framework for asymmetric dyadic relationship\\nclassification, with three core innovations: (i) a triplet graph neural network\\nwith node-edge dual attention that dynamically weights multimodal cues to\\ncapture interaction asymmetries (addressing challenge 1); (ii) a clip-level\\nrelationship learning architecture that preserves temporal continuity, enabling\\nfine-grained modeling of real-world interaction dynamics (addressing challenge\\n2); and (iii) a periodic temporal encoder that projects time indices onto\\nsine/cosine waveforms to model recurrent behavioral patterns (addressing\\nchallenge 3). Extensive experiments on two public datasets demonstrate\\nstate-of-the-art performance, while ablation studies validate the critical role\\nof asymmetric interaction modeling and periodic temporal encoding in improving\\nthe robustness of dyadic relationship classification in real-world scenarios.\\nOur code is publicly available at: https://github.com/tw-repository/AsyReC.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.MM\", \"published\": \"2025-04-07T12:52:23Z\"}"}
