{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02392v1\", \"title\": \"Identifying misclassified meteor showers in the IAU MDC database.\\n  Reclassification Proposal\", \"summary\": \"The study of meteoroid streams reveals the full complexity of these\\nstructures. At present, we have no objective method of deciding whether the\\nparameters of the observed meteoroid stream represent a further solution to an\\nalready known object or whether they relate to a new discovery. As result, the\\nMeteor Data Center (MDC) database of the International Astronomical Union (IAU)\\ncontains duplicates and false duplicates of the meteor showers.\\n  It is desirable to detect questionable cases and, if possible, correct their\\nstatus, thereby contributing to the improvement of the content of the IAU MDC\\ndatabase. The correct content of the MDC database is important in its\\napplications, for example, in assessing the threat from meteoroids to Earth's\\nartificial satellites.\\n  Two approaches were used, in the first the internal compatibility of\\ngeocentric and heliocentric parameters representing a given flux was verified.\\nIn the second, a comparison of two or more solutions of the same stream was\\nmade in as much detail as possible. Fifty-six streams were verified, for which\\nclear suspicion of misclassification was established in our earlier work.\\n  For 43 streams, the misclassification was confirmed, with a proposal to\\nchange their status in the MDC to autonomous. In the remaining 13 cases, it was\\nproposed to leave their status unchanged.\\n  Although we do not consider it 'definitive', our study clearly shows that\\nrepeated misclassification of new meteoroid flux solutions has occurred in the\\npast. Correction of these cases will significantly improve the content of the\\nMDC database. As an additional product, based on the approach proposed in this\\nand our earlier work, relevant procedures have been proposed, which, available\\non the MDC database website, will make it possible to compare new meteoroid\\ndata with the contents of the database, thereby avoiding errors in their\\nclassification.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,astro-ph.IM\", \"published\": \"2025-04-03T08:37:52Z\"}"}
