{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05109v1\", \"title\": \"Inverse Mixed Integer Optimization: An Interior Point Perspective\", \"summary\": \"We propose a novel solution framework for inverse mixed-integer optimization\\nbased on analytic center concepts from interior point methods. We characterize\\nthe optimality gap of a given solution, provide structural results, and propose\\nmodels that can efficiently solve large problems. First, we exploit the\\nproperty that mixed-integer solutions are primarily interior points that can be\\nmodeled as weighted analytic centers with unique weights. We then demonstrate\\nthat the optimality of a given solution can be measured relative to an\\nidentifiable optimal solution to the linear programming relaxation. We quantify\\nthe absolute optimality gap and pose the inverse mixed-integer optimization\\nproblem as a bi-level program where the upper-level objective minimizes the\\nnorm to a given reference cost, while the lower-level objective minimizes the\\nabsolute optimality gap to an optimal linear programming solution. We provide\\ntwo models that address the discrepancies between the upper and lower-level\\nproblems, establish links with noisy and data-driven optimization, and conduct\\nextensive numerical testing. We find that the proposed framework successfully\\nidentifies high-quality solutions in rapid computational times. Compared to the\\nstate-of-the-art trust region cutting plane method, it achieves optimal cost\\nvectors for 95% and 68% of the instances within optimality gaps of e-2 and e-5,\\nrespectively, without sacrificing the relative proximity to the nominal cost\\nvector. To ensure the optimality of the given solution, the proposed approach\\nis complemented by a classical cutting plane method. It is shown to solve\\ninstances that the trust region cutting plane method could not successfully\\nsolve as well as being in very close proximity to the nominal cost vector.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC\", \"published\": \"2025-04-07T14:15:17Z\"}"}
