{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06039v1\", \"title\": \"Enhanced Anomaly Detection for Capsule Endoscopy Using Ensemble Learning\\n  Strategies\", \"summary\": \"Capsule endoscopy is a method to capture images of the gastrointestinal tract\\nand screen for diseases which might remain hidden if investigated with standard\\nendoscopes. Due to the limited size of a video capsule, embedding AI models\\ndirectly into the capsule demands careful consideration of the model size and\\nthus complicates anomaly detection in this field. Furthermore, the scarcity of\\navailable data in this domain poses an ongoing challenge to achieving effective\\nanomaly detection. Thus, this work introduces an ensemble strategy to address\\nthis challenge in anomaly detection tasks in video capsule endoscopies,\\nrequiring only a small number of individual neural networks during both the\\ntraining and inference phases. Ensemble learning combines the predictions of\\nmultiple independently trained neural networks. This has shown to be highly\\neffective in enhancing both the accuracy and robustness of machine learning\\nmodels. However, this comes at the cost of higher memory usage and increased\\ncomputational effort, which quickly becomes prohibitive in many real-world\\napplications. Instead of applying the same training algorithm to each\\nindividual network, we propose using various loss functions, drawn from the\\nanomaly detection field, to train each network. The methods are validated on\\nthe two largest publicly available datasets for video capsule endoscopy images,\\nthe Galar and the Kvasir-Capsule dataset. We achieve an AUC score of 76.86% on\\nthe Kvasir-Capsule and an AUC score of 76.98% on the Galar dataset. Our\\napproach outperforms current baselines with significantly fewer parameters\\nacross all models, which is a crucial step towards incorporating artificial\\nintelligence into capsule endoscopies.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-08T13:39:39Z\"}"}
