{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02711v1\", \"title\": \"Anisotropy analysis of bamboo and tooth using 4-angle polarization\\n  micro-spectroscopy\", \"summary\": \"To investigate the anisotropic properties of biomaterials, two distinct\\nclasses are considered: polymer-based (e.g., cellulose in plants) and\\ncrystalline-based (e.g., enamel in teeth), each demonstrating distinct\\nstructural and functional characteristics. Four-angle polarization (4-pol.)\\nspectral mapping of sub-1 {\\\\mu}m bamboo slices was carried out in the mid-IR\\nspectral range (2.5-20 {\\\\mu}m) to reveal the 3D organization of the chemical\\nbonding of cellulose using the key characteristic absorption bands associated\\nwith C-O-C and C-N vibrational modes. The longitudinal and transverse microtome\\nslices revealed a switch between the presence and absence of dichroism in\\nparenchyma cell walls and vascular bundles. The cell wall showed continuous\\nalignment of the C-O-C stretching vibrational mode (8.6 {\\\\mu}m/1163 cm-1) down\\nto the pixel resolution of ~ 4 {\\\\mu}m (the step size in imaging) in the\\ntransverse slice; the cell wall thickness is ~ 1 {\\\\mu}m. Thin microtomed slices\\nof a tooth were measured in transmission and reflection modes. The single-point\\nreflection measurements, performed using two perpendicular orientations,\\nrevealed orientational anisotropy in the enamel, which was absent in the dentin\\nregion. High sub-diffraction limited lateral resolution was numerically\\nvalidated using a simplified-model of a Gaussian beam reading out material\\npixels with a defined orientation of absorption. It is shown that the\\norientation of small ~ {\\\\lambda}/10 ~ 1 {\\\\mu}m objects can be revealed using a\\nfocal spot of ~ {\\\\lambda}/NA ~ 20 {\\\\mu}m, defining the diffraction limit for\\nthe objective lens with a numerical aperture NA ~ 0.5.\", \"main_category\": \"physics.bio-ph\", \"categories\": \"physics.bio-ph,physics.med-ph\", \"published\": \"2025-04-03T15:51:43Z\"}"}
