{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07018v1\", \"title\": \"ShadowBinding: Realizing Effective Microarchitectures for In-Core Secure\\n  Speculation Schemes\", \"summary\": \"Secure speculation schemes have shown great promise in the war against\\nspeculative side-channel attacks, and will be a key building block for\\ndeveloping secure, high-performance architectures moving forward. As the field\\nmatures, the need for rigorous microarchitectures, and corresponding\\nperformance and cost analysis, become critical for evaluating secure schemes\\nand for enabling their future adoption.\\n  In ShadowBinding, we present effective microarchitectures for two\\nstate-of-the-art secure schemes, uncovering and mitigating fundamental\\nmicroarchitectural limitations within the analyzed schemes, and provide\\nimportant design characteristics. We uncover that Speculative Taint Tracking's\\n(STT's) rename-based taint computation must be completed in a single cycle,\\ncreating an expensive dependency chain which greatly limits performance for\\nwider processor cores. We also introduce a novel michroarchitectural approach\\nfor STT, named STT-Issue, which, by delaying the taint computation to the issue\\nstage, eliminates the dependency chain, achieving better instructions per cycle\\n(IPC), timing, area, and performance results.\\n  Through a comprehensive evaluation of our STT and Non-Speculative Data Access\\n(NDA) microarchitectural designs on the RISC-V Berkeley Out-of-Order Machine,\\nwe find that the IPC impact of in-core secure schemes is higher than previously\\nestimated, close to 20% for the highest performance core. With insights into\\ntiming from our RTL evaluation, the performance loss, created by the combined\\nimpact of IPC and timing, becomes even greater, at 35%, 27%, and 22% for\\nSTT-Rename, STT-Issue, and NDA, respectively. If these trends were to hold for\\nleading processor core designs, the performance impact would be well over 30%,\\neven for the best-performing scheme.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.AR\", \"published\": \"2025-04-09T16:33:42Z\"}"}
