{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23801v1\", \"title\": \"A PINN Methodology for Temperature Field Reconstruction in the PIV\\n  Measurement Plane: Case of Rayleigh-B\\u00e9nard Convection\", \"summary\": \"We present a method to infer temperature fields from stereo particle-image\\nvelocimetry (PIV) data in turbulent Rayleigh-B\\\\'enard convection (RBC) using\\nPhysics-informed neural networks (PINNs). The physical setup is a cubic RBC\\ncell with Rayleigh number $\\\\text{Ra}=10^7$ and Prandtl number $\\\\text{Pr}=0.7$.\\nWith data only available in a vertical plane $A:x=x_0$, the residuals of the\\ngoverning partial differential equations are minimised in an enclosing 3D\\ndomain around $A$ with thickness $\\\\delta_x$. Dynamic collocation point sampling\\nstrategies are used to overcome the lack of 3D labelled information and to\\noptimize the overall convergence of the PINN. In particular, in the\\nout-of-plane direction $x$, the collocation points are distributed according to\\na normal distribution, in order to emphasize the region where data is provided.\\nAlong the vertical direction, we leverage meshing information and sample points\\nfrom a distribution designed based on the grid of a direct numerical simulation\\n(DNS). This approach points greater attention to critical regions, particularly\\nthe areas with high temperature gradients within the thermal boundary layers.\\nUsing planar three-component velocity data from a DNS, we successfully validate\\nthe reconstruction of the temperature fields in the PIV plane. We evaluate the\\nrobustness of our method with respect to characteristics of the labelled data\\nused for training: the data time span, the sampling frequency, some noisy data\\nand boundary data omission, aiming to better accommodate the challenges\\nassociated with experimental data. Developing PINNs on controlled simulation\\ndata is a crucial step toward their effective deployment on experimental data.\\nThe key is to systematically introduce noise, gaps, and uncertainties in\\nsimulated data to mimic real-world conditions and ensure robust generalization.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-03-31T07:24:06Z\"}"}
