{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07651v1\", \"title\": \"Nonperturbative quantum theory of multiplasmonic electron emission from\\n  surfaces: Gauge-specific cumulant expansions vs. Volkov ansatz over plasmonic\\n  coherent states\", \"summary\": \"Energetic electromagnetic fields produce a variety of elementary excitations\\nin solids that can strongly modify their primary photoemission spectra. Such is\\nthe plasmon excitation or pumping mechanism which, although indirect, is very\\nefficient and hence may give rise to formation of plasmonic coherent states. In\\nturn, these states may act as a source or sink of energy and momentum for\\nescaping electrons. Starting from the model Hamiltonian approach we show that\\nprepumped plasmonic bath of coherent states gives rise to ponderomotive\\npotentials and Floquet electronic band structure that support multiple\\nplasmon-induced electron emission or plasmoemission from metals. Theoretical\\ndescription of multiple plasmoemission requires a nonperturbative approch which\\nis here formulated by applying cumulant expansion and Volkov ansatz to the\\ncalculations of electron wavefunctions and emission rates. The calculations are\\nperformed in the standard length gauge as well as in the Pauli-transformed\\nvelocity gauge for electron-plasmon interaction. The applicability of two\\nnonperturbative approaches to calculation of excitation amplitudes are examined\\nin each gauge. They smoothly interpolate between the fully quantal first order\\nBorn approximation and semiclassical multiplasmon-induced electron excitation\\nlimit. This is illustrated on the example of plasmoemission from Floquet\\nsurface bands on Ag(111) from which this channel of electron yield has been\\ndetected. Our calculations indicate that even subsingle mode occupations of\\nplasmonic coherent states can support multiplasmon electron emission from\\nsurface bands. A way of calibration of plasmonic coherent states is proposed.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,cond-mat.mes-hall\", \"published\": \"2025-04-10T10:58:28Z\"}"}
