{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05263v1\", \"title\": \"An X-ray and Optical Study of the Dwarf Nova Candidate OGLE-BLG-DN-0064\", \"summary\": \"The source OGLE-BLG-DN-0064 (hereafter OGLE64) was classified as a potential\\ndwarf nova based on its regular outburst activity revealed by the OGLE optical\\nsurvey. In this paper, we investigate the X-ray and optical emissions from the\\nsource OGLE64 based on archival Chandra and Swift X-ray data and our optical\\nobservations with the 6-m BTA telescope at the Special Astrophysical\\nObservatory of the Russian Academy of Sciences. OGLE64 shows an X-ray\\nluminosity $ L_X \\\\approx 1.6 \\\\times 10^{32} \\\\, \\\\text{erg s}^{-1} $ and a high\\nX-ray-to-optical flux ratio $ F_X / F_{\\\\text{opt}} \\\\approx 1.5$, typical for\\naccreting white dwarfs. The X-ray spectrum of OGLE64 is better fitted by the\\nmodels of a power law with a photon index $\\\\Gamma \\\\approx 1.9$ and an optically\\nthin plasma with a temperature $ kT \\\\approx 6.4 \\\\, \\\\text{keV} $. The optical\\nspectrum shows hydrogen and neutral helium emission lines, in some of which a\\ndouble-peaked structure is observed. An analysis of the outburst activity of\\nOGLE64, based on data from the OGLE, ZTF, ATLAS, and ASAS-SN optical surveys,\\nhas revealed superoutbursts with a characteristic supercycle $ P_{\\\\text{super}}\\n\\\\approx 400 \\\\, \\\\text{days} $. We found no significant variability in either the\\nX-ray or optical light curves of OGLE64 that could be associated with the\\nchange in the visibility conditions for the emitting regions at different\\norbital phases. Our estimates of the orbital period of the system by indirect\\nmethods show that the period probably lies in the range $ P_{\\\\text{orb}} \\\\sim\\n1.5 - 3.5 \\\\, \\\\text{h} $. The properties of the X-ray and optical emissions from\\nOGLE64 lead us to conclude that the system is an SU UMa-type dwarf nova.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.SR\", \"published\": \"2025-04-07T16:58:06Z\"}"}
