{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01600v1\", \"title\": \"Automatic Estimation of Pedestrian Gait Features using a single camera\\n  recording: Algorithm and Statistical Analysis for Gender Difference and\\n  Obstacle Interactions\", \"summary\": \"The pedestrian gait features - body sway frequency, amplitude, stride length,\\nand speed, along with pedestrian personal space and directional bias, are\\nimportant parameters to be used in different pedestrian dynamics studies. Gait\\nfeature measurements are paramount for wide-ranging applications, varying from\\nthe medical field to the design of bridges. Personal space and choice of\\ndirection (directional bias) play important roles during crowd simulations. In\\nthis study, we formulate an automatic algorithm for calculating the gait\\nfeatures of a trajectory extracted from video recorded using a single camera\\nattached to the roof of a building. Our findings indicate that females have\\n28.64% smaller sway amplitudes, 8.68% smaller stride lengths, and 8.14% slower\\nspeeds compared to males, with no significant difference in frequency. However,\\naccording to further investigation, our study reveals that the body parameters\\nare the main variables that dominate gait features rather than gender. We have\\nconducted three experiments in which the volunteers are walking towards the\\ndestination a) without any obstruction, b) with a stationary non-living\\nobstacle present in the middle of the path, and c) with a human being standing\\nin the middle of the path. From a comprehensive statistical analysis, key\\nobservations include no significant difference in gait features with respect to\\ngender, no significant difference in gait features in the absence or presence\\nof an obstacle, pedestrians treating stationary human beings and stationary\\nobstacles the same given that the gender is same to match the comfort level,\\nand a directional bias towards the left direction, likely influenced by\\nleft-hand traffic rule in India.\", \"main_category\": \"physics.soc-ph\", \"categories\": \"physics.soc-ph\", \"published\": \"2025-04-02T11:06:23Z\"}"}
