{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06732v1\", \"title\": \"Properties and prevalence of false poor man's Majoranas in two- and\\n  three-site artificial Kitaev chains\", \"summary\": \"It was predicted that a minimal chain of two quantum dots (QDs) connected via\\na superconductor can host perfectly localized zero-energy states, known as poor\\nman's Majoranas (PMMs). It is expected that these states are related to\\nMajorana bound states (MBSs) in longer chains and that the tunable nature of\\nthis setup makes it a promising platform to study MBSs. However, realistic\\nsystems can only host highly, but not perfectly, localized near-zero-energy\\nstates, called imperfect PMMs. It has been shown that these imperfect PMMs can\\nevolve into trivial states unrelated to MBSs when the chain is extended. Such\\nstates are called false PMMs, whereas PMMs that evolve into MBSs in long chains\\nare called true PMMs. Here, using a microscopic model of QD-superconductor\\narrays, we consider properties of false PMMs and the circumstances under which\\nthey appear. In two-site systems, we find that the origin of many false PMMs\\ncan be related to zero-energy states occurring in the absence of\\nsuperconductivity and we use this analytic understanding to characterize the\\nfalse PMMs that are typical for different regions of parameter space. In\\nthree-site systems, we show that false PMMs can occur via the same mechanism as\\nfor two-site systems, but we also find them in regions of parameter space where\\nthey are not predicted to exist, thus hinting that the physics of false PMMs\\ncan be richer in longer chains. Finally, we demonstrate that the PMMs most\\nstable to perturbations in chemical potential and with the largest excitation\\ngaps appear in a region of parameter space that also has a large ratio of false\\nto true PMMs.\", \"main_category\": \"cond-mat.mes-hall\", \"categories\": \"cond-mat.mes-hall,cond-mat.supr-con\", \"published\": \"2025-04-09T09:45:04Z\"}"}
