{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24268v1\", \"title\": \"Time-Dependent Density Functional Theory Description of $^{238}$U(n,f),\\n  $^{240,242}$Pu(n,f) and $^{237}$Np(n,f) Reactions\", \"summary\": \"In nuclei with an odd nucleon number the non-vanishing spin number density is\\nthe source of a pseudo-magnetic field, which favors the splitting of the\\nnucleon Cooper pairs. Such an pseudo-magnetic field is generated always in the\\ndynamics of any nucleus, but its effects on Cooper pairs is significantly\\nenhanced in the dynamic evolution of nuclei with an odd number of nucleons. We\\npresent for the first time a microscopic study of the induced fission of the\\nodd neutron compound nuclei $^{239}$U, $^{241, 243}$Pu, and the odd proton, odd\\nneutron compound nucleus $^{238}$Np, performed within the time-dependent\\ndensity functional theory extended to superfluid fermion systems, without any\\nsimplifying assumptions and with controlled numerical approximations, and for a\\nvery large number of initial conditions. Due to the presence of the unpaired\\nodd nucleon(s), the time-reversal symmetry of the fission compound nucleus is\\nspontaneously broken, an aspect routinely neglected in the most advanced\\nmicroscopic approaches of the past. The emerging fission fragment properties\\nare quite similar to the properties of fission fragments of neighboring\\neven-even nuclei. The time from saddle-to-scission is often significantly\\nlonger in odd-N-odd-Z or odd-A nuclei than for even-even nuclei since systems\\nwith unpaired nucleons are easier to excite and the potential energy surfaces\\nof these nuclei have more structure, often resembling a very complicated\\nobstacle course, rather than a more direct evolution of the nuclear shape from\\nthe top of the outer fission barrier to the scission configuration. The Pauli\\nblocking approximation, often invoked in the literature, expected to inhibit\\nthe fission of nuclei with unpaired nucleons, is surprisingly strongly violated\\nduring the fission dynamics.\", \"main_category\": \"nucl-th\", \"categories\": \"nucl-th\", \"published\": \"2025-03-31T16:15:02Z\"}"}
