{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04766v1\", \"title\": \"KunPeng: A Global Ocean Environmental Model\", \"summary\": \"Inspired by the similarity of the atmosphere-ocean physical coupling\\nmechanism, this study innovatively migrates meteorological large-model\\ntechniques to the ocean domain, constructing the KunPeng global ocean\\nenvironmental prediction model. Aimed at the discontinuous characteristics of\\nmarine space, we propose a terrain-adaptive mask constraint mechanism to\\nmitigate effectively training divergence caused by abrupt gradients at land-sea\\nboundaries. To fully integrate far-, medium-, and close-range marine features,\\na longitude-cyclic deformable convolution network (LC-DCN) is employed to\\nenhance the dynamic receptive field, achieving refined modeling of multi-scale\\noceanic characteristics. A Deformable Convolution-enhanced Multi-Step\\nPrediction module (DC-MTP) is employed to strengthen temporal dependency\\nfeature extraction capabilities. Experimental results demonstrate that this\\nmodel achieves an average ACC of 0.80 in 15-day global predictions at\\n0.25$^\\\\circ$ resolution, outperforming comparative models by 0.01-0.08. The\\naverage mean squared error (MSE) is 0.41 (representing a 5%-31% reduction) and\\nthe average mean absolute error (MAE) is 0.44 (0.6%-21% reduction) compared to\\nother models. Significant improvements are particularly observed in sea surface\\nparameter prediction, deep-sea region characterization, and current velocity\\nfield forecasting. Through a horizontal comparison of the applicability of\\noperators at different scales in the marine domain, this study reveals that\\nlocal operators significantly outperform global operators under slow-varying\\noceanic processes, demonstrating the effectiveness of dynamic feature pyramid\\nrepresentations in predicting marine physical parameters.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-07T06:41:05Z\"}"}
