{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23744v1\", \"title\": \"European Contributions to Fermilab Accelerator Upgrades and Facilities\\n  for the DUNE Experiment\", \"summary\": \"The Proton Improvement Plan (PIP-II) to the FNAL accelerator chain and the\\nLong-Baseline Neutrino Facility (LBNF) will provide the world's most intense\\nneutrino beam to the Deep Underground Neutrino Experiment (DUNE) enabling a\\nwide-ranging physics program. This document outlines the significant\\ncontributions made by European national laboratories and institutes towards\\nrealizing the first phase of the project with a 1.2 MW neutrino beam.\\nConstruction of this first phase is well underway. For DUNE Phase II, this will\\nbe closely followed by an upgrade of the beam power to > 2 MW, for which the\\nEuropean groups again have a key role and which will require the continued\\nsupport of the European community for machine aspects of neutrino physics.\\nBeyond the neutrino beam aspects, LBNF is also responsible for providing unique\\ninfrastructure to install and operate the DUNE neutrino detectors at FNAL and\\nat the Sanford Underground Research Facility (SURF). The cryostats for the\\nfirst two Liquid Argon Time Projection Chamber detector modules at SURF, a\\ncontribution of CERN to LBNF, are central to the success of the ongoing\\nexecution of DUNE Phase I. Likewise, successful and timely procurement of\\ncryostats for two additional detector modules at SURF will be critical to the\\nsuccess of DUNE Phase II and the overall physics program. The DUNE\\nCollaboration is submitting four main contributions to the 2026 Update of the\\nEuropean Strategy for Particle Physics process. This paper is being submitted\\nto the 'Accelerator technologies' and 'Projects and Large Experiments' streams.\\nAdditional inputs related to the DUNE science program, DUNE detector\\ntechnologies and R&D, and DUNE software and computing, are also being submitted\\nto other streams.\", \"main_category\": \"physics.acc-ph\", \"categories\": \"physics.acc-ph,hep-ex,physics.ins-det\", \"published\": \"2025-03-31T05:47:29Z\"}"}
