{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02499v1\", \"title\": \"The Gradient of Mean Molecular Weight Across the Radius Valley\", \"summary\": \"Photo-evaporation shapes the observed radii of small exoplanets and\\nconstrains the underlying distributions of atmospheric and core masses.\\nHowever, the diversity of atmospheric chemistries corresponding to these\\ndistributions remains unelucidated. We develop a first-principles\\ncarbon-hydrogen-oxygen-sulfur-silicon (CHOSSi) outgassing model that accounts\\nfor non-ideal gas behavior (via fugacities) at high pressures, as well as the\\ntendency for water and hydrogen to dissolve in melt (via solubility laws). We\\nuse data-driven radius valley constraints to establish the relationship between\\nthe atmospheric surface pressures and melt temperatures of sub-Neptunes.\\nSub-Neptunes with less massive rocky cores retain less of their primordial\\nhydrogen envelopes, which leads to less heat retention and diminished melt\\ntemperatures at the surfaces of these cores. Lower melt temperatures lead\\nthermodynamically to the dominance of carbon-, oxygen-, sulfur- and\\nsilicon-bearing molecules over molecular hydrogen, which naturally produce a\\ndiversity of mean molecular weights. Our geochemical outgassing calculations\\nrobustly predict a gradient of mean molecular weight across the radius valley,\\nwhere the strength of this gradient is primarily driven by the oxygen fugacity\\nof the molten cores and not by the carbon enrichment (or \\\"metallicity\\\") of the\\natmosphere. Smaller sub-Neptunes are predicted to have less hydrogen-dominated\\natmospheres. The precise relationship between the observed and outgassed\\nchemistries requires an understanding of how convection near the core interacts\\nwith large-scale atmospheric circulation (driven by stellar heating) near the\\nphotosphere, as well as the influence of photochemistry.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,physics.ao-ph,physics.geo-ph\", \"published\": \"2025-04-03T11:22:08Z\"}"}
