{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02615v1\", \"title\": \"A Hybrid Similarity-Aware Graph Neural Network with Transformer for Node\\n  Classification\", \"summary\": \"Node classification has gained significant importance in graph deep learning\\nwith real-world applications such as recommendation systems, drug discovery,\\nand citation networks. Graph Convolutional Networks and Graph Transformers have\\nachieved superior performance in node classification tasks. However, the key\\nconcern with Graph Convolutional Networks is over-squashing, which limits their\\nability to capture long-range dependencies in the network. Additionally, Graph\\nTransformers face scalability challenges, making it difficult to process large\\ngraphs efficiently. To address this, we propose a novel framework, A Hybrid\\nSImilarity-Aware Graph Neural Network with Transformer for Node Classification\\n(SIGNNet), which capitalizes on local and global structural information,\\nenhances the model's capability to effectively capture fine-grained\\nrelationships and broader contextual patterns within the graph structure. The\\nproposed method leverages Graph Convolutional Networks alongside a score-based\\nmechanism to effectively capture local and global node interactions while\\naddressing the limitations of over-squashing. Our proposed method employs a\\nnovel Personalized PageRank-based node sampling method to address scalability\\nissues by generating subgraphs of nodes. Additionally, SIGNNet incorporates a\\nnovel attention mechanism, Structure-Aware Multi-Head Attention (SA-MHA), which\\nintegrates node structural information for informed attention weighting,\\nenabling the model to prioritize nodes based on topological significance.\\nExtensive experiments demonstrate the significant improvements achieved by the\\nproposed method over existing state-of-the-art methods, with average accuracy\\ngains of 6.03%, 5.47%, 4.78%, 19.10%, 19.61%, 7.22%, 19.54%, and 14.94% on\\nCora, Citeseer, CS, Wisconsin, Texas, Actor, Cornell and Chameleon datasets,\\nrespectively.\", \"main_category\": \"cs.SI\", \"categories\": \"cs.SI\", \"published\": \"2025-04-03T14:14:37Z\"}"}
