{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05244v1\", \"title\": \"Behind the Spotlight: A systematic assessment of outshining using NIRCam\\n  medium-bands in the JADES Origins Field\", \"summary\": \"The spatial resolution and sensitivity of JWST's NIRCam instrument has\\nrevolutionised our ability to probe the internal structure of early galaxies.\\nBy leveraging deep medium-band imaging in the Jades Origins Field, we assemble\\ncomprehensive spectral energy distributions (SEDs) using 19 photometric bands\\nfor over 200 high-redshift galaxies ($z \\\\geq 4.5$). We present an analysis of\\nthis sample with particular emphasis on investigating the \\\"outshining\\\"\\nphenomenon, which can bias the inferred stellar populations by masking the\\npresence of evolved stellar populations ($\\\\geq$ 100 Myr) with the light of\\nbright, young O and B-type stars. We address this problem by performing\\nspatially-resolved SED-fitting of both binned and full pixel-by-pixel\\nphotometry, which we compare to the traditional integrated approach. We find\\nevidence for systematic underestimation of stellar mass in low-mass galaxies\\n($\\\\leq 10^9 \\\\rm M_\\\\odot$) with bursty star formation, which can exceed a factor\\nof 10 in individual cases, but on average is typically a factor of 1.25-2.5,\\ndepending on the binning methodology and SFH model used. The observed mass\\noffset correlates with burstiness (SFR$_{10 \\\\ \\\\rm Myr}$/SFR$_{100 \\\\ \\\\rm Myr}$)\\nand sSFR, such that galaxies with recently rising SFHs have larger mass\\noffsets. The integrated SFH models which produce the most consistent stellar\\nmasses are the double power-law and non-parametric `continuity' models,\\nalthough no integrated model fully reproduces all resolved SFHs. We apply an\\noutshining correction factor to the Stellar Mass Function at $z=7$, finding\\nlittle impact within the uncertainties. We conclude that outshining can be\\nimportant in individual low-mass galaxies, but the overall impact is limited\\nand should be considered alongside other systematic SED fitting effects.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-07T16:30:31Z\"}"}
