{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02756v1\", \"title\": \"Stability of acoustic streaming jets\", \"summary\": \"We study the stability of a steady Eckart streaming jet that is acoustically\\nforced at one end of a closed cylindrical cavity and impinges the wall at the\\nother end, where a recirculation forms. This configuration generically\\nrepresents industrial processes where acoustic forcing offers a contactless\\nmeans of stirring or controlling confined flows. Successfully doing so,\\nhowever, requires sufficient insight into the topology of the acoustically\\nforced flow. This raises the question of whether the base acoustic streaming\\njet is stable and, when not, of which alternative states emerge. Using Linear\\nStability Analysis (LSA) and three-dimensional nonlinear simulations, we\\nidentify the instability mechanisms and determine the nature of the\\nbifurcations that ensue. We show that the ratio $C_R$ between the cavity and\\nthe maximum beam radii determines the dominant unstable mode. For $4 \\\\leq C_R\\n\\\\leq 6$, a non-oscillatory perturbation rooted in the jet impingement triggers\\na supercritical bifurcation. For $C_R = 3$, the flow destabilises through a\\nsubcritical non-oscillatory bifurcation. Further reducing $C_R$ increases the\\nshear within the flow, and gradually relocates the instability in the shear\\nlayer between impingement-induced vortices: for $C_R = 2$, an unstable\\ntravelling wave grows out of a subcritical bifurcation, which becomes\\nsupercritical for $C_R=1$. For each geometry, the nonlinear 3D simulations\\nvalidate the LSA, identify the saturated nonlinear state and its stability.\\nThis study offers fundamental insight into the stability of acoustically-driven\\nflows in general, but also opens possible pathways to either induce turbulence\\nacoustically, or to avoid it in realistic configurations.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-03T16:49:37Z\"}"}
