{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02293v1\", \"title\": \"State-of-the-Art Translation of Text-to-Gloss using mBART : A case study\\n  of Bangla\", \"summary\": \"Despite a large deaf and dumb population of 1.7 million, Bangla Sign Language\\n(BdSL) remains a understudied domain. Specifically, there are no works on\\nBangla text-to-gloss translation task. To address this gap, we begin by\\naddressing the dataset problem. We take inspiration from grammatical rule based\\ngloss generation used in Germany and American sign langauage (ASL) and adapt it\\nfor BdSL. We also leverage LLM to generate synthetic data and use\\nback-translation, text generation for data augmentation. With dataset prepared,\\nwe started experimentation. We fine-tuned pretrained mBART-50 and\\nmBERT-multiclass-uncased model on our dataset. We also trained GRU, RNN and a\\nnovel seq-to-seq model with multi-head attention. We observe significant high\\nperformance (ScareBLEU=79.53) with fine-tuning pretrained mBART-50 multilingual\\nmodel from Facebook. We then explored why we observe such high performance with\\nmBART. We soon notice an interesting property of mBART -- it was trained on\\nshuffled and masked text data. And as we know, gloss form has shuffling\\nproperty. So we hypothesize that mBART is inherently good at text-to-gloss\\ntasks. To find support against this hypothesis, we trained mBART-50 on\\nPHOENIX-14T benchmark and evaluated it with existing literature. Our mBART-50\\nfinetune demonstrated State-of-the-Art performance on PHOENIX-14T benchmark,\\nfar outperforming existing models in all 6 metrics (ScareBLEU = 63.89, BLEU-1 =\\n55.14, BLEU-2 = 38.07, BLEU-3 = 27.13, BLEU-4 = 20.68, COMET = 0.624). Based on\\nthe results, this study proposes a new paradigm for text-to-gloss task using\\nmBART models. Additionally, our results show that BdSL text-to-gloss task can\\ngreatly benefit from rule-based synthetic dataset.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.AI\", \"published\": \"2025-04-03T05:47:51Z\"}"}
