{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01458v1\", \"title\": \"GeoRAG: A Question-Answering Approach from a Geographical Perspective\", \"summary\": \"Geographic Question Answering (GeoQA) addresses natural language queries in\\ngeographic domains to fulfill complex user demands and improve information\\nretrieval efficiency. Traditional QA systems, however, suffer from limited\\ncomprehension, low retrieval accuracy, weak interactivity, and inadequate\\nhandling of complex tasks, hindering precise information acquisition. This\\nstudy presents GeoRAG, a knowledge-enhanced QA framework integrating\\ndomain-specific fine-tuning and prompt engineering with Retrieval-Augmented\\nGeneration (RAG) technology to enhance geographic knowledge retrieval accuracy\\nand user interaction. The methodology involves four components: (1) A\\nstructured geographic knowledge base constructed from 3267 corpora (research\\npapers, monographs, and technical reports), categorized via a multi-agent\\napproach into seven dimensions: semantic understanding, spatial location,\\ngeometric morphology, attribute characteristics, feature relationships,\\nevolutionary processes, and operational mechanisms. This yielded 145234\\nclassified entries and 875432 multi-dimensional QA pairs. (2) A multi-label\\ntext classifier based on BERT-Base-Chinese, trained to analyze query types\\nthrough geographic dimension classification. (3) A retrieval evaluator\\nleveraging QA pair data to assess query-document relevance, optimizing\\nretrieval precision. (4) GeoPrompt templates engineered to dynamically\\nintegrate user queries with retrieved information, enhancing response quality\\nthrough dimension-specific prompting. Comparative experiments demonstrate\\nGeoRAG's superior performance over conventional RAG across multiple base\\nmodels, validating its generalizability. This work advances geographic AI by\\nproposing a novel paradigm for deploying large language models in\\ndomain-specific contexts, with implications for improving GeoQA systems\\nscalability and accuracy in real-world applications.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-04-02T08:11:05Z\"}"}
