{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06803v1\", \"title\": \"DyDiT++: Dynamic Diffusion Transformers for Efficient Visual Generation\", \"summary\": \"Diffusion Transformer (DiT), an emerging diffusion model for visual\\ngeneration, has demonstrated superior performance but suffers from substantial\\ncomputational costs. Our investigations reveal that these costs primarily stem\\nfrom the \\\\emph{static} inference paradigm, which inevitably introduces\\nredundant computation in certain \\\\emph{diffusion timesteps} and \\\\emph{spatial\\nregions}. To overcome this inefficiency, we propose \\\\textbf{Dy}namic\\n\\\\textbf{Di}ffusion \\\\textbf{T}ransformer (DyDiT), an architecture that\\n\\\\emph{dynamically} adjusts its computation along both \\\\emph{timestep} and\\n\\\\emph{spatial} dimensions. Specifically, we introduce a \\\\emph{Timestep-wise\\nDynamic Width} (TDW) approach that adapts model width conditioned on the\\ngeneration timesteps. In addition, we design a \\\\emph{Spatial-wise Dynamic\\nToken} (SDT) strategy to avoid redundant computation at unnecessary spatial\\nlocations. TDW and SDT can be seamlessly integrated into DiT and significantly\\naccelerates the generation process. Building on these designs, we further\\nenhance DyDiT in three key aspects. First, DyDiT is integrated seamlessly with\\nflow matching-based generation, enhancing its versatility. Furthermore, we\\nenhance DyDiT to tackle more complex visual generation tasks, including video\\ngeneration and text-to-image generation, thereby broadening its real-world\\napplications. Finally, to address the high cost of full fine-tuning and\\ndemocratize technology access, we investigate the feasibility of training DyDiT\\nin a parameter-efficient manner and introduce timestep-based dynamic LoRA\\n(TD-LoRA). Extensive experiments on diverse visual generation models, including\\nDiT, SiT, Latte, and FLUX, demonstrate the effectiveness of DyDiT.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-09T11:48:37Z\"}"}
