{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02690v1\", \"title\": \"Planar Laser-Induced Fluorescence system for Space and Phase-resolved\\n  Ion Velocity Distribution Function Measurements\", \"summary\": \"In this work, we present a planar laser-induced fluorescence (PLIF) system\\nfor two-dimensional (2D) spatial and phase-resolved ion velocity distribution\\nfunction (IVDF) measurements. A continuous-wave tunable diode laser produces a\\nlaser sheet that irradiates the plasma, and the resulting fluorescence is\\ncaptured by an intensified CCD (ICCD) camera. Fluorescence images recorded at\\nvarying laser wavelengths are converted into 2D IVDFs using the Doppler shift\\nprinciple. Comparing six image filters, the singular-value decomposition\\n(SVD)-based noise filtering is identified as the most effective for enhancing\\nthe signal-to-noise ratio while preserving the IVDF structure. The developed\\nICCD-based PLIF system is tested in an electron-beam generated $E \\\\times B$\\nplasma with a moderate bulk plasma density of $\\\\sim10^{10}$ $cm^{-3}$. The PLIF\\nmeasurements are validated against a conventional single-point LIF method using\\nphotomultiplier tube (PMT)-based detection at various positions. The\\nphase-resolving capability of the system is tested by oscillating the plasma\\nbetween two nominal operating modes with different density profiles and\\ntriggering the ICCD camera with the externally driven plasma oscillation. The\\nresulting oscillations in fluorescence intensity show good agreement with\\nplasma density variations measured by electrostatic probes, demonstrating the\\nsystems ability to resolve phase-dependent dynamics. The measured IVDFs reveal\\nseveral signatures of ion dynamics in this plasma source, including radially\\noutflowing ions and anomalous ion heating in the plasma periphery, as\\nanticipated by theoretical studies.\", \"main_category\": \"physics.plasm-ph\", \"categories\": \"physics.plasm-ph\", \"published\": \"2025-04-03T15:29:28Z\"}"}
