{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21694v1\", \"title\": \"Progressive Rendering Distillation: Adapting Stable Diffusion for\\n  Instant Text-to-Mesh Generation without 3D Data\", \"summary\": \"It is highly desirable to obtain a model that can generate high-quality 3D\\nmeshes from text prompts in just seconds. While recent attempts have adapted\\npre-trained text-to-image diffusion models, such as Stable Diffusion (SD), into\\ngenerators of 3D representations (e.g., Triplane), they often suffer from poor\\nquality due to the lack of sufficient high-quality 3D training data. Aiming at\\novercoming the data shortage, we propose a novel training scheme, termed as\\nProgressive Rendering Distillation (PRD), eliminating the need for 3D\\nground-truths by distilling multi-view diffusion models and adapting SD into a\\nnative 3D generator. In each iteration of training, PRD uses the U-Net to\\nprogressively denoise the latent from random noise for a few steps, and in each\\nstep it decodes the denoised latent into 3D output. Multi-view diffusion\\nmodels, including MVDream and RichDreamer, are used in joint with SD to distill\\ntext-consistent textures and geometries into the 3D outputs through score\\ndistillation. Since PRD supports training without 3D ground-truths, we can\\neasily scale up the training data and improve generation quality for\\nchallenging text prompts with creative concepts. Meanwhile, PRD can accelerate\\nthe inference speed of the generation model in just a few steps. With PRD, we\\ntrain a Triplane generator, namely TriplaneTurbo, which adds only $2.5\\\\%$\\ntrainable parameters to adapt SD for Triplane generation. TriplaneTurbo\\noutperforms previous text-to-3D generators in both efficiency and quality.\\nSpecifically, it can produce high-quality 3D meshes in 1.2 seconds and\\ngeneralize well for challenging text input. The code is available at\\nhttps://github.com/theEricMa/TriplaneTurbo.\", \"main_category\": \"cs.GR\", \"categories\": \"cs.GR,cs.AI,cs.CV\", \"published\": \"2025-03-27T16:59:15Z\"}"}
