{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05731v1\", \"title\": \"Retrieval Augmented Generation with Collaborative Filtering for\\n  Personalized Text Generation\", \"summary\": \"Recently, the personalization of Large Language Models (LLMs) to generate\\ncontent that aligns with individual user preferences has garnered widespread\\nattention. Personalized Retrieval-Augmented Generation (RAG), which retrieves\\nrelevant documents from the user's history to reflect their preferences and\\nenhance LLM generation, is one commonly used approach for personalization.\\nHowever, existing personalized RAG methods do not consider that the histories\\nof similar users can also assist in personalized generation for the current\\nuser, meaning that collaborative information between users can also benefit\\npersonalized generation. Inspired by the application of collaborative filtering\\nin recommender systems, we propose a method called CFRAG, which adapts\\nCollaborative Filtering to RAG for personalized text generation. However, this\\npresents two challenges: (1)~how to incorporate collaborative information\\nwithout explicit user similarity labels? (2)~how to retrieve documents that\\nsupport personalized LLM generation? For Challenge 1, we use contrastive\\nlearning to train user embeddings to retrieve similar users and introduce\\ncollaborative information. For Challenge 2, we design a personalized retriever\\nand reranker to retrieve the top-$k$ documents from these users' histories. We\\ntake into account the user's preference during retrieval and reranking. Then we\\nleverage feedback from the LLM to fine-tune the personalized retriever and\\nreranker, enabling them to retrieve documents that meet the personalized\\ngeneration needs of the LLM. Experimental results on the Language Model\\nPersonalization (LaMP) benchmark validate the effectiveness of CFRAG. Further\\nanalysis confirms the importance of incorporating collaborative information.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR,cs.CL\", \"published\": \"2025-04-08T07:03:36Z\"}"}
