{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01584v1\", \"title\": \"Higher-order topological phases for time-reversal-symmetry breaking\\n  superconductivity in UTe$_2$\", \"summary\": \"The recent discovery of heavy-fermion superconductor UTe$_2$ has broadened\\nthe possibility of realizing exotic time-reversal-symmetry-breaking\\nsuperconductivity. However, a comprehensive understanding of the topological\\nphases in the superconducting states of UTe$_2$ is still lacking. Here, we\\npresent an exhaustive classification of topological phases for all\\ntime-reversal symmetry breaking pairing symmetries of UTe$_2$. Using the K\\ntheoretical classification approach, we uncover that 25 out of 36 possible\\npairing states are classified as higher-order topological phases, with some\\ndemonstrating hybrid-order topology through an intricate interplay of hinge and\\ncorner states. Furthermore, under the weak-coupling condition of the pair\\npotentials, the possible pairing symmetries are constrained to $B_{ju} + i\\nB_{ku}$, $A_{u} + i B_{j u}$, and $B_{j g} + iA_u$ ($j,k = 1,2,3$; $j \\\\neq k$),\\nwhere these symbols denote the irreducible representations of the point group\\n$D_{2h}$. For these pairing states, the topological invariants are related to\\nthe Fermi surface topology via the Fermi-surface formula, enabling us to\\nsystematically diagnose higher-order topological phases. Using a tight-binding\\nmodel, we demonstrate the higher-order topological phases of the mixed-parity\\n$A_u + iB_{1g}$ superconductors, where the second-order and hybrid-order\\ntopological phases emerge as the number of Fermi surfaces enclosing the\\ntime-reversal invariant momentum evolves from two to four. The findings suggest\\nthat UTe$_2$ serves as a compelling platform for exploring higher-order\\ntopological superconductors with diverse topological surface states.\", \"main_category\": \"cond-mat.supr-con\", \"categories\": \"cond-mat.supr-con\", \"published\": \"2025-04-02T10:40:39Z\"}"}
