{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23844v1\", \"title\": \"FlexiMo: A Flexible Remote Sensing Foundation Model\", \"summary\": \"The rapid expansion of multi-source satellite imagery drives innovation in\\nEarth observation, opening unprecedented opportunities for Remote Sensing\\nFoundation Models to harness diverse data. However, many existing models remain\\nconstrained by fixed spatial resolutions and patch sizes, limiting their\\nability to fully exploit the heterogeneous spatial characteristics inherent in\\nsatellite imagery. To address these challenges, we propose FlexiMo, a flexible\\nremote sensing foundation model that endows the pre-trained model with the\\nflexibility to adapt to arbitrary spatial resolutions. Central to FlexiMo is a\\nspatial resolution-aware module that employs a parameter-free alignment\\nembedding mechanism to dynamically recalibrate patch embeddings based on the\\ninput image's resolution and dimensions. This design not only preserves\\ncritical token characteristics and ensures multi-scale feature fidelity but\\nalso enables efficient feature extraction without requiring modifications to\\nthe underlying network architecture. In addition, FlexiMo incorporates a\\nlightweight channel adaptation module that leverages prior spectral information\\nfrom sensors. This mechanism allows the model to process images with varying\\nnumbers of channels while maintaining the data's intrinsic physical properties.\\nExtensive experiments on diverse multimodal, multi-resolution, and multi-scale\\ndatasets demonstrate that FlexiMo significantly enhances model generalization\\nand robustness. In particular, our method achieves outstanding performance\\nacross a range of downstream tasks, including scene classification, land cover\\nclassification, urban building segmentation, and cloud detection. By enabling\\nparameter-efficient and physically consistent adaptation, FlexiMo paves the way\\nfor more adaptable and effective foundation models in real-world remote sensing\\napplications.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-03-31T08:46:05Z\"}"}
