{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01669v1\", \"title\": \"The CosmoVerse White Paper: Addressing observational tensions in\\n  cosmology with systematics and fundamental physics\", \"summary\": \"The standard model of cosmology has provided a good phenomenological\\ndescription of a wide range of observations both at astrophysical and\\ncosmological scales for several decades. This concordance model is constructed\\nby a universal cosmological constant and supported by a matter sector described\\nby the standard model of particle physics and a cold dark matter contribution,\\nas well as very early-time inflationary physics, and underpinned by gravitation\\nthrough general relativity. There have always been open questions about the\\nsoundness of the foundations of the standard model. However, recent years have\\nshown that there may also be questions from the observational sector with the\\nemergence of differences between certain cosmological probes. In this White\\nPaper, we identify the key objectives that need to be addressed over the coming\\ndecade together with the core science projects that aim to meet these\\nchallenges. These discordances primarily rest on the divergence in the\\nmeasurement of core cosmological parameters with varying levels of statistical\\nconfidence. These possible statistical tensions may be partially accounted for\\nby systematics in various measurements or cosmological probes but there is also\\na growing indication of potential new physics beyond the standard model. After\\nreviewing the principal probes used in the measurement of cosmological\\nparameters, as well as potential systematics, we discuss the most promising\\narray of potential new physics that may be observable in upcoming surveys. We\\nalso discuss the growing set of novel data analysis approaches that go beyond\\ntraditional methods to test physical models. [Abridged]\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,gr-qc,hep-ph\", \"published\": \"2025-04-02T12:17:19Z\"}"}
