{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05952v1\", \"title\": \"Contrasting magnetism in VPS3 and CrI3 monolayers with the common\\n  honeycomb S = 3/2 spin lattice\", \"summary\": \"Two-dimensional (2D) magnetic materials are promising candidates for\\nspintronics and quantum technologies. One extensively studied example is the\\nferromagnetic (FM) CrI$_3$ monolayer with the honeycomb Cr$^{3+}$ ($t_{2g}^3$,\\n$S$ = 3/2) spin lattice, while VPS$_3$ has a same honeycomb $S$ = 3/2 spin\\nlattice (V$^{2+}$, $t_{2g}^3$) but displays N$\\\\acute{e}$el antiferromagnetism\\n(AFM). In this work, we study the electronic structure and particularly the\\ncontrasting magnetism of VPS$_3$ and CrI$_3$ monolayers. We find that VPS$_3$\\nis a Mott-Hubbard insulator but CrI$_3$ is a charge-transfer insulator, and\\ntherefore their magnetic exchange mechanisms are essentially different. The\\nfirst nearest-neighbor (1NN) direct $d$-$d$ exchange dominates in VPS$_3$, thus\\nleading to a strong antiferromagnetic (AF) coupling. However, the formation of\\nvanadium vacancies, associated with instability of the low-valence V$^{2+}$\\nions, suppresses the AF coupling and thus strongly reduces the N$\\\\acute{e}$el\\ntemperature ($T_{\\\\text{N}}$) in line with the experimental observation. In\\ncontrast, our results reveal that the major 1NN $d$-$p$-$d$ superexchanges in\\nCrI$_3$ via different channels give rise to competing FM and AF couplings,\\nultimately resulting in a weak FM coupling as observed experimentally. After\\nrevisiting several important superexchange channels reported in the literature,\\nbased on our MLWFs and tight-binding analyses, we note that some antiphase\\ncontributions must be subtly and simultaneously considered, and thus we provide\\na deeper insight into the FM coupling of CrI$_3$. Moreover, we identify and\\ncompare the major contributions to the magnetic anisotropy, i.e., a weak shape\\nanisotropy in VPS$_3$ and a relatively strong exchange anisotropy in CrI$_3$.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-08T12:06:05Z\"}"}
