{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01373v1\", \"title\": \"UniFault: A Fault Diagnosis Foundation Model from Bearing Data\", \"summary\": \"Machine fault diagnosis (FD) is a critical task for predictive maintenance,\\nenabling early fault detection and preventing unexpected failures. Despite its\\nimportance, existing FD models are operation-specific with limited\\ngeneralization across diverse datasets. Foundation models (FM) have\\ndemonstrated remarkable potential in both visual and language domains,\\nachieving impressive generalization capabilities even with minimal data through\\nfew-shot or zero-shot learning. However, translating these advances to FD\\npresents unique hurdles. Unlike the large-scale, cohesive datasets available\\nfor images and text, FD datasets are typically smaller and more heterogeneous,\\nwith significant variations in sampling frequencies and the number of channels\\nacross different systems and applications. This heterogeneity complicates the\\ndesign of a universal architecture capable of effectively processing such\\ndiverse data while maintaining robust feature extraction and learning\\ncapabilities. In this paper, we introduce UniFault, a foundation model for\\nfault diagnosis that systematically addresses these issues. Specifically, the\\nmodel incorporates a comprehensive data harmonization pipeline featuring two\\nkey innovations. First, a unification scheme transforms multivariate inputs\\ninto standardized univariate sequences while retaining local inter-channel\\nrelationships. Second, a novel cross-domain temporal fusion strategy mitigates\\ndistribution shifts and enriches sample diversity and count, improving the\\nmodel generalization across varying conditions. UniFault is pretrained on over\\n9 billion data points spanning diverse FD datasets, enabling superior few-shot\\nperformance. Extensive experiments on real-world FD datasets demonstrate that\\nUniFault achieves SoTA performance, setting a new benchmark for fault diagnosis\\nmodels and paving the way for more scalable and robust predictive maintenance\\nsolutions.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-02T05:34:27Z\"}"}
