{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01366v1\", \"title\": \"Virtual Reality and Artificial Intelligence as Psychological\\n  Countermeasures in Space and Other Isolated and Confined Environments: A\\n  Scoping Review\", \"summary\": \"Spaceflight is an isolated and confined environment (ICE) that exposes\\nastronauts to psychological hazards, such as stress, danger, and monotony.\\nVirtual reality (VR) and artificial intelligence (AI) technologies can serve as\\npsychological countermeasures as they can digitally simulate immersive\\nenvironments, interactive companions, and therapeutic experiences. Our study\\nemploys a scoping literature review approach to identify what is currently\\nknown about the use and effectiveness of VR and AI-based interventions as\\npsychological countermeasures to improve mood or emotional states in adults in\\nspace or other ICEs. Additionally, this review aimed to identify gaps in the\\nknowledge base and whether a systematic review with meta-analysis was\\nwarranted. The review included studies where the intervention was used or\\nintended for use in space or other extraterrestrial environments (ICE). Our\\nsearch strategy yielded 19 studies from 3390 records across seven major\\ndatabases. All studies focused on VR-based interventions, with no eligible\\nAI-based intervention studies found. VR interventions were found to be\\neffective for relaxation and improving mood, emergency training, as an\\ninteractive communication platform, for comparing interior designs, and for\\nenhancing exercise. There were improvements for measures of mood and emotion\\\\n\\n(e.g., anxiety and stress); however, user preferences varied, and some\\ninstances of cybersickness were reported. A systematic review with\\nmeta-analysis is not recommended due to the heterogeneity of results. There is\\nsignificant scope for further research into the use of VR for a wider range of\\nmood and emotion variables using standardised assessment instruments.\\nAdditionally, the potential application of AI as a psychological countermeasure\\nwarrants further investigation.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC,cs.AI,cs.MM\", \"published\": \"2025-04-02T05:25:29Z\"}"}
