{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06581v1\", \"title\": \"Right Prediction, Wrong Reasoning: Uncovering LLM Misalignment in RA\\n  Disease Diagnosis\", \"summary\": \"Large language models (LLMs) offer a promising pre-screening tool, improving\\nearly disease detection and providing enhanced healthcare access for\\nunderprivileged communities. The early diagnosis of various diseases continues\\nto be a significant challenge in healthcare, primarily due to the nonspecific\\nnature of early symptoms, the shortage of expert medical practitioners, and the\\nneed for prolonged clinical evaluations, all of which can delay treatment and\\nadversely affect patient outcomes. With impressive accuracy in prediction\\nacross a range of diseases, LLMs have the potential to revolutionize clinical\\npre-screening and decision-making for various medical conditions. In this work,\\nwe study the diagnostic capability of LLMs for Rheumatoid Arthritis (RA) with\\nreal world patients data. Patient data was collected alongside diagnoses from\\nmedical experts, and the performance of LLMs was evaluated in comparison to\\nexpert diagnoses for RA disease prediction. We notice an interesting pattern in\\ndisease diagnosis and find an unexpected \\\\textit{misalignment between\\nprediction and explanation}. We conduct a series of multi-round analyses using\\ndifferent LLM agents. The best-performing model accurately predicts rheumatoid\\narthritis (RA) diseases approximately 95\\\\% of the time. However, when medical\\nexperts evaluated the reasoning generated by the model, they found that nearly\\n68\\\\% of the reasoning was incorrect. This study highlights a clear misalignment\\nbetween LLMs high prediction accuracy and its flawed reasoning, raising\\nimportant questions about relying on LLM explanations in clinical settings.\\n\\\\textbf{LLMs provide incorrect reasoning to arrive at the correct answer for RA\\ndisease diagnosis.}\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI\", \"published\": \"2025-04-09T05:04:01Z\"}"}
