{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02569v1\", \"title\": \"Fluorine production in He-burning regions of massive stars during cosmic\\n  history\", \"summary\": \"The origin of fluorine is still a debated question. AGB stars synthesise this\\nelement and likely contribute significantly to its synthesis in the present-day\\nUniverse. However, it is not clear whether other sources contribute, especially\\nin the early Universe. We discuss variations of the surface abundances of\\nfluorine coming from our massive star models and compare them with available\\npresent-day observations. We compute the contribution of massive stars in\\nproducing 19F over metallicities covering the whole cosmic history. We used\\nmodels in the mass range of 9Msol < Mini < 300Msol at metallicities from Pop\\nIII up to super-solar while accounting for the required nuclear network to\\nfollow the evolution of 19F during the core H- and He-burning phases. Results\\nfrom models with and without rotational mixing are presented. We find that\\nrotating models predict a slight depletion of fluorine at their surface at the\\nend of the MS phase. In more advanced evolutionary phases, only models with an\\ninitial mass larger than 25Msol at metallicities Z > 0.014 show phases where\\nthe abundance of fluorine is enhanced. This occurs when the star is a WR star\\nof the WC type. WC stars can show surface abundances of fluorine ten times\\nlarger than their initial abundance. However, we obtained that the winds of\\nmassive stars at metallicities larger than Z=0.006 do not significantly\\ncontribute to fluorine production, confirming previous findings. In contrast,\\nvery metal-poor rapidly rotating massive star models may be important sources\\nof fluorine through the mass expelled at the time of their SN explosion.\\nObservations of WC stars at solar or super-solar metallicities may provide very\\ninteresting indications on the nuclear pathways that lead to fluorine\\nproduction in massive stars. The possibility of observing fluorine-rich CEMPs\\nis also a way to put constrains in present models at very low metallicities.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA\", \"published\": \"2025-04-03T13:36:04Z\"}"}
