{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05823v1\", \"title\": \"New cosystolic high-dimensional expanders from KMS groups\", \"summary\": \"Cosystolic expansion is a high-dimensional generalization of the Cheeger\\nconstant for simplicial complexes. Originally, this notion was motivated by the\\nfact that it implies the topological overlapping property, but more recently it\\nwas shown to be connected to problems in theoretical computer science such as\\nlist agreement expansion and agreement expansion in the low soundness regime.\\n  There are only a few constructions of high-dimensional cosystolic expanders\\nand, in dimension larger than $2$, the only known constructions prior to our\\nwork were (co-dimension 1)-skeletons of quotients of affine buildings. In this\\npaper, we give the first coset complex construction of cosystolic expanders for\\nan arbitrary dimension. Our construction is more symmetric and arguably more\\nelementary than the previous constructions relying on quotients of affine\\nbuildings.\\n  The coset complexes we consider arise from finite quotients of\\nKac--Moody--Steinberg (KMS) groups and are known as KMS complexes. KMS\\ncomplexes were introduced in recent work by Grave de Peralta and\\nValentiner-Branth where it was shown that they are local-spectral expanders.\\nOur result is that KMS complexes, satisfying some minor condition, give rise to\\ninfinite families of bounded degree cosystolic expanders of arbitrary dimension\\nand for any finitely generated Abelian coefficient group.\\n  This result is achieved by observing that proper links of KMS complexes are\\njoins of opposition complexes in spherical buildings. In order to show that\\nthese opposition complexes are coboundary expanders, we develop a new method\\nfor constructing cone functions by iteratively adding sets of vertices. Hence\\nwe show that the links of KMS complexes are coboundary expanders. Using the\\nprior local-to-global results, we obtain cosystolic expansion for the\\n(co-dimension 1)-skeletons of the KMS complexes.\", \"main_category\": \"math.CO\", \"categories\": \"math.CO,math.GR\", \"published\": \"2025-04-08T09:05:46Z\"}"}
