{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24079v1\", \"title\": \"Joint model for zero-inflated data combining fishery-dependent and\\n  fishery-independent sources\", \"summary\": \"Accurately identifying spatial patterns of species distribution is crucial\\nfor scientific insight and societal benefit, aiding our understanding of\\nspecies fluctuations. The increasing quantity and quality of ecological\\ndatasets present heightened statistical challenges, complicating spatial\\nspecies dynamics comprehension. Addressing the complex task of integrating\\nmultiple data sources to enhance spatial fish distribution understanding in\\nmarine ecology, this study introduces a pioneering five-layer Joint model. The\\nmodel adeptly integrates fishery-independent and fishery-dependent data,\\naccommodating zero-inflated data and distinct sampling processes. A\\ncomprehensive simulation study evaluates the model performance across various\\npreferential sampling scenarios and sample sizes, elucidating its advantages\\nand challenges. Our findings highlight the model's robustness in estimating\\npreferential parameters, emphasizing differentiation between presence-absence\\nand biomass observations. Evaluation of estimation of spatial covariance and\\nprediction performance underscores the model's reliability. Augmenting sample\\nsizes reduces parameter estimation variability, aligning with the principle\\nthat increased information enhances certainty. Assessing the contribution of\\neach data source reveals successful integration, providing a comprehensive\\nrepresentation of biomass patterns. Empirical validation within a real-world\\ncontext further solidifies the model's efficacy in capturing species' spatial\\ndistribution. This research advances methodologies for integrating diverse\\ndatasets with different sampling natures further contributing to a more\\ninformed understanding of spatial dynamics of marine species.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME\", \"published\": \"2025-03-31T13:33:58Z\"}"}
