{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05858v1\", \"title\": \"Structural and Electrical Transport Properties of NASICON type\\n  Na$_{3}$Zr$_{2-x}$Ti$_{x}$Si$_2$PO$_{\\\\rm 12}$ ($x=$ 0.1-0.4) Solid\\n  Electrolyte Materials\", \"summary\": \"We report the structural, resistivity, impedance, and dielectric studies of\\nisovalent substituted Na$_{3}$Zr$_{2-x}$Ti$_{x}$Si$_2$PO$_{\\\\rm 12}$ ($x=$\\n0.1--0.4) NASICON type solid electrolyte materials. The Rietveld refinement of\\nXRD patterns shows the monoclinic phase with space group of C 2/c for all the\\nsamples. The resistivity analysis shows the Arrhenius-type thermal conduction\\nwith an increase in activation energy with doping is explained based on\\ndecreased unit cell volume. We use Maxwell-Wagner-Sillars (MWS) relaxation and\\nspace charge or interfacial polarization models to explain the frequency and\\ntemperature-dependent variations of electric permittivity. The double\\nrelaxation peaks in the dielectric loss data show the two types of relaxation\\nmechanisms of different activation energy. The real ($\\\\epsilon^{'}$) and\\nimaginary ($\\\\epsilon^{''}$) parts of permittivity are fitted using the modified\\nCole-Cole equation, including the conductivity term, which show the non-Debye\\ntype relaxation over the measured frequency and temperature range. The\\nimpedance analysis shows the contributions from grain and grain boundary\\nrelaxation. The fitting performed using the impedance and constant-phase\\nelement (CPE) confirm the non-Debye type relaxation. Moreover, the electric\\nmodulus analysis confirms the ionic nature having thermally activated\\nrelaxation and the modulus scaling analysis shows a similar type of relaxation\\nin the measured temperature range. The modified power law is used to understand\\nthe frequency dependence of {\\\\it a.c.} conductivity data. The temperature\\ndependence of exponent ($s$) in modified power law suggests the change in the\\nconduction mechanism from near small polaron tunneling (NSPT) to correlated\\nbarrier hopping (CBH) above room temperature. The larger values of\\n$\\\\epsilon$$_{r}$ indicate these materials as a potential candidate for\\ncharge-storage devices.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-08T09:36:05Z\"}"}
