{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06185v1\", \"title\": \"WoundAmbit: Bridging State-of-the-Art Semantic Segmentation and\\n  Real-World Wound Care\", \"summary\": \"Chronic wounds affect a large population, particularly the elderly and\\ndiabetic patients, who often exhibit limited mobility and co-existing health\\nconditions. Automated wound monitoring via mobile image capture can reduce\\nin-person physician visits by enabling remote tracking of wound size. Semantic\\nsegmentation is key to this process, yet wound segmentation remains\\nunderrepresented in medical imaging research. To address this, we benchmark\\nstate-of-the-art deep learning models from general-purpose vision, medical\\nimaging, and top methods from public wound challenges. For fair comparison, we\\nstandardize training, data augmentation, and evaluation, conducting\\ncross-validationto minimize partitioning bias. We also assess real-world\\ndeployment aspects, including generalization to an out-of-distribution wound\\ndataset, computational efficiency, and interpretability. Additionally, we\\npropose a reference object-based approach to convert AI-generated masks into\\nclinically relevant wound size estimates, and evaluate this, along with mask\\nquality, for the best models based on physician assessments. Overall, the\\ntransformer-based TransNeXt showed the highest levels of generalizability.\\nDespite variations in inference times, all models processed at least one image\\nper second on the CPU, which is deemed adequate for the intended application.\\nInterpretability analysis typically revealed prominent activations in wound\\nregions, emphasizing focus on clinically relevant features. Expert evaluation\\nshowed high mask approval for all analyzed models, with VWFormer and ConvNeXtS\\nbackbone performing the best. Size retrieval accuracy was similar across\\nmodels, and predictions closely matched expert annotations. Finally, we\\ndemonstrate how our AI-driven wound size estimation framework, WoundAmbit, can\\nbe integrated into a custom telehealth system. Our code will be made available\\non GitHub upon publication.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-08T16:25:59Z\"}"}
