{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02518v1\", \"title\": \"Online Multivariate Regularized Distributional Regression for\\n  High-dimensional Probabilistic Electricity Price Forecasting\", \"summary\": \"Probabilistic electricity price forecasting (PEPF) is a key task for market\\nparticipants in short-term electricity markets. The increasing availability of\\nhigh-frequency data and the need for real-time decision-making in energy\\nmarkets require online estimation methods for efficient model updating. We\\npresent an online, multivariate, regularized distributional regression model,\\nallowing for the modeling of all distribution parameters conditional on\\nexplanatory variables. Our approach is based on the combination of the\\nmultivariate distributional regression and an efficient online learning\\nalgorithm based on online coordinate descent for LASSO-type regularization.\\nAdditionally, we propose to regularize the estimation along a path of\\nincreasingly complex dependence structures of the multivariate distribution,\\nallowing for parsimonious estimation and early stopping. We validate our\\napproach through one of the first forecasting studies focusing on multivariate\\nprobabilistic forecasting in the German day-ahead electricity market while\\nusing only online estimation methods. We compare our approach to online\\nLASSO-ARX-models with adaptive marginal distribution and to online univariate\\ndistributional models combined with an adaptive Copula. We show that the\\nmultivariate distributional regression, which allows modeling all distribution\\nparameters - including the mean and the dependence structure - conditional on\\nexplanatory variables such as renewable in-feed or past prices provide superior\\nforecasting performance compared to modeling of the marginals only and keeping\\na static/unconditional dependence structure. Additionally, online estimation\\nyields a speed-up by a factor of 80 to over 400 times compared to batch\\nfitting.\", \"main_category\": \"stat.ML\", \"categories\": \"stat.ML,econ.EM,q-fin.ST,stat.AP,stat.CO\", \"published\": \"2025-04-03T12:08:51Z\"}"}
