{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02358v1\", \"title\": \"Interference trapping of populations in a semi-infinite\\n  coupled-resonator waveguide\", \"summary\": \"We study the energy structure and dynamics of a two-level emitter (2LE)\\nlocally coupled to a semi-infinite one-dimensional (1D) coupled-resonator array\\n(CRA). The energy spectrum in the single-excitation subspace features a\\ncontinuous band with scattering states, discrete levels with bound states, and\\na quantum phase transition characterized by the change of the number of bound\\nstates. The number of bound states is revealed by the behavior of the\\nexcited-state population at long times with quantum beat, residual oscillation,\\na constant with either non-zero or zero.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-03T07:45:42Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02374v1\", \"title\": \"On an Unnoticed Geometrical Paradox in Plato's Timaeus' Cosmology\", \"summary\": \"In a previous article, we discussed a paradox in Timaeus' cosmology: that\\nthere is no void inside the universe, even though it is entirely filled with\\npolyhedra-a mathematical impossibility (Brisson-Ofman 2025). In the present\\narticle, we examine another paradox. While the first paradox is well known and\\nwas already highlighted by Aristotle as a fundamental mathematical\\ncontradiction undermining Plato's cosmology, this new paradox has gone almost\\nentirely unnoticed by commentators, both ancient and modern. This oversight may\\nsurprise scholars, given the extensive body of work on Timaeus' universe, much\\nof which emphasizes discrepancies with astronomical observations or points out\\nsupposed internal contradictions. Like the first paradox, this one arises from\\nthe premise of a universe entirely filled with polyhedra. However, in this\\ncase, the contradiction stems from the absence of void outside it. In the first\\nsection, we demonstrate that the shape of the universe cannot be a perfect\\nmathematical sphere: that is, its boundary is not smooth but exhibits bumps and\\nhollows. Next, we present conceptual arguments from Plato's text that support\\nthe necessity of such 'defects' in the universe's shape compared to a perfect\\nmathematical sphere. In the third section, we argue that such a universe cannot\\nmove at all. Finally, we propose a solution to this mathematical contradiction\\nin Timaeus' construction, drawing on the same ideas used to address the earlier\\napparent contradiction: the unique feature of Timaeus' universe as a living\\nbeing, whose parts are continuously moving, changing, decomposing, and\\nreforming. While this problem does not depend on the various schools of\\ninterpretation of the Timaeus, it is related to some important issues\\nconcerning Plato's philosophy. These issues include the importance of\\nobservations in science-particularly in astronomy-the relationship between\\nintelligible models and their sensible copies, the mythos/ logos approach of\\nPlato's cosmology, and the debate over 'metaphorical' vs 'literal'\\ninterpretation. Of course, all these questions fall outside the scope of this\\narticle and will not be addressed here.\", \"main_category\": \"math.HO\", \"categories\": \"math.HO\", \"published\": \"2025-04-03T08:08:21Z\"}"}
