{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01595v1\", \"title\": \"JWST MIRI reveals the diversity of nuclear mid-infrared spectra of\\n  nearby type-2 quasars\", \"summary\": \"Type-2 quasars (QSO2s) are active galactic nuclei (AGN) seen through a\\nsignificant amount of dust and gas that obscures the central supermassive black\\nhole and the broad line region. Here we present new mid-infrared spectra of the\\ncentral kiloparsec of five optically-selected QSO2s at redshift z~0.1 obtained\\nwith JWST/MIRI/MRS. These QSO2s belong to the QSOFEED sample and they have log\\nLbol=45.5-46.0 erg/s, global SFRs that place them above the main sequence, and\\npractically identical optical spectral shape and [OIII] luminosity, but their\\nnuclear mid-infrared spectra exhibit an unexpected diversity of both continua\\nand features. They show: 1) 9.7 micron silicate features going from emission\\n(strength of S9.7=0.5) to relatively strong absorption (S9.7=-1.0) and 18 and\\n23 micron silicates either in emission or flat. In addition, two of the QSO2s\\nshow absorption bands of CO, H2O, and aliphatic grains, indicating different\\nlevels of nuclear obscuration across the sample. 2) [NeV]/[NeII] ratios ranging\\nfrom 0.1 to 2.1 and [NeIII]/[NeII] from 1.0 to 3.5, indicating different\\ncoronal line and ionizing continuum strengths. 3) Warm molecular gas masses of\\n1-4x10^7 Msun and warm-to-cold gas mass ratios of 1-2%, with molecular gas\\nexcitation likely due to jet-induced shocks in J1430+1339, and to UV heating\\nand/or turbulence in J1509+0434. 4) PAH emission features with equivalent\\nwidths ranging from <0.002 to 0.075 micron, from which we measure a larger\\ncontribution from neutral molecules (PAH 11.3/6.2=1.3-3.4) and SFRs<3-7\\nMsun/yr. This unprecedented dataset allowed us to start exploring the role of\\nvarious AGN and galaxy properties including ionizing continuum, obscuration,\\nelectron density, and jet-ISM interactions on some of the spectral differences\\nlisted above, but larger samples are now required to fully understand the\\ndiversity of QSO2s' nuclear mid-infrared spectra.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-02T11:02:01Z\"}"}
