{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07844v1\", \"title\": \"A quantum computing approach to beam angle optimization\", \"summary\": \"Background: Beam angle optimization (BAO) is a critical component of\\nradiation therapy (RT) treatment planning, where small changes in beam\\nconfiguration can significantly impact treatment quality, especially for proton\\nRT. Mathematically, BAO is a mixed integer programming (MIP) problem, which is\\nNP-hard due to its exponential growing search space. Traditional optimization\\ntechniques often struggle with computational efficiency, necessitating the\\ndevelopment of novel approaches. Purpose: This study introduces QC-BAO, a\\nhybrid quantum-classical approach that leverages quantum computing to solve the\\nMIP formulation of BAO. Methods: The proposed approach, QC-BAO, models BAO as\\nan MIP problem, incorporating binary variables for beam angle selection and\\ncontinuous variables for optimizing spot intensities for proton therapy. The\\nproposed approach employs a hybrid quantum-classical framework, utilizing\\nquantum computing to solve the binary decision component while integrating\\nclassical optimization techniques, including iterative convex relaxation and\\nalternating direction method of multipliers. Results: Computational experiments\\nwere conducted on clinical test cases to evaluate QC-BAO's performance against\\nclinically verified angles and a heuristic approach, GS-BAO. QC-BAO\\ndemonstrated improved treatment plan quality over both clinical and GS-BAO. The\\nmethod consistently increased the conformity index (CI) for target coverage\\nwhile reducing mean and maximum doses to organs-at-risk (OAR). Additionally,\\nQC-BAO produced the lowest objective function value, confirming its superior\\noptimization capability. Conclusions: The findings highlight the potential of\\nquantum computing to enhance the solution to BAO problem by demonstrated\\nimprovement in plan quality using the proposed method, QC-BAO. This study paves\\nthe way for future clinical implementation of quantum-accelerated optimization\\nin RT.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph\", \"published\": \"2025-04-10T15:24:37Z\"}"}
