{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24008v1\", \"title\": \"H2VU-Benchmark: A Comprehensive Benchmark for Hierarchical Holistic\\n  Video Understanding\", \"summary\": \"With the rapid development of multimodal models, the demand for assessing\\nvideo understanding capabilities has been steadily increasing. However,\\nexisting benchmarks for evaluating video understanding exhibit significant\\nlimitations in coverage, task diversity, and scene adaptability. These\\nshortcomings hinder the accurate assessment of models' comprehensive video\\nunderstanding capabilities. To tackle this challenge, we propose a hierarchical\\nand holistic video understanding (H2VU) benchmark designed to evaluate both\\ngeneral video and online streaming video comprehension. This benchmark\\ncontributes three key features:\\n  Extended video duration: Spanning videos from brief 3-second clips to\\ncomprehensive 1.5-hour recordings, thereby bridging the temporal gaps found in\\ncurrent benchmarks. Comprehensive assessment tasks: Beyond traditional\\nperceptual and reasoning tasks, we have introduced modules for\\ncountercommonsense comprehension and trajectory state tracking. These additions\\ntest the models' deep understanding capabilities beyond mere prior knowledge.\\nEnriched video data: To keep pace with the rapid evolution of current AI\\nagents, we have expanded first-person streaming video datasets. This expansion\\nallows for the exploration of multimodal models' performance in understanding\\nstreaming videos from a first-person perspective. Extensive results from H2VU\\nreveal that existing multimodal large language models (MLLMs) possess\\nsubstantial potential for improvement in our newly proposed evaluation tasks.\\nWe expect that H2VU will facilitate advancements in video understanding\\nresearch by offering a comprehensive and in-depth analysis of MLLMs.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-03-31T12:32:51Z\"}"}
