{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23866v1\", \"title\": \"A Channel-Triggered Backdoor Attack on Wireless Semantic Image\\n  Reconstruction\", \"summary\": \"Despite the transformative impact of deep learning (DL) on wireless\\ncommunication systems through data-driven end-to-end (E2E) learning, the\\nsecurity vulnerabilities of these systems have been largely overlooked. Unlike\\nthe extensively studied image domain, limited research has explored the threat\\nof backdoor attacks on the reconstruction of symbols in semantic communication\\n(SemCom) systems. Previous work has investigated such backdoor attacks at the\\ninput level, but these approaches are infeasible in applications with strict\\ninput control. In this paper, we propose a novel attack paradigm, termed\\nChannel-Triggered Backdoor Attack (CT-BA), where the backdoor trigger is a\\nspecific wireless channel. This attack leverages fundamental physical layer\\ncharacteristics, making it more covert and potentially more threatening\\ncompared to previous input-level attacks. Specifically, we utilize channel gain\\nwith different fading distributions or channel noise with different power\\nspectral densities as potential triggers. This approach establishes\\nunprecedented attack flexibility as the adversary can select backdoor triggers\\nfrom both fading characteristics and noise variations in diverse channel\\nenvironments. Moreover, during the testing phase, CT-BA enables automatic\\ntrigger activation through natural channel variations without requiring active\\nadversary participation. We evaluate the robustness of CT-BA on a ViT-based\\nJoint Source-Channel Coding (JSCC) model across three datasets: MNIST,\\nCIFAR-10, and ImageNet. Furthermore, we apply CT-BA to three typical E2E SemCom\\nsystems: BDJSCC, ADJSCC, and JSCCOFDM. Experimental results demonstrate that\\nour attack achieves near-perfect attack success rate (ASR) while maintaining\\neffective stealth. Finally, we discuss potential defense mechanisms against\\nsuch attacks.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.LG\", \"published\": \"2025-03-31T09:17:10Z\"}"}
