{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06055v1\", \"title\": \"Explainable AI for building energy retrofitting under data scarcity\", \"summary\": \"Enhancing energy efficiency in residential buildings is a crucial step toward\\nmitigating climate change and reducing greenhouse gas emissions. Retrofitting\\nexisting buildings, which account for a significant portion of energy\\nconsumption, is critical particularly in regions with outdated and inefficient\\nbuilding stocks. This study presents an Artificial Intelligence (AI) and\\nMachine Learning (ML)-based framework to recommend energy efficiency measures\\nfor residential buildings, leveraging accessible building characteristics to\\nachieve energy class targets. Using Latvia as a case study, the methodology\\naddresses challenges associated with limited datasets, class imbalance and data\\nscarcity. The proposed approach integrates Conditional Tabular Generative\\nAdversarial Networks (CTGAN) to generate synthetic data, enriching and\\nbalancing the dataset. A Multi-Layer Perceptron (MLP) model serves as the\\npredictive model performing multi-label classification to predict appropriate\\nretrofit strategies. Explainable Artificial Intelligence (XAI), specifically\\nSHapley Additive exPlanations (SHAP), ensures transparency and trust by\\nidentifying key features that influence recommendations and guiding feature\\nengineering choices for improved reliability and performance. The evaluation of\\nthe approach shows that it notably overcomes data limitations, achieving\\nimprovements up to 54% in precision, recall and F1 score. Although this study\\nfocuses on Latvia, the methodology is adaptable to other regions, underscoring\\nthe potential of AI in reducing the complexity and cost of building energy\\nretrofitting overcoming data limitations. By facilitating decision-making\\nprocesses and promoting stakeholders engagement, this work supports the global\\ntransition toward sustainable energy use in the residential building sector.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-08T14:00:08Z\"}"}
