{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23825v1\", \"title\": \"Calibration requirements for Epoch of Reionization 21-cm signal\\n  observations -- IV. Bias and variance with time and frequency correlated\\n  residual gains\", \"summary\": \"Observation of multifrequency angular power spectrum of the redshifted 21-cm\\nbrightness temperature fluctuation from the neutral hydrogen holds the key to\\nunderstand the structure formation and its evolution during the reionization\\nand post-reionization era. A major challenge in observing the neutral hydrogen\\narises from presence of strong foreground signals in the frequency range of\\ninterest. Mitigating the direct effect of foregrounds are being addressed\\nthrough various techniques in literature. An additional second order effect\\narises, in presence of foreground, with limited accuracy in time and frequency\\ndependent gain calibrations. This manifests as the residual gain and bandpass\\nerror in the observed data, introduces bias and increases uncertainty in the\\nestimates of multifrequency angular power spectrum. In this work, we present an\\nanalytic method to estimate the bias and excess uncertainty in the estimates of\\nmultifrequency angular power spectrum in presence of residual gain and bandpass\\nerrors. We use this framework to estimate the effect of these errors for\\ndetection of redshifted 21-cm emission from a redshift of $\\\\sim 8$ with the\\nupcoming SKA1-Low. Due to the high baseline density at the required range of\\nangular multipoles, the SKA1-Low is found to be a tuned instrument for the\\nredshifted 21-cm signal detection. We find that, there are scenario with\\nresidual gain and bandpass errors where there can be significant bias in these\\nestimates. Certain foreground mitigation strategies, is expected to reduce a\\npart of the bias. The detailed study of different aspects of gain and bandpass\\nerrors and their relative effects are discussed. We find, with assumed models\\nof gain and bandpass errors, signal detection is possible at this redshift with\\n$128$ hours of observations. However, to achieve this one needs to have better\\ncalibration accuracy than present day interferometers.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,astro-ph.IM\", \"published\": \"2025-03-31T08:19:59Z\"}"}
