{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07073v1\", \"title\": \"New empirical mass-loss recipe for UV radiation line-driven winds of hot\\n  stars across various metallicities\", \"summary\": \"The winds of massive stars remove a significant fraction of their mass,\\nstrongly impacting their evolution. As a star evolves, the rate at which it\\nloses mass changes. In stellar evolution codes, different mass-loss recipes are\\nemployed for different evolutionary stages. The choice of the recipes is\\nuser-dependent and the conditions for switching between them are poorly\\ndefined. Focusing on hot stars, we aim to produce a physically motivated,\\nempirically calibrated mass-loss recipe suitable for a wide range of\\nmetallicities. We want to provide a ready-to-use universal recipe that\\neliminates the need for switching between recipes for hot stars during stellar\\nevolution calculations. We compile a sample of hot stars with reliable stellar\\nand wind parameters in the Galaxy and the Magellanic Clouds. The sample is used\\nto determine the dependence of the mass-loss rate on the basic stellar\\nparameters. We find that independent of evolutionary stage and temperature, the\\nwind mass-loss rate is a function of the electron-scattering Eddington\\nparameter ($\\\\Gamma_e$) and metallicity (Z), being in line with expectations of\\nradiation-driven wind theory. Our derived scaling relation provides an adequate\\n($\\\\Delta$log($\\\\dot{M}$/(M$_\\\\odot$/yr)) = 0.43) and broadly applicable mass-loss\\nrecipe for hot stars. The newly derived mass-loss recipe covers nearly the\\nentire parameter space of hot stars with UV radiation-driven winds and\\neliminates the need for interpolation between mass-loss formulae at different\\nevolutionary stages when applied in stellar evolution models. Examples of\\nstellar evolution calculations using our new recipe reveal that the predictions\\non the ionizing fluxes and final fates of massive stars, especially at low\\nmetallicity, differ significantly from models that use the standard mass-loss\\nrates, impacting our understanding of stellar populations at low metallicity\\nand in the young Universe.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA\", \"published\": \"2025-04-09T17:43:35Z\"}"}
