{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07719v1\", \"title\": \"Counting Hours, Counting Losses: The Toll of Unpredictable Work\\n  Schedules on Financial Security\", \"summary\": \"Financial instability has become a significant issue in today's society.\\nWhile research typically focuses on financial aspects, there is a tendency to\\noverlook time-related aspects of unstable work schedules. The inability to rely\\non consistent work schedules leads to burnout, work-family conflicts, and\\nfinancial shocks that directly impact workers' income and assets. Unforeseen\\nfluctuations in earnings pose challenges in financial planning, affecting\\ndecisions on savings and spending and ultimately undermining individuals'\\nlong-term financial stability and well-being.\\n  This issue is particularly evident in sectors where workers experience\\nfrequently changing schedules without sufficient notice, including those in the\\nfood service and retail sectors, part-time and hourly workers, and individuals\\nwith lower incomes. These groups are already more financially vulnerable, and\\nthe unpredictable nature of their schedules exacerbates their financial\\nfragility.\\n  Our objective is to understand how unforeseen fluctuations in earnings\\nexacerbate financial fragility by investigating the extent to which\\nindividuals' financial management depends on their ability to anticipate and\\nplan for the future. To address this question, we develop a simulation\\nframework that models how individuals optimize utility amidst financial\\nuncertainty and the imperative to avoid financial ruin. We employ online\\nlearning techniques, specifically adapting workers' consumption policies based\\non evolving information about their work schedules.\\n  With this framework, we show both theoretically and empirically how a\\nworker's capacity to anticipate schedule changes enhances their long-term\\nutility. Conversely, the inability to predict future events can worsen workers'\\ninstability. Moreover, our framework enables us to explore interventions to\\nmitigate the problem of schedule uncertainty and evaluate their effectiveness.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI,cs.CY\", \"published\": \"2025-04-10T13:09:56Z\"}"}
