{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02812v1\", \"title\": \"BOP Challenge 2024 on Model-Based and Model-Free 6D Object Pose\\n  Estimation\", \"summary\": \"We present the evaluation methodology, datasets and results of the BOP\\nChallenge 2024, the sixth in a series of public competitions organized to\\ncapture the state of the art in 6D object pose estimation and related tasks. In\\n2024, our goal was to transition BOP from lab-like setups to real-world\\nscenarios. First, we introduced new model-free tasks, where no 3D object models\\nare available and methods need to onboard objects just from provided reference\\nvideos. Second, we defined a new, more practical 6D object detection task where\\nidentities of objects visible in a test image are not provided as input. Third,\\nwe introduced new BOP-H3 datasets recorded with high-resolution sensors and\\nAR/VR headsets, closely resembling real-world scenarios. BOP-H3 include 3D\\nmodels and onboarding videos to support both model-based and model-free tasks.\\nParticipants competed on seven challenge tracks, each defined by a task, object\\nonboarding setup, and dataset group. Notably, the best 2024 method for\\nmodel-based 6D localization of unseen objects (FreeZeV2.1) achieves 22% higher\\naccuracy on BOP-Classic-Core than the best 2023 method (GenFlow), and is only\\n4% behind the best 2023 method for seen objects (GPose2023) although being\\nsignificantly slower (24.9 vs 2.7s per image). A more practical 2024 method for\\nthis task is Co-op which takes only 0.8s per image and is 25X faster and 13%\\nmore accurate than GenFlow. Methods have a similar ranking on 6D detection as\\non 6D localization but higher run time. On model-based 2D detection of unseen\\nobjects, the best 2024 method (MUSE) achieves 21% relative improvement compared\\nto the best 2023 method (CNOS). However, the 2D detection accuracy for unseen\\nobjects is still noticealy (-53%) behind the accuracy for seen objects\\n(GDet2023). The online evaluation system stays open and is available at\\nhttp://bop.felk.cvut.cz/\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-03T17:55:19Z\"}"}
