{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05854v1\", \"title\": \"50 Dra: Am-type twins with additional variability in a non-eclipsing\\n  system\", \"summary\": \"The interplay between radiative diffusion, rotation, convection, and\\nmagnetism in metallic-line chemically peculiar stars is still not fully\\nunderstood. Recently, evidence has emerged that these effects can work\\ntogether. Our goal is to study the bright binary system 50 Dra, describe its\\norbit and components, and study additional variability. We conducted our\\nanalysis using TESS short-cadence data and new high-resolution spectroscopic\\nobservations. We disentangled the spectra using Korel and performed spectral\\nsynthesis with Atlas9 and Synthe codes. The system was modelled using Korel and\\nPhoebe2.4. We also employed SED fitting in Ariadne and isochrone fitting using\\nParam1.5 codes. Our findings indicate that the non-eclipsing system (with an\\ninclination of 49.9(8) deg) 50 Dra, displaying ellipsoidal brightness\\nvariations, consists of two nearly equal A-type stars with masses of\\n$M_{1}=2.08(8)$ and $M_{2}=1.97(8)$ M$_{\\\\odot}$ and temperatures of 9800(100)\\nand 9200(200) K, respectively. Our analysis also suggests that the system, with\\nan orbital period of $P_{\\\\rm orb}=4.117719(2)$ days, is tidally relaxed with a\\ncircular orbit and synchronous rotation of the components. Furthermore, we\\ndiscovered that both stars are metallic-line Am chemically peculiar stars with\\nan underabundance of Sc and an overabundance of iron-peak and rare-earth\\nelements. We identified additional variations with slightly higher frequency\\nthan the rotational frequency of the components that we interpret as prograde\\ng-mode pulsations. The system 50 Dra exhibits numerous exciting phenomena that\\nco-exist together and may have an impact on our understanding of chemical\\npeculiarity and pulsations.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-08T09:32:49Z\"}"}
