{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24244v1\", \"title\": \"The 2-Token Theorem: Recognising History-Deterministic Parity Automata\\n  Efficiently\", \"summary\": \"History-determinism is a restricted notion of nondeterminism in automata,\\nwhere the nondeterminism can be successfully resolved based solely on the\\nprefix read so far. History-deterministic automata still allow for exponential\\nsuccinctness in automata over infinite words compared to deterministic automata\\n(Kuperberg and Skrzypczak, 2015), allow for canonical forms unlike\\ndeterministic automata (Abu Radi and Kupferman, 2019 and 2020; Ehlers and\\nSchewe, 2022), and retain some of the algorithmic properties of deterministic\\nautomata, for example for reactive synthesis (Henzinger and Piterman, 2006;\\nEhlers and Khalimov, 2024).\\n  Despite the topic of history-determinism having received a lot of attention\\nover the last decade, the complexity of deciding whether a parity automaton is\\nhistory-deterministic has, up till now, remained open. We show that\\nhistory-determinism for a parity automaton with a fixed parity index can be\\nchecked in PTIME, thus improving upon the naive EXPTIME upper bound of\\nHenzinger and Piterman that has stood since 2006. More precisely, we show that\\nthe so-called 2-token game, which can be solved in PTIME for parity automata\\nwith a fixed parity index, characterises history-determinism for parity\\nautomata. This game was introduced by Bagnol and Kuperberg in 2018, who showed\\nthat to decide if a B\\\\\\\"uchi automaton is history-determinism, it suffices to\\nfind the winner of the 2-token game on it. They conjectured that this 2-token\\ngame based characterisation extends to parity automata. Boker, Kuperberg,\\nLehtinen, and Skrzypcak showed in 2020 that this conjecture holds for coB\\\\\\\"uchi\\nautomata as well. We prove Bagnol and Kuperberg's conjecture that the winner of\\nthe 2-token game characterises history-determinism on parity automata.\", \"main_category\": \"cs.FL\", \"categories\": \"cs.FL\", \"published\": \"2025-03-31T15:57:44Z\"}"}
