{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05223v1\", \"title\": \"Reducing the Communication of Distributed Model Predictive Control:\\n  Autoencoders and Formation Control\", \"summary\": \"Communication remains a key factor limiting the applicability of distributed\\nmodel predictive control (DMPC) in realistic settings, despite advances in\\nwireless communication. DMPC schemes can require an overwhelming amount of\\ninformation exchange between agents as the amount of data depends on the length\\nof the predication horizon, for which some applications require a significant\\nlength to formally guarantee nominal asymptotic stability. This work aims to\\nprovide an approach to reduce the communication effort of DMPC by reducing the\\nsize of the communicated data between agents. Using an autoencoder, the\\ncommunicated data is reduced by the encoder part of the autoencoder prior to\\ncommunication and reconstructed by the decoder part upon reception within the\\ndistributed optimization algorithm that constitutes the DMPC scheme. The choice\\nof a learning-based reduction method is motivated by structure inherent to the\\ndata, which results from the data's connection to solutions of optimal control\\nproblems. The approach is implemented and tested at the example of formation\\ncontrol of differential-drive robots, which is challenging for\\noptimization-based control due to the robots' nonholonomic constraints, and\\nwhich is interesting due to the practical importance of mobile robotics. The\\napplicability of the proposed approach is presented first in form of a\\nsimulative analysis showing that the resulting control performance yields a\\nsatisfactory accuracy. In particular, the proposed approach outperforms the\\ncanonical naive way to reduce communication by reducing the length of the\\nprediction horizon. Moreover, it is shown that numerical experiments conducted\\non embedded computation hardware, with real distributed computation and\\nwireless communication, work well with the proposed way of reducing\\ncommunication even in practical scenarios in which full communication fails.\", \"main_category\": \"eess.SY\", \"categories\": \"eess.SY,cs.DC,cs.RO,cs.SY\", \"published\": \"2025-04-07T16:10:52Z\"}"}
