{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07092v1\", \"title\": \"Are We Done with Object-Centric Learning?\", \"summary\": \"Object-centric learning (OCL) seeks to learn representations that only encode\\nan object, isolated from other objects or background cues in a scene. This\\napproach underpins various aims, including out-of-distribution (OOD)\\ngeneralization, sample-efficient composition, and modeling of structured\\nenvironments. Most research has focused on developing unsupervised mechanisms\\nthat separate objects into discrete slots in the representation space,\\nevaluated using unsupervised object discovery. However, with recent\\nsample-efficient segmentation models, we can separate objects in the pixel\\nspace and encode them independently. This achieves remarkable zero-shot\\nperformance on OOD object discovery benchmarks, is scalable to foundation\\nmodels, and can handle a variable number of slots out-of-the-box. Hence, the\\ngoal of OCL methods to obtain object-centric representations has been largely\\nachieved. Despite this progress, a key question remains: How does the ability\\nto separate objects within a scene contribute to broader OCL objectives, such\\nas OOD generalization? We address this by investigating the OOD generalization\\nchallenge caused by spurious background cues through the lens of OCL. We\\npropose a novel, training-free probe called $\\\\textbf{Object-Centric\\nClassification with Applied Masks (OCCAM)}$, demonstrating that\\nsegmentation-based encoding of individual objects significantly outperforms\\nslot-based OCL methods. However, challenges in real-world applications remain.\\nWe provide the toolbox for the OCL community to use scalable object-centric\\nrepresentations, and focus on practical applications and fundamental questions,\\nsuch as understanding object perception in human cognition. Our code is\\navailable $\\\\href{https://github.com/AlexanderRubinstein/OCCAM}{here}$.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI,cs.LG\", \"published\": \"2025-04-09T17:59:05Z\"}"}
