{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06700v1\", \"title\": \"Handling LP-Rounding for Hierarchical Clustering and Fitting Distances\\n  by Ultrametrics\", \"summary\": \"We consider the classic correlation clustering problem in the hierarchical\\nsetting. Given a complete graph $G=(V,E)$ and $\\\\ell$ layers of input\\ninformation, where the input of each layer consists of a nonnegative weight and\\na labeling of the edges with either + or -, this problem seeks to compute for\\neach layer a partition of $V$ such that the partition for any non-top layer\\nsubdivides the partition in the upper-layer and the weighted number of\\ndisagreements over the layers is minimized.\\n  Hierarchical correlation clustering is a natural formulation of the classic\\nproblem of fitting distances by ultrametrics, which is further known as\\nnumerical taxonomy in the literature. While single-layer correlation clustering\\nreceived wide attention since it was introduced and major progress evolved in\\nthe past three years, few is known for this problem in the hierarchical\\nsetting. The lack of understanding and adequate tools is reflected in the large\\napproximation ratio known for this problem originating from 2021.\\n  In this work we make both conceptual and technical contributions towards the\\nhierarchical clustering problem. We present a simple paradigm that greatly\\nfacilitates LP-rounding in hierarchical clustering, illustrated with an\\nalgorithm providing a significantly improved approximation guarantee of 25.7846\\nfor the hierarchical correlation clustering problem. Our techniques reveal\\nsurprising new properties of the formulation presented and subsequently used in\\nprevious works for hierarchical clustering over the past two decades. This\\nprovides an interpretation on the core problem in hierarchical clustering as\\nthe problem of finding cuts with prescribed properties regarding average\\ndistances.\\n  We further illustrate this perspective by showing that a direct application\\nof the techniques gives a simple alternative to the state-of-the-art result for\\nthe ultrametric violation distance problem.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS,F.2.2\", \"published\": \"2025-04-09T09:05:13Z\"}"}
