{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04737v1\", \"title\": \"TathyaNyaya and FactLegalLlama: Advancing Factual Judgment Prediction\\n  and Explanation in the Indian Legal Context\", \"summary\": \"In the landscape of Fact-based Judgment Prediction and Explanation (FJPE),\\nreliance on factual data is essential for developing robust and realistic\\nAI-driven decision-making tools. This paper introduces TathyaNyaya, the largest\\nannotated dataset for FJPE tailored to the Indian legal context, encompassing\\njudgments from the Supreme Court of India and various High Courts. Derived from\\nthe Hindi terms \\\"Tathya\\\" (fact) and \\\"Nyaya\\\" (justice), the TathyaNyaya dataset\\nis uniquely designed to focus on factual statements rather than complete legal\\ntexts, reflecting real-world judicial processes where factual data drives\\noutcomes. Complementing this dataset, we present FactLegalLlama, an\\ninstruction-tuned variant of the LLaMa-3-8B Large Language Model (LLM),\\noptimized for generating high-quality explanations in FJPE tasks. Finetuned on\\nthe factual data in TathyaNyaya, FactLegalLlama integrates predictive accuracy\\nwith coherent, contextually relevant explanations, addressing the critical need\\nfor transparency and interpretability in AI-assisted legal systems. Our\\nmethodology combines transformers for binary judgment prediction with\\nFactLegalLlama for explanation generation, creating a robust framework for\\nadvancing FJPE in the Indian legal domain. TathyaNyaya not only surpasses\\nexisting datasets in scale and diversity but also establishes a benchmark for\\nbuilding explainable AI systems in legal analysis. The findings underscore the\\nimportance of factual precision and domain-specific tuning in enhancing\\npredictive performance and interpretability, positioning TathyaNyaya and\\nFactLegalLlama as foundational resources for AI-assisted legal decision-making.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.AI,cs.IR,cs.LG\", \"published\": \"2025-04-07T05:27:32Z\"}"}
