{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02793v1\", \"title\": \"A Framework for Situating Innovations, Opportunities, and Challenges in\\n  Advancing Vertical Systems with Large AI Models\", \"summary\": \"Large artificial intelligence (AI) models have garnered significant attention\\nfor their remarkable, often \\\"superhuman\\\", performance on standardized\\nbenchmarks. However, when these models are deployed in high-stakes verticals\\nsuch as healthcare, education, and law, they often reveal notable limitations.\\nFor instance, they exhibit brittleness to minor variations in input data,\\npresent contextually uninformed decisions in critical settings, and undermine\\nuser trust by confidently producing or reproducing inaccuracies. These\\nchallenges in applying large models necessitate cross-disciplinary innovations\\nto align the models' capabilities with the needs of real-world applications. We\\nintroduce a framework that addresses this gap through a layer-wise abstraction\\nof innovations aimed at meeting users' requirements with large models. Through\\nmultiple case studies, we illustrate how researchers and practitioners across\\nvarious fields can operationalize this framework. Beyond modularizing the\\npipeline of transforming large models into useful \\\"vertical systems\\\", we also\\nhighlight the dynamism that exists within different layers of the framework.\\nFinally, we discuss how our framework can guide researchers and practitioners\\nto (i) optimally situate their innovations (e.g., when vertical-specific\\ninsights can empower broadly impactful vertical-agnostic innovations), (ii)\\nuncover overlooked opportunities (e.g., spotting recurring problems across\\nverticals to develop practically useful foundation models instead of chasing\\nbenchmarks), and (iii) facilitate cross-disciplinary communication of critical\\nchallenges (e.g., enabling a shared vocabulary for AI developers, domain\\nexperts, and human-computer interaction scholars).\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.CL,cs.CY,cs.HC\", \"published\": \"2025-04-03T17:40:11Z\"}"}
