{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06919v1\", \"title\": \"Correcting for interloper contamination in the power spectrum with\\n  neural networks\", \"summary\": \"Modern slitless spectroscopic surveys, such as Euclid and the Roman Space\\nTelescope, collect vast numbers of galaxy spectra but suffer from low\\nsignal-to-noise ratios. This often leads to incorrect redshift assignments when\\nrelying on a single emission line, due to noise spikes or contamination from\\nnon-target emission lines, commonly referred to as redshift interlopers. We\\npropose a machine learning approach to correct the impact of interlopers at the\\nlevel of measured summary statistics, focusing on the power spectrum monopole\\nand line interlopers as a proof of concept. To model interloper effects, we use\\nhalo catalogs from the Quijote simulations as proxies for galaxies, displacing\\na fraction of halos by the distance corresponding to the redshift offset\\nbetween target and interloper galaxies. This yields contaminated catalogs with\\nvarying interloper fractions across a wide range of cosmologies from the\\nQuijote suite. We train a neural network on the power spectrum monopole, alone\\nor combined with the bispectrum monopole, from contaminated mocks to estimate\\nthe interloper fraction and reconstruct the cleaned power spectrum. We evaluate\\nperformance in two settings: one with fixed cosmology and another where\\ncosmological parameters vary under broad priors. In the fixed case, the network\\nrecovers the interloper fraction and corrects the power spectrum to better than\\n1% accuracy. When cosmology varies, performance degrades, but adding bispectrum\\ninformation significantly improves results, reducing the interloper fraction\\nerror by 40-60%. We also study the method's performance as a function of the\\nsize of the training set and find that optimal strategies depend on the\\ncorrelation between target and interloper samples: bispectrum information aids\\nperformance when target and interloper galaxies are uncorrelated, while tighter\\npriors are more effective when the two are strongly correlated.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-04-09T14:24:19Z\"}"}
