{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24297v1\", \"title\": \"Dynamical properties of particulate composites derived from ultradense\\n  stealthy hyperuniform sphere packings\", \"summary\": \"Stealthy hyperuniform (SHU) many-particle systems are distinguished by a\\nstructure factor that vanishes not only at zero wavenumber (as in ``standard''\\nhyperuniform systems) but also across an extended range of wavenumbers near the\\norigin. We generate disordered SHU packings of identical and `nonoverlapping'\\nspheres in $d$-dimensional Euclidean space using a modified\\ncollective-coordinate optimization algorithm that incorporates a soft-core\\nrepulsive potential between particles in addition to the standard stealthy pair\\npotential. These SHU packings are ultradense, spanning a broad spectrum of\\nstructures depending on the stealthiness parameter $\\\\chi$. We consider\\ntwo-phase media composed of hard particles derived from ultradense SHU packings\\nembedded in a matrix phase, with varying stealthiness parameter $\\\\chi$ and\\npacking fractions $\\\\phi$. Our main objective is the estimation of the dynamical\\nphysical properties of such two-phase media, namely, the effective dynamic\\ndielectric constant and the time-dependent diffusion spreadability, which is\\ndirectly related to nuclear magnetic relaxation in fluid-saturated porous\\nmedia. We show through spreadability that two-phase media derived from\\nultradense SHU packings exhibit faster interphase diffusion due to the higher\\npacking fractions achievable compared to media obtained without soft-core\\nrepulsion. The imaginary part of the effective dynamic dielectric constant of\\nSHU packings vanishes at a small wavenumber, implying perfect transparency for\\nthe corresponding wavevectors. We also obtain cross-property relations between\\ntransparency characteristics and long-time behavior of the spreadability for\\nsuch two-phase media. Our results demonstrate that disordered two-phase media\\nderived from ultradense SHU packings exhibit advantageous transport and optical\\nbehaviors of both theoretical and experimental significance.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft,cond-mat.mtrl-sci,cond-mat.stat-mech\", \"published\": \"2025-03-31T16:42:27Z\"}"}
