{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21702v1\", \"title\": \"Enabling Robust Exoplanet Atmospheric Retrievals with Gaussian Processes\", \"summary\": \"Atmospheric retrievals are essential tools for interpreting exoplanet\\ntransmission and eclipse spectra, enabling quantitative constraints on the\\nchemical composition, aerosol properties, and thermal structure of planetary\\natmospheres. The James Webb Space Telescope (JWST) offers unprecedented\\nspectral precision, resolution, and wavelength coverage, unlocking\\ntransformative insights into the formation, evolution, climate, and potential\\nhabitability of planetary systems. However, this opportunity is accompanied by\\nchallenges: modeling assumptions and unaccounted-for noise or signal sources\\ncan bias retrieval outcomes and their interpretation. To address these\\nlimitations, we introduce a Gaussian Process (GP)-aided atmospheric retrieval\\nframework that flexibly accounts for unmodeled features in exoplanet spectra,\\nwhether global or localized. We validate this method on synthetic JWST\\nobservations and show that GP-aided retrievals reduce bias in inferred\\nabundances and better capture model-data mismatches than traditional\\napproaches. We also introduce the concept of mean squared error to quantify the\\ntrade-off between bias and variance, arguing that this metric more accurately\\nreflects retrieval performance than bias alone. We then reanalyze the\\nNIRISS/SOSS JWST transmission spectrum of WASP-96 b, finding that GP-aided\\nretrievals yield broader constraints on CO$_2$ and H$_2$O, alleviating tension\\nbetween previous retrieval results and equilibrium predictions. Our GP\\nframework provides precise and accurate constraints while highlighting regions\\nwhere models fail to explain the data. As JWST matures and future facilities\\ncome online, a deeper understanding of the limitations of both data and models\\nwill be essential, and GP-enabled retrievals like the one presented here offer\\na principled path forward.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,astro-ph.IM\", \"published\": \"2025-03-27T17:06:09Z\"}"}
