{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06890v1\", \"title\": \"Combining high-contrast imaging with high-resolution spectroscopy:\\n  Actual on-sky MIRI/MRS results compared to expectations\", \"summary\": \"CONTEXT: Combining high-contrast imaging with high-resolution spectroscopy\\noffers a powerful way to detect and characterize exoplanets around nearby\\nstars, despite challenges linked to their faintness. Instruments like\\nVLT/SPHERE are state of the art in high-contrast imaging, but their spectral\\nresolution (R=50) limits them to basic characterization of close companions.\\nThese systems can detect planets down to 5-10 Mjup at 10 AU from their stars.\\nDetection limits are mainly constrained by speckle noise, which dominates over\\nphoton and detector noise at short separations, even with advanced differential\\nimaging. Space-based high-contrast imaging is also limited by image stability.\\nSpeckle noise can, however, be mitigated through molecular mapping, a technique\\nthat leverages high-resolution spectroscopic data.\\n  AIMS: We aim to predict detection limits in spectro-imaging after molecular\\nmapping, analyzing how photon and detector noise propagate and comparing\\npredictions with real data to assess performance losses from instrumental\\neffects. We also propose mitigation strategies and validate our model using\\nobservations.\\n  METHODS: We analyzed JWST/MIRI/MRS data with FastCurves, an numerical tool,\\nand compared results to outputs from the MIRI simulator. We also applied\\nprincipal component analysis (PCA) to identify and isolate systematic effects,\\nwith and without molecular mapping.\\n  RESULTS: We studied various systematic effects and their impacts on signal\\nand noise. PCA helped highlight and reduce straylight, fringes, and aliasing.\\nWe further compared observed and modeled companion spectra.\\n  CONCLUSIONS: FastCurves was improved to account for systematics and validated\\nwith real data. In high-flux regimes, systematics impose contrast limits even\\nwith molecular mapping. Our approach could benefit other instruments and inform\\nthe planning of future facilities like ELT/ANDES and ELT/PCS.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM,astro-ph.EP\", \"published\": \"2025-04-09T13:51:20Z\"}"}
