{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05083v1\", \"title\": \"X-ray variability of VHE detected FSRQs: A comparative study\", \"summary\": \"Flat Spectrum Radio Quasars (FSRQs) are weak sources of very high energy\\n(VHE; E>100 GeV) emission, despite exhibiting strong MeV-GeV emissions that\\ndominate their radiative output. To date, only ten FSRQs have been detected at\\nVHEs, primarily during bright optical phases. In this study, we perform a\\ndetailed and systematic, temporal, and spectral analysis of the nine\\nVHE-detected FSRQs, using the Swift X-ray Telescope (XRT) data. Our findings\\nshow no correlation between VHE activity and the X-ray flux or spectral state\\nof the sources. However, investigation of spectral properties with X-ray\\nbrightness shows anti-correlation between flux and spectral index. The X-ray,\\ngenerally with a different spectral shape lies at the farther end of the\\noptical-UV synchrotron spectrum which typically shows a declining power-law\\nspectrum, and thus, the X-ray spectrum is generally explained by Synchrotron\\nSelf-Compton (SSC) process. However, if optical-UV synchrotron emission extends\\ninto the X-ray band, it can soften the X-ray spectrum. While most sources in\\nour sample exhibit rising X-ray SEDs, indicative of non-synchrotron origins or\\nminimal synchrotron contributions, many display softer or flat X-ray spectra,\\nmainly during low X-ray flux states (e.g., 4C +21.35, 3C 279, TON 0599, PKS\\n1441+25, and PKS 0346-27) suggesting potential synchrotron contributions. These\\nsynchrotron continuations influence the gamma-ray spectrum, implying extension\\ninto the VHE range for inverse Compton (IC) scattering in the Thomson\\nscattering limit. If the extended component corresponds to an underlying\\nlow-level emission, these FSRQs could represent potential candidates for\\npersistent VHE activity.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-07T13:53:57Z\"}"}
