{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01513v1\", \"title\": \"Laser Annealing of Transparent ZnO Thin Films: A Route to Improve\\n  Electrical Conductivity and Oxygen Sensing Capabilities\", \"summary\": \"The chemical deposition of high-performance Zinc Oxide (ZnO) thin films is\\nchallenging, thus significant efforts have been devoted during the past decades\\nto develop cost-effective, scalable fabrication methods in gas phase. This work\\ndemonstrates how ultra-short-pulse Laser Beam Scanning (LBS) can be used to\\nmodulate electrical conductivity in ZnO thin films deposited on soda-lime glass\\nby Spatial Atomic Layer Deposition (SALD), a high-throughput, low-temperature\\ndeposition technique suitable for large-area applications. By systematically\\noptimizing laser parameters, including pulse energy and hatching distance,\\nsignificant improvements in the electrical performance of 90 nm-thick ZnO films\\nwere achieved. The optimization of the laser annealing parameters, 0.21\\nuJ/pulse energy and a 1 micron hatching distance, yielded ZnO films with an\\nelectrical resistivity of (9 +- 2) 10-2 Ohm cm, 3 orders of magnitude lower\\nthan as deposited films. This result suggests that laser\\npost-deposition-processing can play an important role in tailoring the\\nproperties of ZnO thin films. Excessive laser intensity can compromise\\nstructural integrity of the films, however, degrading their electrical\\ntransport properties. Notably, the electrical resistance of laser-annealed ZnO\\nfilms exhibited high sensitivity to oxygen concentration in the surrounding\\natmosphere, suggesting exciting prospects for application in devices based on\\ntransparent oxygen sensors. This study thus positions ultra-short pulsed laser\\nannealing as a versatile post-deposition method for fine-tuning the properties\\nof ZnO thin films, enabling their use in advanced optoelectronic and\\ngas-sensing technologies, particularly on temperature-sensitive substrates.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-02T09:00:05Z\"}"}
