{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02683v1\", \"title\": \"Probing patchy reionisation with JWST: IGM opacity constraints from the\\n  Lyman-$\\u03b1$ forest of galaxies in legacy extragalactic fields\", \"summary\": \"We present the first characterization of the Gunn-Peterson trough in\\nhigh-redshift galaxies using public JWST NIRSpec spectroscopy. This enables us\\nto derive the first galaxy-based IGM opacity measurements at the end of\\nreionisation. Using galaxy spectra has several advantages over quasar spectra:\\nit enables measurements of the IGM opacity in any extragalactic field over a\\ncontinuous redshift range $4\\\\lesssim z\\\\lesssim 7$, as well as measurements of\\nthe intrinsic Lyman-$\\\\beta$ opacity. Our novel constraints are in good\\nagreement with state-of-the-art ground-based quasar Lyman-$\\\\alpha$ forest\\nobservations, and will become competitive as the number of JWST $z>5$ galaxy\\nspectra rapidly increases. We also provide the first constraints on the\\nuncontaminated Lyman-$\\\\beta$ opacity at $5<z<6$. Finally, we demonstrate the\\npower of JWST to connect the ionisation state of the IGM to the sources of\\nreionisation in a single extragalactic field. We show that a previously\\nreported galaxy overdensity and an excess of Lyman-$\\\\alpha$ emitters detected\\nwith JWST in GOODS-South at $z=5.8-5.9$ coincides with an anomalously low IGM\\nopacity to Lyman-$\\\\alpha$ at this redshift. The local photo-ionisation rate\\nexcess can be fully accounted for by the cumulative ionising output of\\n$M_{\\\\rm{UV}}\\\\lesssim -10$ galaxies in the overdensity, provided they have\\n$\\\\log_{10}\\\\langle \\\\xi_{\\\\rm{ion}} f_{\\\\rm{esc}} / \\\\ [\\\\rm{erg}^{-1}\\\\rm{Hz}]\\\\rangle\\n= 24.7$ (or equivalently $\\\\log_{10}\\\\xi_{\\\\rm{ion}} / \\\\\\n[\\\\rm{erg}^{-1}\\\\rm{Hz}]=25.4$ and $f_{\\\\rm{esc}}=20\\\\%$). Overall, this\\nbreakthrough offers a new way to connect the galaxy large-scale structure to\\nthe state of the IGM, potentially enabling us to precisely identify the sources\\nof reionisation.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.CO\", \"published\": \"2025-04-03T15:24:01Z\"}"}
