{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05697v1\", \"title\": \"VADIS: A Visual Analytics Pipeline for Dynamic Document Representation\\n  and Information-Seeking\", \"summary\": \"In the biomedical domain, visualizing the document embeddings of an extensive\\ncorpus has been widely used in information-seeking tasks. However, three key\\nchallenges with existing visualizations make it difficult for clinicians to\\nfind information efficiently. First, the document embeddings used in these\\nvisualizations are generated statically by pretrained language models, which\\ncannot adapt to the user's evolving interest. Second, existing document\\nvisualization techniques cannot effectively display how the documents are\\nrelevant to users' interest, making it difficult for users to identify the most\\npertinent information. Third, existing embedding generation and visualization\\nprocesses suffer from a lack of interpretability, making it difficult to\\nunderstand, trust and use the result for decision-making. In this paper, we\\npresent a novel visual analytics pipeline for user driven document\\nrepresentation and iterative information seeking (VADIS). VADIS introduces a\\nprompt-based attention model (PAM) that generates dynamic document embedding\\nand document relevance adjusted to the user's query. To effectively visualize\\nthese two pieces of information, we design a new document map that leverages a\\ncircular grid layout to display documents based on both their relevance to the\\nquery and the semantic similarity. Additionally, to improve the\\ninterpretability, we introduce a corpus-level attention visualization method to\\nimprove the user's understanding of the model focus and to enable the users to\\nidentify potential oversight. This visualization, in turn, empowers users to\\nrefine, update and introduce new queries, thereby facilitating a dynamic and\\niterative information-seeking experience. We evaluated VADIS quantitatively and\\nqualitatively on a real-world dataset of biomedical research papers to\\ndemonstrate its effectiveness.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-08T05:39:11Z\"}"}
