{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21728v1\", \"title\": \"Near field imaging of local interference in radio interferometric data:\\n  Impact on the redshifted 21-cm power spectrum\", \"summary\": \"Radio-frequency interference (RFI) is a major systematic limitation in radio\\nastronomy, particularly for science cases requiring high sensitivity, such as\\n21-cm cosmology. Traditionally, RFI is dealt with by identifying its signature\\nin the dynamic spectra of visibility data and flagging strongly affected\\nregions. However, for RFI sources that do not occupy narrow regions in the\\ntime-frequency space, such as persistent local RFI, modeling these sources\\ncould be essential to mitigating their impact. This paper introduces two\\nmethods for detecting and characterizing local RFI sources from radio\\ninterferometric visibilities: matched filtering and maximum a posteriori (MAP)\\nimaging. These algorithms use the spherical wave equation to construct\\nthree-dimensional near-field image cubes of RFI intensity from the\\nvisibilities. The matched filter algorithm can generate normalized maps by\\ncross-correlating the expected contributions from RFI sources with the observed\\nvisibilities, while the MAP method performs a regularized inversion of the\\nvisibility equation in the near field. We also develop a full polarization\\nsimulation framework for RFI and demonstrate the methods on simulated\\nobservations of local RFI sources. The stability, speed, and errors introduced\\nby these algorithms are investigated, and, as a demonstration, the algorithms\\nare applied to a subset of NenuFAR observations to perform spatial, spectral,\\nand temporal characterization of two local RFI sources. We assess the impact of\\nlocal RFI on images, the uv plane, and cylindrical power spectra through\\nsimulations and describe these effects qualitatively. We also quantify the\\nlevel of errors and biases that these algorithms induce and assess their\\nimplications for the estimated 21-cm power spectrum with radio interferometers.\\nThe near-field imaging and simulation codes are made available publicly in the\\nPython library nfis.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM,astro-ph.CO\", \"published\": \"2025-03-27T17:40:38Z\"}"}
