{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06720v1\", \"title\": \"Revealing the ages of metal-rich RR Lyrae via kinematic label transfer\", \"summary\": \"RR Lyrae stars have long been considered reliable tracers of old, metal-poor\\npopulations, primarily due to their prevalence in globular clusters and the\\nGalactic halo. However, the discovery of a metal-rich subpopulation in the\\nGalactic disc, kinematically colder and more rotationally supported, challenges\\nthis classical view. Understanding the age of these metal-rich RR Lyrae stars\\nis crucial for constraining their formation pathways and assessing what\\nGalactic populations they are tracing. In this work, we leverage the\\nunprecedented astrometric precision of Gaia DR3 to infer the age distribution\\nof metal-rich RR Lyrae stars through a kinematic comparison with O-rich Mira\\nvariables. Mira variables, with their well-established period-age relation,\\nserve as a natural clock, allowing us to transfer age information to RR Lyrae\\nstars via their phase-space properties. By applying this approach across\\ndifferent metallicity bins, we find that the most metal-rich RR Lyrae stars\\n($[\\\\rm Fe/H] > -0.5$) exhibit kinematics consistent with a population\\nsignificantly younger ($\\\\approx 6-7$ Gyr) than typically assumed for RR Lyrae\\nstars. In contrast, those with $-1 < [\\\\rm Fe/H] < -0.5$ show properties more\\naligned with older ($\\\\approx 9-11$ Gyr) populations. Interestingly, we also\\nfind evidence of a possible double age populations for the most metal-rich RR\\nLyrae, one younger with ages between 3 and 6 Gyr, and another one older ranging\\nfrom 8 to 11 Gyr. These results provide strong evidence that metal-rich RR\\nLyrae stars in the Galactic field do not exclusively trace ancient populations.\\nThis finding challenges the current model of RR Lyrae formation and supports\\nalternative formation scenarios, such as binary evolution.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA\", \"published\": \"2025-04-09T09:19:55Z\"}"}
