{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04840v1\", \"title\": \"Unsupervised Ego- and Exo-centric Dense Procedural Activity Captioning\\n  via Gaze Consensus Adaptation\", \"summary\": \"Even from an early age, humans naturally adapt between exocentric (Exo) and\\negocentric (Ego) perspectives to understand daily procedural activities.\\nInspired by this cognitive ability, in this paper, we propose a novel\\nUnsupervised Ego-Exo Adaptation for Dense Video Captioning (UEA-DVC) task,\\nwhich aims to predict the time segments and descriptions for target view\\nvideos, while only the source view data are labeled during training. Despite\\nprevious works endeavoring to address the fully-supervised single-view or\\ncross-view dense video captioning, they lapse in the proposed unsupervised task\\ndue to the significant inter-view gap caused by temporal misalignment and\\nirrelevant object interference. Hence, we propose a Gaze Consensus-guided\\nEgo-Exo Adaptation Network (GCEAN) that injects the gaze information into the\\nlearned representations for the fine-grained alignment between the Ego and Exo\\nviews. Specifically, the Score-based Adversarial Learning Module (SALM)\\nincorporates a discriminative scoring network to learn unified view-invariant\\nrepresentations for bridging distinct views from a global level. Then, the Gaze\\nConsensus Construction Module (GCCM) utilizes gaze representations to\\nprogressively calibrate the learned global view-invariant representations for\\nextracting the video temporal contexts based on focusing regions. Moreover, the\\ngaze consensus is constructed via hierarchical gaze-guided consistency losses\\nto spatially and temporally align the source and target views. To support our\\nresearch, we propose a new EgoMe-UEA-DVC benchmark and experiments demonstrate\\nthe effectiveness of our method, which outperforms many related methods by a\\nlarge margin. The code will be released.\", \"main_category\": \"cs.MM\", \"categories\": \"cs.MM\", \"published\": \"2025-04-07T08:51:11Z\"}"}
