{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06774v1\", \"title\": \"Hybrid machine learning models based on physical patterns to accelerate\\n  CFD simulations: a short guide on autoregressive models\", \"summary\": \"Accurate modeling of the complex dynamics of fluid flows is a fundamental\\nchallenge in computational physics and engineering. This study presents an\\ninnovative integration of High-Order Singular Value Decomposition (HOSVD) with\\nLong Short-Term Memory (LSTM) architectures to address the complexities of\\nreduced-order modeling (ROM) in fluid dynamics. HOSVD improves the\\ndimensionality reduction process by preserving multidimensional structures,\\nsurpassing the limitations of Singular Value Decomposition (SVD). The\\nmethodology is tested across numerical and experimental data sets, including\\ntwo- and three-dimensional (2D and 3D) cylinder wake flows, spanning both\\nlaminar and turbulent regimes. The emphasis is also on exploring how the depth\\nand complexity of LSTM architectures contribute to improving predictive\\nperformance. Simpler architectures with a single dense layer effectively\\ncapture the periodic dynamics, demonstrating the network's ability to model\\nnon-linearities and chaotic dynamics. The addition of extra layers provides\\nhigher accuracy at minimal computational cost. These additional layers enable\\nthe network to expand its representational capacity, improving the prediction\\naccuracy and reliability. The results demonstrate that HOSVD outperforms SVD in\\nall tested scenarios, as evidenced by using different error metrics. Efficient\\nmode truncation by HOSVD-based models enables the capture of complex temporal\\npatterns, offering reliable predictions even in challenging, noise-influenced\\ndata sets. The findings underscore the adaptability and robustness of\\nHOSVD-LSTM architectures, offering a scalable framework for modeling fluid\\ndynamics.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn,cs.LG\", \"published\": \"2025-04-09T10:56:03Z\"}"}
