{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07615v1\", \"title\": \"VLM-R1: A Stable and Generalizable R1-style Large Vision-Language Model\", \"summary\": \"Recently DeepSeek R1 has shown that reinforcement learning (RL) can\\nsubstantially improve the reasoning capabilities of Large Language Models\\n(LLMs) through a simple yet effective design. The core of R1 lies in its\\nrule-based reward formulation, which leverages tasks with deterministic\\nground-truth answers to enable precise and stable reward computation. In the\\nvisual domain, we similarly observe that a wide range of visual understanding\\ntasks are inherently equipped with well-defined ground-truth annotations. This\\nproperty makes them naturally compatible with rule-based reward mechanisms.\\nMotivated by this observation, we investigate the extension of R1-style\\nreinforcement learning to Vision-Language Models (VLMs), aiming to enhance\\ntheir visual reasoning capabilities. To this end, we develop VLM-R1, a\\ndedicated framework designed to harness RL for improving VLMs' performance on\\ngeneral vision-language tasks. Using this framework, we further explore the\\nfeasibility of applying RL to visual domain. Experimental results indicate that\\nthe RL-based model not only delivers competitive performance on visual\\nunderstanding tasks but also surpasses Supervised Fine-Tuning (SFT) in\\ngeneralization ability. Furthermore, we conduct comprehensive ablation studies\\nthat uncover a series of noteworthy insights, including the presence of reward\\nhacking in object detection, the emergence of the \\\"OD aha moment\\\", the impact\\nof training data quality, and the scaling behavior of RL across different model\\nsizes. Through these analyses, we aim to deepen the understanding of how\\nreinforcement learning enhances the capabilities of vision-language models, and\\nwe hope our findings and open-source contributions will support continued\\nprogress in the vision-language RL community. Our code and model are available\\nat https://github.com/om-ai-lab/VLM-R1\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.CL\", \"published\": \"2025-04-10T10:05:15Z\"}"}
