{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17540v1\", \"title\": \"An Explainable Nature-Inspired Framework for Monkeypox Diagnosis:\\n  Xception Features Combined with NGBoost and African Vultures Optimization\\n  Algorithm\", \"summary\": \"The recent global spread of monkeypox, particularly in regions where it has\\nnot historically been prevalent, has raised significant public health concerns.\\nEarly and accurate diagnosis is critical for effective disease management and\\ncontrol. In response, this study proposes a novel deep learning-based framework\\nfor the automated detection of monkeypox from skin lesion images, leveraging\\nthe power of transfer learning, dimensionality reduction, and advanced machine\\nlearning techniques. We utilize the newly developed Monkeypox Skin Lesion\\nDataset (MSLD), which includes images of monkeypox, chickenpox, and measles, to\\ntrain and evaluate our models. The proposed framework employs the Xception\\narchitecture for deep feature extraction, followed by Principal Component\\nAnalysis (PCA) for dimensionality reduction, and the Natural Gradient Boosting\\n(NGBoost) algorithm for classification. To optimize the model's performance and\\ngeneralization, we introduce the African Vultures Optimization Algorithm (AVOA)\\nfor hyperparameter tuning, ensuring efficient exploration of the parameter\\nspace. Our results demonstrate that the proposed AVOA-NGBoost model achieves\\nstate-of-the-art performance, with an accuracy of 97.53%, F1-score of 97.72%\\nand an AUC of 97.47%. Additionally, we enhance model interpretability using\\nGrad-CAM and LIME techniques, providing insights into the decision-making\\nprocess and highlighting key features influencing classification. This\\nframework offers a highly precise and efficient diagnostic tool, potentially\\naiding healthcare providers in early detection and diagnosis, particularly in\\nresource-constrained environments.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI,cs.LG,eess.IV\", \"published\": \"2025-04-24T13:32:11Z\"}"}
