{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21491v1\", \"title\": \"ClassWise-CRF: Category-Specific Fusion for Enhanced Semantic\\n  Segmentation of Remote Sensing Imagery\", \"summary\": \"We propose a result-level category-specific fusion architecture called\\nClassWise-CRF. This architecture employs a two-stage process: first, it selects\\nexpert networks that perform well in specific categories from a pool of\\ncandidate networks using a greedy algorithm; second, it integrates the\\nsegmentation predictions of these selected networks by adaptively weighting\\ntheir contributions based on their segmentation performance in each category.\\nInspired by Conditional Random Field (CRF), the ClassWise-CRF architecture\\ntreats the segmentation predictions from multiple networks as confidence vector\\nfields. It leverages segmentation metrics (such as Intersection over Union)\\nfrom the validation set as priors and employs an exponential weighting strategy\\nto fuse the category-specific confidence scores predicted by each network. This\\nfusion method dynamically adjusts the weights of each network for different\\ncategories, achieving category-specific optimization. Building on this, the\\narchitecture further optimizes the fused results using unary and pairwise\\npotentials in CRF to ensure spatial consistency and boundary accuracy. To\\nvalidate the effectiveness of ClassWise-CRF, we conducted experiments on two\\nremote sensing datasets, LoveDA and Vaihingen, using eight classic and advanced\\nsemantic segmentation networks. The results show that the ClassWise-CRF\\narchitecture significantly improves segmentation performance: on the LoveDA\\ndataset, the mean Intersection over Union (mIoU) metric increased by 1.00% on\\nthe validation set and by 0.68% on the test set; on the Vaihingen dataset, the\\nmIoU improved by 0.87% on the validation set and by 0.91% on the test set.\\nThese results fully demonstrate the effectiveness and generality of the\\nClassWise-CRF architecture in semantic segmentation of remote sensing images.\\nThe full code is available at https://github.com/zhuqinfeng1999/ClassWise-CRF.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI,cs.LG,cs.MM\", \"published\": \"2025-04-30T10:19:21Z\"}"}
