{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15672v1\", \"title\": \"Comparative Analysis of Evolutionary Algorithms for Energy-Aware\\n  Production Scheduling\", \"summary\": \"The energy transition is driving rapid growth in renewable energy generation,\\ncreating the need to balance energy supply and demand with energy price\\nawareness. One such approach for manufacturers to balance their energy demand\\nwith available energy is energyaware production planning. Through energy-aware\\nproduction planning, manufacturers can align their energy demand with dynamic\\ngrid conditions, supporting renewable energy integration while benefiting from\\nlower prices and reduced emissions. Energy-aware production planning can be\\nmodeled as a multi-criteria scheduling problem, where the objectives extend\\nbeyond traditional metrics like makespan or required workers to also include\\nminimizing energy costs and emissions. Due to market dynamics and the NP-hard\\nmulti-objective nature of the problem, evolutionary algorithms are widely used\\nfor energy-aware scheduling. However, existing research focuses on the design\\nand analysis of single algorithms, with limited comparisons between different\\napproaches. In this study, we adapt NSGA-III, HypE, and $\\\\theta$-DEA as memetic\\nmetaheuristics for energy-aware scheduling to minimize makespan, energy costs,\\nemissions, and the number of workers, within a real-time energy market context.\\nThese adapted metaheuristics present different approaches for environmental\\nselection. In a comparative analysis, we explore differences in solution\\nefficiency and quality across various scenarios which are based on benchmark\\ninstances from the literature and real-world energy market data. Additionally,\\nwe estimate upper bounds on the distance between objective values obtained with\\nour memetic metaheuristics and reference sets obtained via an exact solver.\", \"main_category\": \"cs.NE\", \"categories\": \"cs.NE\", \"published\": \"2025-04-22T07:54:05Z\"}"}
