{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01453v1\", \"title\": \"Tinnitus, lucid dreaming and awakening. An online survey and theoretical\\n  implications\", \"summary\": \"(1) Background: Tinnitus is the perception of phantom sound in the absence of\\na corresponding external source. Previous studies reported that the presence of\\ntinnitus is notably absent during dreams. This study aimed at replicating\\nprevious findings regarding tinnitus-free dreams, while also gaining a deeper\\nunderstanding of tinnitus manifestations during dreams and after awakening. (2)\\nMethods: For this observational study, 195 tinnitus patients answered an online\\nsurvey on the mutual-help community Siopi. (3) Results: 160 patients could\\nrecall their dreams. Among them, 92.5% state they do not hear their tinnitus\\nwhile dreaming. The rest (7.5%) report higher tinnitus burden, higher stress\\nand more often exhibit objective tinnitus and/or tinnitus related to peripheral\\nauditory pathology and/or drug intake. 13% of the participants frequently\\nexperience lucid dreams. Among them, 36% could perceive their tinnitus during\\nlucid dreams, and this was strongly associated with the concomitant perception\\nof external sounds during lucid dreaming. While the majority of patients report\\nperceiving their tinnitus instantly upon awakening, during nocturnal\\nawakenings, 18% declared they could be awakened by their tinnitus and 9.8%\\nmentioned that their tinnitus can temporarily cease. (4) Conclusions: Our\\nfindings confirm the previous findings: tinnitus is rarely perceived during\\ndreams. Remarkably, our study is the first to document the case of tinnitus\\nduring lucid dreaming. 64% of these patients gain higher-order consciousness\\nattributes while still experiencing a tinnitus-free state. Our observations\\nsuggest that the presence or absence of gating of external auditory information\\nduring dreams acts as a tinnitus on-off switch, refining the previously\\nproposed integrative model of auditory phantom perception.\", \"main_category\": \"q-bio.NC\", \"categories\": \"q-bio.NC\", \"published\": \"2025-04-02T08:06:00Z\"}"}
