{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12288v1\", \"title\": \"The underlap coefficient as a measure of a biomarker's discriminatory\\n  ability\", \"summary\": \"The first step in evaluating a potential diagnostic biomarker is to examine\\nthe variation in its values across different disease groups. In a three-class\\ndisease setting, the volume under the receiver operating characteristic surface\\nand the three-class Youden index are commonly used summary measures of a\\nbiomarker's discriminatory ability. However, these measures rely on a\\nstochastic ordering assumption for the distributions of biomarker outcomes\\nacross the three groups. This assumption can be restrictive, particularly when\\ncovariates are involved, and its violation may lead to incorrect conclusions\\nabout a biomarker's ability to distinguish between the three disease classes.\\nEven when a stochastic ordering exists, the order may vary across different\\nbiomarkers in discovery studies involving dozens or even thousands of candidate\\nbiomarkers, complicating automated ranking. To address these challenges and\\ncomplement existing measures, we propose the underlap coefficient, a novel\\nsummary index of a biomarker's ability to distinguish between three (or more)\\ndisease groups, and study its properties. Additionally, we introduce Bayesian\\nnonparametric estimators for both the unconditional underlap coefficient and\\nits covariate-specific counterpart. These estimators are broadly applicable to\\na wide range of biomarkers and populations. A simulation study reveals a good\\nperformance of the proposed estimators across a range of conceivable scenarios.\\nWe illustrate the proposed approach through an application to an Alzheimer's\\ndisease (AD) dataset aimed to assess how four potential AD biomarkers\\ndistinguish between individuals with normal cognition, mild impairment, and\\ndementia, and how and if age and gender impact this discriminatory ability.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME\", \"published\": \"2025-04-16T17:52:57Z\"}"}
