{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05429v1\", \"title\": \"Theoretical modeling of approximate universality of tidally deformed\\n  neutron stars\", \"summary\": \"Quasi-universal relations are known to exist among various neutron star\\nobservables that do not depend sensitively on the underlying nuclear matter\\nequations of state. For example, some of these relations imply that the tidally\\ninduced multipole moments are approximately characterized by the electric-type\\nquadrupolar tidal deformability. Such relations can be used to reduce the\\nnumber of independent tidal parameters in gravitational-waveform modeling,\\nthereby allowing us to infer extreme nuclear matter properties more accurately\\nand test General Relativity in an insensitive manner to uncertainties in\\nnuclear physics. We present a comprehensive theoretical investigation into\\napproximate universality of neutron stars. Our approach employs a semi-analytic\\nrelativistic stellar interior model, which extends the Tolman VII solution,\\nthereby enabling a refined exploration of the tidal properties of nonrotating\\nstars within a semi-analytic framework. The derived power-law relations among\\nvarious tidal deformabilities -- referred to as the universal Love relations --\\nagree well with expressions in previous work found empirically. We elucidate\\nhow the equation-of-state dependence is suppressed in a particular combination\\nof macroscopic physical parameters induced by perturbations and demonstrate\\nthat the relation between the moment of inertia and electric-type quadrupolar\\ntidal deformability (I-Love relation) rests on the same underlying mechanism.\\nOur findings indicate that the approximate universality of neutron stars can be\\nattributed to low compressibility, consistent with some of the previous studies\\non the possible origin of the universality.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc,astro-ph.HE,nucl-ex,nucl-th\", \"published\": \"2025-05-08T17:19:11Z\"}"}
