{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11929v1\", \"title\": \"Separate universe in multifield inflation: a phase-space approach\", \"summary\": \"In this article we extend a study of the validity conditions of the\\nseparate-universe approach of cosmological perturbations to models of inflation\\nwith multiple fields. The separate-universe approach consists in describing the\\nuniverse as a collection of homogeneous and isotropic patches, giving us an\\neffective description of perturbation theory at large scales through\\nphase-space reduction. This approximation is a necessary step in stochastic\\ninflation, an effective theory of coarse-grained, super-Hubble, scalar fields\\nfluctuations. One needs a stochastic inflation description in the context of\\nprimordial black hole productions since it needs enhancements of the curvature\\npower spectrum. It easily achievable in multifield inflation models but\\nnecessarily comes with strong diffusive effects. We study and compare\\ncosmological perturbation theory and the separate-universe approach in said\\nnon-linear sigma models as a typical framework of multifield inflation and\\nemploying the Hamiltonian formalism to keep track of the complete phase space\\n(or the reduced isotropic phase space in the separate-universe approach). We\\nfind that the separate-universe approach adequately describes the cosmological\\nperturbation theory provided the wavelength of the modes considered is greater\\nthat several lower bounds that depend on the cosmological horizon and the\\ninverse of the effective Hamiltonian masses of the fields; the latter being\\nfixed by the coupling potential and the field-space geometry. We also compare\\ngauge-invariant variables and several gauge fixing procedures in both\\napproaches. For instance, we showed that the uniform-expansion gauge is nicely\\ndescribed by the separate-universe picture, hence qualifying its use in\\nstochastic inflation as commonly done.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,gr-qc,hep-th\", \"published\": \"2025-04-16T10:08:43Z\"}"}
