{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00325v1\", \"title\": \"CognitionNet: A Collaborative Neural Network for Play Style Discovery in\\n  Online Skill Gaming Platform\", \"summary\": \"Games are one of the safest source of realizing self-esteem and relaxation at\\nthe same time. An online gaming platform typically has massive data coming in,\\ne.g., in-game actions, player moves, clickstreams, transactions etc. It is\\nrather interesting, as something as simple as data on gaming moves can help\\ncreate a psychological imprint of the user at that moment, based on her\\nimpulsive reactions and response to a situation in the game. Mining this\\nknowledge can: (a) immediately help better explain observed and predicted\\nplayer behavior; and (b) consequently propel deeper understanding towards\\nplayers' experience, growth and protection. To this effect, we focus on\\ndiscovery of the \\\"game behaviours\\\" as micro-patterns formed by continuous\\nsequence of games and the persistent \\\"play styles\\\" of the players' as a\\nsequence of such sequences on an online skill gaming platform for Rummy. We\\npropose a two stage deep neural network, CognitionNet. The first stage focuses\\non mining game behaviours as cluster representations in a latent space while\\nthe second aggregates over these micro patterns to discover play styles via a\\nsupervised classification objective around player engagement. The dual\\nobjective allows CognitionNet to reveal several player psychology inspired\\ndecision making and tactics. To our knowledge, this is the first and\\none-of-its-kind research to fully automate the discovery of: (i) player\\npsychology and game tactics from telemetry data; and (ii) relevant diagnostic\\nexplanations to players' engagement predictions. The collaborative training of\\nthe two networks with differential input dimensions is enabled using a novel\\nformulation of \\\"bridge loss\\\". The network plays pivotal role in obtaining\\nhomogeneous and consistent play style definitions and significantly outperforms\\nthe SOTA baselines wherever applicable.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.LG\", \"published\": \"2025-05-01T05:51:19Z\"}"}
