{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20467v1\", \"title\": \"Switching, Multiple Time-Scales and Geometric Blow-Up in a\\n  Low-Dimensional Gene Regulatory Network\", \"summary\": \"ODE-based models for gene regulatory networks (GRNs) can often be formulated\\nas smooth singular perturbation problems with multiple small parameters, some\\nof which are related to time-scale separation, whereas others are related to\\n'switching' (proximity to a non-smooth singular limit). This motivates the\\nstudy of reduced models obtained after (i) quasi-steady state reduction (QSSR),\\nwhich utilises the time-scale separation, and (ii) piecewise-smooth\\napproximations, which reduce the nonlinearity of the model by viewing highly\\nnonlinear sigmoidal terms as singular perturbations of step functions. We\\ninvestigate the interplay between the reduction methods (i)-(ii), in the\\ncontext of a 4-dimensional GRN which has been used as a low-dimensional\\nrepresentative of an important class of (generally high-dimensional) GRN models\\nin the literature. We begin by identifying a region in the small parameter\\nplane for which this problem can be formulated as a smooth singularly perturbed\\nsystem on a blown-up space, uniformly in the switching parameter. This allows\\nus to apply Fenichel's coordinate-free theorems and obtain a rigorous reduction\\nto a 2-dimensional system, that is a perturbation of the QSSR. Finally, we show\\nthat the reduced system features a Hopf bifurcation which does not appear in\\nthe QSSR system, due to the influence of higher order terms. Taken together,\\nour findings suggest that the relative size of the small parameters is\\nimportant for the validity of QSS reductions and the determination of\\nqualitative dynamics in GRN models more generally. Although the focus is on the\\n4-dimensional GRN, our approach is applicable to higher dimensions.\", \"main_category\": \"math.DS\", \"categories\": \"math.DS\", \"published\": \"2025-04-29T07:05:05Z\"}"}
