{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15147v1\", \"title\": \"The Iterative Chainlet Partitioning Algorithm for the Traveling Salesman\\n  Problem with Drone and Neural Acceleration\", \"summary\": \"This study introduces the Iterative Chainlet Partitioning (ICP) algorithm and\\nits neural acceleration for solving the Traveling Salesman Problem with Drone\\n(TSP-D). The proposed ICP algorithm decomposes a TSP-D solution into smaller\\nsegments called chainlets, each optimized individually by a dynamic programming\\nsubroutine. The chainlet with the highest improvement is updated and the\\nprocedure is repeated until no further improvement is possible. The number of\\nsubroutine calls is bounded linearly in problem size for the first iteration\\nand remains constant in subsequent iterations, ensuring algorithmic\\nscalability. Empirical results show that ICP outperforms existing algorithms in\\nboth solution quality and computational time. Tested over 1,059 benchmark\\ninstances, ICP yields an average improvement of 2.75% in solution quality over\\nthe previous state-of-the-art algorithm while reducing computational time by\\n79.8%. The procedure is deterministic, ensuring reliability without requiring\\nmultiple runs. The subroutine is the computational bottleneck in the already\\nefficient ICP algorithm. To reduce the necessity of subroutine calls, we\\nintegrate a graph neural network (GNN) to predict incremental improvements. We\\ndemonstrate that the resulting Neuro ICP (NICP) achieves substantial\\nacceleration while maintaining solution quality. Compared to ICP, NICP reduces\\nthe total computational time by 49.7%, while the objective function value\\nincrease is limited to 0.12%. The framework's adaptability to various\\noperational constraints makes it a valuable foundation for developing efficient\\nalgorithms for truck-drone synchronized routing problems.\", \"main_category\": \"cs.NE\", \"categories\": \"cs.NE\", \"published\": \"2025-04-21T14:51:15Z\"}"}
