{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00373v1\", \"title\": \"Constraints on the state of the IGM at $z\\\\sim 8-10$ using redshifted\\n  21-cm observations with LOFAR\", \"summary\": \"The power spectra of the redshifted 21-cm signal from the Epoch of\\nReionization (EoR) contain information about the ionization and thermal states\\nof the intergalactic medium (IGM), and depend on the properties of the EoR\\nsources. Recently, Mertens et al 2025 has analysed 10 nights of LOFAR high-band\\ndata and estimated upper limits on the 21-cm power spectrum at redshifts 8.3,\\n9.1 and 10.1. Here we use these upper limit results to constrain the properties\\nof the IGM at those redshifts. We focus on the properties of the ionized and\\nheated regions where the temperature is larger than that of the CMB. We model\\nthe 21-cm power spectrum with the code GRIZZLY, and use a Bayesian inference\\nframework to explore the source parameters for uniform priors on their ranges.\\nThe framework also provides information about the IGM properties in the form of\\nderived parameters. In a model which includes a radio background in excess of\\nthe CMB, the 95 (68) per cent credible intervals of disfavoured models at\\nredshift 9.1 for the chosen priors correspond to IGM states with averaged\\nionization and heated fraction below 0.46 ($\\\\lesssim 0.05$), an average gas\\ntemperature below 44 K (4 K), and a characteristic size of the heated region\\n$\\\\lesssim 14 ~h^{-1} ~\\\\mathrm{Mpc}$ ($\\\\lesssim 3 ~h^{-1} ~\\\\mathrm{Mpc}$). The\\n68 per cent credible interval suggests an excess radio background which is more\\nthan 100 per cent of the CMB at 1.42 GHz, while the 95 per cent credible\\ninterval of the radio background efficiency parameter spans the entire prior\\nrange. The behaviour of the credible intervals is similar at all redshifts. The\\nmodels disfavoured by the LOFAR upper limits are extreme ones, as they are\\nmainly driven by rare and large ionized or heated regions.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-05-01T07:56:08Z\"}"}
