{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15069v1\", \"title\": \"Data-constrained Magnetohydrodynamic Simulation of a Filament Eruption\\n  in a Decaying Active Region 13079 on a Global Scale\", \"summary\": \"Filaments are special plasma phenomena embedded in the solar atmosphere,\\ncharacterized by unique thermodynamic properties and magnetic structures.\\nMagnetohydrodynamic (MHD) simulations are useful to investigate the eruption\\nmechanisms of filaments. We conduct a data-constrained zero-$\\\\beta$ MHD\\nsimulation in spherical coordinates to investigate a C3.5 class flare triggered\\nby an eruptive filament on 2022 August 15 in a decaying weak active region\\n13079. We reconstruct the three-dimensional coronal magnetic field using vector\\nmagnetograms and synoptic maps from the Solar Dynamics Observatory/Helioseismic\\nand Magnetic Imager (SDO/HMI). We transform vector magnetic field into\\nStonyhurst heliographic spherical coordinates combined with a synoptic map and\\nconstructed a potential field source surface (PFSS) model with a magnetic flux\\nrope (MFR) embedded using the Regularized Biot--Savart Laws (RBSL).\\nSubsequently, we conduct a spherical zero-$\\\\beta$ MHD simulation using the\\nMessage Passing Interface Adaptive Mesh Refinement Versatile Advection Code\\n(MPI-AMRVAC) and replicated the entire dynamic process of the filament eruption\\nconsistent with observations. With the calculation of time-distance profile,\\nQusai-Separatrix Layers (QSL), and synthetic radiation from simulated current\\ndensity, we find a good agreement between our simulation and observations in\\nterms of dynamics and magnetic topology. Technically, we provide a useful\\nmethod of advanced data-constrained simulation of weak active regions in\\nspherical coordinates. Scientifically, the model allows us to quantitatively\\ndescribe and diagnose the entire process of filament eruption.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-21T12:55:25Z\"}"}
