{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07813v1\", \"title\": \"P2Object: Single Point Supervised Object Detection and Instance\\n  Segmentation\", \"summary\": \"Object recognition using single-point supervision has attracted increasing\\nattention recently. However, the performance gap compared with fully-supervised\\nalgorithms remains large. Previous works generated class-agnostic\\n\\\\textbf{\\\\textit{proposals in an image}} offline and then treated mixed\\ncandidates as a single bag, putting a huge burden on multiple instance learning\\n(MIL). In this paper, we introduce Point-to-Box Network (P2BNet), which\\nconstructs balanced \\\\textbf{\\\\textit{instance-level proposal bags}} by\\ngenerating proposals in an anchor-like way and refining the proposals in a\\ncoarse-to-fine paradigm. Through further research, we find that the bag of\\nproposals, either at the image level or the instance level, is established on\\ndiscrete box sampling. This leads the pseudo box estimation into a sub-optimal\\nsolution, resulting in the truncation of object boundaries or the excessive\\ninclusion of background. Hence, we conduct a series exploration of\\ndiscrete-to-continuous optimization, yielding P2BNet++ and Point-to-Mask\\nNetwork (P2MNet). P2BNet++ conducts an approximately continuous proposal\\nsampling strategy by better utilizing spatial clues. P2MNet further introduces\\nlow-level image information to assist in pixel prediction, and a boundary\\nself-prediction is designed to relieve the limitation of the estimated boxes.\\nBenefiting from the continuous object-aware \\\\textbf{\\\\textit{pixel-level\\nperception}}, P2MNet can generate more precise bounding boxes and generalize to\\nsegmentation tasks. Our method largely surpasses the previous methods in terms\\nof the mean average precision on COCO, VOC, SBD, and Cityscapes, demonstrating\\ngreat potential to bridge the performance gap compared with fully supervised\\ntasks.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-10T14:51:08Z\"}"}
