{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11186v1\", \"title\": \"Benchmarking Next-Generation Reasoning-Focused Large Language Models in\\n  Ophthalmology: A Head-to-Head Evaluation on 5,888 Items\", \"summary\": \"Recent advances in reasoning-focused large language models (LLMs) mark a\\nshift from general LLMs toward models designed for complex decision-making, a\\ncrucial aspect in medicine. However, their performance in specialized domains\\nlike ophthalmology remains underexplored. This study comprehensively evaluated\\nand compared the accuracy and reasoning capabilities of four newly developed\\nreasoning-focused LLMs, namely DeepSeek-R1, OpenAI o1, o3-mini, and Gemini 2.0\\nFlash-Thinking. Each model was assessed using 5,888 multiple-choice\\nophthalmology exam questions from the MedMCQA dataset in zero-shot setting.\\nQuantitative evaluation included accuracy, Macro-F1, and five text-generation\\nmetrics (ROUGE-L, METEOR, BERTScore, BARTScore, and AlignScore), computed\\nagainst ground-truth reasonings. Average inference time was recorded for a\\nsubset of 100 randomly selected questions. Additionally, two board-certified\\nophthalmologists qualitatively assessed clarity, completeness, and reasoning\\nstructure of responses to differential diagnosis questions.O1 (0.902) and\\nDeepSeek-R1 (0.888) achieved the highest accuracy, with o1 also leading in\\nMacro-F1 (0.900). The performance of models across the text-generation metrics\\nvaried: O3-mini excelled in ROUGE-L (0.151), o1 in METEOR (0.232), DeepSeek-R1\\nand o3-mini tied for BERTScore (0.673), DeepSeek-R1 (-4.105) and Gemini 2.0\\nFlash-Thinking (-4.127) performed best in BARTScore, while o3-mini (0.181) and\\no1 (0.176) led AlignScore. Inference time across the models varied, with\\nDeepSeek-R1 being slowest (40.4 seconds) and Gemini 2.0 Flash-Thinking fastest\\n(6.7 seconds). Qualitative evaluation revealed that DeepSeek-R1 and Gemini 2.0\\nFlash-Thinking tended to provide detailed and comprehensive intermediate\\nreasoning, whereas o1 and o3-mini displayed concise and summarized\\njustifications.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.AI\", \"published\": \"2025-04-15T13:42:34Z\"}"}
