{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04339v1\", \"title\": \"Adaptive and Robust DBSCAN with Multi-agent Reinforcement Learning\", \"summary\": \"DBSCAN, a well-known density-based clustering algorithm, has gained\\nwidespread popularity and usage due to its effectiveness in identifying\\nclusters of arbitrary shapes and handling noisy data. However, it encounters\\nchallenges in producing satisfactory cluster results when confronted with\\ndatasets of varying density scales, a common scenario in real-world\\napplications. In this paper, we propose a novel Adaptive and Robust DBSCAN with\\nMulti-agent Reinforcement Learning cluster framework, namely AR-DBSCAN. First,\\nwe model the initial dataset as a two-level encoding tree and categorize the\\ndata vertices into distinct density partitions according to the information\\nuncertainty determined in the encoding tree. Each partition is then assigned to\\nan agent to find the best clustering parameters without manual assistance. The\\nallocation is density-adaptive, enabling AR-DBSCAN to effectively handle\\ndiverse density distributions within the dataset by utilizing distinct agents\\nfor different partitions. Second, a multi-agent deep reinforcement learning\\nguided automatic parameter searching process is designed. The process of\\nadjusting the parameter search direction by perceiving the clustering\\nenvironment is modeled as a Markov decision process. Using a weakly-supervised\\nreward training policy network, each agent adaptively learns the optimal\\nclustering parameters by interacting with the clusters. Third, a recursive\\nsearch mechanism adaptable to the data's scale is presented, enabling efficient\\nand controlled exploration of large parameter spaces. Extensive experiments are\\nconducted on nine artificial datasets and a real-world dataset. The results of\\noffline and online tasks show that AR-DBSCAN not only improves clustering\\naccuracy by up to 144.1% and 175.3% in the NMI and ARI metrics, respectively,\\nbut also is capable of robustly finding dominant parameters.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-05-07T11:37:23Z\"}"}
