{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02626v1\", \"title\": \"Unveiling the reflection spectrum in the ultracompact LMXB 4U 1820-30\", \"summary\": \"4U 1820-30 is a ultracompact X-ray binary located in the globular cluster NGC\\n6624, consisting of a neutron star accreting material from a helium white dwarf\\ncompanion characterized by the shortest known orbital period for this type of\\nstar (11.4 minutes). Despite extensive studies, the detection of the\\nrelativistic Fe K emission line, has been inconsistently reported and no\\nmeasurement of the system inclination has been achieved. In this work, we\\ninvestigate the broadband spectral and polarimetric properties of 4U 1820-30,\\nexploring the presence of a reflection component and its role in shaping the\\npolarization signal. We analyzed simultaneous X-ray observations from NICER,\\nNuSTAR, and IXPE. The spectral continuum was modeled with a disk blackbody, a\\npower law, and a Comptonization component with seed photons originating from a\\nboundary layer. We detected a strong reflection component, described, for the\\nfirst time, with two self-consistent models ({\\\\tt Relxillns} and {\\\\tt\\nRfxconv}), allowing us to provide a measurement of the system inclination angle\\n(about 31 degrees), supporting the low-inclination hypothesis. Subsolar iron\\nabundances were detected in the accretion disk and interstellar medium,\\nprobably related to the source location in a metal-poor globular cluster. The\\npolarization increases from an upper limit of $1.2\\\\%$ in the 2--4 keV band up\\nto about $8\\\\%$ in the 7--8 keV range. The disk is expected to be orthogonally\\npolarized to these components, which may help to explain the decreasing of the\\nobserved polarization at low energies. However, the high polarization degree we\\nfound challenges the current models, also taking into consideration the\\nrelatively low inclination angle derived from the spectral analysis.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,hep-ph\", \"published\": \"2025-04-03T14:25:11Z\"}"}
