{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06895v1\", \"title\": \"ColorizeDiffusion v2: Enhancing Reference-based Sketch Colorization\\n  Through Separating Utilities\", \"summary\": \"Reference-based sketch colorization methods have garnered significant\\nattention due to their potential applications in the animation production\\nindustry. However, most existing methods are trained with image triplets of\\nsketch, reference, and ground truth that are semantically and spatially\\nwell-aligned, while real-world references and sketches often exhibit\\nsubstantial misalignment. This mismatch in data distribution between training\\nand inference leads to overfitting, consequently resulting in spatial artifacts\\nand significant degradation in overall colorization quality, limiting potential\\napplications of current methods for general purposes. To address this\\nlimitation, we conduct an in-depth analysis of the \\\\textbf{carrier}, defined as\\nthe latent representation facilitating information transfer from reference to\\nsketch. Based on this analysis, we propose a novel workflow that dynamically\\nadapts the carrier to optimize distinct aspects of colorization. Specifically,\\nfor spatially misaligned artifacts, we introduce a split cross-attention\\nmechanism with spatial masks, enabling region-specific reference injection\\nwithin the diffusion process. To mitigate semantic neglect of sketches, we\\nemploy dedicated background and style encoders to transfer detailed reference\\ninformation in the latent feature space, achieving enhanced spatial control and\\nricher detail synthesis. Furthermore, we propose character-mask merging and\\nbackground bleaching as preprocessing steps to improve foreground-background\\nintegration and background generation. Extensive qualitative and quantitative\\nevaluations, including a user study, demonstrate the superior performance of\\nour proposed method compared to existing approaches. An ablation study further\\nvalidates the efficacy of each proposed component.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-09T13:55:32Z\"}"}
