{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19708v1\", \"title\": \"Relative Spectral Response Function Retrieval of Hyperspectral\\n  Instruments in Atmospheric Spectrometry\", \"summary\": \"Nowadays, tens of satellites carry hyperspectral spectrometers. Such\\ninstruments allow decomposing the light that exits the atmosphere from its top\\ninto hundreds to thousands of contiguous spectral channels. By analysis of the\\nlight spectral distribution, and in particular the depths of selected\\nabsorption lines, researchers and meteorological agencies can retrieve the\\natmosphere composition and thermodynamic state. To get a global view of the\\nEarth, several instruments are generally operated synergistically, therefore, a\\nharmonized calibration must be achieved between them.\\n  To cross-calibrate two spectrometers, a common practice is to analyze an\\nensemble of collocated measurements, meaning acquisitions performed at the same\\ntime and under the same geometry. Nonetheless, such analysis always faces the\\nissue of setting appropriate temporal and geometric thresholds in defining the\\ncollocations, trading off between statistics and quality. Consequently, some\\ncollocation mismatches may have a substantial impact on the cross-calibration\\nresults. Thus, the following manuscript describes in detail the inclusion of\\ncollocation errors into the mathematical description and presents an\\napplication which is designed on purpose to be robust to such errors.\\n  Then, the knowledge of the spectral sensitivities of each channel to the\\nincoming light, called the spectral response functions (SRF), are key to the\\nexploitation of the acquisitions. In that context, the authors have studied and\\ndesigned a novel methodology to retrieve relative SRF between two or more\\nspectrometers, within a single instrument or between instruments embarked on\\ndifferent platforms. The objective of the methodology is to characterize\\ndiscrepancies of responses between flying spectrometers, track long-term\\nevolutions and harmonize their responses with post-processing when necessary.\", \"main_category\": \"physics.ins-det\", \"categories\": \"physics.ins-det,physics.ao-ph\", \"published\": \"2025-04-28T12:01:23Z\"}"}
