{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10348v1\", \"title\": \"Improving diffusion modeling in all-solid-state lithium batteries: a\\n  novel approach for grain boundary effects\", \"summary\": \"All-solid-state lithium-ion batteries offer promising advantages with respect\\nto capacity, safety, and performance. The diffusion behavior of lithium ions in\\nthe contained polycrystalline solid-state electrolyte is crucial for battery\\nfunction. While atomistic studies indicate that grain boundaries (GBs) and\\ngrain size significantly impact diffusivity, the corresponding effects are\\neither neglected in simulations on larger scales or considered only under\\nstrong assumptions such as isotropy. Our approach considers the fully resolved\\ncrystalline structure with a parametrization aligned with the atomistic\\nperspective to describe diffusion along and across GBs. The approach is\\nembedded into a finite element simulation using a novel collapsed interface\\nelement based on an analytical description in thickness direction. Results are\\ngoverned by different and potentially anisotropic diffusion coefficients in\\nbulk and GB domains. The mesoscale response is derived using linear\\ncomputational homogenization to capture large-scale effects. The novel\\ncollapsed interface description allows for a reconstruction of the 3D transport\\nbehavior within the GB domain without resolving it and is able to capture the\\nrelevant transport mechanisms such as channeling effects and concentration\\njumps. Grain size and GB volume fraction are expressed in terms of an affine\\nparameter dependence and can be altered without any changes to geometry or\\nmesh. Together with the observed dependence of the effective material response\\non the anisotropic GB parametrization, this leads to the identification of four\\ndistinct diffusion regimes, each with implications for the design of battery\\nmaterials.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-14T15:58:25Z\"}"}
