{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04895v1\", \"title\": \"Asymmetric 4.77 Three-Way Unequal Filtering Power Divider/Combiner for\\n  Communication Systems Application\", \"summary\": \"This study presents a novel three-way unequal filtering power\\ndivider/combiner, addressing challenges in unequal power distribution while\\nincorporating filtering functions in communication systems. Wilkinson power\\ndivider (WPD) is the traditional power division approach using\\nquarter-wavelength transmission lines [1]. This type of power divider is\\npopularly used in communication systems due to its good electrical isolation\\nand simple structure. The problem with WPD is that its operation requires the\\nuse of an externally connected bandpass filter (BPF) to achieve filtering\\nfunctionality. This leads to increased footprint and increased loss\\ncoefficients in a system. In contrast to the traditional design approach\\ninvolving a BPF, a matching transmission line, and a Wilkinson power divider as\\nseparate components, the proposed integrated filtering power divider (FPD)\\nconsolidates all three components into a single device, leading to lower\\nfootprint and lower loss coefficient in a system. Circuit modelling and\\nelectromagnetic (EM) simulations were conducted to ensure alignment between\\ntheoretical and practical results. The design demonstrates effective unequal\\npower division at the three output ports while maintaining very good filtering\\nperformance. Results show a return loss better than 15 dB and a minimum\\ninsertion loss of 1.2 dB. The overall size of the device is 32.2 x 50.0 mm.\\nThis paper contributes to advancements in power divider design by addressing\\nunequal power division challenges and integrating filtering functions. The\\nfindings offer a foundation for future developments in advanced power\\ndivider/combiner systems, with insights into potential challenges and areas for\\nfurther improvements.\", \"main_category\": \"eess.SY\", \"categories\": \"eess.SY,cs.SY,eess.SP\", \"published\": \"2025-04-07T10:06:59Z\"}"}
