{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17354v1\", \"title\": \"Data-Driven Surrogate Modeling Techniques to Predict the Effective\\n  Contact Area of Rough Surface Contact Problems\", \"summary\": \"The effective contact area in rough surface contact plays a critical role in\\nmulti-physics phenomena such as wear, sealing, and thermal or electrical\\nconduction. Although accurate numerical methods, like the Boundary Element\\nMethod (BEM), are available to compute this quantity, their high computational\\ncost limits their applicability in multi-query contexts, such as uncertainty\\nquantification, parameter identification, and multi-scale algorithms, where\\nmany repeated evaluations are required. This study proposes a surrogate\\nmodeling framework for predicting the effective contact area using\\nfast-to-evaluate data-driven techniques. Various machine learning algorithms\\nare trained on a precomputed dataset, where the inputs are the imposed load and\\nstatistical roughness parameters, and the output is the corresponding effective\\ncontact area. All models undergo hyperparameter optimization to enable fair\\ncomparisons in terms of predictive accuracy and computational efficiency,\\nevaluated using established quantitative metrics. Among the models, the Kernel\\nRidge Regressor demonstrates the best trade-off between accuracy and\\nefficiency, achieving high predictive accuracy, low prediction time, and\\nminimal training overhead-making it a strong candidate for general-purpose\\nsurrogate modeling. The Gaussian Process Regressor provides an attractive\\nalternative when uncertainty quantification is required, although it incurs\\nadditional computational cost due to variance estimation. The generalization\\ncapability of the Kernel Ridge model is validated on an unseen simulation\\nscenario, confirming its ability to transfer to new configurations. Database\\ngeneration constitutes the dominant cost in the surrogate modeling process.\\nNevertheless, the approach proves practical and efficient for multi-query\\ntasks, even when accounting for this initial expense.\", \"main_category\": \"cs.CE\", \"categories\": \"cs.CE,cs.AI\", \"published\": \"2025-04-24T08:15:46Z\"}"}
