{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06714v1\", \"title\": \"Unifying Search and Recommendation: A Generative Paradigm Inspired by\\n  Information Theory\", \"summary\": \"Recommender systems and search engines serve as foundational elements of\\nonline platforms, with the former delivering information proactively and the\\nlatter enabling users to seek information actively. Unifying both tasks in a\\nshared model is promising since it can enhance user modeling and item\\nunderstanding. Previous approaches mainly follow a discriminative paradigm,\\nutilizing shared encoders to process input features and task-specific heads to\\nperform each task. However, this paradigm encounters two key challenges:\\ngradient conflict and manual design complexity. From the information theory\\nperspective, these challenges potentially both stem from the same issue -- low\\nmutual information between the input features and task-specific outputs during\\nthe optimization process.\\n  To tackle these issues, we propose GenSR, a novel generative paradigm for\\nunifying search and recommendation (S&R), which leverages task-specific prompts\\nto partition the model's parameter space into subspaces, thereby enhancing\\nmutual information. To construct effective subspaces for each task, GenSR first\\nprepares informative representations for each subspace and then optimizes both\\nsubspaces in one unified model. Specifically, GenSR consists of two main\\nmodules: (1) Dual Representation Learning, which independently models\\ncollaborative and semantic historical information to derive expressive item\\nrepresentations; and (2) S&R Task Unifying, which utilizes contrastive learning\\ntogether with instruction tuning to generate task-specific outputs effectively.\\nExtensive experiments on two public datasets show GenSR outperforms\\nstate-of-the-art methods across S&R tasks. Our work introduces a new generative\\nparadigm compared with previous discriminative methods and establishes its\\nsuperiority from the mutual information perspective.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-04-09T09:15:37Z\"}"}
