{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00548v1\", \"title\": \"Model order reduction of hemodynamics by space-time reduced basis and\\n  reduced fluid-structure interaction\", \"summary\": \"In this work, we apply the space-time Galerkin reduced basis (ST-GRB) method\\nto a reduced fluid-structure interaction model, for the numerical simulation of\\nhemodynamics in arteries. In essence, ST-GRB extends the classical reduced\\nbasis (RB) method, exploiting a data-driven low-dimensional linear encoding of\\nthe temporal dynamics to further cut the computational costs. The current\\ninvestigation brings forth two key enhancements, compared to previous works on\\nthe topic. On the one side, we model blood flow through the Navier-Stokes\\nequations, hence accounting for convection. In this regard, we implement a\\nhyper-reduction scheme, based on approximate space-time reduced affine\\ndecompositions, to deal with nonlinearities effectively. On the other side, we\\nmove beyond the constraint of modelling blood vessels as rigid structures,\\nacknowledging the importance of elasticity for the accurate simulation of\\ncomplex blood flow patterns. To limit computational complexity, we adopt the\\nCoupled Momentum model, incorporating the effect of wall compliance in the\\nfluid's equations through a generalized Robin boundary condition. In\\nparticular, we propose an efficient strategy for handling the spatio-temporal\\nprojection of the structural displacement, which ultimately configures as a\\nby-product. The performances of ST-GRB are assessed in three different\\nnumerical experiments. The results confirm that the proposed approach can\\noutperform the classical RB method, yielding precise approximations of\\nhigh-fidelity solutions at more convenient costs. However, the computational\\ngains of ST-GRB vanish if the number of retained temporal modes is too large,\\nwhich occurs either when complex dynamics arise or if very precise solutions\\nare sought.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA\", \"published\": \"2025-05-01T14:24:41Z\"}"}
