{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19566v1\", \"title\": \"Metadata-private Messaging without Coordination\", \"summary\": \"For those seeking end-to-end private communication free from pervasive\\nmetadata tracking and censorship, the Tor network has been the de-facto choice\\nin practice, despite its susceptibility to traffic analysis attacks. Recently,\\nnumerous metadata-private messaging proposals have emerged with the aim to\\nsurpass Tor in the messaging context by obscuring the relationships between any\\ntwo messaging buddies, even against global and active attackers. However, most\\nof these systems face an undesirable usability constraint: they require a\\nmetadata-private \\\"dialing\\\" phase to establish mutual agreement and timing or\\nround coordination before initiating any regular chats among users. This phase\\nis not only resource-intensive but also inflexible, limiting users' ability to\\nmanage multiple concurrent conversations seamlessly. For stringent privacy\\nrequirement, the often-enforced traffic uniformity further exacerbated the\\nlimitations of this roadblock.\\n  In this paper, we introduce PingPong, a new end-to-end system for\\nmetadata-private messaging designed to overcome these limitations. Under the\\nsame traffic uniformity requirement, PingPong replaces the rigid\\n\\\"dial-before-converse\\\" paradigm with a more flexible \\\"notify-before-retrieval\\\"\\nworkflow. This workflow incorporates a metadata-private notification subsystem,\\nPing, and a metadata-private message store, Pong. Both Ping and Pong leverage\\nhardware-assisted secure enclaves for performance and operates through a series\\nof customized oblivious algorithms, while meeting the uniformity requirements\\nfor metadata protection. By allowing users to switch between conversations on\\ndemand, PingPong achieves a level of usability akin to modern instant messaging\\nsystems, while also offering improved performance and bandwidth utilization for\\ngoodput. We have built a prototype of PingPong with 32 8-core servers equipped\\nwith enclaves to validate our claims.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR\", \"published\": \"2025-04-28T08:21:16Z\"}"}
