{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04961v1\", \"title\": \"Probing gravity with non-linear clustering in redshift space\", \"summary\": \"We present the first computation of the gravity model testing parameter $E_G$\\non realistic simulated modified gravity galaxy mocks. The analysis is conducted\\nusing two twin simulations presented in arXiv:1805.09824(1): one based on\\ngeneral relativity (GR) and the other on the $f(R)$ Hu $\\\\&$ Sawicki model with\\n$f=10^{-5}$ (F5). This study aims to measure the $E_G$ estimator in GR and\\n$f(R)$ models using high-fidelity simulated galaxy catalogs, with the goal of\\nassessing how future galaxy surveys can detect deviations from standard\\ngravity. Deriving this estimator requires precise, unbiased measurements of the\\ngrowth rate of structure and the linear galaxy bias. We achieve this by\\nimplementing an end-to-end cosmological analysis pipeline in configuration\\nspace, using the multipoles of the 2-point correlation function. Our analysis\\ndemonstrates how to measure the scale-dependent growth rate predicted by\\nnon-standard gravity models. We split the estimation of the RSD $\\\\beta$\\nparameter over distinct scale ranges, separating large (quasi-linear) and small\\n(non-linear) scales. We show that this estimator can be accurately measured\\nusing mock galaxies in low redshift bins ($z < 1$), where it offers strong\\ndiscriminating power over competing gravity theories. We find that, for an\\nall-sky galaxy survey and neglecting observational systematics, accurate and\\nlargely unbiased estimations of $E_G$ can be obtained across all redshifts.\\nHowever, the error bars are too large to clearly distinguish between the\\ntheories. When measuring the scale-dependence of the $E_G$ estimator, we note\\nthat state-of-the-art theory modeling limitations and intrinsic \\\"prior volume\\neffects\\\" prevent high-accuracy constraints. Alternatively, we propose a null\\ntest of gravity using RSD clustering, which, if small scales are modeled\\naccurately in future surveys, could detect significant departures from GR.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-04-07T11:49:43Z\"}"}
