{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11002v1\", \"title\": \"Dopamine Audiobook: A Training-free MLLM Agent for Emotional and\\n  Human-like Audiobook Generation\", \"summary\": \"Audiobook generation, which creates vivid and emotion-rich audio works, faces\\nchallenges in conveying complex emotions, achieving human-like qualities, and\\naligning evaluations with human preferences. Existing text-to-speech (TTS)\\nmethods are often limited to specific scenarios, struggle with emotional\\ntransitions, and lack automatic human-aligned evaluation benchmarks, instead\\nrelying on either misaligned automated metrics or costly human assessments. To\\naddress these issues, we propose Dopamine Audiobook, a new unified\\ntraining-free system leveraging a multimodal large language model (MLLM) as an\\nAI agent for emotional and human-like audiobook generation and evaluation.\\nSpecifically, we first design a flow-based emotion-enhanced framework that\\ndecomposes complex emotional speech synthesis into controllable sub-tasks.\\nThen, we propose an adaptive model selection module that dynamically selects\\nthe most suitable TTS methods from a set of existing state-of-the-art (SOTA)\\nTTS methods for diverse scenarios. We further enhance emotional expressiveness\\nthrough paralinguistic augmentation and prosody retrieval at word and utterance\\nlevels. For evaluation, we propose a novel GPT-based evaluation framework\\nincorporating self-critique, perspective-taking, and psychological MagicEmo\\nprompts to ensure human-aligned and self-aligned assessments. Experiments show\\nthat our method generates long speech with superior emotional expression to\\nSOTA TTS models in various metrics. Importantly, our evaluation framework\\ndemonstrates better alignment with human preferences and transferability across\\naudio tasks. Project website with audio samples can be found at\\nhttps://dopamine-audiobook.github.io.\", \"main_category\": \"cs.SD\", \"categories\": \"cs.SD,cs.MM,eess.AS\", \"published\": \"2025-04-15T09:19:44Z\"}"}
