{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10088v1\", \"title\": \"Code size constraints in b-symbol read channels: A bound analysis\", \"summary\": \"In classical coding theory, error-correcting codes are designed to protect\\nagainst errors occurring at individual symbol positions in a codeword. However,\\nin practical storage and communication systems, errors often affect multiple\\nadjacent symbols rather than single symbols independently. To address this,\\nsymbol-pair read channels were introduced \\\\cite{Yuval2011}, and later\\ngeneralized to $b$-symbol read channels \\\\cite{yaakobi2016} to better model such\\nerror patterns. $b$-Symbol read channels generalize symbol-pair read channels\\nto account for clustered errors in modern storage and communication systems. By\\ndeveloping bounds and efficient codes, researchers improve data reliability in\\napplications such as storage devices, wireless networks, and DNA-based storage.\\nGiven integers $q$, $n$, $d$, and $b \\\\geq 2$, let $A_b(n,d,q)$ denote the\\nlargest possible code size for which there exists a $q$-ary code of length $n$\\nwith minimum $b$-symbol distance at least $d$. In \\\\cite{chen2022}, various\\nupper and lower bounds on $A_b(n,d,q)$ are given for $b=2$. In this paper, we\\ngeneralize some of these bounds to the $b$-symbol read channels for $b>2$ and\\npresent several new bounds on $A_b(n,d,q)$. In particular, we establish the\\nlinear programming bound, a recurrence relation on $A_b(n,d,q)$, the Johnson\\nbound (even), the restricted Johnson bound, the Gilbert-Varshamov-type bound,\\nand the Elias bound for the metric of symbols $b$, $b\\\\geq 2$. Furthermore, we\\nprovide examples demonstrating that the Gilbert-Varshamov bound we establish\\noffers a stronger lower bound than the one presented in \\\\cite{Song2018}.\\nAdditionally, we introduce an alternative approach to deriving the\\nSphere-packing and Plotkin bounds.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-04-14T10:47:31Z\"}"}
