{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21746v1\", \"title\": \"Laser injection locking and nanophotonic spectral translation of\\n  electro-optic frequency combs\", \"summary\": \"High-resolution electro-optic frequency combs (EO combs) consisting of\\nthousands to millions of comb teeth across a bandwidth between 1 GHz to 500 GHz\\nare powerful tools for atomic, molecular, and cavity-based spectroscopy,\\nincluding in the context of deployable quantum sensors. However, achieving\\nsufficiently high signal-to-noise ratio (SNR) EO combs for use across the broad\\nrange of wavelengths required in the aforementioned applications is hindered by\\nthe corresponding unavailability of relevant components such as\\nnarrow-linewidth lasers, electro-optic phase modulators with adequate optical\\npower handling, and low-noise optical amplifiers. Here, we address the latter\\ntwo points by showing that optical injection locking of commercial Fabry-Perot\\n(FP) laser diodes can help enable high SNR EO combs. We injection lock the FP\\nlaser diode to more than 10^6 comb teeth at injected comb powers as low as 1 nW\\nand produce a high SNR replica of the EO comb. In comparison to a commercial\\nsemiconductor optical amplifier, injection locking achieves approximately 100x\\ngreater SNR for the same input power (when <1 microwatt) and equal SNR for >\\n35x lower input power. Such low-power injection locking is of particular\\nrelevance in conjunction with nanophotonic spectral translation, which extends\\nthe range of wavelengths available for EO combs. We show that the usable\\nwavelength range of an EO comb produced by photo-induced second harmonic\\ngeneration of an EO comb in a silicon nitride resonator is significantly\\nincreased when combined with optical injection locking. Our results demonstrate\\nthat optical injection locking provides a versatile and high-performance\\napproach to addressing many different scenarios in which EO comb SNR would be\\notherwise limited.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics\", \"published\": \"2025-04-30T15:40:49Z\"}"}
