{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16621v1\", \"title\": \"Ultra-high dose rate 6 MeV electron irradiation generates stable\\n  [1-$^{13}$C]alanine radicals suitable for medical imaging with dissolution\\n  Dynamic Nuclear Polarisation\", \"summary\": \"Dissolution Dynamic Nuclear Polarisation (dDNP) is an experimental technique\\nthat increases the sensitivity of magnetic resonance experiments by more than a\\nfactor of $10^5$, permitting isotopically-labelled molecules to be transiently\\nvisible in MRI scans with their biochemical fates spatially resolvable over\\ntime following injection into a patient. dDNP requires a source of unpaired\\nelectrons to be in contact with the isotope-labelled nuclei, cooled to\\ntemperatures close to absolute zero, and spin-pumped into a given state by\\nmicrowave irradiation. At present, these electrons are typically provided by\\nchemical radicals which require removal by filtration prior to injection into\\nhumans. Alternative sources include UV irradiation, requiring storing samples\\nin liquid nitrogen, or cobalt-60 gamma irradiation, which requires days and\\ngenerates polarisation two to three orders of magnitude lower than chemical\\nradicals. In this study, we present ultra-high dose rate electron beam\\nirradiation as a novel alternative for generating non-persistent radicals in\\nglycerol/alanine mixtures. These radicals are stable for months at room\\ntemperature, are present at concentrations dependent on irradiation dose, and\\ngenerate comparable nuclear polarisation to the typically used trityl radicals\\n(20%) through a novel mechanism. The process of their generation inherently\\nsterilises samples, and they enable the imaging of alanine metabolism in vivo\\nusing dDNP. This new method of generating radicals for dDNP offers the\\npotential to report on relevant biological processes while being translatable\\nto the clinic.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph,q-bio.BM\", \"published\": \"2025-04-23T11:23:23Z\"}"}
