{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10943v1\", \"title\": \"Drivers and barriers of adopting shared micromobility: a latent class\\n  clustering model on the attitudes towards shared micromobility as part of\\n  public transport trips in the Netherlands\", \"summary\": \"Shared micromobility (SMM) is often cited as a solution to the first/last\\nmile problem of public transport (train) travel, yet when implemented, they\\noften do not get adopted by a broader travelling public. A large part of\\nbehavioural adoption is related to peoples' attitudes and perceptions. In this\\npaper, we develop an adjusted behavioural framework, based on the UTAUT2\\ntechnology acceptance framework. We carry out an exploratory factor analysis\\n(EFA) to obtain attitudinal factors which we then use to perform a latent class\\ncluster analysis (LCCA), with the goal of studying the potential adoption of\\nSMM and to assess the various drivers and barriers as perceived by different\\nuser groups. Our findings suggest there are six distinct user groups with\\nvarying intention to use shared micromobility: Progressives, Conservatives,\\nHesitant participants, Bold innovators, Anxious observers and Skilled sceptics.\\nBold innovators and Progressives tend to be the most open to adopting SMM and\\nare also able to do so. Hesitant participants would like to, but find it\\ndifficult or dangerous to use, while Skilled sceptics are capable and\\nconfident, but have limited intention of using it. Conservatives and Anxious\\nobservers are most negative about SMM, finding it difficult to use and\\ndangerous. In general, factors relating to technological savviness,\\nease-of-use, physical safety and societal perception seem to be the biggest\\nbarriers to wider adoption. Younger, highly educated males are the group most\\nlikely and open to using shared micromobility, while older individuals with\\nlower incomes and a lower level of education tend to be the least likely.\", \"main_category\": \"physics.soc-ph\", \"categories\": \"physics.soc-ph\", \"published\": \"2025-04-15T07:46:19Z\"}"}
