{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12794v1\", \"title\": \"Supporting Urban Low-Altitude Economy: Channel Gain Map Inference Based\\n  on 3D Conditional GAN\", \"summary\": \"The advancement of advanced air mobility (AAM) in recent years has given rise\\nto the concept of low-altitude economy (LAE). However, the diverse flight\\nactivities associated with the emerging LAE applications in urban scenarios\\nconfront complex physical environments, which urgently necessitates ubiquitous\\nand reliable communication to guarantee the operation safety of the\\nlow-altitude aircraft. As one of promising technologies for the sixth\\ngeneration (6G) mobile networks, channel knowledge map (CKM) enables the\\nenvironment-aware communication by constructing a site-specific dataset,\\nthereby providing a priori on-site information for the aircraft to obtain the\\nchannel state information (CSI) at arbitrary locations with much reduced online\\noverhead. Diverse base station (BS) deployments in the three-dimensional (3D)\\nurban low-altitude environment require efficient 3D CKM construction to capture\\nspatial channel characteristics with less overhead. Towards this end, this\\npaper proposes a 3D channel gain map (CGM) inference method based on a 3D\\nconditional generative adversarial network (3D-CGAN). Specifically, we first\\nanalyze the potential deployment types of BSs in urban low-altitude scenario,\\nand investigate the CGM representation with the corresponding 3D channel gain\\nmodel. The framework of the proposed 3D-CGAN is then discussed, which is\\ntrained by a dataset consisting of existing CGMs. Consequently, the trained\\n3D-CGAN is capable of inferring the corresponding CGM only based on the BS\\ncoordinate without additional measurement. The simulation results demonstrate\\nthat the CGMs inferred by the proposed 3D-CGAN outperform those of the\\nbenchmark schemes, which can accurately reflect the radio propagation condition\\nin 3D environment.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-17T09:55:03Z\"}"}
