{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24380v1\", \"title\": \"The fundamental localization phases in quasiperiodic systems: A unified\\n  framework and exact results\", \"summary\": \"The disordered quantum systems host three types of quantum states, the\\nextended, localized, and critical, which bring up various distinct fundamental\\nphases, including the pure phases and coexisting ones with mobility edges. The\\nquantum phases involving critical states are of particular importance, but are\\nless understood compared with the other ones, and the different phases have\\nbeen separately studied in different quasiperiodic models. Here we propose a\\nunified framework based on a spinful quasiperiodic system which unifies the\\nrealizations of all the fundamental Anderson phases, %with or without mobility\\nedges, with the exact and universal results being obtained for these distinct\\nphases. Through the duality transformation and renormalization group method, we\\nshow that the pure phases are obtained when the (emergent) chiral symmetry\\npreserves in the proposed spin-1/2 quasiperiodic model, which provides a\\ncriteria for the emergence of the pure phases or the coexisting ones with\\nmobility edges. Further, we uncover a new universal mechanism for the critical\\nstates that the emergence of such states is protected by the generalized\\nincommensurate matrix element zeros in the spinful quasiperiodic model, as a\\nnovel generalization of the quasiperiodic hopping zeros in the spinless\\nsystems. We also show with the Avila's global theory the criteria of exact\\nsolvability for the present unified quasiperiodic system, with which we\\nidentify several new quasiperiodic models derived from the spinful system\\nhosting exactly solvable Anderson phases. In particular, we reach a single\\nmodel that hosts all the seven fundamental phases of Anderson localization.\\nFinally, an experimental scheme is proposed to realize these models using\\nquasiperiodic optical Raman lattices.\", \"main_category\": \"cond-mat.dis-nn\", \"categories\": \"cond-mat.dis-nn,cond-mat.mes-hall,cond-mat.stat-mech,quant-ph\", \"published\": \"2025-03-31T17:59:02Z\"}"}
