{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11894v1\", \"title\": \"Trajectory Dispersion Control for Precision Landing Guidance of Reusable\\n  Rockets\", \"summary\": \"This article is an engineering note, and formal abstract is omitted in\\naccordance with the requirements of the journal. The main idea of this note is\\nas follows. In endoatmospheric landing of reusable rockets, there exist various\\nkinds of disturbances that can induce the trajectory dispersion. The trajectory\\ndispersion propagates with flight time and ultimately determines landing\\naccuracy. Therefore, to achieve high-precision landing, this note proposes a\\nnovel online trajectory dispersion control method. Based on a Parameterized\\nOptimal Feedback Guidance Law (POFGL), two key components of the proposed\\nmethod are designed: online trajectory dispersion prediction and real-time\\nguidance parameter tuning for trajectory dispersion optimization. First, by\\nformalizing a parameterized probabilistic disturbance model, the closed-loop\\ntrajectory dispersion under the POFGL is predicted online. Compared with the\\ncovariance control guidance method, a more accurate trajectory dispersion\\nprediction is achieved by using generalized Polynomial Chaos (gPC) expansion\\nand pseudospectral collocation methods. Second, to ensure computational\\nefficiency, a gradient descent based real-time guidance parameter tuning law is\\ndesigned to simultaneously optimize the performance index and meet the landing\\nerror dispersion constraint, which significantly reduces the conservativeness\\nof guidance design compared with the robust trajectory optimization method.\\nNumerical simulations indicate that the trajectory dispersion prediction method\\ncan achieve the same accuracy as the Monte Carlo method with smaller\\ncomputational resource; the guidance parameter tuning law can improve the\\noptimal performance index and meet the desired accuracy requirements through\\ndirectly shaping the trajectory dispersion.\", \"main_category\": \"physics.space-ph\", \"categories\": \"physics.space-ph\", \"published\": \"2025-04-16T09:20:16Z\"}"}
