{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19779v1\", \"title\": \"Learning Brenier Potentials with Convex Generative Adversarial Neural\\n  Networks\", \"summary\": \"Brenier proved that under certain conditions on a source and a target\\nprobability measure there exists a strictly convex function such that its\\ngradient is a transport map from the source to the target distribution. This\\nfunction is called the Brenier potential. Furthermore, detailed information on\\nthe H\\\\\\\"older regularity of the Brenier potential is available. In this work we\\ndevelop the statistical learning theory of generative adversarial neural\\nnetworks that learn the Brenier potential. As by the transformation of\\ndensities formula, the density of the generated measure depends on the second\\nderivative of the Brenier potential, we develop the universal approximation\\ntheory of ReCU networks with cubic activation $\\\\mathtt{ReCU}(x)=\\\\max\\\\{0,x\\\\}^3$\\nthat combines the favorable approximation properties of H\\\\\\\"older functions with\\na Lipschitz continuous density. In order to assure the convexity of such\\ngeneral networks, we introduce an adversarial training procedure for a\\npotential function represented by the ReCU networks that combines the classical\\ndiscriminator cross entropy loss with a penalty term that enforces (strict)\\nconvexity. We give a detailed decomposition of learning errors and show that\\nfor a suitable high penalty parameter all networks chosen in the adversarial\\nmin-max optimization problem are strictly convex. This is further exploited to\\nprove the consistency of the learning procedure for (slowly) expanding network\\ncapacity. We also implement the described learning algorithm and apply it to a\\nnumber of standard test cases from Gaussian mixture to image data as target\\ndistributions. As predicted in theory, we observe that the convexity loss\\nbecomes inactive during the training process and the potentials represented by\\nthe neural networks have learned convexity.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.CV\", \"published\": \"2025-04-28T13:24:52Z\"}"}
