{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20420v1\", \"title\": \"A Geography-Inspired and Self-Adaptive Clustering Algorithm: A Study in\\n  Channel Measurement\", \"summary\": \"The phenomenon that multi-path components (MPCs) arrive in clusters has been\\nverified by channel measurements, and is widely adopted by cluster-based\\nchannel models. As a crucial intermediate processing step, MPC clustering\\nbridges raw data in channel measurement and cluster characteristics for channel\\nmodeling. In this paper, a physical-interpretable and self-adaptive MPC\\nclustering algorithm is proposed, which can locate both single-point and\\nwide-spread scatterers without prior knowledge. Inspired by the concept in\\ngeography, a novel metaphor that interprets features of MPC attributes in the\\npower-delay-angle profile (PDAP) as topographic concepts is developed. In light\\nof the interpretation, the proposed algorithm disassembles the PDAP by\\nconstructing contour lines and identifying characteristic points that indicate\\nthe skeleton of MPC clusters, which are fitted by analytical models that\\nassociate MPCs with physical scatterer locations. Besides, a new clustering\\nperformance index, the power gradient consistency index, is proposed.\\nCalculated as the weighted Spearman correlation coefficient between the power\\nand the distance to the center, the index captures the intrinsic property of\\nMPC clusters that the dominant high-power path is surrounded by lower-power\\npaths. The performance of the proposed algorithm is analyzed and compared with\\nthe counterparts of conventional clustering algorithms based on the channel\\nmeasurement conducted in an outdoor scenario. The proposed algorithm performs\\nbetter in average Silhouette index and weighted Spearman correlation\\ncoefficient, and the average root mean square error (RMSE) of the estimated\\nscatterer location is 0.1 m.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,eess.SP,math.IT\", \"published\": \"2025-04-29T04:32:03Z\"}"}
