{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01327v1\", \"title\": \"Multi-wavelength properties of $z\\\\gtrsim 6$ LISA detectable events\", \"summary\": \"We investigate the intrinsic and observational properties of $z\\\\gtrsim 6$\\ngalaxies hosting coalescing massive black holes (MBHs) that gives rise to\\ngravitational waves (GWs) detectable with the Laser Interferometer Space\\nAntenna (LISA). We adopt a zoom-in cosmological hydrodynamical simulation of\\ngalaxy formation and black hole (BH) co-evolution, zoomed-in on a $M_h \\\\sim\\n10^{12}~\\\\rm M_{\\\\odot}$ dark matter halo at z = 6, which hosts a fast accreting\\nsuper-massive black hole (SMBH) and a star-forming galaxy. Following the SMBH\\nformation backward in time, we identify the merging events that concurred to\\nits formation and we pick up the ones that are detectable with LISA. Among\\nthese LISA detectable events (LDEs), we select those that, based on their\\nintrinsic properties are expected to be bright in one or more electromagnetic\\n(EM) bands. We post-process these events with dust radiative transfer\\ncalculations to make predictions about their spectral energy distributions and\\ncontinuum maps in the JWST to ALMA wavelength range. We compare the spectra\\narising from galaxies hosting the merging MBHs with those arising from AGN\\npowered by single accreting BHs. We find that it will be impossible to identify\\nan LDE from the continuum SEDs because of the absence of specific imprints from\\nthe merging MBHs. We also compute the profile of the H$_{\\\\rm \\\\alpha}$ line\\narising from LDEs, considering the contribution from their star-forming regions\\nand the accreting MBHs. We find that the presence of two accreting MBHs would\\nbe difficult to infer even if both MBHs accrete at super-Eddington rates. We\\nconclude that the combined detection of GW and EM signals from $z\\\\gtrsim 6$\\nMBHs is challenging not only because of the poor sky-localization provided by\\nLISA, but also because the loudest GW emitters are not massive enough to leave\\nsignificant signatures in the emission lines arising from the broad line\\nregion.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-02T03:24:35Z\"}"}
