{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10120v1\", \"title\": \"Universally Composable Commitments with Communicating Malicious\\n  Physically Uncloneable Functions\", \"summary\": \"In this work, we explore the possibility of universally composable\\n(UC)-secure commitments using Physically Uncloneable Functions (PUFs) within a\\nnew adversarial model. We introduce the communicating malicious PUFs, i.e.\\nmalicious PUFs that can interact with their creator even when not in their\\npossession, obtaining a stronger adversarial model. Prior work [ASIACRYPT 2013,\\nLNCS, vol. 8270, pp. 100-119] proposed a compiler for constructing UC-secure\\ncommitments from ideal extractable commitments, and our task would be to adapt\\nthe ideal extractable commitment scheme proposed therein to our new model.\\nHowever, we found an attack and identified a few other issues in that\\nconstruction, and to address them, we modified the aforementioned ideal\\nextractable commitment scheme and introduced new properties and tools that\\nallow us to rigorously develop and present security proofs in this context. We\\npropose a new UC-secure commitment scheme against adversaries that can only\\ncreate stateless malicious PUFs which can receive, but not send, information\\nfrom their creators. Our protocol is more efficient compared to previous\\nproposals, as we have parallelized the ideal extractable commitments within it.\\nThe restriction to stateless malicious PUFs is significant, mainly since the\\nprotocol from [ASIACRYPT 2013, LNCS, vol. 8270, pp. 100-119] assumes malicious\\nPUFs with unbounded state, thus limiting its applicability. However it is the\\nonly way we found to address the issues of the original construction. We hope\\nthat in future work this restriction can be lifted, and along the lines of our\\nwork, UC-secure commitments with fewer restrictions on both the state and\\ncommunication can be constructed.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR\", \"published\": \"2025-04-14T11:29:04Z\"}"}
