{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03691v1\", \"title\": \"Sequential decoding of the XYZ$^2$ hexagonal stabilizer code\", \"summary\": \"Quantum error correction requires accurate and efficient decoding to\\noptimally suppress errors in the encoded information. For concatenated codes,\\nwhere one code is embedded within another, optimal decoding can be achieved\\nusing a message-passing algorithm that sends conditional error probabilities\\nfrom the lower-level code to a higher-level decoder. In this work, we study the\\nXYZ$^2$ topological stabilizer code, defined on a honeycomb lattice, and use\\nthe fact that it can be viewed as a concatenation of a [[2, 1, 1]] phase-flip\\nparity check code and the surface code with $YZZY$ stabilizers, to decode the\\nsyndrome information in two steps. We use this sequential decoding scheme to\\ncorrect errors on data qubits, as well as measurement errors, under various\\nbiased error models using both a maximum-likelihood decoder (MLD) and more\\nefficient matching-based decoders. For depolarizing noise we find that the\\nsequential matching decoder gives a threshold of 18.3%, close to optimal, as a\\nconsequence of a favorable, effectively biased, error model on the upper-level\\nYZZY code. For phase-biased noise on data qubits, at a bias $\\\\eta =\\n\\\\frac{p_z}{p_x+p_y} = 10$, we find that a belief-matching-based decoder reaches\\nthresholds of 24.1%, compared to 28.6% for the MLD. With measurement errors the\\nthresholds are reduced to 3.4% and 4.3%, for depolarizing and biased noise\\nrespectively, using the belief-matching decoder. This demonstrates that the\\nXYZ$^2$ code has thresholds that are competitive with other codes tailored to\\nbiased noise. The results also showcase two approaches to taking advantage of\\nconcatenated codes: 1) tailoring the upper-level code to the effective noise\\nprofile of the decoded lower-level code, and 2) making use of an upper-level\\ndecoder that can utilize the local information from the lower-level code.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-05-06T16:53:51Z\"}"}
