{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10358v1\", \"title\": \"FingER: Content Aware Fine-grained Evaluation with Reasoning for\\n  AI-Generated Videos\", \"summary\": \"Recent advances in video generation have posed great challenges in the\\nassessment of AI-generated content, particularly with the emergence of\\nincreasingly sophisticated models. The various inconsistencies and defects\\nobserved in such videos are inherently complex, making overall scoring\\nnotoriously difficult. In this paper, we emphasize the critical importance of\\nintegrating fine-grained reasoning into video evaluation, and we propose\\n$\\\\textbf{F}$ing$\\\\textbf{ER}$, a novel entity-level reasoning evaluation\\nframework that first automatically generates $\\\\textbf{F}$ine-grained\\n$\\\\textbf{E}$ntity-level questions, and then answers those questions by a\\n$\\\\textbf{R}$easoning model with scores, which can be subsequently weighted\\nsummed to an overall score for different applications. Specifically, we\\nleverage LLMs to derive entity-level questions across five distinct\\nperspectives, which (i) often focus on some specific entities of the content,\\nthereby making answering or scoring much easier by MLLMs, and (ii) are more\\ninterpretable. Then we construct a FingER dataset, consisting of approximately\\n3.3k videos and corresponding 60k fine-grained QA annotations, each with\\ndetailed reasons. Based on that, we further investigate various training\\nprotocols to best incentivize the reasoning capability of MLLMs for correct\\nanswer prediction. Extensive experiments demonstrate that a reasoning model\\ntrained using Group Relative Policy Optimization (GRPO) with a cold-start\\nstrategy achieves the best performance. Notably, our model surpasses existing\\nmethods by a relative margin of $11.8\\\\%$ on GenAI-Bench and $5.5\\\\%$ on\\nMonetBench with only 3.3k training videos, which is at most one-tenth of the\\ntraining samples utilized by other methods. Our code and dataset will be\\nreleased soon.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-14T16:07:16Z\"}"}
