{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04207v1\", \"title\": \"An Enhanced YOLOv8 Model for Real-Time and Accurate Pothole Detection\\n  and Measurement\", \"summary\": \"Potholes cause vehicle damage and traffic accidents, creating serious safety\\nand economic problems. Therefore, early and accurate detection of potholes is\\ncrucial. Existing detection methods are usually only based on 2D RGB images and\\ncannot accurately analyze the physical characteristics of potholes. In this\\npaper, a publicly available dataset of RGB-D images (PothRGBD) is created and\\nan improved YOLOv8-based model is proposed for both pothole detection and\\npothole physical features analysis. The Intel RealSense D415 depth camera was\\nused to collect RGB and depth data from the road surfaces, resulting in a\\nPothRGBD dataset of 1000 images. The data was labeled in YOLO format suitable\\nfor segmentation. A novel YOLO model is proposed based on the YOLOv8n-seg\\narchitecture, which is structurally improved with Dynamic Snake Convolution\\n(DSConv), Simple Attention Module (SimAM) and Gaussian Error Linear Unit\\n(GELU). The proposed model segmented potholes with irregular edge structure\\nmore accurately, and performed perimeter and depth measurements on depth maps\\nwith high accuracy. The standard YOLOv8n-seg model achieved 91.9% precision,\\n85.2% recall and 91.9% mAP@50. With the proposed model, the values increased to\\n93.7%, 90.4% and 93.8% respectively. Thus, an improvement of 1.96% in\\nprecision, 6.13% in recall and 2.07% in mAP was achieved. The proposed model\\nperforms pothole detection as well as perimeter and depth measurement with high\\naccuracy and is suitable for real-time applications due to its low model\\ncomplexity. In this way, a lightweight and effective model that can be used in\\ndeep learning-based intelligent transportation solutions has been acquired.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-05-07T07:58:57Z\"}"}
