{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17549v1\", \"title\": \"Premature supermassive black hole mergers in cosmological simulations of\\n  structure formation\", \"summary\": \"The co-evolution of massive black holes (BHs) and their host galaxies is\\nwell-established within the hierarchical galaxy formation paradigm. Large-scale\\ncosmological simulations are an ideal tool to study the repeated BH mergers,\\naccretion and feedback that conspire to regulate this process. While such\\nsimulations are of fundamental importance for understanding the complex and\\nintertwined relationship between BHs and their hosts, they are plagued with\\nnumerical inaccuracies at the scale of individual BH orbits. To quantify this\\nissue, taking advantage of the $(100 \\\\, h^{-1}\\\\,\\\\text{cMpc})^3$ FABLE\\nsimulation box, we track all individual BH mergers and the corresponding host\\ngalaxy mergers as a function of cosmic time. We demonstrate that BH mergers\\nfrequently occur prematurely, well before the corresponding merger of the host\\ngalaxies is complete, and that BHs are sometimes erroneously displaced from\\ntheir hosts during close galaxy encounters. Correcting for these artefacts\\nresults in substantial macrophysical delays, spanning over several Gyrs, which\\nare additional to any microphysical delays arising from unresolved BH binary\\nhardening processes. We find that once the macrophysical delays are accounted\\nfor, high-mass BH merger events are suppressed, affecting the predictions for\\nthe BH population that may be observable with LISA and pulsar timing arrays.\\nFurthermore, including these macrophysical delays leads to an increase in the\\nnumber of observable dual active galactic nuclei, especially at lower\\nredshifts, with respect to FABLE. Our results highlight the pressing need for\\nmore accurate modelling of BH dynamics in cosmological simulations of galaxy\\nformation as we prepare for the multi-messenger era.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-24T13:40:06Z\"}"}
