{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01547v1\", \"title\": \"Semi-Supervised Biomedical Image Segmentation via Diffusion Models and\\n  Teacher-Student Co-Training\", \"summary\": \"Supervised deep learning for semantic segmentation has achieved excellent\\nresults in accurately identifying anatomical and pathological structures in\\nmedical images. However, it often requires large annotated training datasets,\\nwhich limits its scalability in clinical settings. To address this challenge,\\nsemi-supervised learning is a well-established approach that leverages both\\nlabeled and unlabeled data. In this paper, we introduce a novel semi-supervised\\nteacher-student framework for biomedical image segmentation, inspired by the\\nrecent success of generative models. Our approach leverages denoising diffusion\\nprobabilistic models (DDPMs) to generate segmentation masks by progressively\\nrefining noisy inputs conditioned on the corresponding images. The teacher\\nmodel is first trained in an unsupervised manner using a cycle-consistency\\nconstraint based on noise-corrupted image reconstruction, enabling it to\\ngenerate informative semantic masks. Subsequently, the teacher is integrated\\ninto a co-training process with a twin-student network. The student learns from\\nground-truth labels when available and from teacher-generated pseudo-labels\\notherwise, while the teacher continuously improves its pseudo-labeling\\ncapabilities. Finally, to further enhance performance, we introduce a\\nmulti-round pseudo-label generation strategy that iteratively improves the\\npseudo-labeling process. We evaluate our approach on multiple biomedical\\nimaging benchmarks, spanning multiple imaging modalities and segmentation\\ntasks. Experimental results show that our method consistently outperforms\\nstate-of-the-art semi-supervised techniques, highlighting its effectiveness in\\nscenarios with limited annotated data. The code to replicate our experiments\\ncan be found at\\nhttps://github.com/ciampluca/diffusion_semi_supervised_biomedical_image_segmentation\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-02T09:41:43Z\"}"}
