{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24309v1\", \"title\": \"The edge-on disk Tau042021: icy grains at high altitudes and a wind\\n  containing astronomical PAHs\", \"summary\": \"Spectra of the nearly edge-on protoplanetary disks observed with the JWST\\nhave shown ice absorption bands of varying optical depths and peculiar\\nprofiles, challenging radiative transfer modelling and our understanding of\\ndust and ice in disks. We build models including dust grain size, shape, and\\ncomposition to reproduce JWST IFU spectroscopy of the large edge-on disk\\nTau042021. We explore radiative transfer models using different dust grain size\\ndistributions, including grains of effective radii a_eff = 0.005-3000 microns.\\nScattering properties of distributions of triaxial ellipsoidal grains are\\ncalculated. We consider compositions with silicates, amorphous carbon, and\\nmixtures of H2O, CO2, and CO. We use RADMC-3D Monte Carlo radiative transfer\\nmodels of Tau042021 to simulate the spectral cubes observed with JWST-NIRSpec\\nand MIRI. We compare the results to observations, including H2O at 3.05\\nmicrons, CO at 4.67 microns, and CO2 at 4.27 microns and to archival\\nJWST-NIRCam and ALMA continuum images. The observed near- to mid-infrared imply\\ndust distributions with grain sizes up to several tens of microns. The\\nintensity distribution perpendicular to the disk exhibits emission profile\\nwings extending into the upper disk atmosphere at altitudes exceeding the\\nclassical scale height expected in the isothermal hydrostatic limit. We produce\\nice map images demonstrating the presence of icy dust grains up to altitudes\\nhigh above the disk midplane, more than three hydrostatic equilibrium scale\\nheights. We demonstrate the presence of a wind containing the carriers of\\nastronomical PAH bands. The wind appears as an X-shaped emission at 3.3, 6.2,\\n7.7 and 11.3 microns, characteristic wavelengths of the infrared astronomical\\nPAH bands. We associate the spatial distribution of this component with\\ncarriers of astronomical PAH bands that form a layer of emission at the\\ninterface with the H2 wind.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,astro-ph.SR\", \"published\": \"2025-03-31T16:56:16Z\"}"}
