{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20709v1\", \"title\": \"Periodicity and local complexity of Delone sets\", \"summary\": \"We study complexity and periodicity of Delone sets by applying an algebraic\\napproach to multidimensional symbolic dynamics. In this algebraic approach,\\n$\\\\mathbb{Z}^d$-configurations $c: \\\\mathbb{Z}^d \\\\to \\\\mathcal{A}$ for a finite\\nset $\\\\mathcal{A} \\\\subseteq \\\\mathbb{C}$ and finite $\\\\mathbb{Z}^d$-patterns are\\nregarded as formal power series and Laurent polynomials, respectively. In this\\npaper we study also functions $c: \\\\mathbb{R}^d \\\\to \\\\mathcal{A}$ where\\n$\\\\mathcal{A}$ is as above. These functions are called\\n$\\\\mathbb{R}^d$-configurations. Any Delone set may be regarded as an\\n$\\\\mathbb{R}^d$-configuration by simply presenting it as its indicator function.\\nConversely, any $\\\\mathbb{R}^d$-configuration whose support (that is, the set of\\ncells for which the configuration gets non-zero values) is a Delone set can be\\nseen as a colored Delone set. We generalize the concept of annihilators and\\nperiodizers of $\\\\mathbb{Z}^d$-configurations for $\\\\mathbb{R}^d$-configurations.\\nWe show that if an $\\\\mathbb{R}^d$-configuration has a non-trivial annihilator,\\nthat is, if a linear combination of some finitely many of its translations is\\nthe zero function, then it has an annihilator of a particular form. Moreover,\\nwe show that $\\\\mathbb{R}^d$-configurations with integer coefficients that have\\nnon-trivial annihilators are sums of finitely many periodic functions\\n$c_1,\\\\ldots,c_m: \\\\mathbb{R}^d \\\\to \\\\mathbb{Z}$. Also, $\\\\mathbb{R}^d$-pattern\\ncomplexity is studied alongside with the classical patch-complexity of Delone\\nsets. We point out the fact that sufficiently low $\\\\mathbb{R}^d$-pattern\\ncomplexity of an $\\\\mathbb{R}^d$-configuration implies the existence of\\nnon-trivial annihilators. Moreover, it is shown that if a Meyer set has\\nsufficiently slow patch-complexity growth, then it has a non-trivial\\nannihilator. Finally, a condition for forced periodicity of colored Delone sets\\nof finite local complexity is provided.\", \"main_category\": \"math.DS\", \"categories\": \"math.DS,cs.DM,math.CO\", \"published\": \"2025-04-29T12:41:01Z\"}"}
