{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01922v1\", \"title\": \"Is Less Really More? Fake News Detection with Limited Information\", \"summary\": \"The threat that online fake news and misinformation pose to democracy,\\njustice, public confidence, and especially to vulnerable populations, has led\\nto a sharp increase in the need for fake news detection and intervention.\\nWhether multi-modal or pure text-based, most fake news detection methods depend\\non textual analysis of entire articles. However, these fake news detection\\nmethods come with certain limitations. For instance, fake news detection\\nmethods that rely on full text can be computationally inefficient, demand large\\namounts of training data to achieve competitive accuracy, and may lack\\nrobustness across different datasets. This is because fake news datasets have\\nstrong variations in terms of the level and types of information they provide;\\nwhere some can include large paragraphs of text with images and metadata,\\nothers can be a few short sentences. Perhaps if one could only use minimal\\ninformation to detect fake news, fake news detection methods could become more\\nrobust and resilient to the lack of information. We aim to overcome these\\nlimitations by detecting fake news using systematically selected, limited\\ninformation that is both effective and capable of delivering robust, promising\\nperformance. We propose a framework called SLIM Systematically-selected Limited\\nInformation) for fake news detection. In SLIM, we quantify the amount of\\ninformation by introducing information-theoretic measures. SLIM leverages\\nlimited information to achieve performance in fake news detection comparable to\\nthat of state-of-the-art obtained using the full text. Furthermore, by\\ncombining various types of limited information, SLIM can perform even better\\nwhile significantly reducing the quantity of information required for training\\ncompared to state-of-the-art language model-based fake news detection\\ntechniques.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-04-02T17:32:37Z\"}"}
