{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07055v1\", \"title\": \"$\\u03a0$-NeSy: A Possibilistic Neuro-Symbolic Approach\", \"summary\": \"In this article, we introduce a neuro-symbolic approach that combines a\\nlow-level perception task performed by a neural network with a high-level\\nreasoning task performed by a possibilistic rule-based system. The goal is to\\nbe able to derive for each input instance the degree of possibility that it\\nbelongs to a target (meta-)concept. This (meta-)concept is connected to\\nintermediate concepts by a possibilistic rule-based system. The probability of\\neach intermediate concept for the input instance is inferred using a neural\\nnetwork. The connection between the low-level perception task and the\\nhigh-level reasoning task lies in the transformation of neural network outputs\\nmodeled by probability distributions (through softmax activation) into\\npossibility distributions. The use of intermediate concepts is valuable for the\\nexplanation purpose: using the rule-based system, the classification of an\\ninput instance as an element of the (meta-)concept can be justified by the fact\\nthat intermediate concepts have been recognized.\\n  From the technical side, our contribution consists of the design of efficient\\nmethods for defining the matrix relation and the equation system associated\\nwith a possibilistic rule-based system. The corresponding matrix and equation\\nare key data structures used to perform inferences from a possibilistic\\nrule-based system and to learn the values of the rule parameters in such a\\nsystem according to a training data sample. Furthermore, leveraging recent\\nresults on the handling of inconsistent systems of fuzzy relational equations,\\nan approach for learning rule parameters according to multiple training data\\nsamples is presented. Experiments carried out on the MNIST addition problems\\nand the MNIST Sudoku puzzles problems highlight the effectiveness of our\\napproach compared with state-of-the-art neuro-symbolic ones.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.LG,cs.LO\", \"published\": \"2025-04-09T17:16:23Z\"}"}
