{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03267v1\", \"title\": \"Solar Coronal Heating: Role of Kinetic and Inertial Alfv\\u00e9n Waves in\\n  Heating and Charged Particle Acceleration\", \"summary\": \"A comprehensive understanding of solar coronal heating and charged particle\\nacceleration remains one of the most critical challenges in space and\\nastrophysical plasma physics. In this study, we explore the contribution of\\nAlfv\\\\'en waves, both in their kinetic (KAWs) and inertial (IAWs) regimes, to\\nparticle acceleration processes that ultimately lead to coronal heating. Using\\na kinetic plasma framework based on the generalized Vlasov-Maxwell model, we\\nanalyze the dynamics of these waves with a focus on the perpendicular\\ncomponents of the Poynting flux vectors and the net resonance speed of the\\nparticles.\\n  Our results show that both the magnitude and dissipation rate of the Poynting\\nflux for KAWs and IAWs decrease with increasing electron-to-ion temperature\\nratio (T_e/T_i) and normalized perpendicular electron inertial length (c k_x /\\nomega_pe). We evaluate the associated electric potentials and find that KAWs\\nare significantly influenced in the high wavenumber (k_x rho_i) regime. IAWs,\\non the other hand, show a decrease in electric potential along the magnetic\\nfield and an increase across it when the perpendicular electric field (E_x) is\\nenhanced. We also determine the net resonant speeds of particles in the\\nperpendicular direction and show that these wave-particle interactions can\\nefficiently heat the solar corona over large distances (R_Sun). Finally, we\\nquantify the power transported by KAWs and IAWs through solar flux loop tubes,\\nfinding that both wave types deliver greater energy with increasing T_e/T_i and\\nc k_x / omega_pe. These findings offer deeper insights into wave-driven heating\\nand are relevant to solar wind and magnetospheric physics.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,physics.plasm-ph\", \"published\": \"2025-05-06T07:59:31Z\"}"}
