{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14971v1\", \"title\": \"A novel hybrid neural network of fluid-structure interaction prediction\\n  for two cylinders in tandem arrangement\", \"summary\": \"Deep learning has shown promise in improving computing efficiency while\\nensuring modeling accuracy in fluid-structure interaction (FSI) analysis.\\nHowever, its current capabilities are limited when it comes to constructing\\nmulti-object coupling systems with dynamic boundaries. To address such\\nlimitation, a novel FSI neural solver integrated by a fluid deep learning model\\nwith multi-time steps and a structural dynamic solver is proposed to accurately\\nand reliably predict the vortex-induced vibration (VIV) evolution for two\\ncylinders in tandem. This well-designed model in the form of end-to-end can\\nprecisely predict the instantaneous flow field state at the subsequent time by\\ncoupling the temporal flow fields of historical multi-time sequences and the\\ncurrent structural responses, moreover, derives the structural state at the\\nnext time. Furthermore, the novel fluid deep learning model consists of a wall\\nshear model utilizing a multilayer perception network and flow field model with\\nU-shaped architecture jointing the Fourier neural operator and modified\\nconvolution long-short term memory model. Both models effectively capture\\ncoupling transfer forces and predict instantaneous flow fields, with the latter\\ndemonstrating superior accuracy compared to Convolutional Neural Network- or\\nUnet- based models with similar parameters. The prediction speed of the\\nproposed models realizes an improvement of over 1000 times compared with the\\nnumerical simulation. Significantly, the proposed FSI neural model demonstrates\\nexceptional capability in constructing the nonlinear complex multi- vibration\\nsystems and has substantial potential for advancing FSI modeling of flexible\\nstructures featuring pronounced nonlinear deformation boundaries.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-21T08:58:00Z\"}"}
