{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04160v1\", \"title\": \"Leptohadronic Multimessenger Modeling of Two High-redshift (z $>$ 1)\\n  Neutrino Emission Blazar Candidates\", \"summary\": \"The blazars are one of the leading candidate sources of high-energy\\nneutrinos. Recently, two blazars have been found to be temporally and spatially\\ncorrelated with some IceCube high-energy neutrino events. The two blazars, GB6\\nJ2113+1121 and NVSS J171822+423948, are Flat Spectrum Radio Quasars (FSRQs)\\nwith redshifts greater than unity. In particular, NVSS J171822+423948 has a\\nredshift of 2.7, which provides an important probe for studying the radiation\\nprocesses of jets from active galactic nuclei in the early universe. To better\\nunderstand the physical origin of the IceCube neutrinos, we adopt the one-zone\\nleptohadronic model to fit the multimessenger emission of GB6 J2113+1121 and\\nNVSS J171822+423948 during their $\\\\gamma$-ray flaring periods and then\\ncalculate the high-energy neutrino detection probability. The chance of\\ndetecting a single muon neutrino from these two sources is found to be $\\\\sim\\n2\\\\%$ and $0.8\\\\%$, respectively. Although such detection rates are not high\\nmainly because of their high redshifts, our investigation strongly suggests\\nthat these sources are efficient PeV neutrino emitters. Our results also\\nindicate that electromagnetic cascades produced by hadronic processes\\ncontribute significantly to X-ray and $\\\\gamma$-ray emissions. However,\\nhigh-energy $\\\\gamma$-rays can be severely absorbed by the soft photon field\\nfrom the broad-line region (BLR), which weakens the correlation between\\n$\\\\gamma$-rays and neutrinos, while suggesting a stronger connection between\\nX-rays and neutrinos. We predict that IceCube will continue to detect neutrinos\\nfrom FSRQs with redshifts greater than 1 in the future.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.GA\", \"published\": \"2025-05-07T06:22:55Z\"}"}
