{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03519v1\", \"title\": \"Uncovering the Limitations of Model Inversion Evaluation: Benchmarks and\\n  Connection to Type-I Adversarial Attacks\", \"summary\": \"Model Inversion (MI) attacks aim to reconstruct information of private\\ntraining data by exploiting access to machine learning models. The most common\\nevaluation framework for MI attacks/defenses relies on an evaluation model that\\nhas been utilized to assess progress across almost all MI attacks and defenses\\nproposed in recent years. In this paper, for the first time, we present an\\nin-depth study of MI evaluation. Firstly, we construct the first comprehensive\\nhuman-annotated dataset of MI attack samples, based on 28 setups of different\\nMI attacks, defenses, private and public datasets. Secondly, using our dataset,\\nwe examine the accuracy of the MI evaluation framework and reveal that it\\nsuffers from a significant number of false positives. These findings raise\\nquestions about the previously reported success rates of SOTA MI attacks.\\nThirdly, we analyze the causes of these false positives, design controlled\\nexperiments, and discover the surprising effect of Type I adversarial features\\non MI evaluation, as well as adversarial transferability, highlighting a\\nrelationship between two previously distinct research areas. Our findings\\nsuggest that the performance of SOTA MI attacks has been overestimated, with\\nthe actual privacy leakage being significantly less than previously reported.\\nIn conclusion, we highlight critical limitations in the widely used MI\\nevaluation framework and present our methods to mitigate false positive rates.\\nWe remark that prior research has shown that Type I adversarial attacks are\\nvery challenging, with no existing solution. Therefore, we urge to consider\\nhuman evaluation as a primary MI evaluation framework rather than merely a\\nsupplement as in previous MI research. We also encourage further work on\\ndeveloping more robust and reliable automatic evaluation frameworks.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-05-06T13:32:12Z\"}"}
