{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19512v1\", \"title\": \"Gapped Boundaries of Kitaev's Quantum Double Models: A Lattice\\n  Realization of Anyon Condensation from Lagrangian Algebras\", \"summary\": \"The macroscopic theory of anyon condensation, rooted in the categorical\\nstructure of topological excitations, provides a complete classification of\\ngapped boundaries in topologically ordered systems, where distinct boundaries\\ncorrespond to the condensation of different Lagrangian algebras. However, an\\nintrinsic and direct understanding of anyon condensation in lattice models,\\ngrounded in the framework of Lagrangian algebras, remains undeveloped. In this\\npaper, we propose a systematic framework for constructing all gapped boundaries\\nof Kitaev's quantum double models directly from the data of Lagrangian\\nalgebras. Central to our approach is the observation that bulk interactions in\\nthe quantum double models admit two complementary interpretations: the\\nanyon-creating picture and anyon-probing picture. Generalizing this insight to\\nthe boundary, we derive the consistency condition for boundary ribbon operators\\nthat respect the mathematical axiomatic structure of Lagrangian algebras.\\nSolving these conditions yields explicit expressions for the local boundary\\ninteractions required to realize gapped boundaries. Our construction provides a\\nmicroscopic characterization of the bulk-to-boundary anyon condensation\\ndynamics via the action of ribbon operators. Moreover, all these boundary terms\\nare supported within a common effective Hilbert space, making further studies\\non pure boundary phase transitions natural and convenient. Given the broad\\napplicability of anyon condensation theory, we believe that our approach can be\\ngeneralized to extended string-net models or higher-dimensional topologically\\nordered systems.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el,math-ph,math.MP,quant-ph\", \"published\": \"2025-04-28T06:22:06Z\"}"}
