{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10832v1\", \"title\": \"Unlimited Vector Processing for Wireless Baseband Based on RISC-V\\n  Extension\", \"summary\": \"Wireless baseband processing (WBP) serves as an ideal scenario for utilizing\\nvector processing, which excels in managing data-parallel operations due to its\\nparallel structure. However, conventional vector architectures face certain\\nconstraints such as limited vector register sizes, reliance on power-of-two\\nvector length multipliers, and vector permutation capabilities tied to specific\\narchitectures. To address these challenges, we have introduced an instruction\\nset extension (ISE) based on RISC-V known as unlimited vector processing (UVP).\\nThis extension enhances both the flexibility and efficiency of vector\\ncomputations. UVP employs a novel programming model that supports\\nnon-power-of-two register groupings and hardware strip-mining, thus enabling\\nsmooth handling of vectors of varying lengths while reducing the software\\nstrip-mining burden. Vector instructions are categorized into symmetric and\\nasymmetric classes, complemented by specialized load/store strategies to\\noptimize execution. Moreover, we present a hardware implementation of UVP\\nfeaturing sophisticated hazard detection mechanisms, optimized pipelines for\\nsymmetric tasks such as fixed-point multiplication and division, and a robust\\npermutation engine for effective asymmetric operations. Comprehensive\\nevaluations demonstrate that UVP significantly enhances performance, achieving\\nup to 3.0$\\\\times$ and 2.1$\\\\times$ speedups in matrix multiplication and fast\\nFourier transform (FFT) tasks, respectively, when measured against lane-based\\nvector architectures. Our synthesized RTL for a 16-lane configuration using\\nSMIC 40nm technology spans 0.94 mm$^2$ and achieves an area efficiency of 21.2\\nGOPS/mm$^2$.\", \"main_category\": \"cs.AR\", \"categories\": \"cs.AR\", \"published\": \"2025-04-15T03:23:02Z\"}"}
