{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10854v1\", \"title\": \"LVLM_CSP: Accelerating Large Vision Language Models via Clustering,\\n  Scattering, and Pruning for Reasoning Segmentation\", \"summary\": \"Large Vision Language Models (LVLMs) have been widely adopted to guide vision\\nfoundation models in performing reasoning segmentation tasks, achieving\\nimpressive performance. However, the substantial computational overhead\\nassociated with LVLMs presents a new challenge. The primary source of this\\ncomputational cost arises from processing hundreds of image tokens. Therefore,\\nan effective strategy to mitigate such overhead is to reduce the number of\\nimage tokens, a process known as image token pruning. Previous studies on image\\ntoken pruning for LVLMs have primarily focused on high level visual\\nunderstanding tasks, such as visual question answering and image captioning. In\\ncontrast, guiding vision foundation models to generate accurate visual masks\\nbased on textual queries demands precise semantic and spatial reasoning\\ncapabilities. Consequently, pruning methods must carefully control individual\\nimage tokens throughout the LVLM reasoning process. Our empirical analysis\\nreveals that existing methods struggle to adequately balance reductions in\\ncomputational overhead with the necessity to maintain high segmentation\\naccuracy. In this work, we propose LVLM_CSP, a novel training free visual token\\npruning method specifically designed for LVLM based reasoning segmentation\\ntasks. LVLM_CSP consists of three stages: clustering, scattering, and pruning.\\nInitially, the LVLM performs coarse-grained visual reasoning using a subset of\\nselected image tokens. Next, fine grained reasoning is conducted, and finally,\\nmost visual tokens are pruned in the last stage. Extensive experiments\\ndemonstrate that LVLM_CSP achieves a 65% reduction in image token inference\\nFLOPs with virtually no accuracy degradation, and a 70% reduction with only a\\nminor 1% drop in accuracy on the 7B LVLM.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-15T04:27:15Z\"}"}
