{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10373v1\", \"title\": \"DUE: A Deep Learning Framework and Library for Modeling Unknown\\n  Equations\", \"summary\": \"Equations, particularly differential equations, are fundamental for\\nunderstanding natural phenomena and predicting complex dynamics across various\\nscientific and engineering disciplines. However, the governing equations for\\nmany complex systems remain unknown due to intricate underlying mechanisms.\\nRecent advancements in machine learning and data science offer a new paradigm\\nfor modeling unknown equations from measurement or simulation data. This\\nparadigm shift, known as data-driven discovery or modeling, stands at the\\nforefront of AI for science, with significant progress made in recent years. In\\nthis paper, we introduce a systematic framework for data-driven modeling of\\nunknown equations using deep learning. This versatile framework is capable of\\nlearning unknown ODEs, PDEs, DAEs, IDEs, SDEs, reduced or partially observed\\nsystems, and non-autonomous differential equations. Based on this framework, we\\nhave developed Deep Unknown Equations (DUE), an open-source software package\\ndesigned to facilitate the data-driven modeling of unknown equations using\\nmodern deep learning techniques. DUE serves as an educational tool for\\nclassroom instruction, enabling students and newcomers to gain hands-on\\nexperience with differential equations, data-driven modeling, and contemporary\\ndeep learning approaches such as FNN, ResNet, generalized ResNet, operator\\nsemigroup networks (OSG-Net), and Transformers. Additionally, DUE is a\\nversatile and accessible toolkit for researchers across various scientific and\\nengineering fields. It is applicable not only for learning unknown equations\\nfrom data but also for surrogate modeling of known, yet complex, equations that\\nare costly to solve using traditional numerical methods. We provide detailed\\ndescriptions of DUE and demonstrate its capabilities through diverse examples,\\nwhich serve as templates that can be easily adapted for other applications.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.NA,math.DS,math.NA,stat.ML\", \"published\": \"2025-04-14T16:20:55Z\"}"}
