{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03334v1\", \"title\": \"From Word to Sentence: A Large-Scale Multi-Instance Dataset for Open-Set\\n  Aerial Detection\", \"summary\": \"In recent years, language-guided open-world aerial object detection has\\ngained significant attention due to its better alignment with real-world\\napplication needs. However, due to limited datasets, most existing\\nlanguage-guided methods primarily focus on vocabulary, which fails to meet the\\ndemands of more fine-grained open-world detection. To address this limitation,\\nwe propose constructing a large-scale language-guided open-set aerial detection\\ndataset, encompassing three levels of language guidance: from words to phrases,\\nand ultimately to sentences. Centered around an open-source large\\nvision-language model and integrating image-operation-based preprocessing with\\nBERT-based postprocessing, we present the OS-W2S Label Engine, an automatic\\nannotation pipeline capable of handling diverse scene annotations for aerial\\nimages. Using this label engine, we expand existing aerial detection datasets\\nwith rich textual annotations and construct a novel benchmark dataset, called\\nMulti-instance Open-set Aerial Dataset (MI-OAD), addressing the limitations of\\ncurrent remote sensing grounding data and enabling effective open-set aerial\\ndetection. Specifically, MI-OAD contains 163,023 images and 2 million\\nimage-caption pairs, approximately 40 times larger than comparable datasets. We\\nalso employ state-of-the-art open-set methods from the natural image domain,\\ntrained on our proposed dataset, to validate the model's open-set detection\\ncapabilities. For instance, when trained on our dataset, Grounding DINO\\nachieves improvements of 29.5 AP_{50} and 33.7 Recall@10 for sentence inputs\\nunder zero-shot transfer conditions. Both the dataset and the label engine will\\nbe released publicly.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.DB\", \"published\": \"2025-05-06T09:07:52Z\"}"}
