{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20627v1\", \"title\": \"Modeling of the time-resolved spectral energy distribution of blazar OJ\\n  287 from 2008 to 2023: a comprehensive multi-epoch study\", \"summary\": \"We present a comprehensive analysis of the time-resolved spectral energy\\ndistributions (SEDs) of the blazar OJ 287 over a 15-year period (2008-2023),\\nusing multi-wavelength data. In the $\\\\gamma$-ray band, multiple flaring\\nepisodes were observed, with the strongest flare reaching a peak flux of\\n$(5.60\\\\pm1.11)\\\\times10^{-7}\\\\:{\\\\rm photons\\\\:cm^{-2}\\\\:s^{-1}}$ on MJD 55869.03\\n(04 November 2011). In the optical/UV band, the source was in an active state\\nbetween MJD 57360 (04 December 2015) and 57960 (26 July 2017), during which the\\nhighest flux of $(1.07\\\\pm0.02)\\\\times10^{-10}\\\\:{\\\\rm erg\\\\:cm^{-2}\\\\:s^{-1}}$ was\\nobserved on MJD 57681.23 (20 October 2016). In the X-ray band, both the flux\\nand spectral index exhibit variability. To investigate the origin of the\\nbroadband emission from OJ 287, we systematically modeled 739\\nquasi-simultaneous SEDs using a leptonic model that self-consistently accounts\\nfor particle injection and cooling. This analysis is possible thanks to the\\nrecent development of a surrogate neural-network-based model, trained on\\nkinetic simulations. This innovative, time-resolved, neural network-based\\napproach overcomes the limitations of traditional single-epoch SED modeling,\\nenabling to explore the temporal evolution of key model parameters, such as the\\nmagnetic field strength, Doppler factor, and electron injection distribution,\\nacross different states of the source. We identified distinct emission states\\ncharacterized by unique combinations of magnetic field $ B $, electron index $\\np $, and Doppler boost $ \\\\delta $, associated to different underlying\\nmechanisms such as varying acceleration processes (e.g., shocks, turbulence)\\nand magnetic confinement. The analysis provides insights into the jet physics\\nprocesses, including particle acceleration mechanisms and dynamic changes in\\nthe jet structure.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.GA\", \"published\": \"2025-04-29T10:54:50Z\"}"}
