{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17785v1\", \"title\": \"Silenzio: Secure Non-Interactive Outsourced MLP Training\", \"summary\": \"Outsourcing the ML training to cloud providers presents a compelling\\nopportunity for resource constrained clients, while it simultaneously bears\\ninherent privacy risks, especially for highly sensitive training data. We\\nintroduce Silenzio, the first fully non-interactive outsourcing scheme for the\\ntraining of multi-layer perceptrons that achieves 128 bit security using FHE.\\nUnlike traditional MPC based protocols that necessitate interactive\\ncommunication between the client and server(s) or non-collusion assumptions\\namong multiple servers, Silenzio enables the fire-and-forget paradigm without\\nsuch assumptions. In this approach, the client encrypts the training data once,\\nand the cloud server performs the training without any further interaction.\\n  Silenzio operates over low bitwidth integers - never exceeding 8 bit - to\\nmitigate the computational overhead of FHE. Our approach features a novel\\nlow-bitwidth matrix multiplication that leverages input-dependent residue\\nnumber systems and a Karatsuba-inspired multiplication routine, ensuring that\\nno intermediate FHE-processed value overflows 8 bit. Starting from an\\nRNS-to-MRNS conversion process, we propose an efficient block-scaling\\nmechanism, which approximately shifts encrypted tensor values to the\\nuser-specified most significant bits. To instantiate the backpropagation of the\\nerror, Silenzio introduces a low-bitwidth and TFHE friendly gradient\\ncomputation for the cross entropy loss.\\n  Implemented using the state-of-the-art Concrete library, we evaluate Silenzio\\non standard MLP training tasks regarding runtime as well as model performance\\nand achieve similar classification accuracy as MLPs trained using standard\\nPyTorch with 32 bit floating-point computations. Our open-source implementation\\nrepresents a significant advancement in privacy-preserving ML, providing a new\\nbaseline for secure and non-interactive outsourced MLP training.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR\", \"published\": \"2025-04-24T17:59:22Z\"}"}
