{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12859v1\", \"title\": \"Enhancing Decentralization in Blockchain Decision-Making Through\\n  Quadratic Voting and Its Generalization\", \"summary\": \"This study explores the application of Quadratic Voting (QV) and its\\ngeneralization to improve decentralization and effectiveness in blockchain\\ngovernance systems. The conducted research identified three main types of\\nquadratic (square root) voting. Two of them pertain to voting with a split\\nstake, and one involves voting without splitting. In split stakes, Type 1 QV\\napplies the square root to the total stake before distributing it among\\npreferences, while Type 2 QV distributes the stake first and then applies the\\nsquare root. In unsplit stakes (Type 3 QV), the square root of the total stake\\nis allocated entirely to each preference. The presented formal proofs confirm\\nthat Types 2 and 3 QV, along with generalized models, enhance decentralization\\nas measured by the Gini and Nakamoto coefficients. A pivotal discovery is the\\nexistence of a threshold stakeholder whose relative voting ratio increases\\nunder QV compared to linear voting, while smaller stakeholders also gain\\ninfluence. The generalized QV model allows flexible adjustment of this\\nthreshold, enabling tailored decentralization levels. Maintaining fairness, QV\\nensures that stakeholders with higher stakes retain a proportionally greater\\nvoting ratio while redistributing influence to prevent excessive concentration.\\nIt is shown that to preserve fairness and robustness, QV must be implemented\\nalongside privacy-preserving cryptographic voting protocols, as voters casting\\ntheir ballots last could otherwise manipulate outcomes. The generalized QV\\nmodel, proposed in this paper, enables algorithmic parametrization to achieve\\ndesired levels of decentralization for specific use cases. This flexibility\\nmakes it applicable across diverse domains, including user interaction with\\ncryptocurrency platforms, facilitating community events and educational\\ninitiatives, and supporting charitable activities through decentralized\\ndecision-making.\", \"main_category\": \"cs.GT\", \"categories\": \"cs.GT\", \"published\": \"2025-04-17T11:36:32Z\"}"}
