{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05081v1\", \"title\": \"PIDiff: Image Customization for Personalized Identities with Diffusion\\n  Models\", \"summary\": \"Text-to-image generation for personalized identities aims at incorporating\\nthe specific identity into images using a text prompt and an identity image.\\nBased on the powerful generative capabilities of DDPMs, many previous works\\nadopt additional prompts, such as text embeddings and CLIP image embeddings, to\\nrepresent the identity information, while they fail to disentangle the identity\\ninformation and background information. As a result, the generated images not\\nonly lose key identity characteristics but also suffer from significantly\\nreduced diversity. To address this issue, previous works have combined the W+\\nspace from StyleGAN with diffusion models, leveraging this space to provide a\\nmore accurate and comprehensive representation of identity features through\\nmulti-level feature extraction. However, the entanglement of identity and\\nbackground information in in-the-wild images during training prevents accurate\\nidentity localization, resulting in severe semantic interference between\\nidentity and background. In this paper, we propose a novel fine-tuning-based\\ndiffusion model for personalized identities text-to-image generation, named\\nPIDiff, which leverages the W+ space and an identity-tailored fine-tuning\\nstrategy to avoid semantic entanglement and achieves accurate feature\\nextraction and localization. Style editing can also be achieved by PIDiff\\nthrough preserving the characteristics of identity features in the W+ space,\\nwhich vary from coarse to fine. Through the combination of the proposed\\ncross-attention block and parameter optimization strategy, PIDiff preserves the\\nidentity information and maintains the generation capability for in-the-wild\\nimages of the pre-trained model during inference. Our experimental results\\nvalidate the effectiveness of our method in this task.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-08T09:26:28Z\"}"}
