{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15913v1\", \"title\": \"A Massive Gas Outflow Outside the Line-of-Sight: Imaging Polarimetry of\\n  the Blue Excess Hot Dust Obscured Galaxy W0204-0506\", \"summary\": \"(Aims) Hot Dust Obscured Galaxies (Hot DOGs) are a population of\\nhyper-luminous, heavily obscured quasars. Although nuclear obscurations close\\nto Compton-thick are typical, a fraction show blue UV spectral energy\\ndistributions consistent with unobscured quasar activity, albeit two orders of\\nmagnitude fainter than expected from their mid-IR luminosity. The origin of the\\nUV emission in these Blue excess Hot DOGs (BHDs) has been linked to scattered\\nlight from the central engine. Here we study the properties of the UV emission\\nin the BHD WISE J020446.13-050640.8 (W0204-0506). (Methods) We use imaging\\npolarization observations in the $R_{\\\\rm Special}$ band obtained with the FORS2\\ninstrument at VLT. We compare these data with radiative transfer simulations to\\nconstrain the characteristics of the scattering material. (Results) We find a\\nspatially integrated polarization fraction of $24.7\\\\pm 0.7$%, confirming the\\nscattered-light nature of the UV emission of W0204-0506. The source is\\nspatially resolved in the observations and we find a gradient in polarization\\nfraction and angle that is aligned with the extended morphology of the source\\nfound in HST/WFC3 imaging. A dusty, conical polar outflow starting at the AGN\\nsublimation radius with a half-opening angle $\\\\lesssim 50~\\\\rm deg$ viewed at an\\ninclination $\\\\gtrsim 45~\\\\rm deg$ can reproduce the observed polarization\\nfraction if the dust is graphite-rich. We find that the gas mass and outflow\\nvelocity are consistent with the range of values found for [OIII] outflows\\nthrough spectroscopy in other Hot DOGs, though it is unclear whether the\\noutflow is energetic enough to affect the long-term evolution of the host\\ngalaxy. Our study highlights the unique potential for polarization imaging to\\nstudy dusty quasar outflows, providing complementary constraints to those\\nobtained through traditional spectroscopic studies.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.CO\", \"published\": \"2025-04-22T14:00:11Z\"}"}
