{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21336v1\", \"title\": \"UniBiomed: A Universal Foundation Model for Grounded Biomedical Image\\n  Interpretation\", \"summary\": \"Multi-modal interpretation of biomedical images opens up novel opportunities\\nin biomedical image analysis. Conventional AI approaches typically rely on\\ndisjointed training, i.e., Large Language Models (LLMs) for clinical text\\ngeneration and segmentation models for target extraction, which results in\\ninflexible real-world deployment and a failure to leverage holistic biomedical\\ninformation. To this end, we introduce UniBiomed, the first universal\\nfoundation model for grounded biomedical image interpretation. UniBiomed is\\nbased on a novel integration of Multi-modal Large Language Model (MLLM) and\\nSegment Anything Model (SAM), which effectively unifies the generation of\\nclinical texts and the segmentation of corresponding biomedical objects for\\ngrounded interpretation. In this way, UniBiomed is capable of tackling a wide\\nrange of biomedical tasks across ten diverse biomedical imaging modalities. To\\ndevelop UniBiomed, we curate a large-scale dataset comprising over 27 million\\ntriplets of images, annotations, and text descriptions across ten imaging\\nmodalities. Extensive validation on 84 internal and external datasets\\ndemonstrated that UniBiomed achieves state-of-the-art performance in\\nsegmentation, disease recognition, region-aware diagnosis, visual question\\nanswering, and report generation. Moreover, unlike previous models that rely on\\nclinical experts to pre-diagnose images and manually craft precise textual or\\nvisual prompts, UniBiomed can provide automated and end-to-end grounded\\ninterpretation for biomedical image analysis. This represents a novel paradigm\\nshift in clinical workflows, which will significantly improve diagnostic\\nefficiency. In summary, UniBiomed represents a novel breakthrough in biomedical\\nAI, unlocking powerful grounded interpretation capabilities for more accurate\\nand efficient biomedical image analysis.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-30T05:51:48Z\"}"}
