{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00296v1\", \"title\": \"The Complexity of Minimum-Envy House Allocation Over Graphs\", \"summary\": \"In this paper, we study a generalization of the House Allocation problem. In\\nour problem, agents are represented by vertices of a graph $\\\\GG_{\\\\mathcal{A}} =\\n(\\\\AA, E_\\\\AA)$, and each agent $a \\\\in \\\\AA$ is associated with a set of preferred\\nhouses $\\\\PP_a \\\\subseteq \\\\HH$, where $\\\\AA$ is the set of agents and $\\\\HH$ is the\\nset of houses. A house allocation is an injective function $\\\\phi: \\\\AA\\n\\\\rightarrow \\\\HH$, and an agent $a$ envies a neighbour $a' \\\\in N_{\\\\GG_\\\\AA}(a)$\\nunder $\\\\phi$ if $\\\\phi(a) \\\\notin \\\\PP_a$ and $\\\\phi(a') \\\\in \\\\PP_a$. We study two\\nnatural objectives: the first problem called \\\\ohaa, aims to compute an\\nallocation that minimizes the number of envious agents; the second problem\\ncalled \\\\ohaah aims to maximize, among all minimum-envy allocations, the number\\nof agents who are assigned a house they prefer. These two objectives capture\\ncomplementary notions of fairness and individual satisfaction.\\n  We design polynomial time algorithms for both problems for the variant when\\neach agent prefers exactly one house. On the other hand, when the list of\\npreferred houses for each agent has size at most $2$ then we show that both\\nproblems are \\\\NP-hard even when the agent graph $\\\\GG_\\\\AA$ is a complete\\nbipartite graph. We also show that both problems are \\\\NP-hard even when the\\nnumber $|\\\\mathcal H|$ of houses is equal to the number $|\\\\mathcal A|$ of\\nagents. This is in contrast to the classical {\\\\sc House Allocation} problem,\\nwhere the problem is polynomial time solvable when $|\\\\mathcal H| = |\\\\mathcal\\nA|$. The two problems are also \\\\NP-hard when the agent graph has a small vertex\\ncover. On the positive side, we design exact algorithms that exploit certain\\nstructural properties of $\\\\GG_{\\\\AA}$ such as sparsity, existence of balanced\\nseparators or existence of small-sized vertex covers, and perform better than\\nthe naive brute-force algorithm.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS,cs.CC\", \"published\": \"2025-05-01T04:38:09Z\"}"}
