{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15075v1\", \"title\": \"Mitigating Degree Bias in Graph Representation Learning with Learnable\\n  Structural Augmentation and Structural Self-Attention\", \"summary\": \"Graph Neural Networks (GNNs) update node representations through message\\npassing, which is primarily based on the homophily principle, assuming that\\nadjacent nodes share similar features. However, in real-world graphs with\\nlong-tailed degree distributions, high-degree nodes dominate message passing,\\ncausing a degree bias where low-degree nodes remain under-represented due to\\ninadequate messages. The main challenge in addressing degree bias is how to\\ndiscover non-adjacent nodes to provide additional messages to low-degree nodes\\nwhile reducing excessive messages for high-degree nodes. Nevertheless,\\nexploiting non-adjacent nodes to provide valuable messages is challenging, as\\nit could generate noisy information and disrupt the original graph structures.\\nTo solve it, we propose a novel Degree Fairness Graph Transformer, named\\nDegFairGT, to mitigate degree bias by discovering structural similarities\\nbetween non-adjacent nodes through learnable structural augmentation and\\nstructural self-attention. Our key idea is to exploit non-adjacent nodes with\\nsimilar roles in the same community to generate informative edges under our\\naugmentation, which could provide informative messages between nodes with\\nsimilar roles while ensuring that the homophily principle is maintained within\\nthe community. To enable DegFairGT to learn such structural similarities, we\\nthen propose a structural self-attention to capture the similarities between\\nnode pairs. To preserve global graph structures and prevent graph augmentation\\nfrom hindering graph structure, we propose a Self-Supervised Learning task to\\npreserve p-step transition probability and regularize graph augmentation.\\nExtensive experiments on six datasets showed that DegFairGT outperformed\\nstate-of-the-art baselines in degree fairness analysis, node classification,\\nand node clustering tasks.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.LG\", \"published\": \"2025-04-21T13:03:40Z\"}"}
