{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15283v1\", \"title\": \"Simultaneously Modelling Dusty Star Forming Galaxies and Massive\\n  Quiescents: A Calibration Framework for Galaxy Formation Models\", \"summary\": \"Galaxy formation models, particularly semi-analytic models (SAMs), rely on\\ndifferential equations with free parameters to describe the physical mechanisms\\ngoverning galaxy formation and evolution. Traditionally, most SAMs calibrate\\nthese parameters manually to match observational data. However, this approach\\nfails to fully explore the multidimensional parameter space, resulting in\\nlimited robustness and inconsistency with some observations. In contrast, the\\nL-Galaxies SAM features a unique Markov Chain Monte Carlo (MCMC) mode, enabling\\nrobust model calibration. Using this functionality, we address a long-standing\\ntension in galaxy formation models: simultaneously reproducing the number\\ndensities of dusty star-forming galaxies (DSFGs) and high-redshift massive\\nquiescent galaxies (MQs). We test nine combinations of observational\\nconstraints - including stellar mass functions, quiescent fractions, neutral\\nhydrogen mass functions, and DSFG number densities - across different\\nredshifts. We then analyze the resulting galaxy property predictions and\\ndiscuss the underlying physical mechanisms. Our results identify a model that\\nreasonably matches the number density of DSFGs while remaining consistent with\\nobservationally-derived lower limits on the number density of high-redshift\\nMQs. This model requires high star formation efficiencies in mergers and a null\\ndependency of supermassive black hole (SMBH) cold gas accretion on halo mass,\\nfacilitating rapid stellar mass and SMBH growth. Additionally, our findings\\nhighlight the importance of robust calibration procedures to address the\\nsignificant degeneracies inherent to multidimensional galaxy formation models.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-21T17:59:59Z\"}"}
