{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13046v1\", \"title\": \"Variance-Reduced Fast Operator Splitting Methods for Stochastic\\n  Generalized Equations\", \"summary\": \"We develop two classes of variance-reduced fast operator splitting methods to\\napproximate solutions of both finite-sum and stochastic generalized equations.\\nOur approach integrates recent advances in accelerated fixed-point methods,\\nco-hypomonotonicity, and variance reduction. First, we introduce a class of\\nvariance-reduced estimators and establish their variance-reduction bounds. This\\nclass covers both unbiased and biased instances and comprises common estimators\\nas special cases, including SVRG, SAGA, SARAH, and Hybrid-SGD. Next, we design\\na novel accelerated variance-reduced forward-backward splitting (FBS) algorithm\\nusing these estimators to solve finite-sum and stochastic generalized\\nequations. Our method achieves both $\\\\mathcal{O}(1/k^2)$ and $o(1/k^2)$\\nconvergence rates on the expected squared norm $\\\\mathbb{E}[ \\\\|\\nG_{\\\\lambda}x^k\\\\|^2]$ of the FBS residual $G_{\\\\lambda}$, where $k$ is the\\niteration counter. Additionally, we establish, for the first time, almost sure\\nconvergence rates and almost sure convergence of iterates to a solution in\\nstochastic accelerated methods. Unlike existing stochastic fixed-point\\nalgorithms, our methods accommodate co-hypomonotone operators, which\\npotentially include nonmonotone problems arising from recent applications. We\\nfurther specify our method to derive an appropriate variant for each stochastic\\nestimator -- SVRG, SAGA, SARAH, and Hybrid-SGD -- demonstrating that they\\nachieve the best-known complexity for each without relying on enhancement\\ntechniques. Alternatively, we propose an accelerated variance-reduced\\nbackward-forward splitting (BFS) method, which attains similar convergence\\nrates and oracle complexity as our FBS method. Finally, we validate our results\\nthrough several numerical experiments and compare their performance.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC,stat.ML\", \"published\": \"2025-04-17T16:02:20Z\"}"}
