{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10884v1\", \"title\": \"Unusual gas sensor response and semiconductor-to-insulator transition in\\n  WO3-x nanostructures : The role of oxygen vacancy\", \"summary\": \"WO3-x thinfilms featuring petal-like and lamella-like nanostructures are\\ngrown under controlled oxygen partial pressures using hot filament chemical\\nvapor deposition. These synthesized WO3-x nanostructures exhibit monoclinic\\nstructure and contain a significant amount of oxygen vacancies (VO) as\\nconfirmed by X-ray diffraction and Raman spectroscopy, respectively. These\\nWO3-x nanostructures demonstrate sensor response to both NH3 and NO2 gases even\\nat room temperature. However, the sensor response varies with temperature and\\nanalyte gas type. For NH3, the sensors exhibit an increase in resistance\\nbehaving like a p-type semiconductor at temperatures below 150 0C while the\\nresistance decreases at higher temperatures, resembling n-type semiconductor\\nbehavior. On the other hand, below 150 0C, these sensors display n-type\\nbehavior towards NO2 but act like p-type semiconductor at higher temperatures.\\nFurther temperature dependent transport studies were performed in these WO3-x\\nnanostructures in the temperature range from 25 to 300 oC, after inducing\\nadditional VO in the films through annealing under CH4. The petal-like WO3-x\\nnanostructures display an abrupt change in resistance, indicating\\ninsulator-to-semiconductor and semiconductor-to-insulator transitions during\\nheating and cooling cycles respectively, in the temperature range of 100 - 212\\n0C. In lamella-like WO3-x nanostructures, the resistance is flipped from\\nsemiconductor-to-insulator at 300 0C and remains insulating state when cooled\\ndown to 30 0C. The abnormal gas sensing behavior and insulator - semiconductor\\ntransition is discussed in terms of VO in WO3-x nanostructures.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,cond-mat.str-el\", \"published\": \"2025-04-15T05:29:29Z\"}"}
