{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16468v1\", \"title\": \"HAQA: A Hardware-Guided and Fidelity-Aware Strategy for Efficient Qubit\\n  Mapping Optimization\", \"summary\": \"Quantum algorithms rely on quantum computers for implementation, but the\\nphysical connectivity constraints of modern quantum processors impede the\\nefficient realization of quantum algorithms. Qubit mapping, a critical\\ntechnology for practical quantum computing applications, directly determines\\nthe execution efficiency and feasibility of algorithms on superconducting\\nquantum processors. Existing mapping methods overlook intractable quantum\\nhardware fidelity characteristics, reducing circuit execution quality. They\\nalso exhibit prolonged solving times or even failure to complete when handling\\nlarge-scale quantum architectures, compromising efficiency. To address these\\nchallenges, we propose a novel qubit mapping method HAQA. HAQA first introduces\\na community-based iterative region identification strategy leveraging hardware\\nconnection topology, achieving effective dimensionality reduction of mapping\\nspace. This strategy avoids global search procedures, with complexity analysis\\ndemonstrating quadratic polynomial-level acceleration. Furthermore, HAQA\\nimplements a hardware-characteristic-based region evaluation mechanism,\\nenabling quantitative selection of mapping regions based on fidelity metrics.\\nThis approach effectively integrates hardware fidelity information into the\\nmapping process, enabling fidelity-aware qubit allocation. Experimental results\\ndemonstrate that HAQA significantly improves solving speed and fidelity while\\nensuring solution quality. When applied to state-of-the-art quantum mapping\\ntechniques Qsynth-v2 and TB-OLSQ2, HAQA achieves acceleration ratios of 632.76\\nand 286.87 respectively, while improving fidelity by up to 52.69% and 238.28%\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cs.ET\", \"published\": \"2025-04-23T07:27:27Z\"}"}
