{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02338v1\", \"title\": \"Coronal and chromospheric activity of Teegarden's star\", \"summary\": \"Teegarden's star is a late-type M-dwarf planet host, typically showing only\\nrather low levels of activity. In this paper we present an extensive\\ncharacterisation of this activity at photospheric, chromospheric, and coronal\\nlevels. We specifically investigated TESS observations of Teegarden's star,\\nwhich showed two very large flares with an estimated flare fluence between\\n10$^{29}$ and 10$^{32}$\\\\,erg comparable to the largest solar flares. We\\nfurthermore analysed nearly 300 CARMENES spectra and 11 ESPRESSO spectra\\ncovering all the usually used chromospheric lines in the optical from the\\n\\\\ion{Ca}{ii} H \\\\& K lines at 3930\\\\,\\\\AA\\\\, to the \\\\ion{He}{i} infrared triplet at\\n10830\\\\,\\\\AA. These lines show different behaviour: The \\\\ion{He}{i} infrared\\ntriplet is the only one absent in all spectra, some lines show up only during\\nflares, and others are always present and highly variable. Specifically, the\\nH$\\\\alpha$ line is more or less filled in during quiescence; however, the higher\\nBalmer lines are still observed in emission. Many chromospheric lines show a\\ncorrelation with H$\\\\alpha$ variability, which, in addition to stochastic\\nbehaviour, also shows systematic behaviour on different timescales including\\nthe rotation period. Moreover, we found several flares and also report hints of\\nan erupting prominence, which may have led to a coronal mass ejection. Finally,\\nwe present X-ray observations of Teegarden's star (i.e. a discovery pointing\\nobtained with the \\\\emph{Chandra} observatory) and an extensive study with the\\n\\\\emph{XMM-Newton} observatory; when these two large flares were observed, one\\nof them showed clear signatures of the Neupert effect, suggesting the\\nproduction of hard X-rays in the system.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-03T07:18:54Z\"}"}
