{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15262v1\", \"title\": \"Revealing the 3D Cosmic Web through Gravitationally Constrained Neural\\n  Fields\", \"summary\": \"Weak gravitational lensing is the slight distortion of galaxy shapes caused\\nprimarily by the gravitational effects of dark matter in the universe. In our\\nwork, we seek to invert the weak lensing signal from 2D telescope images to\\nreconstruct a 3D map of the universe's dark matter field. While inversion\\ntypically yields a 2D projection of the dark matter field, accurate 3D maps of\\nthe dark matter distribution are essential for localizing structures of\\ninterest and testing theories of our universe. However, 3D inversion poses\\nsignificant challenges. First, unlike standard 3D reconstruction that relies on\\nmultiple viewpoints, in this case, images are only observed from a single\\nviewpoint. This challenge can be partially addressed by observing how galaxy\\nemitters throughout the volume are lensed. However, this leads to the second\\nchallenge: the shapes and exact locations of unlensed galaxies are unknown, and\\ncan only be estimated with a very large degree of uncertainty. This introduces\\nan overwhelming amount of noise which nearly drowns out the lensing signal\\ncompletely. Previous approaches tackle this by imposing strong assumptions\\nabout the structures in the volume. We instead propose a methodology using a\\ngravitationally-constrained neural field to flexibly model the continuous\\nmatter distribution. We take an analysis-by-synthesis approach, optimizing the\\nweights of the neural network through a fully differentiable physical forward\\nmodel to reproduce the lensing signal present in image measurements. We\\nshowcase our method on simulations, including realistic simulated measurements\\nof dark matter distributions that mimic data from upcoming telescope surveys.\\nOur results show that our method can not only outperform previous methods, but\\nimportantly is also able to recover potentially surprising dark matter\\nstructures.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,cs.CV\", \"published\": \"2025-04-21T17:43:21Z\"}"}
