{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03401v1\", \"title\": \"DDaTR: Dynamic Difference-aware Temporal Residual Network for\\n  Longitudinal Radiology Report Generation\", \"summary\": \"Radiology Report Generation (RRG) automates the creation of radiology reports\\nfrom medical imaging, enhancing the efficiency of the reporting process.\\nLongitudinal Radiology Report Generation (LRRG) extends RRG by incorporating\\nthe ability to compare current and prior exams, facilitating the tracking of\\ntemporal changes in clinical findings. Existing LRRG approaches only extract\\nfeatures from prior and current images using a visual pre-trained encoder,\\nwhich are then concatenated to generate the final report. However, these\\nmethods struggle to effectively capture both spatial and temporal correlations\\nduring the feature extraction process. Consequently, the extracted features\\ninadequately capture the information of difference across exams and thus\\nunderrepresent the expected progressions, leading to sub-optimal performance in\\nLRRG. To address this, we develop a novel dynamic difference-aware temporal\\nresidual network (DDaTR). In DDaTR, we introduce two modules at each stage of\\nthe visual encoder to capture multi-level spatial correlations. The Dynamic\\nFeature Alignment Module (DFAM) is designed to align prior features across\\nmodalities for the integrity of prior clinical information. Prompted by the\\nenriched prior features, the dynamic difference-aware module (DDAM) captures\\nfavorable difference information by identifying relationships across exams.\\nFurthermore, our DDaTR employs the dynamic residual network to unidirectionally\\ntransmit longitudinal information, effectively modelling temporal correlations.\\nExtensive experiments demonstrated superior performance over existing methods\\non three benchmarks, proving its efficacy in both RRG and LRRG tasks.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-05-06T10:29:23Z\"}"}
