{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05136v1\", \"title\": \"Automated vision-based assistance tools in bronchoscopy: stenosis\\n  severity estimation\", \"summary\": \"Purpose: Subglottic stenosis refers to the narrowing of the subglottis, the\\nairway between the vocal cords and the trachea. Its severity is typically\\nevaluated by estimating the percentage of obstructed airway. This estimation\\ncan be obtained from CT data or through visual inspection by experts exploring\\nthe region. However, visual inspections are inherently subjective, leading to\\nless consistent and robust diagnoses. No public methods or datasets are\\ncurrently available for automated evaluation of this condition from\\nbronchoscopy video.\\n  Methods: We propose a pipeline for automated subglottic stenosis severity\\nestimation during the bronchoscopy exploration, without requiring the physician\\nto traverse the stenosed region. Our approach exploits the physical effect of\\nillumination decline in endoscopy to segment and track the lumen and obtain a\\n3D model of the airway. This 3D model is obtained from a single frame and is\\nused to measure the airway narrowing.\\n  Results: Our pipeline is the first to enable automated and robust subglottic\\nstenosis severity measurement using bronchoscopy images. The results show\\nconsistency with ground-truth estimations from CT scans and expert estimations,\\nand reliable repeatability across multiple estimations on the same patient. Our\\nevaluation is performed on our new Subglottic Stenosis Dataset of real\\nbronchoscopy procedures data.\\n  Conclusion: We demonstrate how to automate evaluation of subglottic stenosis\\nseverity using only bronchoscopy. Our approach can assist with and shorten\\ndiagnosis and monitoring procedures, with automated and repeatable estimations\\nand less exploration time, and save radiation exposure to patients as no CT is\\nrequired. Additionally, we release the first public benchmark for subglottic\\nstenosis severity assessment.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-08T11:13:38Z\"}"}
