{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09965v1\", \"title\": \"Incipient motion of a single particle on a regular substrate in an\\n  oscillatory flow\", \"summary\": \"In this study, we investigate and model the initiation of motion of a single\\nparticle on a structured substrate within an oscillatory boundary layer,\\nfollowing a mechanistic approach. By deterministically relating forces and\\ntorques acting on the particle to the instantaneous ambient flow, the effects\\nof flow unsteadiness are captured, revealing rich particle dynamics. Our\\nlaboratory experiments in an oscillatory flow tunnel characterise the\\ninitiation and early stages of motion with particle imaging velocimetry\\nmeasurements yielding the flow conditions at the motion threshold. The\\nexperiments validate and complement results from particle-resolved direct\\nnumerical simulations. These simulations provide detailed insights by combining\\nan immersed boundary method with a discrete element method that incorporates a\\nstatic friction contact model. Within the explored region of the parameter\\nspace, the movable particle rolls without sliding on the underlying substrate,\\nindicating that motion initiation is governed by an unbalanced torque rather\\nthan a force. Both experimental and numerical results show excellent agreement\\nwith an analytical torque balance that includes the hydrodynamic torque\\nmodelled on the basis of the theoretical Stokes velocity profile, and\\ncontributions of lift, added mass, and externally imposed pressure gradient.\\nAdditional regimes of motion that are absent in steady conditions are\\nidentified, in particular those related to particle inertia and flow reversal\\ntime. Our deterministic approach allows the prediction of the phase of\\nincipient particle motion without relying on empirical estimates of threshold\\nvalues, and can even be extended to a wide range of flow and substrate\\nconditions, as long as turbulence is absent and interactions with other movable\\nparticles are negligible.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-14T08:06:12Z\"}"}
