{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05856v1\", \"title\": \"Analyzing type Ia supernovae near-infrared light curves with Principal\\n  Component Analysis\", \"summary\": \"Type Ia supernovae (SNeIa), the thermonuclear explosions of C/O white dwarf\\nstars in binary systems, are phenomena that remain poorly understood. The\\ncomplexity of their progenitor systems, explosion physics and intrinsic\\ndiversity poses not only challenges for their understanding as astrophysical\\nobjects, but also for their standardization and use as cosmological probes.\\nNear-infrared (NIR) observations offer a promising avenue for studying the\\nphysics of SNeIa and for reducing systematic uncertainties in distance\\nestimations, as they exhibit lower dust extinction and smaller dispersion in\\npeak luminosity than optical bands. Here, Principal Component Analysis (PCA) is\\napplied to a sample of SNeIa with well-sampled NIR (YJH-band) light curves to\\nidentify the dominant components of their variability and constrain physical\\nunderlying properties. The theoretical models of Kasen2006 are used for the\\nphysical interpretation of the PCA components, where we found the 56Ni mass to\\ndescribe the dominant variability. Other factors, such as mixing and\\nmetallicity, were found to contribute significantly as well. However, some\\ndifferences are found between the components of the NIR bands which may be\\nattributed to differences in the explosion aspects they each trace.\\nAdditionally, the PCA components are compared to various light-curve\\nparameters, identifying strong correlations between some components and peak\\nbrightness in both the NIR and optical bands, particularly in the Y band. When\\napplying PCA to NIR color curves, we found interesting correlations with the\\nhost-galaxy mass, where SNeIa with redder NIR colors are predominantly found in\\nless massive galaxies. We also investigate the potential for improved\\nstandardization in the Y band by incorporating PCA coefficients as correction\\nparameters, leading to a reduction in the scatter of the intrinsic luminosity\\nof SNeIa.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-08T09:35:33Z\"}"}
