{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15995v1\", \"title\": \"OPUS-VFL: Incentivizing Optimal Privacy-Utility Tradeoffs in Vertical\\n  Federated Learning\", \"summary\": \"Vertical Federated Learning (VFL) enables organizations with disjoint feature\\nspaces but shared user bases to collaboratively train models without sharing\\nraw data. However, existing VFL systems face critical limitations: they often\\nlack effective incentive mechanisms, struggle to balance privacy-utility\\ntradeoffs, and fail to accommodate clients with heterogeneous resource\\ncapabilities. These challenges hinder meaningful participation, degrade model\\nperformance, and limit practical deployment. To address these issues, we\\npropose OPUS-VFL, an Optimal Privacy-Utility tradeoff Strategy for VFL.\\nOPUS-VFL introduces a novel, privacy-aware incentive mechanism that rewards\\nclients based on a principled combination of model contribution, privacy\\npreservation, and resource investment. It employs a lightweight leave-one-out\\n(LOO) strategy to quantify feature importance per client, and integrates an\\nadaptive differential privacy mechanism that enables clients to dynamically\\ncalibrate noise levels to optimize their individual utility. Our framework is\\ndesigned to be scalable, budget-balanced, and robust to inference and poisoning\\nattacks. Extensive experiments on benchmark datasets (MNIST, CIFAR-10, and\\nCIFAR-100) demonstrate that OPUS-VFL significantly outperforms state-of-the-art\\nVFL baselines in both efficiency and robustness. It reduces label inference\\nattack success rates by up to 20%, increases feature inference reconstruction\\nerror (MSE) by over 30%, and achieves up to 25% higher incentives for clients\\nthat contribute meaningfully while respecting privacy and cost constraints.\\nThese results highlight the practicality and innovation of OPUS-VFL as a\\nsecure, fair, and performance-driven solution for real-world VFL.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-22T16:00:11Z\"}"}
