{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05920v1\", \"title\": \"Local Thermal Non-Equilibrium Models in Porous Media: A Comparative\\n  Study of Conduction Effects\", \"summary\": \"Instantaneous heat transfer between different phases is a common assumption\\nfor modeling heat transfer in porous media, known as Local Thermal Equilibrium\\n(LTE). This assumption may not hold in certain technical and environmental\\napplications, especially in systems with large temperature gradients, large\\ndifferences in thermal properties, or high velocities. Local Thermal\\nNon-Equilibrium (LTNE) models aim to describe heat transfer processes when the\\nLTE assumption may fail. In this work, we compare three continuum-scale models\\nfrom the pore to the representative elementary volume (REV) scale.\\nSpecifically, dual-network and REV-scale models are evaluated against a\\npore-resolved model, which we perceive as a reference in the absence of\\nexperimental results. Different effective models are used to obtain upscaled\\nproperties on the REV scale and to compare resulting temperature profiles. The\\nsystems investigated are fully saturated, consisting of one fluid and one solid\\nphase. This study focuses on purely conductive systems without significant\\ndifferences in thermal properties. Results show that LTE holds then for low\\ninterfacial resistances. However, for large interfacial resistances, solid and\\nfluid temperatures differ. The REV-scale model with effective parameters\\nobtained by homogenization leads to similar results as the pore-resolved model,\\nwhereas the dual-network model shows greater deviation due to its fixed spatial\\nresolution. Among the evaluated effective parameter formulations for the\\nREV-scale model, only the homogenization-based approach captures the LTNE\\nbehavior, as it incorporates the interfacial heat transfer coefficient.\\nConvection is relevant for most practical applications, and its impact will be\\naddressed in a follow-up article.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-08T11:19:02Z\"}"}
