{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15835v1\", \"title\": \"Text-based Animatable 3D Avatars with Morphable Model Alignment\", \"summary\": \"The generation of high-quality, animatable 3D head avatars from text has\\nenormous potential in content creation applications such as games, movies, and\\nembodied virtual assistants. Current text-to-3D generation methods typically\\ncombine parametric head models with 2D diffusion models using score\\ndistillation sampling to produce 3D-consistent results. However, they struggle\\nto synthesize realistic details and suffer from misalignments between the\\nappearance and the driving parametric model, resulting in unnatural animation\\nresults. We discovered that these limitations stem from ambiguities in the 2D\\ndiffusion predictions during 3D avatar distillation, specifically: i) the\\navatar's appearance and geometry is underconstrained by the text input, and ii)\\nthe semantic alignment between the predictions and the parametric head model is\\ninsufficient because the diffusion model alone cannot incorporate information\\nfrom the parametric model. In this work, we propose a novel framework,\\nAnimPortrait3D, for text-based realistic animatable 3DGS avatar generation with\\nmorphable model alignment, and introduce two key strategies to address these\\nchallenges. First, we tackle appearance and geometry ambiguities by utilizing\\nprior information from a pretrained text-to-3D model to initialize a 3D avatar\\nwith robust appearance, geometry, and rigging relationships to the morphable\\nmodel. Second, we refine the initial 3D avatar for dynamic expressions using a\\nControlNet that is conditioned on semantic and normal maps of the morphable\\nmodel to ensure accurate alignment. As a result, our method outperforms\\nexisting approaches in terms of synthesis quality, alignment, and animation\\nfidelity. Our experiments show that the proposed method advances the state of\\nthe art in text-based, animatable 3D head avatar generation.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-22T12:29:14Z\"}"}
