{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15679v1\", \"title\": \"Policy-Based Radiative Transfer: Solving the $2$-Level Atom Non-LTE\\n  Problem using Soft Actor-Critic Reinforcement Learning\", \"summary\": \"We present a novel reinforcement learning (RL) approach for solving the\\nclassical 2-level atom non-LTE radiative transfer problem by framing it as a\\ncontrol task in which an RL agent learns a depth-dependent source function\\n$S(\\\\tau)$ that self-consistently satisfies the equation of statistical\\nequilibrium (SE). The agent's policy is optimized entirely via reward-based\\ninteractions with a radiative transfer engine, without explicit knowledge of\\nthe ground truth. This method bypasses the need for constructing approximate\\nlambda operators ($\\\\Lambda^*$) common in accelerated iterative schemes.\\nAdditionally, it requires no extensive precomputed labeled datasets to extract\\na supervisory signal, and avoids backpropagating gradients through the complex\\nRT solver itself. Finally, we show through experiment that a simple feedforward\\nneural network trained greedily cannot solve for SE, possibly due to the moving\\ntarget nature of the problem. Our $\\\\Lambda^*-\\\\text{Free}$ method offers\\npotential advantages for complex scenarios (e.g., atmospheres with enhanced\\nvelocity fields, multi-dimensional geometries, or complex microphysics) where\\n$\\\\Lambda^*$ construction or solver differentiability is challenging.\\nAdditionally, the agent can be incentivized to find more efficient policies by\\nmanipulating the discount factor, leading to a reprioritization of immediate\\nrewards. If demonstrated to generalize past its training data, this RL\\nframework could serve as an alternative or accelerated formalism to achieve SE.\\nTo the best of our knowledge, this study represents the first application of\\nreinforcement learning in solar physics that directly solves for a fundamental\\nphysical constraint.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,cs.LG\", \"published\": \"2025-04-22T08:03:09Z\"}"}
