{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16058v1\", \"title\": \"How to make CLEAN variants faster? Using clustered components informed\\n  by the autocorrelation function\", \"summary\": \"Deconvolution, imaging and calibration of data from radio interferometers is\\na challenging computational (inverse) problem. The upcoming generation of radio\\ntelescopes poses significant challenges to existing, and well proven data\\nreduction pipelines due to the large data sizes expected from these\\nexperiments, and the high resolution and dynamic range. In this manuscript, we\\ndeal with the deconvolution problem. A variety of multiscalar variants to the\\nclassical CLEAN algorithm (the de-facto standard) have been proposed in the\\npast, often outperforming CLEAN at the cost of significantly increasing\\nnumerical resources. In this work, we aim to combine some of these ideas for a\\nnew algorithm, Autocorr-CLEAN, to accelerate the deconvolution and prepare the\\ndata reduction pipelines for the data sizes expected by the upcoming generation\\nof instruments. To this end, we propose to use a cluster of CLEAN components\\nfitted to the autocorrelation function of the residual in a subminor loop, to\\nderive continuously changing, and potentially non-radially symmetric, basis\\nfunctions for CLEANing the residual. Autocorr-CLEAN allows for the superior\\nreconstruction fidelity achieved by modern multiscalar approaches, and their\\nsuperior convergence speed. It achieves this without utilizing any substep of\\nsuper-linear complexity in the minor loops, keeping the single minor loop and\\nsubminor loop iterations at an execution time comparable to CLEAN. Combining\\nthese advantages, Autocorr-CLEAN is found to be up to a magnitude faster than\\nthe classical CLEAN procedure. Autocorr-CLEAN fits well in the algorithmic\\nframework common for radio interferometry, making it relatively straightforward\\nto include in future data reduction pipelines. With its accelerated convergence\\nspeed, and smaller residual, Autocorr-CLEAN may be an important asset for the\\ndata analysis in the future.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM,astro-ph.GA\", \"published\": \"2025-04-22T17:33:55Z\"}"}
