{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20789v1\", \"title\": \"Evaluating Effects of Augmented SELFIES for Molecular Understanding\\n  Using QK-LSTM\", \"summary\": \"Identifying molecular properties, including side effects, is a critical yet\\ntime-consuming step in drug development. Failing to detect these side effects\\nbefore regulatory submission can result in significant financial losses and\\nproduction delays, and overlooking them during the regulatory review can lead\\nto catastrophic consequences. This challenge presents an opportunity for\\ninnovative machine learning approaches, particularly hybrid quantum-classical\\nmodels like the Quantum Kernel-Based Long Short-Term Memory (QK-LSTM) network.\\nThe QK-LSTM integrates quantum kernel functions into the classical LSTM\\nframework, enabling the capture of complex, non-linear patterns in sequential\\ndata. By mapping input data into a high-dimensional quantum feature space, the\\nQK-LSTM model reduces the need for large parameter sets, allowing for model\\ncompression without sacrificing accuracy in sequence-based tasks. Recent\\nadvancements have been made in the classical domain using augmented variations\\nof the Simplified Molecular Line-Entry System (SMILES). However, to the best of\\nour knowledge, no research has explored the impact of augmented SMILES in the\\nquantum domain, nor the role of augmented Self-Referencing Embedded Strings\\n(SELFIES) in either classical or hybrid quantum-classical settings. This study\\npresents the first analysis of these approaches, providing novel insights into\\ntheir potential for enhancing molecular property prediction and side effect\\nidentification. Results reveal that augmenting SELFIES yields in statistically\\nsignificant improvements from SMILES by a 5.97% improvement for the classical\\ndomain and a 5.91% improvement for the hybrid quantum-classical domain.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-29T14:03:31Z\"}"}
