{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05743v1\", \"title\": \"Causal Portfolio Optimization: Principles and Sensitivity-Based\\n  Solutions\", \"summary\": \"Fundamental and necessary principles for achieving efficient portfolio\\noptimization based on asset and diversification dynamics are presented. The\\nCommonality Principle is a necessary and sufficient condition for identifying\\noptimal drivers of a portfolio in terms of its diversification dynamics. The\\nproof relies on the Reichenbach Common Cause Principle, along with the fact\\nthat the sensitivities of portfolio constituents with respect to the common\\ncausal drivers are themselves causal. A conformal map preserves idiosyncratic\\ndiversification from the unconditional setting while optimizing systematic\\ndiversification on an embedded space of these sensitivities. Causal\\nmethodologies for combinatorial driver selection are presented, such as the use\\nof Bayesian networks and correlation-based algorithms from Reichenbach's\\nprinciple. Limitations of linear models in capturing causality are discussed,\\nand included for completeness alongside more advanced models such as neural\\nnetworks. Portfolio optimization methods are presented that map risk from the\\nsensitivity space to other risk measures of interest. Finally, the work\\nintroduces a novel risk management framework based on Common Causal Manifolds,\\nincluding both theoretical development and experimental validation. The\\nsensitivity space is predicted along the common causal manifold, which is\\nmodeled as a causal time system. Sensitivities are forecasted using SDEs\\ncalibrated to data previously extracted from neural networks to move along the\\nmanifold via its tangent bundles. An optimization method is then proposed that\\naccumulates information across future predicted tangent bundles on the common\\ncausal time system manifold. It aggregates sensitivity-based distance metrics\\nalong the trajectory to build a comprehensive sensitivity distance matrix. This\\nmatrix enables trajectory-wide optimal diversification, taking into account\\nfuture dynamics.\", \"main_category\": \"q-fin.PM\", \"categories\": \"q-fin.PM\", \"published\": \"2025-04-08T07:21:40Z\"}"}
