{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10967v1\", \"title\": \"An Efficient and Mixed Heterogeneous Model for Image Restoration\", \"summary\": \"Image restoration~(IR), as a fundamental multimedia data processing task, has\\na significant impact on downstream visual applications. In recent years,\\nresearchers have focused on developing general-purpose IR models capable of\\nhandling diverse degradation types, thereby reducing the cost and complexity of\\nmodel development. Current mainstream approaches are based on three\\narchitectural paradigms: CNNs, Transformers, and Mambas. CNNs excel in\\nefficient inference, whereas Transformers and Mamba excel at capturing\\nlong-range dependencies and modeling global contexts. While each architecture\\nhas demonstrated success in specialized, single-task settings, limited efforts\\nhave been made to effectively integrate heterogeneous architectures to jointly\\naddress diverse IR challenges. To bridge this gap, we propose RestorMixer, an\\nefficient and general-purpose IR model based on mixed-architecture fusion.\\nRestorMixer adopts a three-stage encoder-decoder structure, where each stage is\\ntailored to the resolution and feature characteristics of the input. In the\\ninitial high-resolution stage, CNN-based blocks are employed to rapidly extract\\nshallow local features. In the subsequent stages, we integrate a refined\\nmulti-directional scanning Mamba module with a multi-scale window-based\\nself-attention mechanism. This hierarchical and adaptive design enables the\\nmodel to leverage the strengths of CNNs in local feature extraction, Mamba in\\nglobal context modeling, and attention mechanisms in dynamic feature\\nrefinement. Extensive experimental results demonstrate that RestorMixer\\nachieves leading performance across multiple IR tasks while maintaining high\\ninference efficiency. The official code can be accessed at\\nhttps://github.com/ClimBin/RestorMixer.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-15T08:19:12Z\"}"}
