{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17741v1\", \"title\": \"Multi-messenger standard-siren cosmology for third-generation\\n  gravitational-wave detectors: Considering observations of gamma-ray bursts\\n  and kilonovae\", \"summary\": \"In the third-generation (3G) gravitational-wave (GW) detector era, GW\\nmulti-messenger observations for binary neutron star merger events can exert\\ngreat impacts on exploring the cosmic expansion history. Extending the previous\\nwork, we explore the potential of 3G GW standard siren observations in\\ncosmological parameter estimation by considering their associated\\nelectromagnetic (EM) counterparts, including $\\\\gamma$-ray burst (GRB)\\ncoincidence observations by the Gravitational wave high-energy Electromagnetic\\nCounterpart All-sky Monitor and GW-triggered target-of-opportunity observations\\nof kilonovae by different optical survey projects. During an assumed 10-year\\nobservation, we predict that the number of detectable GW-kilonova events is\\n$\\\\sim 4900$ with redshifts below $\\\\sim 0.4$ under GW network and Large Synoptic\\nSurvey Telescope in the $i$ band, which is three times more than that of GW-GRB\\ndetections. For the cosmological analysis, we find that with the inclusion of\\nGW-kilonova detections, the constraints on cosmological parameters from GW-EM\\ndetections are significantly improved compared to those from GW-GRB detections.\\nIn particular, GW-EM detections can tightly constrain the Hubble constant with\\na precision ranging from $0.076\\\\%$ to $0.034\\\\%$. Moreover, GW multi-messenger\\nobservations could effectively break the cosmological parameter degeneracies\\ngenerated by the mainstream EM observations, CMB+BAO+SN (CBS). The combination\\nof CBS and GW-EM can tightly constrain the equation of state parameters of dark\\nenergy $w$ in the $w$CDM model and $w_0$ in the $w_0w_a$CDM model with\\nprecisions of $0.72\\\\%$ and $0.99\\\\%$, respectively, meeting the standard of\\nprecision cosmology. In conclusion, GW multi-messenger observations could play\\na crucial role in helping solve the Hubble tension and probing the fundamental\\nnature of dark energy.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,gr-qc,hep-ph\", \"published\": \"2025-04-24T16:57:51Z\"}"}
