{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12875v1\", \"title\": \"A Client-level Assessment of Collaborative Backdoor Poisoning in Non-IID\\n  Federated Learning\", \"summary\": \"Federated learning (FL) enables collaborative model training using\\ndecentralized private data from multiple clients. While FL has shown robustness\\nagainst poisoning attacks with basic defenses, our research reveals new\\nvulnerabilities stemming from non-independent and identically distributed\\n(non-IID) data among clients. These vulnerabilities pose a substantial risk of\\nmodel poisoning in real-world FL scenarios.\\n  To demonstrate such vulnerabilities, we develop a novel collaborative\\nbackdoor poisoning attack called CollaPois. In this attack, we distribute a\\nsingle pre-trained model infected with a Trojan to a group of compromised\\nclients. These clients then work together to produce malicious gradients,\\ncausing the FL model to consistently converge towards a low-loss region\\ncentered around the Trojan-infected model. Consequently, the impact of the\\nTrojan is amplified, especially when the benign clients have diverse local data\\ndistributions and scattered local gradients. CollaPois stands out by achieving\\nits goals while involving only a limited number of compromised clients, setting\\nit apart from existing attacks. Also, CollaPois effectively avoids noticeable\\nshifts or degradation in the FL model's performance on legitimate data samples,\\nallowing it to operate stealthily and evade detection by advanced robust FL\\nalgorithms.\\n  Thorough theoretical analysis and experiments conducted on various benchmark\\ndatasets demonstrate the superiority of CollaPois compared to state-of-the-art\\nbackdoor attacks. Notably, CollaPois bypasses existing backdoor defenses,\\nespecially in scenarios where clients possess diverse data distributions.\\nMoreover, the results show that CollaPois remains effective even when involving\\na small number of compromised clients. Notably, clients whose local data is\\nclosely aligned with compromised clients experience higher risks of backdoor\\ninfections.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-17T12:03:02Z\"}"}
