{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17409v1\", \"title\": \"AGCo-MATA: Air-Ground Collaborative Multi-Agent Task Allocation in\\n  Mobile Crowdsensing\", \"summary\": \"Rapid progress in intelligent unmanned systems has presented new\\nopportunities for mobile crowd sensing (MCS). Today, heterogeneous air-ground\\ncollaborative multi-agent framework, which comprise unmanned aerial vehicles\\n(UAVs) and unmanned ground vehicles (UGVs), have presented superior flexibility\\nand efficiency compared to traditional homogeneous frameworks in complex\\nsensing tasks. Within this context, task allocation among different agents\\nalways play an important role in improving overall MCS quality. In order to\\nbetter allocate tasks among heterogeneous collaborative agents, in this paper,\\nwe investigated two representative complex multi-agent task allocation\\nscenarios with dual optimization objectives: (1) For AG-FAMT (Air-Ground Few\\nAgents More Tasks) scenario, the objectives are to maximize the task completion\\nwhile minimizing the total travel distance; (2) For AG-MAFT (Air-Ground More\\nAgents Few Tasks) scenario, where the agents are allocated based on their\\nlocations, has the optimization objectives of minimizing the total travel\\ndistance while reducing travel time cost. To achieve this, we proposed a\\nMulti-Task Minimum Cost Maximum Flow (MT-MCMF) optimization algorithm tailored\\nfor AG-FAMT, along with a multi-objective optimization algorithm called W-ILP\\ndesigned for AG-MAFT, with a particular focus on optimizing the charging path\\nplanning of UAVs. Our experiments based on a large-scale real-world dataset\\ndemonstrated that the proposed two algorithms both outperform baseline\\napproaches under varying experimental settings, including task quantity, task\\ndifficulty, and task distribution, providing a novel way to improve the overall\\nquality of mobile crowdsensing tasks.\", \"main_category\": \"cs.MA\", \"categories\": \"cs.MA\", \"published\": \"2025-04-24T10:01:54Z\"}"}
