{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17486v1\", \"title\": \"Reconstructions of electron-temperature profiles from EUROfusion\\n  Pedestal Database using turbulence models and machine learning\", \"summary\": \"This study uses plasma-profile data from the EUROfusion pedestal database,\\nfocusing on the electron-temperature and electron-density profiles in the edge\\nregion of H-mode ELMy JET ITER-Like-Wall (ILW) pulses. We make systematic\\npredictions of the electron-temperature pedestal, using the density profiles\\nand engineering parameters of the pulses as inputs.\\n  We first present a machine-learning algorithm that, given more inputs than\\ntheory-based modelling and 80\\\\% of the database as training data, can\\nreconstruct the remaining 20\\\\% of temperature profiles within 20\\\\% of the\\nexperimental values, including accurate estimates of the pedestal width and\\nlocation. The most important engineering parameters for these predictions are\\nmagnetic field strength, particle fuelling rate, plasma current, and\\nstrike-point configuration. This confirms the potential of accurate pedestal\\nprediction using large databases.\\n  Next, we take a simple theoretical approach assuming a local power-law\\nrelationship between the gradients of density ($R/L_{n_e}$) and temperature\\n($R/L_{T_e}$): $R/L_{T_e}=A\\\\left(R/L_{n_e}\\\\right)^\\\\alpha$ with $\\\\alpha\\\\approx\\n0.4$ fits well in the steep-gradient region. When $A$ and $\\\\alpha$ are fit\\nindependently for each pedestal, a one-to-one correlation emerges, also valid\\nfor JET-C data. For $\\\\alpha = 1$, $A \\\\equiv \\\\eta_e$, a known control parameter\\nfor turbulence in slab-ETG theory. Measured values of $\\\\eta_e$ in the\\nsteep-gradient region lie well above the slab-ETG stability threshold,\\nsuggesting a nonlinear threshold shift or a supercritical turbulent state.\\n  Finally, we test heat-flux scalings motivated by gyrokinetic simulations, and\\nwe provide best-fit parameters for reconstructing JET-ILW pedestals. These\\nmodels require additional experimental inputs to reach the accuracy of the\\nmachine-learning reconstructions.\", \"main_category\": \"physics.plasm-ph\", \"categories\": \"physics.plasm-ph\", \"published\": \"2025-04-24T12:25:10Z\"}"}
