{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20645v1\", \"title\": \"LDPoly: Latent Diffusion for Polygonal Road Outline Extraction in\\n  Large-Scale Topographic Mapping\", \"summary\": \"Polygonal road outline extraction from high-resolution aerial images is an\\nimportant task in large-scale topographic mapping, where roads are represented\\nas vectorized polygons, capturing essential geometric features with minimal\\nvertex redundancy. Despite its importance, no existing method has been\\nexplicitly designed for this task. While polygonal building outline extraction\\nhas been extensively studied, the unique characteristics of roads, such as\\nbranching structures and topological connectivity, pose challenges to these\\nmethods. To address this gap, we introduce LDPoly, the first dedicated\\nframework for extracting polygonal road outlines from high-resolution aerial\\nimages. Our method leverages a novel Dual-Latent Diffusion Model with a\\nChannel-Embedded Fusion Module, enabling the model to simultaneously generate\\nroad masks and vertex heatmaps. A tailored polygonization method is then\\napplied to obtain accurate vectorized road polygons with minimal vertex\\nredundancy. We evaluate LDPoly on a new benchmark dataset, Map2ImLas, which\\ncontains detailed polygonal annotations for various topographic objects in\\nseveral Dutch regions. Our experiments include both in-region and cross-region\\nevaluations, with the latter designed to assess the model's generalization\\nperformance on unseen regions. Quantitative and qualitative results demonstrate\\nthat LDPoly outperforms state-of-the-art polygon extraction methods across\\nvarious metrics, including pixel-level coverage, vertex efficiency, polygon\\nregularity, and road connectivity. We also design two new metrics to assess\\npolygon simplicity and boundary smoothness. Moreover, this work represents the\\nfirst application of diffusion models for extracting precise vectorized object\\noutlines without redundant vertices from remote-sensing imagery, paving the way\\nfor future advancements in this field.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-29T11:13:33Z\"}"}
