{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02488v1\", \"title\": \"A Behaviour and Disease Model of Testing and Isolation\", \"summary\": \"There has been interest in the interactions between infectious disease\\ndynamics and behaviour for most of the history of mathematical epidemiology.\\nThis has included consideration of which mathematical models best capture each\\nphenomenon, as well as their interaction, but typically in a manner that is\\nagnostic to the exact behaviour in question. Here, we investigate interacting\\nbehaviour and disease dynamics specifically related to behaviours around\\ntesting and isolation. This epidemiological-behavioural interaction is of\\nparticular interest as, prospectively, it is well-placed to be informed by\\nreal-world data temporally monitoring test results and compliance with testing\\npolicy. To carry out our investigation we extend an existing \\\"behaviour and\\ndisease\\\" (BaD) model by incorporating the dynamics of symptomatic testing and\\nisolation. We provide a dynamical systems analysis of the ordinary differential\\nequations that define this model, providing theoretical results on its\\nbehaviour early in a new outbreak (particularly its basic reproduction number)\\nand endemicity of the system (its steady states and associated stability\\ncriteria). We then supplement these findings with a numerical analysis to\\ninform how temporal and cumulative outbreak metrics depend on the model\\nparameter values for epidemic and endemic regimes. As the presented\\ninterdisciplinary modelling approach can accommodate further extensions\\n(including, but not limited to, adding testing capacity, decay in behavioural\\neffects and multiple pathogen variants), we hope that our work will encourage\\nfurther modelling studies integrating specific measured behaviours and disease\\ndynamics that may reduce the health and economic impacts of future epidemics.\", \"main_category\": \"q-bio.PE\", \"categories\": \"q-bio.PE,physics.soc-ph\", \"published\": \"2025-04-03T11:10:08Z\"}"}
