{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15220v1\", \"title\": \"Fully Bayesian Approaches to Topics over Time\", \"summary\": \"The Topics over Time (ToT) model captures thematic changes in timestamped\\ndatasets by explicitly modeling publication dates jointly with word\\nco-occurrence patterns. However, ToT was not approached in a fully Bayesian\\nfashion, a flaw that makes it susceptible to stability problems. To address\\nthis issue, we propose a fully Bayesian Topics over Time (BToT) model via the\\nintroduction of a conjugate prior to the Beta distribution. This prior acts as\\na regularization that prevents the online version of the algorithm from\\nunstable updates when a topic is poorly represented in a mini-batch. The\\ncharacteristics of this prior to the Beta distribution are studied here for the\\nfirst time. Still, this model suffers from a difference in scale between the\\nsingle-time observations and the multiplicity of words per document. A\\nvariation of BToT, Weighted Bayesian Topics over Time (WBToT), is proposed as a\\nsolution. In WBToT, publication dates are repeated a certain number of times\\nper document, which balances the relative influence of words and timestamps\\nalong the inference process. We have tested our models on two datasets: a\\ncollection of over 200 years of US state-of-the-union (SOTU) addresses and a\\nlarge-scale COVID-19 Twitter corpus of 10 million tweets. The results show that\\nWBToT captures events better than Latent Dirichlet Allocation and other SOTA\\ntopic models like BERTopic: the median absolute deviation of the topic presence\\nover time is reduced by $51\\\\%$ and $34\\\\%$, respectively. Our experiments also\\ndemonstrate the superior coherence of WBToT over BToT, which highlights the\\nimportance of balancing the time and word modalities. Finally, we illustrate\\nthe stability of the online optimization algorithm in WBToT, which allows the\\napplication of WBToT to problems that are intractable for standard ToT.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.LG\", \"published\": \"2025-04-21T16:46:07Z\"}"}
