{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04313v1\", \"title\": \"KERAIA: An Adaptive and Explainable Framework for Dynamic Knowledge\\n  Representation and Reasoning\", \"summary\": \"In this paper, we introduce KERAIA, a novel framework and software platform\\nfor symbolic knowledge engineering designed to address the persistent\\nchallenges of representing, reasoning with, and executing knowledge in dynamic,\\ncomplex, and context-sensitive environments. The central research question that\\nmotivates this work is: How can unstructured, often tacit, human expertise be\\neffectively transformed into computationally tractable algorithms that AI\\nsystems can efficiently utilise? KERAIA seeks to bridge this gap by building on\\nfoundational concepts such as Minsky's frame-based reasoning and K-lines, while\\nintroducing significant innovations. These include Clouds of Knowledge for\\ndynamic aggregation, Dynamic Relations (DRels) for context-sensitive\\ninheritance, explicit Lines of Thought (LoTs) for traceable reasoning, and\\nCloud Elaboration for adaptive knowledge transformation. This approach moves\\nbeyond the limitations of traditional, often static, knowledge representation\\nparadigms. KERAIA is designed with Explainable AI (XAI) as a core principle,\\nensuring transparency and interpretability, particularly through the use of\\nLoTs. The paper details the framework's architecture, the KSYNTH representation\\nlanguage, and the General Purpose Paradigm Builder (GPPB) to integrate diverse\\ninference methods within a unified structure. We validate KERAIA's versatility,\\nexpressiveness, and practical applicability through detailed analysis of\\nmultiple case studies spanning naval warfare simulation, industrial diagnostics\\nin water treatment plants, and strategic decision-making in the game of RISK.\\nFurthermore, we provide a comparative analysis against established knowledge\\nrepresentation paradigms (including ontologies, rule-based systems, and\\nknowledge graphs) and discuss the implementation aspects and computational\\nconsiderations of the KERAIA platform.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.ET,cs.SC\", \"published\": \"2025-05-07T10:56:05Z\"}"}
