{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06168v1\", \"title\": \"Differential diffusion effects and super-adiabatic local temperature in\\n  lean hydrogen-air turbulent flames\", \"summary\": \"Analyzed in this paper are three-dimensional Direct Numerical Simulation\\n(DNS) data obtained from seven statistically planar and one-dimensional, lean\\ncomplex-chemistry hydrogen-air flames propagating in a box with forced\\nturbulence. The simulation conditions cover a wide range of non-dimensional\\nturbulent combustion characteristics. Specifically, root-mean-square turbulent\\nvelocity is varied from 2.2 to 54 laminar flame speeds, integral length scale\\nof turbulence is varied from 0.5 to 2.2 laminar flame thicknesses, Damk\\\\\\\"ohler\\nand Karlovitz number are varied from 0.01 to 0.53 and from 10 to 1315,\\nrespectively. Two equivalence ratios, 0.5 and 0.35, are explored. Turbulent\\nburning velocities are evaluated for these seven low Lewis number flames and\\nequidiffusion counterparts to six of them. Moreover, conditioned profiles of\\ntemperature, fuel consumption and heat release rates and probabilities of\\nfinding superadiabatic temperature are sampled from all seven low Lewis number\\nflames. Analyses of obtained results show that both magnitude of superadiabatic\\ntemperature and probability of finding it are decreased with increasing\\nKarlovitz number Ka. However, significant influence of differential diffusion\\neffects on local structure of flame reaction zones and bulk burning velocity is\\nwell pronounced in all cases, even at Ka as high as 1315. Therefore, a decrease\\nin magnitude of superadiabatic local temperature with increasing Karlovitz\\nnumber or even negligible probability of finding such a high temperature at\\nhigh Ka is not an evidence that differential diffusion effects play a minor\\nrole under such conditions. The simulated mitigation of phenomenon of\\nsuperadiabatic temperature at high Ka is attributed to intensification of\\nturbulent mixing in local flame oxidation zones, rather than weakening\\ndifferential diffusion effects in local flame reaction zones.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-08T16:07:14Z\"}"}
