{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14984v1\", \"title\": \"A New Formation Mechanism of Counterstreaming Mass Flows in Filaments\\n  and the Doppler Bullseye Pattern in Prominences\", \"summary\": \"The eruption of solar prominences can eject substantial mass and magnetic\\nfield into interplanetary space and cause geomagnetic storms. However, various\\nquestions about prominences and their eruption mechanism remain unclear. In\\nparticular, what causes the intriguing Doppler bullseye pattern in prominences\\nhas not yet been solved, despite some preliminary studies proposing that they\\nare probably associated with counterstreaming mass flows. Previous studies are\\nmainly based on single-angle and short timescale observations, making it\\ndifficult to determine the physical origin of Doppler bullseye patterns in\\nprominences. Here, taking advantage of stereoscopic observations taken by the\\nSolar Dynamics Observatory and the Solar Terrestrial Relations Observatory and\\na three-dimensional numerical simulation, we investigate the origin of\\nprominence Doppler bullseye pattern by tracing a long-lived transequatorial\\nfilament/prominence from July 23 to August 4, 2012. We find that repeated\\ncoronal jets at one end of the prominence can launch the Doppler bullseye\\npattern. It is evidenced in our observations and simulation that during the\\nforward traveling of jet plasma along the helical magnetic field structure of\\nthe prominence, part of the ejecting plasma can not pass through the apex of\\nthe prominence due to the insufficient kinetic energy and therefore forms a\\nbackward-moving mass flow along the same or neighboring magnetic field lines.\\nThis process finally forms counterstreaming mass flows in on-disk filaments.\\nWhen the on-disk filament rotates to the solar limb to be a prominence, the\\ncounterstreaming mass flows are naturally observed as a Doppler bullseye\\npattern.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-21T09:24:50Z\"}"}
