{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16510v1\", \"title\": \"Non-equilibrium dynamics of disordered fractal spring network with\\n  active forces\", \"summary\": \"We investigate the non-equilibrium dynamics of active bead-spring critical\\npercolation clusters under the action of monopolar and dipolar forces.\\nPreviously, Langevin dynamics simulations of Rouse-type dynamics were performed\\non a deterministic fractal -- the Sierpinski gasket -- and combined with\\nanalytical theory [Chaos {\\\\bf 34}, 113107 (2024)]. To study disordered\\nfractals, we use here the critical (bond) percolation infinite cluster of\\nsquare and triangular lattices, where beads (occupying nodes) are connected by\\nharmonic springs. Two types of active stochastic forces, modeled as random\\ntelegraph processes, are considered: force monopoles, acting on individual\\nnodes in random directions, and force dipoles, where extensile or contractile\\nforces act between pairs of nodes, forming dipole links. A dynamical steady\\nstate is reached where the network is dynamically swelled for force monopoles.\\nThe time-averaged mean square displacement (MSD) shows sub-diffusive behavior\\nat intermediate times longer than the force correlation time, whose anomalous\\nexponent is solely controlled by the spectral dimension $(d_s)$ of the fractal\\nnetwork yielding MSD $\\\\sim t^{\\\\nu}$, with $\\\\nu=1-\\\\frac{d_s}{2}$, similar to the\\nthermal system and in accord with the general analytic theory. In contrast,\\ndipolar forces require a diverging time to reach a steady state, depending on\\nthe fraction of dipoles, and lead to network shrinkage. Within a\\nquasi-steady-state assumption, we find a saturation behavior at the same\\ntemporal regime. Thereafter, a second ballistic-like rise is observed for\\nnetworks with a low fraction of dipole forces, followed by a linear, diffusive\\nincrease. The second ballistic rise is, however, absent in networks fully\\noccupied with force dipoles. These two behaviors are argued to result from\\nlocal rotations of nodes, which are either persistent or fluctuating.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft,cond-mat.stat-mech\", \"published\": \"2025-04-23T08:36:34Z\"}"}
