{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05221v1\", \"title\": \"Core-surface kinematic control of polarity reversals in advanced\\n  geodynamo simulations\", \"summary\": \"The geomagnetic field has undergone hundreds of polarity reversals over\\nEarth's history, at a variable pace. In numerical models of Earth's core\\ndynamics, reversals occur with increasing frequency when the convective forcing\\nis increased past a critical level. This transition has previously been related\\nto the influence of inertia in the force balance. Because this force is\\nsubdominant in Earth's core, concerns have been raised regarding the\\ngeophysical applicability of this paradigm. Reproducing the reversal rate of\\nthe past million years also requires forcing conditions that do not guarantee\\nthat the rest of the geomagnetic variation spectrum is reproduced. These issues\\nmotivate the search for alternative reversal mechanisms. Using a suite of\\nnumerical models where buoyancy is provided at the bottom of the core by\\ninner-core freezing, we show that the magnetic dipole amplitude is controlled\\nby the relative strength of subsurface upwellings and horizontal circulation at\\nthe core surface. A relative weakening of upwellings brings the system from a\\nstable to a reversing dipole state. This mechanism is purely kinematic because\\nit operates irrespectively of the interior force balance. It is therefore\\nexpected to apply at the physical conditions of Earth's core. Subsurface\\nupwellings may be impeded by stable stratification in the outermost core. We\\nshow that with weak stratification levels corresponding to a nearly adiabatic\\ncore surface heat flow, a single model reproduces the observed geomagnetic\\nvariations ranging from decades to millions of years. \\\\rev{In contrast with}\\nthe existing paradigm, reversals caused by this stable top core mechanism\\nbecome more frequent when the level of stratification increases i.e. when the\\ncore heat flow decreases. This suggests that the link between mantle dynamics\\nand magnetic reversal frequency needs to be reexamined.\", \"main_category\": \"physics.geo-ph\", \"categories\": \"physics.geo-ph\", \"published\": \"2025-05-08T13:12:37Z\"}"}
