{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21701v1\", \"title\": \"Machine Learning Assisted Modeling of Amorphous TiO$_2$-Doped GeO$_2$\\n  for Advanced LIGO Mirror Coatings\", \"summary\": \"The mechanical loss angle of amorphous TiO$_2$-doped GeO$_2$ can be lower\\nthan 10$^{-4}$, making it a candidate for Laser Interferometer\\nGravitational-wave Observatory (LIGO) mirror coatings. Amorphous oxides have\\ncomplex atomic structures that are influenced by various factors, including\\ndoping concentration, preparation, and thermal history, resulting in different\\nmass densities and physical properties. Modeling at atomistic level enables\\ncapturing these effects by generating atomic structure models according to\\nexperimental conditions. In order to obtain reliable and physical amorphous\\nmodels at an affordable cost, we develop classical and machine-learning\\npotentials (MLP) to speed up simulations. First-principles calculations are\\nused to train and validate MLP as well as validating structure models. To\\nbetter reproduce properties such as elastic modulus, radial distribution\\nfunction (RDF) and the variations in mass density of doped amorphous oxides,\\ndensity functional theory (DFT) calculations are used to optimize the final\\nmodels. We find that the mass densities of amorphous systems are correlated\\nwith the total void volume. The experimental mass density matches the models\\nwith the most symmetric potential energy wells under volume change. The elastic\\nresponse of the metal-oxygen network is also studied. The 27\\\\% TiO$_2$ doped\\nGeO$_2$ system shows the least number of large atom-atom distance changes,\\nwhile for 44\\\\% TiO$_2$ doped GeO$_2$, a majority of Ti-O distances are\\nsignificantly changed. In response to strains, the metal-oxygen network at low\\nmass densities prefers to adjust bond angles, while at high mass densities, the\\nadjustment is mainly done by changing atom-atom distance.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-03-27T17:05:07Z\"}"}
