{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02505v1\", \"title\": \"Centrality dependence of charged-particle pseudorapidity density at\\n  midrapidity in Pb-Pb collisions at $\\\\mathbf{\\\\sqrt{\\\\textit{s}_{\\\\rm NN}} =\\n  5.36}$ TeV\", \"summary\": \"The ALICE Collaboration reports its first LHC Run 3 measurements of\\ncharged-particle pseudorapidity density at midrapidity in Pb-Pb collisions at a\\ncentre-of-mass energy per nucleon pair of $\\\\sqrt{s_{\\\\mathrm{NN}}}=5.36$ TeV.\\nParticle multiplicity in high-energy collisions characterises the system\\ngeometry, constrains particle-production mechanisms, and is used to estimate\\ninitial energy density. Multiplicity also acts as a reference for subsequent\\nmeasurements as a function of centrality. In this letter, for the first time,\\ncharged particles are reconstructed using the upgraded ALICE Inner Tracking\\nSystem and Time Projection Chamber, while the collision centrality is\\ndetermined by measuring charged-particle multiplicities with the Fast\\nInteraction Trigger system. Pseudorapidity density, ${\\\\rm d}N_{\\\\rm ch}/{\\\\rm\\nd}\\\\eta$, is presented, averaged over events, for various centrality classes.\\nResults are shown as a function of pseudorapidity and the average number of\\nparticipating nucleons ($\\\\langle N_{\\\\mathrm{part}}\\\\rangle$) in the collision.\\nThe average charged-particle pseudorapidity density ($\\\\langle {\\\\rm d}N_{\\\\rm\\nch}/{\\\\rm d}\\\\eta \\\\rangle$) at midrapidity ($|\\\\eta|<0.5$) is 2047 $\\\\pm$ 54 for\\nthe 5% most central collisions. The value of $\\\\langle {\\\\rm d}N_{\\\\rm ch}/{\\\\rm\\nd}\\\\eta \\\\rangle$ normalised to $\\\\langle N_{\\\\mathrm{part}}\\\\rangle/2$ as a\\nfunction of $\\\\sqrt{s_{\\\\mathrm{NN}}}$ follows the trend established in previous\\nmeasurements in heavy-ion collisions. Theoretical models based on mechanisms\\nfor particle production in nuclear collisions that involve the formation of\\nquark-gluon plasma medium and models based on individual nucleon-nucleon\\ninteractions are compared to the data.\", \"main_category\": \"nucl-ex\", \"categories\": \"nucl-ex,hep-ex\", \"published\": \"2025-04-03T11:36:43Z\"}"}
