{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10310v1\", \"title\": \"Existence of Nonequilibrium Glasses in the Degenerate Stealthy\\n  Hyperuniform Ground-State Manifold\", \"summary\": \"Stealthy interactions are an emerging class of nontrivial, bounded\\nlong-ranged oscillatory pair potentials with classical ground states that can\\nbe disordered, hyperuniform, and infinitely degenerate. Their hybrid\\ncrystal-liquid nature endows them with novel physical properties with\\nadvantages over their crystalline counterparts. Here, we show the existence of\\nnonequilibrium hard-sphere glasses within this unusual ground-state manifold as\\nthe stealthiness parameter $\\\\chi$ tends to zero that are remarkably\\nconfigurationally extremely close to hyperuniform 3D maximally random jammed\\n(MRJ) sphere packings. The latter are prototypical glasses since they are\\nmaximally disordered, perfectly rigid, and perfectly nonergodic. Our\\noptimization procedure, which leverages the maximum cardinality of the infinite\\nground-state set, not only guarantees that our packings are hyperuniform with\\nthe same structure-factor scaling exponent as the MRJ state, but they share\\nother salient structural attributes, including a packing fraction of $0.638$, a\\nmean contact number per particle of 6, gap exponent of $0.44(1)$, and pair\\ncorrelation functions $g_2(r)$ and structures factors $S(k)$ that are virtually\\nidentical to one another for all $r$ and $k$, respectively. Moreover, we\\ndemonstrate that stealthy hyperuniform packings can be created within the\\ndisordered regime ($0 < \\\\chi <1/2$) with heretofore unattained maximal packing\\nfractions. As $\\\\chi$ increases from zero, they always form interparticle\\ncontacts, albeit with sparser contact networks as $\\\\chi$ increases from zero,\\nresulting in linear polymer-like chains of contacting particles with\\nincreasingly shorter chain lengths. The capacity to generate ultradense\\nstealthy hyperuniform packings for all $\\\\chi$ opens up new materials\\napplications in optics and acoustics.\", \"main_category\": \"cond-mat.dis-nn\", \"categories\": \"cond-mat.dis-nn,cond-mat.stat-mech,physics.comp-ph\", \"published\": \"2025-04-14T15:19:03Z\"}"}
