{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21564v1\", \"title\": \"Simulating quantum collision models with Hamiltonian simulations using\\n  early fault-tolerant quantum computers\", \"summary\": \"We develop randomized quantum algorithms to simulate quantum collision\\nmodels, also known as repeated interaction schemes, which provide a rich\\nframework to model various open-system dynamics. The underlying technique\\ninvolves composing time evolutions of the total (system, bath, and interaction)\\nHamiltonian and intermittent tracing out of the environment degrees of freedom.\\nThis results in a unified framework where any near-term Hamiltonian simulation\\nalgorithm can be incorporated to implement an arbitrary number of such\\ncollisions on early fault-tolerant quantum computers: we do not assume access\\nto specialized oracles such as block encodings and minimize the number of\\nancilla qubits needed. In particular, using the correspondence between\\nLindbladian evolution and completely positive trace-preserving maps arising out\\nof memoryless collisions, we provide an end-to-end quantum algorithm for\\nsimulating Lindbladian dynamics. For a system of $n$-qubits, we exhaustively\\ncompare the circuit depth needed to estimate the expectation value of an\\nobservable with respect to the reduced state of the system after time $t$ while\\nemploying different near-term Hamiltonian simulation techniques, requiring at\\nmost $n+2$ qubits in all. We compare the CNOT gate counts of the various\\napproaches for estimating the Transverse Field Magnetization of a $10$-qubit\\nXX-Heisenberg spin chain under amplitude damping. Finally, we also develop a\\nframework to efficiently simulate an arbitrary number of memory-retaining\\ncollisions, i.e., where environments interact, leading to non-Markovian\\ndynamics. Overall, our methods can leverage quantum collision models for both\\nMarkovian and non-Markovian dynamics on early fault-tolerant quantum computers,\\nshedding light on the advantages and limitations of simulating open systems\\ndynamics using this framework.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cs.DS\", \"published\": \"2025-04-30T12:09:54Z\"}"}
