{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05055v1\", \"title\": \"How to Infer Repeat Structures in MIDI Performances\", \"summary\": \"MIDI performances are generally expedient in performance research and music\\ninformation retrieval, and even more so if they can be connected to a score.\\nThis connection is usually established by means of alignment, linking either\\nnotes or time points between the score and the performance. The first obstacle\\nwhen trying to establish such an alignment is that a performance realizes one\\n(out of many) structural versions of the score that can plausibly result from\\ninstructions such as repeats, variations, and navigation markers like 'dal\\nsegno/da capo al coda'. A score needs to be unfolded, that is, its repeats and\\nnavigation markers need to be explicitly written out to create a single\\ntimeline without jumps matching the performance, before alignment algorithms\\ncan be applied. In the curation of large performance corpora this process is\\ncarried out manually, as no tools are available to infer the repeat structure\\nof the performance. To ease this process, we develop a method to automatically\\ninfer the repeat structure of a MIDI performance, given a symbolically encoded\\nscore including repeat and navigation markers. The intuition guiding our design\\nis: 1) local alignment of every contiguous section of the score with a section\\nof a performance containing the same material should receive high alignment\\ngain, whereas local alignment with any other performance section should accrue\\na low or zero gain. And 2) stitching local alignments together according to a\\nvalid structural version of the score should result in an approximate full\\nalignment and correspondingly high global accumulated gain if the structural\\nversion corresponds to the performance, and low gain for all other, ill-fitting\\nstructural versions.\", \"main_category\": \"cs.SD\", \"categories\": \"cs.SD,eess.AS\", \"published\": \"2025-05-08T08:46:38Z\"}"}
