{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01537v1\", \"title\": \"Multi-Marker Similarity enables reduced-reference and interpretable\\n  image quality assessment in optical microscopy\", \"summary\": \"Optical microscopy contributes to the ever-increasing progress in biological\\nand biomedical studies, as it allows the implementation of minimally invasive\\nexperimental pipelines to translate the data of measured samples into valuable\\nknowledge. Within these pipelines, reliable quality assessment must be ensured\\nto validate the generated results. Image quality assessment is often applied\\nwith full-reference methods to estimate the similarity between the ground truth\\nand the output images. However, current methods often show poor agreement with\\nvisual perception and lead to the generation of various full-reference metrics\\ntailored to specific applications. Additionally, they rely on pixel-wise\\ncomparisons, emphasizing local intensity similarity while often overlooking\\ncomprehensive and interpretable image quality assessment. To address these\\nissues, we have developed a multi-marker similarity method that compares\\nstandard quality markers, such as resolution, signal-to-noise ratio, contrast,\\nand high frequency components. The method computes a similarity score between\\nthe image and the ground truth for each marker, then combines these scores into\\nan overall similarity estimate. This provides a full-reference estimate of\\nimage quality while extracting global quality features and detecting\\nexperimental artifacts. Multi-marker similarity provides a reliable and\\ninterpretable method for image quality assessment and the generation of quality\\nrankings. By focusing on the comparison of quality markers rather than direct\\nimage distances, the method enables reduced reference implementations, where a\\nsingle field of view is used as a benchmark for multiple measurements. This\\nopens the way for reliable automatic evaluation of big datasets, typical of\\nlarge biomedical studies, when manual assessment of single images and defining\\nthe ground truth for each field of view is not feasible.\", \"main_category\": \"q-bio.QM\", \"categories\": \"q-bio.QM,physics.optics,stat.AP,stat.ME\", \"published\": \"2025-04-02T09:23:57Z\"}"}
