{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04829v1\", \"title\": \"Attentional Graph Meta-Learning for Indoor Localization Using Extremely\\n  Sparse Fingerprints\", \"summary\": \"Fingerprint-based indoor localization is often labor-intensive due to the\\nneed for dense grids and repeated measurements across time and space.\\nMaintaining high localization accuracy with extremely sparse fingerprints\\nremains a persistent challenge. Existing benchmark methods primarily rely on\\nthe measured fingerprints, while neglecting valuable spatial and environmental\\ncharacteristics. In this paper, we propose a systematic integration of an\\nAttentional Graph Neural Network (AGNN) model, capable of learning spatial\\nadjacency relationships and aggregating information from neighboring\\nfingerprints, and a meta-learning framework that utilizes datasets with similar\\nenvironmental characteristics to enhance model training. To minimize the labor\\nrequired for fingerprint collection, we introduce two novel data augmentation\\nstrategies: 1) unlabeled fingerprint augmentation using moving platforms, which\\nenables the semi-supervised AGNN model to incorporate information from\\nunlabeled fingerprints, and 2) synthetic labeled fingerprint augmentation\\nthrough environmental digital twins, which enhances the meta-learning framework\\nthrough a practical distribution alignment, which can minimize the feature\\ndiscrepancy between synthetic and real-world fingerprints effectively. By\\nintegrating these novel modules, we propose the Attentional Graph Meta-Learning\\n(AGML) model. This novel model combines the strengths of the AGNN model and the\\nmeta-learning framework to address the challenges posed by extremely sparse\\nfingerprints. To validate our approach, we collected multiple datasets from\\nboth consumer-grade WiFi devices and professional equipment across diverse\\nenvironments. Extensive experiments conducted on both synthetic and real-world\\ndatasets demonstrate that the AGML model-based localization method consistently\\noutperforms all baseline methods using sparse fingerprints across all evaluated\\nmetrics.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,eess.SP,stat.ML\", \"published\": \"2025-04-07T08:37:18Z\"}"}
