{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04388v1\", \"title\": \"The Aloe Family Recipe for Open and Specialized Healthcare LLMs\", \"summary\": \"Purpose: With advancements in Large Language Models (LLMs) for healthcare,\\nthe need arises for competitive open-source models to protect the public\\ninterest. This work contributes to the field of open medical LLMs by optimizing\\nkey stages of data preprocessing and training, while showing how to improve\\nmodel safety (through DPO) and efficacy (through RAG). The evaluation\\nmethodology used, which includes four different types of tests, defines a new\\nstandard for the field. The resultant models, shown to be competitive with the\\nbest private alternatives, are released with a permisive license.\\n  Methods: Building on top of strong base models like Llama 3.1 and Qwen 2.5,\\nAloe Beta uses a custom dataset to enhance public data with synthetic Chain of\\nThought examples. The models undergo alignment with Direct Preference\\nOptimization, emphasizing ethical and policy-aligned performance in the\\npresence of jailbreaking attacks. Evaluation includes close-ended, open-ended,\\nsafety and human assessments, to maximize the reliability of results.\\n  Results: Recommendations are made across the entire pipeline, backed by the\\nsolid performance of the Aloe Family. These models deliver competitive\\nperformance across healthcare benchmarks and medical fields, and are often\\npreferred by healthcare professionals. On bias and toxicity, the Aloe Beta\\nmodels significantly improve safety, showing resilience to unseen jailbreaking\\nattacks. For a responsible release, a detailed risk assessment specific to\\nhealthcare is attached to the Aloe Family models.\\n  Conclusion: The Aloe Beta models, and the recipe that leads to them, are a\\nsignificant contribution to the open-source medical LLM field, offering\\ntop-of-the-line performance while maintaining high ethical requirements. This\\nwork sets a new standard for developing and reporting aligned LLMs in\\nhealthcare.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.AI\", \"published\": \"2025-05-07T13:13:14Z\"}"}
