{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15681v1\", \"title\": \"Vidi: Large Multimodal Models for Video Understanding and Editing\", \"summary\": \"Humans naturally share information with those they are connected to, and\\nvideo has become one of the dominant mediums for communication and expression\\non the Internet. To support the creation of high-quality large-scale video\\ncontent, a modern pipeline requires a comprehensive understanding of both the\\nraw input materials (e.g., the unedited footage captured by cameras) and the\\nediting components (e.g., visual effects). In video editing scenarios, models\\nmust process multiple modalities (e.g., vision, audio, text) with strong\\nbackground knowledge and handle flexible input lengths (e.g., hour-long raw\\nvideos), which poses significant challenges for traditional models. In this\\nreport, we introduce Vidi, a family of Large Multimodal Models (LMMs) for a\\nwide range of video understand editing scenarios. The first release focuses on\\ntemporal retrieval, i.e., identifying the time ranges within the input videos\\ncorresponding to a given text query, which plays a critical role in intelligent\\nediting. The model is capable of processing hour-long videos with strong\\ntemporal understanding capability, e.g., retrieve time ranges for certain\\nqueries. To support a comprehensive evaluation in real-world scenarios, we also\\npresent the VUE-TR benchmark, which introduces five key advancements. 1) Video\\nduration: significantly longer than existing temporal retrival datasets, 2)\\nAudio support: includes audio-based queries, 3) Query format: diverse query\\nlengths/formats, 4) Annotation quality: ground-truth time ranges are manually\\nannotated. 5) Evaluation metric: a refined IoU metric to support evaluation\\nover multiple time ranges. Remarkably, Vidi significantly outperforms leading\\nproprietary models, e.g., GPT-4o and Gemini, on the temporal retrieval task,\\nindicating its superiority in video editing scenarios.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-22T08:04:45Z\"}"}
