{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12099v1\", \"title\": \"Logical multi-qubit entanglement with dual-rail superconducting qubits\", \"summary\": \"Recent advances in quantum error correction (QEC) across hardware platforms\\nhave demonstrated operation near and beyond the fault-tolerance threshold, yet\\nachieving exponential suppression of logical errors through code scaling\\nremains a critical challenge. Erasure qubits, which enable hardware-level\\ndetection of dominant error types, offer a promising path toward\\nresource-efficient QEC by exploiting error bias. Single erasure qubits with\\ndual-rail encoding in superconducting cavities and transmons have demonstrated\\nhigh coherence and low single-qubit gate errors with mid-circuit erasure\\ndetection, but the generation of multi-qubit entanglement--a fundamental\\nrequirement for quantum computation and error correction--has remained an\\noutstanding milestone. Here, we demonstrate a superconducting processor\\nintegrating four dual-rail erasure qubits that achieves the logical multi-qubit\\nentanglement with error-biased protection. Each dual-rail qubit, encoded in\\npairs of tunable transmons, preserves millisecond-scale coherence times and\\nsingle-qubit gate errors at the level of $10^{-5}$. By engineering tunable\\ncouplings between logical qubits, we generate high-fidelity entangled states\\nresilient to physical qubit noise, including logical Bell states (98.8%\\nfidelity) and a three-logical-qubit Greenberger-Horne-Zeilinger (GHZ) state\\n(93.5% fidelity). A universal gate set is realized through a calibrated logical\\ncontrolled-NOT (CNOT) gate with 96.2% process fidelity, enabled by\\ncoupler-activated $XX$ interactions in the protected logical subspace. This\\nwork advances dual-rail architectures beyond single-qubit demonstrations,\\nproviding a blueprint for concatenated quantum error correction with erasure\\nqubits.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-16T14:02:30Z\"}"}
