{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05300v1\", \"title\": \"Search for dark matter produced in association with one or two top\\n  quarks in proton-proton collisions at $\\\\sqrt{s}$ = 13 TeV\", \"summary\": \"A search is performed for dark matter (DM) produced in association with a\\nsingle top quark or a pair of top quarks using the data collected with the CMS\\ndetector at the LHC from proton-proton collisions at a center-of-mass energy of\\n13 TeV, corresponding to 138 fb$^{-1}$ of integrated luminosity. An excess of\\nevents with a large imbalance of transverse momentum is searched for across 0,\\n1 and 2 lepton final states. Novel multivariate techniques are used to take\\nadvantage of the differences in kinematic properties between the two DM\\nproduction mechanisms. No significant deviations with respect to the standard\\nmodel predictions are observed. The results are interpreted considering a\\nsimplified model in which the mediator is either a scalar or pseudoscalar\\nparticle and couples to top quarks and to DM fermions. Axion-like particles\\nthat are coupled to top quarks and DM fermions are also considered. Expected\\nexclusion limits of 410 and 380 GeV for scalar and pseudoscalar mediator\\nmasses, respectively, are set at the 95% confidence level. A DM particle mass\\nof 1 GeV is assumed, with mediator couplings to fermions and DM particles set\\nto unity. A small signal-like excess is observed in data, with the largest\\nlocal significance observed to be 1.9 standard deviations for the 150 GeV\\npseudoscalar mediator hypothesis. Because of this excess, mediator masses are\\nonly excluded below 310 (320) GeV for the scalar (pseudoscalar) mediator. The\\nresults are also translated into model-independent 95% confidence level upper\\nlimits on the visible cross section of DM production in association with top\\nquarks, ranging from 1 pb to 0.02 pb.\", \"main_category\": \"hep-ex\", \"categories\": \"hep-ex\", \"published\": \"2025-05-08T14:42:37Z\"}"}
