{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11433v1\", \"title\": \"Predicting Wave Dynamics using Deep Learning with Multistep Integration\\n  Inspired Attention and Physics-Based Loss Decomposition\", \"summary\": \"In this paper, we present a physics-based deep learning framework for\\ndata-driven prediction of wave propagation in fluid media. The proposed\\napproach, termed Multistep Integration-Inspired Attention (MI2A), combines a\\ndenoising-based convolutional autoencoder for reduced latent representation\\nwith an attention-based recurrent neural network with long-short-term memory\\ncells for time evolution of reduced coordinates. This proposed architecture\\ndraws inspiration from classical linear multistep methods to enhance stability\\nand long-horizon accuracy in latent-time integration. Despite the efficiency of\\nhybrid neural architectures in modeling wave dynamics, autoregressive\\npredictions are often prone to accumulating phase and amplitude errors over\\ntime. To mitigate this issue within the MI2A framework, we introduce a novel\\nloss decomposition strategy that explicitly separates the training loss\\nfunction into distinct phase and amplitude components. We assess the\\nperformance of MI2A against two baseline reduced-order models trained with\\nstandard mean-squared error loss: a sequence-to-sequence recurrent neural\\nnetwork and a variant using Luong-style attention. To demonstrate the\\neffectiveness of the MI2A model, we consider three benchmark wave propagation\\nproblems of increasing complexity, namely one-dimensional linear convection,\\nthe nonlinear viscous Burgers equation, and the two-dimensional Saint-Venant\\nshallow water system. Our results demonstrate that the MI2A framework\\nsignificantly improves the accuracy and stability of long-term predictions,\\naccurately preserving wave amplitude and phase characteristics. Compared to the\\nstandard long-short term memory and attention-based models, MI2A-based deep\\nlearning exhibits superior generalization and temporal accuracy, making it a\\npromising tool for real-time wave modeling.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.NA,math.NA,physics.flu-dyn\", \"published\": \"2025-04-15T17:47:20Z\"}"}
