{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11842v1\", \"title\": \"Bloch phonon-polaritons with anomalous dispersion in polaritonic Fourier\\n  crystals\", \"summary\": \"The recently suggested concept of a polaritonic Fourier crystal (PFC) is\\nbased on a harmonically-corrugated mirror substrate for a thin pristine\\npolaritonic crystal layer. The propagating polaritons in PFC experience a\\nharmonic and mode-selective momentum modulation leading to a manifestation of\\nBloch modes with practically zero inter-mode scattering. PFC was first\\ndemonstrated for the hyperbolic phonon-polaritons in hexagonal boron nitride\\n(hBN) within its Type II Reststrahlen band (RB-II) where the in-plane\\ncomponents of the dielectric permittivity tensor are isotropic and negative,\\nwhile the out-of-plane component is positive. By contrast, a Type I\\nReststrahlen band (RB-I) is characterized by negative out-of-plane and positive\\nin-plane permittivity components, and consequently, the inversion of field\\nsymmetry of phonon-polaritons compared to RB-II. Behavior of such RB-I modes in\\na polaritonic crystal is yet to be explored. Here, we employ a biaxial crystal\\nalpha-phase molybdenum trioxide ({\\\\alpha}-MoO3) and near-field imaging to study\\npolaritonic Bloch modes in a one-dimensional PFC within the RB-I where the\\nmid-infrared phonon-polaritons in {\\\\alpha}-MoO3 have anomalous dispersion and\\nnegative phase velocity. Surprisingly, we observe a manifestation of Bloch\\nwaves as a dispersionless near-field pattern across the first Brillouin zone,\\nin contrast to RB-II case demonstrated with in-plane isotropic hBN. We\\nattribute this difference to the opposite field symmetry of the lowest-order\\nphonon-polariton mode in the two RBs, leading to a different momentum\\nmodulation regime in the polaritonic Fourier crystal. Our results reveal the\\nimportance of mode symmetry for polaritonic crystals in general and for the\\nemerging field of Fourier crystals in particular, which promise new ways to\\nmanipulate the nanolight.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics,cond-mat.other,physics.app-ph\", \"published\": \"2025-04-16T08:05:56Z\"}"}
