{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17721v1\", \"title\": \"Conformal Segmentation in Industrial Surface Defect Detection with\\n  Statistical Guarantees\", \"summary\": \"In industrial settings, surface defects on steel can significantly compromise\\nits service life and elevate potential safety risks. Traditional defect\\ndetection methods predominantly rely on manual inspection, which suffers from\\nlow efficiency and high costs. Although automated defect detection approaches\\nbased on Convolutional Neural Networks(e.g., Mask R-CNN) have advanced rapidly,\\ntheir reliability remains challenged due to data annotation uncertainties\\nduring deep model training and overfitting issues. These limitations may lead\\nto detection deviations when processing the given new test samples, rendering\\nautomated detection processes unreliable. To address this challenge, we first\\nevaluate the detection model's practical performance through calibration data\\nthat satisfies the independent and identically distributed (i.i.d) condition\\nwith test data. Specifically, we define a loss function for each calibration\\nsample to quantify detection error rates, such as the complement of recall rate\\nand false discovery rate. Subsequently, we derive a statistically rigorous\\nthreshold based on a user-defined risk level to identify high-probability\\ndefective pixels in test images, thereby constructing prediction sets (e.g.,\\ndefect regions). This methodology ensures that the expected error rate (mean\\nerror rate) on the test set remains strictly bounced by the predefined risk\\nlevel. Additionally, we observe a negative correlation between the average\\nprediction set size and the risk level on the test set, establishing a\\nstatistically rigorous metric for assessing detection model uncertainty.\\nFurthermore, our study demonstrates robust and efficient control over the\\nexpected test set error rate across varying calibration-to-test partitioning\\nratios, validating the method's adaptability and operational effectiveness.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-24T16:33:56Z\"}"}
