{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24263v1\", \"title\": \"The Physics of Conformal Cyclic Cosmology\", \"summary\": \"According to conformal cyclic cosmology (CCC), the currently conventional\\ndescription of the entire history of the universe (but without an initial\\ninflationary phase) provides but one cosmic aeon of an unending sequence of\\nsuch aeons, where the future conformal infinity of each aeon joins essentially\\nsmoothly to the conformally stretched big bang of the next, across a spacelike\\n3-surface, referred to as a crossover 3-surface. Whereas in previous accounts\\nof CCC a detailed description of the physics of crossover had been somewhat\\nproblematic, a novel idea is introduced here to show how crossover takes place\\nnaturally during a temporal period of the universe that is dominated by\\ngravitational waves referred to here as a gravitational wave epoch (GWE).\\nAccordingly, the geometry at the crossover surface is conformally smooth,\\nexcept at a discrete set of points, referred to as Hawking points, each\\nrepresenting the final Hawking evaporation of the dominant black hole of a\\ngalactic cluster in the earlier aeon. It is shown here (using 2-spinor and\\ntwistor techniques) that there is a mass-energy conservation law that holds\\nacross the crossover surface, showing that the rise of temperature within such\\nHawking spots should be effectively determined by the total mass of the\\npre-crossover galactic cluster involved. This rise of temperature on the CMB\\nmap within Hawking spots is found to be in quantitative agreement with the\\nmasses of the largest galactic clusters observed in our own aeon what suggests\\nthat the physics in the previous aeon was, at least in the gravitational\\nsector, similar to ours. A second observational feature, the actual angular\\ndiameter of the Hawking spots seen in our CMB, which is about twice what should\\nhave been expected, is associated to the presence of GWE just after the\\ncrossover and before the start of the usual cosmological epochs.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc\", \"published\": \"2025-03-31T16:10:05Z\"}"}
