{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17546v1\", \"title\": \"An introduction to R package `mvs`\", \"summary\": \"In biomedical science, a set of objects or persons can often be described by\\nmultiple distinct sets of features obtained from different data sources or\\nmodalities (called \\\"multi-view data\\\"). Classical machine learning methods\\nignore the multi-view structure of such data, limiting model interpretability\\nand performance. The R package `mvs` provides methods that were designed\\nspecifically for dealing with multi-view data, based on the multi-view stacking\\n(MVS) framework. MVS is a form of supervised (machine) learning used to train\\nmulti-view classification or prediction models. MVS works by training a\\nlearning algorithm on each view separately, estimating the predictive power of\\neach view-specific model through cross-validation, and then using another\\nlearning algorithm to assign weights to the view-specific models based on their\\nestimated predictions. MVS is a form of ensemble learning, dividing the large\\nmulti-view learning problem into smaller sub-problems. Most of these\\nsub-problems can be solved in parallel, making it computationally attractive.\\nAdditionally, the number of features of the sub-problems is greatly reduced\\ncompared with the full multi-view learning problem. This makes MVS especially\\nuseful when the total number of features is larger than the number of\\nobservations (i.e., high-dimensional data). MVS can still be applied even if\\nthe sub-problems are themselves high-dimensional by adding suitable penalty\\nterms to the learning algorithms. Furthermore, MVS can be used to automatically\\nselect the views which are most important for prediction. The R package `mvs`\\nmakes fitting MVS models, including such penalty terms, easily and openly\\naccessible. `mvs` allows for the fitting of stacked models with any number of\\nlevels, with different penalty terms, different outcome distributions, and\\nprovides several options for missing data handling.\", \"main_category\": \"stat.CO\", \"categories\": \"stat.CO,cs.LG,stat.ME,stat.ML\", \"published\": \"2025-04-24T13:34:31Z\"}"}
