{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12743v1\", \"title\": \"Quasinormal Modes and Greybody Factors of Scalar Field Perturbations in\\n  the NED Corrected Charged Black Hole Spacetime\", \"summary\": \"Inspired by the quark-antiquark confinement potential, Mazharimousavi et al.\\n\\\\cite{Mazharimousavi:2023okd} proposed a nonlinear electrodynamics (NED) model,\\nand based on this model, they constructed a charged black hole solution that\\nincludes a logarithmic correction term ($\\\\propto \\\\frac{\\\\zeta \\\\ln r}{r}$). On\\nthe basis of the Reissner-Nordstr\\\\\\\"om metric, this solution realizes a\\nlong-range confinement correction by introducing the NED parameter $\\\\zeta$,\\nproviding a new theoretical perspective for explaining the anomalies in galaxy\\nrotation curves. To deeply explore the dynamic properties of this black hole\\nsolution, this paper combines two complementary methods, namely, time-domain\\nevolution and the WKB approximation, to calculate the quasinormal mode (QNM)\\nspectrum of its scalar field perturbations. The research results show that the\\noscillation frequencies and decay rates of the low-order QNM modes decrease\\nmonotonically with the increase of the NED parameter $\\\\zeta$, and exhibit an\\napproximately linear dependence. The analysis of the greybody factor (GF)\\nindicates that as $\\\\zeta$ increases, the transmittance of the low-frequency\\nscalar field also increases. The enhanced long-range confinement effect caused\\nby the increase of $\\\\zeta$ makes low-frequency perturbations more likely to\\nsurvive and propagate in space-time on the one hand, and at the same time\\nenhances the transmission ability of the low-frequency scalar field. These\\ncharacteristics provide key theoretical predictions and potential observational\\nfeatures for testing and constraining such NED models in a strong gravitational\\nfield environment in the future using the observational data of gravitational\\nwave astronomy or Hawking radiation.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc\", \"published\": \"2025-04-17T08:32:29Z\"}"}
