{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02602v1\", \"title\": \"Leveraging Sparse Annotations for Leukemia Diagnosis on the Large\\n  Leukemia Dataset\", \"summary\": \"Leukemia is 10th most frequently diagnosed cancer and one of the leading\\ncauses of cancer related deaths worldwide. Realistic analysis of Leukemia\\nrequires White Blook Cells (WBC) localization, classification, and\\nmorphological assessment. Despite deep learning advances in medical imaging,\\nleukemia analysis lacks a large, diverse multi-task dataset, while existing\\nsmall datasets lack domain diversity, limiting real world applicability. To\\novercome dataset challenges, we present a large scale WBC dataset named Large\\nLeukemia Dataset (LLD) and novel methods for detecting WBC with their\\nattributes. Our contribution here is threefold. First, we present a large-scale\\nLeukemia dataset collected through Peripheral Blood Films (PBF) from several\\npatients, through multiple microscopes, multi cameras, and multi magnification.\\nTo enhance diagnosis explainability and medical expert acceptance, each\\nleukemia cell is annotated at 100x with 7 morphological attributes, ranging\\nfrom Cell Size to Nuclear Shape. Secondly, we propose a multi task model that\\nnot only detects WBCs but also predicts their attributes, providing an\\ninterpretable and clinically meaningful solution. Third, we propose a method\\nfor WBC detection with attribute analysis using sparse annotations. This\\napproach reduces the annotation burden on hematologists, requiring them to mark\\nonly a small area within the field of view. Our method enables the model to\\nleverage the entire field of view rather than just the annotated regions,\\nenhancing learning efficiency and diagnostic accuracy. From diagnosis\\nexplainability to overcoming domain shift challenges, presented datasets could\\nbe used for many challenging aspects of microscopic image analysis. The\\ndatasets, code, and demo are available at:\\nhttps://im.itu.edu.pk/sparse-leukemiaattri/\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-03T14:04:02Z\"}"}
