{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12657v1\", \"title\": \"Photon Calibration Performance of KAGRA during the 4th Joint Observing\\n  Run (O4)\", \"summary\": \"KAGRA is a kilometer-scale cryogenic gravitational-wave (GW) detector in\\nJapan. It joined the 4th joint observing run (O4) in May 2023 in collaboration\\nwith the Laser Interferometer GW Observatory (LIGO) in the USA, and Virgo in\\nItaly. After one month of observations, KAGRA entered a break period to enhance\\nits sensitivity to GWs, and it is planned to rejoin O4 before its scheduled end\\nin October 2025. To accurately recover the information encoded in the GW\\nsignals, it is essential to properly calibrate the observed signals. We employ\\na photon calibration (Pcal) system as a reference signal injector to calibrate\\nthe output signals obtained from the telescope. In ideal future conditions, the\\nuncertainty in Pcal could dominate the uncertainty in the observed data. In\\nthis paper, we present the methods used to estimate the uncertainty in the Pcal\\nsystems employed during KAGRA O4 and report an estimated system uncertainty of\\n0.79%, which is three times lower than the uncertainty achieved in the previous\\n3rd joint observing run (O3) in 2020. Additionally, we investigate the\\nuncertainty in the Pcal laser power sensors, which had the highest impact on\\nthe Pcal uncertainty, and estimate the beam positions on the KAGRA main mirror,\\nwhich had the second highest impact. The Pcal systems in KAGRA are the first\\nfully functional calibration systems for a cryogenic GW telescope. To avoid\\ninterference with the KAGRA cryogenic systems, the Pcal systems incorporate\\nunique features regarding their placement and the use of telephoto cameras,\\nwhich can capture images of the mirror surface at almost normal incidence. As\\nfuture GW telescopes, such as the Einstein Telescope, are expected to adopt\\ncryogenic techniques, the performance of the KAGRA Pcal systems can serve as a\\nvaluable reference.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM\", \"published\": \"2025-04-17T05:36:31Z\"}"}
