{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10134v1\", \"title\": \"Let's Talk About It: Making Scientific Computational Reproducibility\\n  Easy\", \"summary\": \"Computational reproducibility of scientific results, that is, the execution\\nof a computational experiment (e.g., a script) using its original settings\\n(data, code, etc.), should always be possible. However, reproducibility has\\nbecome a significant challenge, as researchers often face difficulties in\\naccurately replicating experiments due to inconsistencies in documentation,\\nsetup configurations, and missing data. This lack of reproducibility may\\nundermine the credibility of scientific results.\\n  To address this issue, we propose a conversational, text-based tool that\\nallows researchers to easily reproduce computational experiments (theirs or\\nfrom others) and package them in a single file that can be re-executed with\\njust a double click on any computer, requiring the installation of a single\\nwidely-used software. Researchers interact with the platform in natural\\nlanguage, which our tool processes to automatically create a computational\\nenvironment able to execute the provided experiment/code.\\n  We conducted two studies to evaluate our proposal. In the first study, we\\ngathered qualitative data by executing 18 experiments from the literature.\\nAlthough in some cases it was not possible to execute the experiment, in most\\ninstances, it was necessary to have little or even no interaction for the tool\\nto reproduce the results.\\n  We also conducted a user study comparing our tool with an enterprise-level\\none. During this study, we measured the usability of both tools using the\\nSystem Usability Scale (SUS) and participants' workload using the NASA Task\\nLoad Index (TLX). The results show a statistically significant difference\\nbetween both tools in favor of our proposal, demonstrating that the usability\\nand workload of our tool are superior to the current state of the art.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-14T11:45:51Z\"}"}
