{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24203v1\", \"title\": \"Traffic Engineering in Large-scale Networks with Generalizable Graph\\n  Neural Networks\", \"summary\": \"Traffic engineering (TE) in large-scale computer networks has become a\\nfundamental yet challenging problem, owing to the swift growth of global-scale\\ncloud wide-area networks or backbone low-Earth-orbit satellite constellations.\\nTo address the scalability issue of traditional TE algorithms, learning-based\\napproaches have been proposed, showing potential of significant efficiency\\nimprovement over state-of-the-art methods. Nevertheless, the intrinsic\\nlimitations of existing learning-based methods hinder their practical\\napplication: they are not generalizable across diverse topologies and network\\nconditions, incur excessive training overhead, and do not respect link\\ncapacities by default.\\n  This paper proposes TELGEN, a novel TE algorithm that learns to solve TE\\nproblems efficiently in large-scale networks, while achieving superior\\ngeneralizability across diverse network conditions. TELGEN is based on the\\nnovel idea of transforming the problem of \\\"predicting the optimal TE solution\\\"\\ninto \\\"predicting the optimal TE algorithm\\\", which enables TELGEN to learn and\\nefficiently approximate the end-to-end solving process of classical optimal TE\\nalgorithms. The learned algorithm is agnostic to the exact network topology or\\ntraffic patterns, and can efficiently solve TE problems given arbitrary inputs\\nand generalize well to unseen topologies and demands.\\n  We trained and evaluated TELGEN on random and real-world networks with up to\\n5000 nodes and 106 links. TELGEN achieved less than 3% optimality gap while\\nensuring feasibility in all cases, even when the test network had up to 20x\\nmore nodes than the largest in training. It also saved up to 84% solving time\\nthan classical optimal solver, and could reduce training time per epoch and\\nsolving time by 2-4 orders of magnitude than latest learning algorithms on the\\nlargest networks.\", \"main_category\": \"cs.NI\", \"categories\": \"cs.NI,cs.LG\", \"published\": \"2025-03-31T15:21:22Z\"}"}
