{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16506v1\", \"title\": \"A Comprehensive Survey of Synthetic Tabular Data Generation\", \"summary\": \"Tabular data remains one of the most prevalent and critical data formats\\nacross diverse real-world applications. However, its effective use in machine\\nlearning (ML) is often constrained by challenges such as data scarcity, privacy\\nconcerns, and class imbalance. Synthetic data generation has emerged as a\\npromising solution, leveraging generative models to learn the distribution of\\nreal datasets and produce high-fidelity, privacy-preserving samples. Various\\ngenerative paradigms have been explored, including energy-based models (EBMs),\\nvariational autoencoders (VAEs), generative adversarial networks (GANs), large\\nlanguage models (LLMs), and diffusion models. While several surveys have\\ninvestigated synthetic tabular data generation, most focus on narrow subdomains\\nor specific generative methods, such as GANs, diffusion models, or\\nprivacy-preserving techniques. This limited scope often results in fragmented\\ninsights, lacking a comprehensive synthesis that bridges diverse approaches. In\\nparticular, recent advances driven by LLMs and diffusion-based models remain\\nunderexplored. This gap hinders a holistic understanding of the field`s\\nevolution, methodological interplay, and open challenges. To address this, our\\nsurvey provides a unified and systematic review of synthetic tabular data\\ngeneration. Our contributions are threefold: (1) we propose a comprehensive\\ntaxonomy that organizes existing methods into traditional approaches,\\ndiffusion-based methods, and LLM-based models, and provide an in-depth\\ncomparative analysis; (2) we detail the complete pipeline for synthetic tabular\\ndata generation, including data synthesis, post-processing, and evaluation; (3)\\nwe identify major challenges, explore real-world applications, and outline open\\nresearch questions and future directions to guide future work in this rapidly\\nevolving area.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-23T08:33:34Z\"}"}
