{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16449v1\", \"title\": \"From Past to Present: A Survey of Malicious URL Detection Techniques,\\n  Datasets and Code Repositories\", \"summary\": \"Malicious URLs persistently threaten the cybersecurity ecosystem, by either\\ndeceiving users into divulging private data or distributing harmful payloads to\\ninfiltrate host systems. Gaining timely insights into the current state of this\\nongoing battle holds significant importance. However, existing reviews exhibit\\n4 critical gaps: 1) Their reliance on algorithm-centric taxonomies obscures\\nunderstanding of how detection approaches exploit specific modal information\\nchannels; 2) They fail to incorporate pivotal LLM/Transformer-based defenses;\\n3) No open-source implementations are collected to facilitate benchmarking; 4)\\nInsufficient dataset coverage.This paper presents a comprehensive review of\\nmalicious URL detection technologies, systematically analyzing methods from\\ntraditional blacklisting to advanced deep learning approaches (e.g.\\nTransformer, GNNs, and LLMs). Unlike prior surveys, we propose a novel\\nmodality-based taxonomy that categorizes existing works according to their\\nprimary data modalities (URL, HTML, Visual, etc.). This hierarchical\\nclassification enables both rigorous technical analysis and clear understanding\\nof multimodal information utilization. Furthermore, to establish a profile of\\naccessible datasets and address the lack of standardized benchmarking (where\\ncurrent studies often lack proper baseline comparisons), we curate and analyze:\\n1) publicly available datasets (2016-2024), and 2) open-source implementations\\nfrom published works(2013-2025). Then, we outline essential design principles\\nand architectural frameworks for product-level implementations. The review\\nconcludes by examining emerging challenges and proposing actionable directions\\nfor future research. We maintain a GitHub repository for ongoing curating\\ndatasets and open-source implementations:\\nhttps://github.com/sevenolu7/Malicious-URL-Detection-Open-Source/tree/master.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.LG\", \"published\": \"2025-04-23T06:23:18Z\"}"}
