{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21702v1\", \"title\": \"A Conversational Approach to Well-being Awareness Creation and\\n  Behavioural Intention\", \"summary\": \"The promotion of a healthy lifestyle is one of the main drivers of an\\nindividual's overall physical and psycho-emotional well-being. Digital\\ntechnologies are more and more adopted as ''facilitators'' for this goal, to\\nraise awareness and solicit healthy lifestyle habits.\\n  This study aims to experiment the effects of the adoption of a digital\\nconversational tool to influence awareness creation and behavioural change in\\nthe context of a well-being lifestyle. Our aim is to collect evidence of the\\naspects that must be taken into account when designing and implementing such\\ntools in well-being promotion campaigns.\\n  To this end, we created a conversational application for promoting well-being\\nand healthy lifestyles, which presents relevant information and asks specific\\nquestions to its intended users within an interaction happening through a chat\\ninterface; the conversational tool presents itself as a well-being counsellor\\nnamed Allegra and follows a coaching approach to structure the interaction with\\nthe user. In our user study, participants were asked to first interact with\\nAllegra in one of three experimental conditions, corresponding to different\\nconversational styles; then, they answered a questionnaire about their\\nexperience. The questionnaire items were related to intrinsic motivation\\nfactors as well as awareness creation and behavioural change. The collected\\ndata allowed us to assess the hypotheses of our model that put in connection\\nthose variables.\\n  Our results confirm the positive effect of intrinsic motivation factors on\\nboth awareness creation and behavioural intention in the context of well-being\\nand healthy lifestyle; on the other hand, we did not record any statistically\\nsignificant effect of different language and communication styles on the\\noutcomes.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-30T14:45:20Z\"}"}
