{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17441v1\", \"title\": \"Predict-Optimize-Distill: A Self-Improving Cycle for 4D Object\\n  Understanding\", \"summary\": \"Humans can resort to long-form inspection to build intuition on predicting\\nthe 3D configurations of unseen objects. The more we observe the object motion,\\nthe better we get at predicting its 3D state immediately. Existing systems\\neither optimize underlying representations from multi-view observations or\\ntrain a feed-forward predictor from supervised datasets. We introduce\\nPredict-Optimize-Distill (POD), a self-improving framework that interleaves\\nprediction and optimization in a mutually reinforcing cycle to achieve better\\n4D object understanding with increasing observation time. Given a multi-view\\nobject scan and a long-form monocular video of human-object interaction, POD\\niteratively trains a neural network to predict local part poses from RGB\\nframes, uses this predictor to initialize a global optimization which refines\\noutput poses through inverse rendering, then finally distills the results of\\noptimization back into the model by generating synthetic self-labeled training\\ndata from novel viewpoints. Each iteration improves both the predictive model\\nand the optimized motion trajectory, creating a virtuous cycle that bootstraps\\nits own training data to learn about the pose configurations of an object. We\\nalso introduce a quasi-multiview mining strategy for reducing depth ambiguity\\nby leveraging long video. We evaluate POD on 14 real-world and 5 synthetic\\nobjects with various joint types, including revolute and prismatic joints as\\nwell as multi-body configurations where parts detach or reattach independently.\\nPOD demonstrates significant improvement over a pure optimization baseline\\nwhich gets stuck in local minima, particularly for longer videos. We also find\\nthat POD's performance improves with both video length and successive\\niterations of the self-improving cycle, highlighting its ability to scale\\nperformance with additional observations and looped refinement.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-24T11:03:15Z\"}"}
