{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11274v1\", \"title\": \"Isomeric yield ratios and mass spectrometry of Y and Nb isotopes in the\\n  neutron-rich N=60 region: the unusual case of $^{98}$Y\", \"summary\": \"The isomeric yield ratio (IYR) of fission products is an observable that\\ncarries relevant information about the fragments emerging from the scission of\\na fissioning nucleus. We report on IYR of $^{96,98,100}$Y and $^{100,102}$Nb,\\ntogether with the previously reported values for $^{97}$Y and $^{99}$Nb,\\nproduced in the 28 MeV $\\\\alpha$-induced fission of $^{232}$Th at the Ion Guide\\nIsotope Separation On-Line (IGISOL) facility of the University of\\nJyv{\\\\\\\"a}skyl{\\\\\\\"a}. We measured the IYR using two different techniques, the\\nphase-imaging ion-cyclotron-resonance (PI-ICR) and the multiple-reflection\\ntime-of-flight mass spectrometry (MR-TOF-MS) methods. Moreover, we measured the\\nmasses of the long-lived isomeric states in $^{98,100}$Y and $^{100,102}$Nb\\npopulated via in-trap $\\\\beta$-decay of their precursors. Since the\\n$\\\\beta$-decay selectively populates states with a favourable spin-parity, we\\ncould identify the measured state and show that in all cases except $^{102}$Nb\\nthe ground state is the low-spin state. This measurement confirms the\\nspin-parity assignments of all the nuclei as they are reported on the ENSDF\\nevaluations, disagreeing with the assignment for $^{100}$Y reported on the\\nNUBASE2020 evaluation.\\n  Making also use of previously reported data, we observe an anomalously low\\nIYR for the $N=59$ isotope $^{98}$Y as compared to other yttrium or neighboring\\nniobium isotopes. This behavior is very rare across the nuclear chart and is\\nposited to be connected to the characteristic shape coexistence of $^{98}$Y and\\nto the change in the charge radii of the ground and excited states in the\\n$N=58-60$ region.\", \"main_category\": \"nucl-ex\", \"categories\": \"nucl-ex\", \"published\": \"2025-04-15T15:15:13Z\"}"}
