{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00524v1\", \"title\": \"Recursive inseparability of classical theories of a binary predicate and\\n  non-classical logics of a unary predicate\", \"summary\": \"The paper considers algorithmic properties of classical and non-classical\\nfirst-order logics and theories in bounded languages. The main idea is to prove\\nthe undecidability of various fragments of classical and non-classical\\nfirst-order logics and theories indirectly, by extracting it as a consequence\\nof the recursive inseparability of special problems associated with them.\\nFirst, we propose a domino problem, which makes it possible to catch the\\nrecursive inseparability of two sets. Second, using this problem, we prove that\\nthe classical first-order logic of a binary predicate and the theory of its\\nfinite models where the predicate is symmetric and irreflexive are recursively\\ninseparable in a language with a single binary predicate letter and three\\nvariables (without constants and equality). Third, we prove, for an infinite\\nclass of logics, that the monadic fragment of a modal predicate logic and the\\nlogic of the class of its finite Kripke frames are recursively inseparable in\\nlanguages with a single unary predicate letter and two individual variables;\\nthe same result is obtained if we replace the condition of finiteness of frames\\nwith the condition of finiteness of domains allowed in frames. Forth, we expand\\nthe results to a wide class of superintuitionistic predicate logics. In\\nparticular, it is proved that the positive fragments of the intuitionistic\\npredicate logic and the logic of the class of finite intuitionistic Kripke\\nframes are recursively inseparable in the language with a single unary\\npredicate letter and two individual variables. The technique used and the\\nresults obtained allow us to answer some additional questions about the\\ndecidability of special monadic fragments of some modal and superintuitionistic\\npredicate logics.\", \"main_category\": \"math.LO\", \"categories\": \"math.LO\", \"published\": \"2025-05-01T13:46:45Z\"}"}
