{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20857v1\", \"title\": \"MIGHTEE-HI: The radial acceleration relation with resolved stellar mass\\n  measurements\", \"summary\": \"The radial acceleration relation (RAR) is a fundamental relation linking\\nbaryonic and dark matter in galaxies by relating the observed acceleration\\nderived from dynamics to the one estimated from the baryonic mass. This\\nrelation exhibits small scatter, thus providing key constraints for models of\\ngalaxy formation and evolution -- allowing us to map the distribution of dark\\nmatter in galaxies -- as well as models of modified dynamics. However, it has\\nonly been extensively studied in the very local Universe with largely\\nheterogeneous samples. We present a new measurement of the RAR, utilising a\\nhomogeneous, unbiased sample of H{\\\\sc i}-selected galaxies. We introduce a\\nnovel approach of measuring resolved stellar masses using spectral energy\\ndistribution (SED) fitting across 10 photometric bands to determine the\\nresolved mass-to-light ratio, which we show is essential for measuring the\\nacceleration due to baryons in the low-acceleration regime. We find that the\\nstellar mass-to-light ratio varies across galaxies and radially, favouring\\nlower mass-to-light ratios compared to previous studies. Our results reveal a\\ntight RAR with a low-acceleration power-law slope of $\\\\sim 0.5$, consistent\\nwith previous studies. Adopting a spatially varying mass-to-light ratio yields\\nthe tightest RAR with an intrinsic scatter of only $0.045 \\\\pm 0.022$ dex. We\\nalso find the first tentative evidence for redshift evolution in the\\nacceleration scale, but more data will be required to confirm this. These\\nresults highlight the importance of resolved stellar mass measurements in\\naccurately characterizing the gravitational contribution of the baryons in\\nlow-mass, gas-rich galaxies.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-29T15:32:19Z\"}"}
