{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05671v1\", \"title\": \"The Impact of Neutrino Magnetic Moments on the Evolution of the Helium\\n  Flash and Lithium-Rich Red Clump Stars\", \"summary\": \"The detection of the neutrino magnetic moment (NMM,$\\\\mu_v$) is one of the\\nmost significant challenges in physics. The additional energy loss due to NMM\\ncan significantly influence the He flash evolution in low-mass stars. Using the\\nMESA code, we investigated the impact of NMM on the He flash evolution in\\nlow-mass stars. We found that NMM leads to an increase in both the critical He\\ncore mass required for the He flash and the luminosity of TRGB. For a typical\\n$Z = 1 Z_{\\\\odot}$ , $M$ = 1.0 $M_{\\\\odot}$, and $\\\\mu_v = 3 \\\\times 10^{-12}\\n\\\\mu_{\\\\mathrm{B}}$ model, the He core mass increases by $\\\\sim 5\\\\%$, and the TRGB\\nluminosity increases by $\\\\sim 35\\\\%$ compared to the model without NMM. However,\\ncontrary to previous conclusions, our model indicates that the He flash occurs\\nearlier, rather than delayed, with increasing NMM values. This is because the\\nadditional energy loss from NMM accelerates the contraction of the He core,\\nreleases more gravitational energy that heats the H shell and increases the\\nhydrogen burning rate, thereby causing the He core to reach the critical mass\\nfaster and advancing the He flash. An increase in NMM results in a higher peak\\nluminosity for the first He flash, a more off-center ignition position, and\\nsub-flashes with higher luminosities, shorter intervals, and higher frequency.\\nWe found that the internal gravity wave (IGW) mixing generated by the He flash\\ncan induce sufficient mixing in the radiative zone, turning the overshoot\\nregion into a low-Dmix bottleneck within the stellar interior. The increase in\\nNMM in the model narrows the overshoot bottleneck region, enabling Li to enter\\nthe surface convection zone more quickly, thereby enhancing the enrichment\\neffect of IGW mixing on surface Li. For models incorporating both NMM and IGW\\nmixing, the reduction in the overshoot bottleneck region allows them to\\neffectively produce super Li-rich red clump star samples.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-08T04:33:18Z\"}"}
