{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17635v1\", \"title\": \"Quantifying jet-interstellar medium interactions in Cyg X-1: Insights\\n  from dual-frequency bow shock detection with MeerKAT\", \"summary\": \"Accretion and outflows are astrophysical phenomena observed across a wide\\nrange of objects, from white dwarfs to supermassive black holes. Developing a\\ncomplete picture of these processes requires complementary studies across this\\nfull spectrum of jet-launching sources. Jet-interstellar medium (ISM)\\ninteraction sites near black hole X-ray binaries provide unique laboratories to\\nstudy jet energetics. This work aims to detect and characterise the bow shock\\nnear one black hole X-ray binary, Cyg X-1, and then use this bow shock\\nstructure to parametrise the properties of the jet launched by Cyg X-1 over its\\nlifetime. We used the MeerKAT radio telescope to investigate the bow shock\\nstructure formed by the interaction between the jets of Cyg X-1 and the ISM. We\\nsuccessfully detect the bow shock north of Cyg X-1 in the L and S bands and\\nreport its size and brightness. We present the spectral index distribution\\nacross the bow shock, which is in the range -0.9 to 0.4, with an error\\ndistribution (0.6 to 1.5) that peaks at unity. We determine that the unshocked\\nISM density is 6-7 cm^-3 for a temperature range of 10^4 to 3*10^6 K. This\\ntemperature range suggests that the velocity of the bow shock is 21 km/s to 364\\nkm/s. The age of the Cyg X-1 jet responsible for the bow shock is 0.04 to 0.3\\nMyr, and the power of the jet is constrained to 2*10^31 ergs/s to 10^35 ergs/s.\\nWe also detect new morphological features of the bow shock in the S-band image.\\nThe comparison of archival H_alpha maps with the new radio observations hints\\nat different regions of emission, different temperature ranges, and different\\nISM densities. The spectral index suggests a consistent emission origin across\\nthe structure. The ISM density around Cyg X-1 is on the higher end for Galactic\\nenvironments, and our results indicate a lower jet energy transport rate than\\nprior estimates.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-24T15:08:09Z\"}"}
