{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21381v1\", \"title\": \"From expNN to sinNN: automatic generation of sum-of-products models for\\n  potential energy surfaces in internal coordinates using neural networks and\\n  sparse grid sampling\", \"summary\": \"Potential Energy Surfaces are generally required for simulating quantum\\ndynamics. Specifically, having an analytical expression of the PES enables a\\nmore efficient dynamics workflow compared to the currently popular direct\\ndynamics approaches. When using the MCTDH method, there is also a strong\\nadvantage to express the PES in sum-of-products form for solving the\\ntime-dependent nuclear Schr\\\\\\\"odinger equation. Nevertheless, obtaining an\\naccurate expression for the PES of molecular systems that contain more than a\\nfew atoms presents challenges. The objectives of this work are twofold. First,\\nthe practicality of a single-layer artificial neural network with sinusoidal\\nactivation functions for representing potential energy surfaces in\\nsum-of-products form will be evaluated. Second, the efficiency and ability of a\\nhomogeneous sampling strategy based on sparse grids to provide unbiased\\ncoverage of configuration space for generating training data will be assessed.\\nThe fitting approach, named sinNN, is applied to modeling the PES of HONO,\\ncovering both the trans and cis isomers. Refitting is first explored with\\ncomparison to the expNN fitting method. Second, fitting from potential energies\\nobtained from the machine learning model MLatom/AIQM2 is considered. The sinNN\\nPES model obtained from MLatom/AIQM2 energies was able to reproduce available\\nexperimental fundamental vibrational transition energies with a root mean\\nsquare error of about 17 cm-1. sinNN combined with sparse grids sampling\\napproach proves to be of practical use for the chosen system, both at refitting\\nand direct fitting tasks. The ability of MLatom/AIQM models to accurately\\nreproduce global PESs beyond equilibrium geometries is of particular interest.\", \"main_category\": \"physics.chem-ph\", \"categories\": \"physics.chem-ph,quant-ph\", \"published\": \"2025-04-30T07:31:32Z\"}"}
