{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15561v1\", \"title\": \"SPECI: Skill Prompts based Hierarchical Continual Imitation Learning for\\n  Robot Manipulation\", \"summary\": \"Real-world robot manipulation in dynamic unstructured environments requires\\nlifelong adaptability to evolving objects, scenes and tasks. Traditional\\nimitation learning relies on static training paradigms, which are ill-suited\\nfor lifelong adaptation. Although Continual Imitation Learnin (CIL) enables\\nincremental task adaptation while preserving learned knowledge, current CIL\\nmethods primarily overlook the intrinsic skill characteristics of robot\\nmanipulation or depend on manually defined and rigid skills, leading to\\nsuboptimal cross-task knowledge transfer. To address these issues, we propose\\nSkill Prompts-based HiErarchical Continual Imitation Learning (SPECI), a novel\\nend-to-end hierarchical CIL policy architecture for robot manipulation. The\\nSPECI framework consists of a multimodal perception and fusion module for\\nheterogeneous sensory information encoding, a high-level skill inference module\\nfor dynamic skill extraction and selection, and a low-level action execution\\nmodule for precise action generation. To enable efficient knowledge transfer on\\nboth skill and task levels, SPECI performs continual implicit skill acquisition\\nand reuse via an expandable skill codebook and an attention-driven skill\\nselection mechanism. Furthermore, we introduce mode approximation to augment\\nthe last two modules with task-specific and task-sharing parameters, thereby\\nenhancing task-level knowledge transfer. Extensive experiments on diverse\\nmanipulation task suites demonstrate that SPECI consistently outperforms\\nstate-of-the-art CIL methods across all evaluated metrics, revealing\\nexceptional bidirectional knowledge transfer and superior overall performance.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.LG\", \"published\": \"2025-04-22T03:30:38Z\"}"}
