{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19654v1\", \"title\": \"Transformation & Translation Occupancy Grid Mapping: 2-Dimensional Deep\\n  Learning Refined SLAM\", \"summary\": \"SLAM (Simultaneous Localisation and Mapping) is a crucial component for\\nrobotic systems, providing a map of an environment, the current location and\\nprevious trajectory of a robot. While 3D LiDAR SLAM has received notable\\nimprovements in recent years, 2D SLAM lags behind. Gradual drifts in odometry\\nand pose estimation inaccuracies hinder modern 2D LiDAR-odometry algorithms in\\nlarge complex environments. Dynamic robotic motion coupled with inherent\\nestimation based SLAM processes introduce noise and errors, degrading map\\nquality. Occupancy Grid Mapping (OGM) produces results that are often noisy and\\nunclear. This is due to the fact that evidence based mapping represents maps\\naccording to uncertain observations. This is why OGMs are so popular in\\nexploration or navigation tasks. However, this also limits OGMs' effectiveness\\nfor specific mapping based tasks such as floor plan creation in complex scenes.\\nTo address this, we propose our novel Transformation and Translation Occupancy\\nGrid Mapping (TT-OGM). We adapt and enable accurate and robust pose estimation\\ntechniques from 3D SLAM to the world of 2D and mitigate errors to improve map\\nquality using Generative Adversarial Networks (GANs). We introduce a novel data\\ngeneration method via deep reinforcement learning (DRL) to build datasets large\\nenough for training a GAN for SLAM error correction. We demonstrate our SLAM in\\nreal-time on data collected at Loughborough University. We also prove its\\ngeneralisability on a variety of large complex environments on a collection of\\nlarge scale well-known 2D occupancy maps. Our novel approach enables the\\ncreation of high quality OGMs in complex scenes, far surpassing the\\ncapabilities of current SLAM algorithms in terms of quality, accuracy and\\nreliability.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.AI,cs.LG\", \"published\": \"2025-04-28T10:13:47Z\"}"}
