{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00671v1\", \"title\": \"Multi-Constraint Safe Reinforcement Learning via Closed-form Solution\\n  for Log-Sum-Exp Approximation of Control Barrier Functions\", \"summary\": \"The safety of training task policies and their subsequent application using\\nreinforcement learning (RL) methods has become a focal point in the field of\\nsafe RL. A central challenge in this area remains the establishment of\\ntheoretical guarantees for safety during both the learning and deployment\\nprocesses. Given the successful implementation of Control Barrier Function\\n(CBF)-based safety strategies in a range of control-affine robotic systems,\\nCBF-based safe RL demonstrates significant promise for practical applications\\nin real-world scenarios. However, integrating these two approaches presents\\nseveral challenges. First, embedding safety optimization within the RL training\\npipeline requires that the optimization outputs be differentiable with respect\\nto the input parameters, a condition commonly referred to as differentiable\\noptimization, which is non-trivial to solve. Second, the differentiable\\noptimization framework confronts significant efficiency issues, especially when\\ndealing with multi-constraint problems. To address these challenges, this paper\\npresents a CBF-based safe RL architecture that effectively mitigates the issues\\noutlined above. The proposed approach constructs a continuous AND logic\\napproximation for the multiple constraints using a single composite CBF. By\\nleveraging this approximation, a close-form solution of the quadratic\\nprogramming is derived for the policy network in RL, thereby circumventing the\\nneed for differentiable optimization within the end-to-end safe RL pipeline.\\nThis strategy significantly reduces computational complexity because of the\\nclosed-form solution while maintaining safety guarantees. Simulation results\\ndemonstrate that, in comparison to existing approaches relying on\\ndifferentiable optimization, the proposed method significantly reduces training\\ncomputational costs while ensuring provable safety throughout the training\\nprocess.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.SY,eess.SY\", \"published\": \"2025-05-01T17:22:11Z\"}"}
