{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14940v1\", \"title\": \"Gigaparsec structures are nowhere to be seen in $\\u039b$CDM: an\\n  enhanced analysis of LSS in FLAMINGO-10K simulations\", \"summary\": \"Recently, Sawala et al. 2025 claimed to refute the cosmological significance\\nof the Giant Arc based on their analysis of the FLAMINGO-10K simulation data.\\nIn our paper here, we highlight several shortcomings of the authors' analysis.\\nWe then perform an enhanced analysis on the FLAMINGO-10K simulation data with\\napplications of: the Single-Linkage Hierarchical Clustering (SLHC), the Convex\\nHull of Member Spheres (CHMS), and the Minimal Spanning Tree (MST) algorithms.\\nUsing the full $2.8^3$ Gpc$^3$ FLAMINGO-10K box, with subhaloes at $z=0.7$, and\\n$100$ random realisations (from random subset selections) we find no gigaparsec\\nstructures in FLAMINGO-10K, and only a few ultra-large large-scale structures\\n(uLSSs, structures exceeding a maximum pairwise separation of $370$ Mpc).\\nSomewhat surprisingly, we found that the large-scale aspects of the\\nFLAMINGO-10K data could be adequately represented by a Poisson point\\ndistribution. The enhanced analysis presented here further supports the\\nremarkable nature of the Giant Arc as a cosmologically-significant structure.\\nOf course, the Giant Arc is also accompanied by a second uLSS, the Big Ring.\\nThe analysis presented here builds on the work presented by Sawala et al., but\\namends the application of their statistical assessments. We do not yet know why\\nthere appears to be such a large discrepancy between the FLAMINGO-10K data and\\nthe observed LSS in MgII absorbers. Perhaps the results presented here might\\nsuggest that the GA, and especially the GA + BR, presents a more direct\\nchallenge to $\\\\Lambda$CDM. In contrast to the conclusion of Sawala et al. that\\n`gigaparsec patterns abound in a $\\\\Lambda$CDM universe' we find that they are\\nnowhere to be seen.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-04-21T08:02:11Z\"}"}
