{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21537v1\", \"title\": \"The role of dendritic spines in water exchange measurements with\\n  diffusion MRI: Double Diffusion Encoding and free-waveform MRI\", \"summary\": \"Time-dependent diffusion MRI enables the estimation of water exchange rates\\nin vivo, yet reported values in grey matter remain inconsistent. While most\\nstudies attribute these estimates to membrane permeability, non-permeative\\ngeometric exchange has also been proposed. The present study investigates the\\ncontribution of geometric exchange between dendritic spines and shafts to\\ndiffusion MRI-derived exchange estimates. Monte Carlo simulations were\\nperformed in synthetic dendrites with varying spine morphology, density, and\\nmembrane permeability. Diffusion-weighted signals were generated using multiple\\nprotocols - including single diffusion encoding, double diffusion encoding, and\\nfree waveforms - and were analysed using four frameworks: the K\\\\\\\"arger model\\n(via kurtosis time-dependence), correlation tensor imaging,\\nRestriction-Exchange, and Multi-Gaussian Exchange with transient kurtosis\\n(tMGE). Dendritic spines were found to impart similar time-dependence\\nsignatures on the diffusion-weighted signal as permeative exchange (signal\\ndecrease with diffusion time). The effect was modulated by both spine\\nmorphology and density. Both the exchange rate and microscopic kurtosis\\nincreased with spine density. The tMGE method demonstrated the ability to\\ndisentangle geometric from permeative exchange. Non-permeative exchange in\\ndendritic spines has a non-negligible impact on exchange estimates obtained\\nwith diffusion MRI and should be considered in future studies. Diffusion MRI\\nexchange estimates may provide a non-invasive proxy for dendritic spine\\ndensity, with potential applications in studies of neurological disorders.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph\", \"published\": \"2025-04-30T11:34:44Z\"}"}
