{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00369v1\", \"title\": \"Automated segmenta-on of pediatric neuroblastoma on multi-modal MRI:\\n  Results of the SPPIN challenge at MICCAI 2023\", \"summary\": \"Surgery plays an important role within the treatment for neuroblastoma, a\\ncommon pediatric cancer. This requires careful planning, often via magnetic\\nresonance imaging (MRI)-based anatomical 3D models. However, creating these\\nmodels is often time-consuming and user dependent. We organized the Surgical\\nPlanning in Pediatric Neuroblastoma (SPPIN) challenge, to stimulate\\ndevelopments on this topic, and set a benchmark for fully automatic\\nsegmentation of neuroblastoma on multi-model MRI. The challenge started with a\\ntraining phase, where teams received 78 sets of MRI scans from 34 patients,\\nconsisting of both diagnostic and post-chemotherapy MRI scans. The final test\\nphase, consisting of 18 MRI sets from 9 patients, determined the ranking of the\\nteams. Ranking was based on the Dice similarity coefficient (Dice score), the\\n95th percentile of the Hausdorff distance (HD95) and the volumetric similarity\\n(VS). The SPPIN challenge was hosted at MICCAI 2023. The final leaderboard\\nconsisted of 9 teams. The highest-ranking team achieved a median Dice score\\n0.82, a median HD95 of 7.69 mm and a VS of 0.91, utilizing a large, pretrained\\nnetwork called STU-Net. A significant difference for the segmentation results\\nbetween diagnostic and post-chemotherapy MRI scans was observed (Dice = 0.89 vs\\nDice = 0.59, P = 0.01) for the highest-ranking team. SPPIN is the first medical\\nsegmentation challenge in extracranial pediatric oncology. The highest-ranking\\nteam used a large pre-trained network, suggesting that pretraining can be of\\nuse in small, heterogenous datasets. Although the results of the\\nhighest-ranking team were high for most patients, segmentation especially in\\nsmall, pre-treated tumors were insufficient. Therefore, more reliable\\nsegmentation methods are needed to create clinically applicable models to aid\\nsurgical planning in pediatric neuroblastoma.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-01T07:46:03Z\"}"}
