{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03635v1\", \"title\": \"Accelerating the development of oxynitride thin films: A combinatorial\\n  investigation of the Al-Si-O-N system\", \"summary\": \"Oxynitrides are used in a variety of applications including photocatalysts,\\nhigh-k dielectrics or wear-resistant coatings and often show intriguing\\nmulti-functionality. To accelerate the co-optimization of the relevant material\\nproperties of these compositionally complex oxynitride systems, high-throughput\\nsynthesis and characterization methods are desirable. In the present work,\\nthree approaches were investigated to obtain orthogonal anion and cation\\ngradients on the same substrate by magnetron sputtering. The different\\napproaches included varying positions of the local reactive gas inlets and\\ndifferent combinations of target materials. The best performing approach was\\napplied to screen a large two-dimensional area of the quaternary phase space\\nwithin the Al-Si-O-N system. This material system is a promising candidate for\\ntransparent protective coatings with variable refractive indices. With only\\nfive depositions of combinatorial libraries, an anion composition range of\\n2-46% O/(N+O) and a cation composition range of 4-44% Si/(Al+Si) is covered.\\nFor lower oxygen and silicon contents, a region with hardness of up to 25 GPa\\nis observed, where the material exhibits either wurtzite AlN or a composite\\nmicrostructure. By increasing the deposition temperature to 400 {\\\\deg}C, an\\nextension of this region can be achieved. At higher oxygen and silicon\\ncontents, the structure of the samples is X-ray amorphous. In this structural\\nregion, an intimate correlation between hardness and refractive index is\\nconfirmed. The results of this study introduce a practical approach to perform\\nhigh-throughput development of mixed anion materials, which is transferable to\\nmany materials systems and applications.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-05-06T15:37:11Z\"}"}
