{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19803v1\", \"title\": \"Unconventional Relaxation Dynamics in Co_8Zn_7Mn_5 and Co_8Zn_8Mn_4:\\n  Evidence of Inertial Effects\", \"summary\": \"Magnetization relaxation dynamics serve as an essential tool for uncovering\\nthe intrinsic mechanisms governing the magnetic response and energy dissipation\\nin magnetic systems. In this work, we examine the relaxation dynamics for Beta\\nMn type Co_8Zn_7Mn_5 and Co_8Zn_8Mn_4 across a frequency range of 1 kHz to 10\\nkHz, spanning different magnetic phases. While most magnetic systems tend to\\nfollow the Debye-like relaxation with non-zero distribution or the Cole-Cole\\nformalism, our analysis reveal that these conventional models fail to capture\\nfrequency dependence of ac susceptibility across different magnetic phases in\\nCo_8Zn_7Mn_5 and Co_8Zn_8Mn_4. Instead, an inertial component is needed to\\nsuccessfully describe the dynamics, suggesting the presence of unconventional\\nrelaxation behavior. The characteristic relaxation time is found to be of the\\norder of 10^-5 s for both the compositions. The field dependent variation of\\nrelaxation time exhibits a non-monotonic nature, with the double peak like\\nstructure at the skyrmion phase transitions, implying slower relaxation\\ndynamics at the phase boundaries. Furthermore, the presence of non-zero\\ndifference between isothermal and adiabatic susceptibility in the pure phases\\nimplies slower relaxation dynamics, which is consistent with the presence of\\nfinite dissipation in pure phases. The inertial term has been previously\\ninvoked to describe the dynamics in spin ice systems due to the propagation of\\nmagnetic monopoles. However, its necessity in this system, points to a wider\\nsignificance in magnetization dynamics that goes beyond the conventional spin\\nices and skyrmions.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,cond-mat.other,cond-mat.str-el,quant-ph\", \"published\": \"2025-04-28T13:55:27Z\"}"}
