{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05286v1\", \"title\": \"HEXGEN-TEXT2SQL: Optimizing LLM Inference Request Scheduling for Agentic\\n  Text-to-SQL Workflow\", \"summary\": \"Recent advances in leveraging the agentic paradigm of large language models\\n(LLMs) utilization have significantly enhanced Text-to-SQL capabilities,\\nenabling users without specialized database expertise to query data\\nintuitively. However, deploying these agentic LLM-based Text-to-SQL systems in\\nproduction poses substantial challenges due to their inherently multi-stage\\nworkflows, stringent latency constraints, and potentially heterogeneous GPU\\ninfrastructure in enterprise environments. Current LLM serving frameworks lack\\neffective mechanisms for handling interdependent inference tasks, dynamic\\nlatency variability, and resource heterogeneity, leading to suboptimal\\nperformance and frequent service-level objective (SLO) violations. In this\\npaper, we introduce HEXGEN-TEXT2SQL, a novel framework designed explicitly to\\nschedule and execute agentic multi-stage LLM-based Text-to-SQL workflows on\\nheterogeneous GPU clusters that handle multi-tenant end-to-end queries.\\nHEXGEN-TEXT2SQL introduce a hierarchical scheduling approach combining global\\nworkload-balanced task dispatching and local adaptive urgency-guided\\nprioritization, guided by a systematic analysis of agentic Text-to-SQL\\nworkflows. Additionally, we propose a lightweight simulation-based method for\\ntuning critical scheduling hyperparameters, further enhancing robustness and\\nadaptability. Our extensive evaluation on realistic Text-to-SQL benchmarks\\ndemonstrates that HEXGEN-TEXT2SQL significantly outperforms state-of-the-art\\nLLM serving frameworks. Specifically, HEXGEN-TEXT2SQL reduces latency deadlines\\nby up to 1.67$\\\\times$ (average: 1.41$\\\\times$) and improves system throughput by\\nup to 1.75$\\\\times$ (average: 1.65$\\\\times$) compared to vLLM under diverse,\\nrealistic workload conditions. Our code is available at\\nhttps://github.com/Relaxed-System-Lab/Hexgen-Flow.\", \"main_category\": \"cs.DB\", \"categories\": \"cs.DB\", \"published\": \"2025-05-08T14:28:47Z\"}"}
