{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12051v1\", \"title\": \"On the calibration of Just-in-time Defect Prediction\", \"summary\": \"Just in time defect prediction (JIT DP) leverages ML to identify defect-prone\\ncode commits, enabling quality assurance (QA) teams to allocate resources more\\nefficiently by focusing on commits that are most likely to contain defects.\\nAlthough JIT DP techniques have introduced improvements in terms of predictive\\naccuracy, they are still susceptible to misclassification errors such as false\\npositives and negatives. This can lead to wasted resources or undetected\\ndefects, a particularly critical concern when QA resources are limited. To\\nmitigate these challenges and preserve the practical utility of JIT DP tools,\\nit becomes essential to estimate the reliability of the predictions, i.e.,\\ncomputing confidence scores. Such scores can help practitioners determine the\\ntrustworthiness of predictions and thus prioritize them efficiently. A simple\\napproach to computing confidence scores is to extract, alongside each\\nprediction, the corresponding prediction probabilities and use them as\\nindicators of confidence. However, for these probabilities to reliably serve as\\nconfidence scores, the predictive model must be well-calibrated. This means\\nthat the prediction probabilities must accurately represent the true likelihood\\nof each prediction being correct. Miscalibration, common in modern ML models,\\ndistorts probability scores such that they do not align with the actual\\ncorrectness probability. In this study, we evaluate the calibration of three\\nJIT DP techniques to determine whether and to what extent they exhibit poor\\ncalibration. Furthermore, we assess whether post-calibration methods can\\nimprove the calibration of existing JIT defect prediction models. Our results\\nreveal that all evaluated JIT DP models exhibit some level of miscalibration,\\nwith ECE ranging from 2-35%. Furthermore, post-calibration methods do not\\nconsistently improve the calibration.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE,cs.LG\", \"published\": \"2025-04-16T13:06:20Z\"}"}
