{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21645v1\", \"title\": \"The effect of neon seeding on plasma edge transport in EAST\", \"summary\": \"The effect of neon seeding on different transport mechanisms in EAST is\\ninvestigated by analyzing SOLPSITER simulations. By evaluating the agreement\\nbetween experimental observations and the performed simulations, four\\nsimulations are selected for a detailed analysis. In this analysis, it is shown\\nthat the presence of neon reduces the influence of drifts on the simulated\\nprofiles. In the simulation results, double peaked profiles/profiles with two\\nvalleys are observed at the divertor targets which can be explained by the\\nparallel drift velocities These drifts move particles from the outboard towards\\nthe inboard side and, in that way, also increase the ionization sources at the\\ninboard side. It is shown that Ne+ leaks towards the core making it difficult\\nto perform experiments which contain as much neon as in the SOLPS-ITER\\nsimulations. In fact, the level of neon in the experiments is limited by the HL\\nbacktransition which takes place if higher order states of neon ionize in the\\ncore and cause in that way too much core radiation. Furthermore, the analysis\\nof the radiated power profiles suggests that the presence of other radiators\\nbesides neon is important to bring the experiments into detachment. The\\nionization of deuterium is the most important neutral reaction present in the\\nsimulations. The amount of ionized deuterium is decreased when large amounts of\\nneon are present and the anomalous transport is modified. Therefore, it is\\nconcluded that for the analyzed simulations, neon increases the radiated power\\nfraction, decreases the deuterium ionization, increases the neutral friction,\\nbut does not manage to cause significant influence of deuterium recombination.\\nAs a consequence, volumetric recombination only plays a minor role in the\\nstudied simulations.\", \"main_category\": \"physics.plasm-ph\", \"categories\": \"physics.plasm-ph\", \"published\": \"2025-04-30T13:48:17Z\"}"}
