{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20479v1\", \"title\": \"Full-field surrogate modeling of cardiac function encoding geometric\\n  variability\", \"summary\": \"Combining physics-based modeling with data-driven methods is critical to\\nenabling the translation of computational methods to clinical use in\\ncardiology. The use of rigorous differential equations combined with machine\\nlearning tools allows for model personalization with uncertainty quantification\\nin time frames compatible with clinical practice. However, accurate and\\nefficient surrogate models of cardiac function, built from physics-based\\nnumerical simulation, are still mostly geometry-specific and require retraining\\nfor different patients and pathological conditions. We propose a novel\\ncomputational pipeline to embed cardiac anatomies into full-field surrogate\\nmodels. We generate a dataset of electrophysiology simulations using a complex\\nmulti-scale mathematical model coupling partial and ordinary differential\\nequations. We adopt Branched Latent Neural Maps (BLNMs) as an effective\\nscientific machine learning method to encode activation maps extracted from\\nphysics-based numerical simulations into a neural network. Leveraging large\\ndeformation diffeomorphic metric mappings, we build a biventricular anatomical\\natlas and parametrize the anatomical variability of a small and challenging\\ncohort of 13 pediatric patients affected by Tetralogy of Fallot. We propose a\\nnovel statistical shape modeling based z-score sampling approach to generate a\\nnew synthetic cohort of 52 biventricular geometries that are compatible with\\nthe original geometrical variability. This synthetic cohort acts as the\\ntraining set for BLNMs. Our surrogate model demonstrates robustness and great\\ngeneralization across the complex original patient cohort, achieving an average\\nadimensional mean squared error of 0.0034. The Python implementation of our\\nBLNM model is publicly available under MIT License at\\nhttps://github.com/StanfordCBCL/BLNM.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.LG\", \"published\": \"2025-04-29T07:22:06Z\"}"}
