{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02483v1\", \"title\": \"Robust direction-dependent gain-calibration of beam-modelling errors far\\n  from the target field\", \"summary\": \"Many astronomical questions require deep, wide-field observations at low\\nradio frequencies. Phased arrays like LOFAR and SKA-low are designed for this,\\nbut have inherently unstable element gains, leading to time, frequency and\\ndirection-dependent gain errors. Precise direction-dependent calibration of\\nobservations is therefore key to reaching the highest possible dynamic range.\\nMany tools for direction-dependent calibration utilise sky and beam models to\\ninfer gains. However, these calibration tools struggle with precision\\ncalibration for relatively bright (e.g. A-team) sources far from the beam\\ncentre. Therefore, the point-spread-function of these sources can potentially\\nobscure a faint signal of interest. We show that, and why, the assumption of a\\nsmooth gain solution per station fails for realistic radio interferometers, and\\nhow this affects gain-calibration results. Subsequently, we introduce an\\nimprovement for smooth spectral gain constraints for direction-dependent\\ngain-calibration algorithms, in which the level of regularisation is weighted\\nby the expected station response to the sky model. We test this method using\\ndirection-dependent calibration method DDECal and physically-motivated beam\\nmodelling errors for LOFAR-HBA stations. The new method outperforms the\\nstandard method for various calibration settings near nulls in the beam, and\\nmatches the standard inverse-variance-weighted method's performance for the\\nremainder of the data. The proposed method is especially effective for short\\nbaselines, both in visibility and image space. Improved direction-dependent\\ngain-calibration is critical for future high-precision SKA-low observations,\\nwhere higher sensitivity, increased antenna beam complexity, and mutual\\ncoupling call for better off-axis source subtraction, which may not be achieved\\nthrough improved beam models alone.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM,astro-ph.CO\", \"published\": \"2025-04-03T11:07:25Z\"}"}
