{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12863v1\", \"title\": \"The impact of ram pressure on cluster galaxies, insights from GAEA and\\n  TNG\", \"summary\": \"Ram pressure stripping (RPS) has a non-negligible impact on the gas content\\nof cluster galaxies. We use the semi-analytic model GAEA and the\\nhydro-simulation TNG to investigate whether cluster galaxies suffer a strong\\nRPS that is sufficient to remove a significant fraction of their gas during the\\nfirst pericentric passage. We estimate that a ram pressure of $10^{-10.5}$,\\n$10^{-12} $, $10^{-13.5} $ $g cm^{-1} s^{-2}$ can remove at most $90\\\\%$,\\n$50\\\\%$, and $20\\\\%$ of the cold gas reservoir from low-mass galaxies with\\n$9<\\\\log M_{\\\\star}/{\\\\rm M}_{\\\\odot} <9.5$, assuming the gas can be stripped\\ninstantaneously. We then use this information to divide the phase space diagram\\ninto `strong', `moderate', `weak', and `no' RPS zones. By tracing the orbit of\\ngalaxies since $2.5R_{vir}$, we find in both GAEA and TNG that about half of\\nthe galaxies in Virgo-like halos ($\\\\log M_h / M_{\\\\odot} \\\\sim 14 $) did not\\nsuffer strong RPS during the first pericentric passage. In Coma-like halos\\n($\\\\log M_h / M_{\\\\odot} \\\\sim 15$), almost all galaxies have suffered strong RPS\\nduring the first pericentric passage, which can remove all gas from low-mass\\ngalaxies but is insufficient to significantly reduce the gas content of more\\nmassive galaxies. In general, results from TNG and GAEA are consistent, with\\nthe RPS being only slightly stronger in TNG than in GAEA. Our findings suggest\\nthat most cluster galaxies will maintain a notable fraction of their gas and\\ncontinue forming stars after the first pericentric passage, except for those\\nwith low stellar mass ($\\\\log M_{\\\\star}/{\\\\rm M}_{\\\\odot} <9.5$) in very massive\\nhalos ($\\\\log M_{h}/{\\\\rm M}_{\\\\odot} > 15$).\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-17T11:41:20Z\"}"}
