{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19787v1\", \"title\": \"Interpretable machine learning-guided design of Fe-based soft magnetic\\n  alloys\", \"summary\": \"We present a machine-learning guided approach to predict saturation\\nmagnetization (MS) and coercivity (HC) in Fe-rich soft magnetic alloys,\\nparticularly Fe-Si-B systems. ML models trained on experimental data reveals\\nthat increasing Si and B content reduces MS from 1.81T (DFT~2.04 T) to ~1.54 T\\n(DFT~1.56T) in Fe-Si-B, which is attributed to decreased magnetic density and\\nstructural modifications. Experimental validation of ML predicted magnetic\\nsaturation on Fe-1Si-1B (2.09T), Fe-5Si-5B (2.01T) and Fe-10Si-10B (1.54T)\\nalloy compositions further support our findings. These trends are consistent\\nwith density functional theory (DFT) predictions, which link increased\\nelectronic disorder and band broadening to lower MS values. Experimental\\nvalidation on selected alloys confirms the predictive accuracy of the ML model,\\nwith good agreement across compositions. Beyond predictive accuracy, detailed\\nuncertainty quantification and model interpretability including through feature\\nimportance and partial dependence analysis reveals that MS is governed by a\\nnonlinear interplay between Fe content, early transition metal ratios, and\\nannealing temperature, while HC is more sensitive to processing conditions such\\nas ribbon thickness and thermal treatment windows. The ML framework was further\\napplied to Fe-Si-B/Cr/Cu/Zr/Nb alloys in a pseudo-quaternary compositional\\nspace, which shows comparable magnetic properties to NANOMET\\n(Fe84.8Si0.5B9.4Cu0.8 P3.5C1), FINEMET (Fe73.5Si13.5B9 Cu1Nb3), NANOPERM\\n(Fe88Zr7B4Cu1), and HITPERM (Fe44Co44Zr7B4Cu1. Our fundings demonstrate the\\npotential of ML framework for accelerated search of high-performance, Co- and\\nNi-free, soft magnetic materials.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,cond-mat.other,cs.LG\", \"published\": \"2025-04-28T13:30:28Z\"}"}
