{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10356v1\", \"title\": \"MultiLoKo: a multilingual local knowledge benchmark for LLMs spanning 31\\n  languages\", \"summary\": \"We present MultiLoKo, a new benchmark for evaluating multilinguality in LLMs\\ncovering 31 languages. MultiLoKo consists of three partitions: a main partition\\nconsisting of 500 questions per language, separately sourced to be locally\\nrelevant to the specific language, and two translated partitions, containing\\nhuman-authored translations from 30 non-English languages to English and vice\\nversa. For comparison, we also release corresponding machine-authored\\ntranslations. The data is equally distributed over two splits: a dev split and\\na blind, out-of-distribution test split. MultiLoKo can be used to study a\\nvariety of questions regarding the multilinguality of LLMs as well as\\nmeta-questions about multilingual benchmark creation. We compute MultiLoKo\\nscores for 11 base and chat models marketed to be multilingual and study their\\naverage performance, their performance parity across languages, how much their\\nability to answer questions depends on the question language, and which\\nlanguages are most difficult. None of the models we studied performs well on\\nMultiLoKo, as indicated by low average scores as well as large differences\\nbetween the best and worst scoring languages. Furthermore, we find a\\nsubstantial effect of the question language, indicating sub-optimal knowledge\\ntransfer between languages. Lastly, we find that using local vs\\nEnglish-translated data can result in differences more than 20 points for the\\nbest performing models, drastically change the estimated difficulty of some\\nlanguages. For using machines instead of human translations, we find a weaker\\neffect on ordering of language difficulty, a larger difference in model\\nrankings, and a substantial drop in estimated performance for all models.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-04-14T16:05:59Z\"}"}
