{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21640v1\", \"title\": \"Compact stellar systems hosting an intermediate mass black hole:\\n  magnetohydrodynamic study of inflow-outflow dynamics\", \"summary\": \"Intermediate-mass black holes (IMBHs) are a missing link in black hole\\ndemographics, with only tentative observational evidence to date. Dense stellar\\nclusters such as IRS 13E near the Galactic Center are promising IMBH hosts,\\nwhere accretion is likely driven by winds from nearby Wolf-Rayet (WR) stars.\\nYet, the dynamics of such wind-fed systems remain largely unexplored. We\\ninvestigate how high-velocity stellar winds, magnetic fields, and\\nmetallicity-dependent radiative cooling influence gas dynamics and black hole\\naccretion in compact WR clusters. Using three-dimensional (magneto)hydrodynamic\\nsimulations, we model each WR star as a source of mass, momentum, energy, and\\nmagnetic flux, and include a cooling function that depends on chemical\\nabundance. We compare isotropic versus disk-like stellar distributions to\\nexplore the impact of cluster geometry. Across all models, we find that the\\naccretion rate onto the IMBH is suppressed by up to five orders of magnitude\\nrelative to the total stellar mass-loss rate. Turbulent, shock-heated outflows\\ndriven by wind-wind collisions dominate the flow, expelling most injected gas.\\nWhile enhanced cooling in high-metallicity runs promotes the formation of dense\\nclumps, these structures are typically unable to reach the black hole. The\\nsystem's integrated X-ray luminosity is dominated by colliding WR winds,\\nmasking the IMBH's radiative signature. Accretion occurs in short-lived,\\nquasi-periodic episodes triggered by close stellar passages, but even these\\nflares remain difficult to detect against the luminous wind background. Our\\nresults naturally explain the low detectability of IMBHs in compact WR clusters\\nand provide theoretical predictions to guide future X-ray and infrared\\nobservational strategies.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-30T13:43:10Z\"}"}
