{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12844v1\", \"title\": \"High-Fidelity Image Inpainting with Multimodal Guided GAN Inversion\", \"summary\": \"Generative Adversarial Network (GAN) inversion have demonstrated excellent\\nperformance in image inpainting that aims to restore lost or damaged image\\ntexture using its unmasked content. Previous GAN inversion-based methods\\nusually utilize well-trained GAN models as effective priors to generate the\\nrealistic regions for missing holes. Despite excellence, they ignore a hard\\nconstraint that the unmasked regions in the input and the output should be the\\nsame, resulting in a gap between GAN inversion and image inpainting and thus\\ndegrading the performance. Besides, existing GAN inversion approaches often\\nconsider a single modality of the input image, neglecting other auxiliary cues\\nin images for improvements. Addressing these problems, we propose a novel GAN\\ninversion approach, dubbed MMInvertFill, for image inpainting. MMInvertFill\\ncontains primarily a multimodal guided encoder with a pre-modulation and a GAN\\ngenerator with F&W+ latent space. Specifically, the multimodal encoder aims to\\nenhance the multi-scale structures with additional semantic segmentation edge\\ntexture modalities through a gated mask-aware attention module. Afterwards, a\\npre-modulation is presented to encode these structures into style vectors. To\\nmitigate issues of conspicuous color discrepancy and semantic inconsistency, we\\nintroduce the F&W+ latent space to bridge the gap between GAN inversion and\\nimage inpainting. Furthermore, in order to reconstruct faithful and\\nphotorealistic images, we devise a simple yet effective Soft-update Mean Latent\\nmodule to capture more diversified in-domain patterns for generating\\nhigh-fidelity textures for massive corruptions. In our extensive experiments on\\nsix challenging datasets, we show that our MMInvertFill qualitatively and\\nquantitatively outperforms other state-of-the-arts and it supports the\\ncompletion of out-of-domain images effectively.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-17T10:58:45Z\"}"}
