{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12999v1\", \"title\": \"GSAC: Leveraging Gaussian Splatting for Photorealistic Avatar Creation\\n  with Unity Integration\", \"summary\": \"Photorealistic avatars have become essential for immersive applications in\\nvirtual reality (VR) and augmented reality (AR), enabling lifelike interactions\\nin areas such as training simulations, telemedicine, and virtual collaboration.\\nThese avatars bridge the gap between the physical and digital worlds, improving\\nthe user experience through realistic human representation. However, existing\\navatar creation techniques face significant challenges, including high costs,\\nlong creation times, and limited utility in virtual applications. Manual\\nmethods, such as MetaHuman, require extensive time and expertise, while\\nautomatic approaches, such as NeRF-based pipelines often lack efficiency,\\ndetailed facial expression fidelity, and are unable to be rendered at a speed\\nsufficent for real-time applications. By involving several cutting-edge modern\\ntechniques, we introduce an end-to-end 3D Gaussian Splatting (3DGS) avatar\\ncreation pipeline that leverages monocular video input to create a scalable and\\nefficient photorealistic avatar directly compatible with the Unity game engine.\\nOur pipeline incorporates a novel Gaussian splatting technique with customized\\npreprocessing that enables the user of \\\"in the wild\\\" monocular video capture,\\ndetailed facial expression reconstruction and embedding within a fully rigged\\navatar model. Additionally, we present a Unity-integrated Gaussian Splatting\\nAvatar Editor, offering a user-friendly environment for VR/AR application\\ndevelopment. Experimental results validate the effectiveness of our\\npreprocessing pipeline in standardizing custom data for 3DGS training and\\ndemonstrate the versatility of Gaussian avatars in Unity, highlighting the\\nscalability and practicality of our approach.\", \"main_category\": \"cs.GR\", \"categories\": \"cs.GR,cs.CV\", \"published\": \"2025-04-17T15:10:14Z\"}"}
