{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03461v1\", \"title\": \"VLBA observations of a sample of low-power compact symmetric objects\", \"summary\": \"Compact symmetric objects (CSOs) are intrinsically compact extragalactic\\nradio sources that are thought to be the progenitors of classical radio\\ngalaxies. To date, evolutionary models have mainly focused on the formation and\\ngrowth of high-power radio sources, leaving unanswered many questions related\\nto low-power objects, whose relativistic jets are likely more prone to\\ninstabilities. We present a new sample of candidate low-power CSOs selected\\nfrom the Faint Images of the Radio Sky at Twenty-cm (FIRST) survey. The main\\nselection criteria are (i) a parsec-scale double radio morphology from archival\\nVery Long Baseline Array (VLBA) images and (ii) a VLBA total flux density\\nconsistent with that from the FIRST survey, which rules out the presence of\\nsignificant radio emission extending beyond the parsec scale. The final sample\\nconsists of 60 sources with radio luminosities between 10$^{24}$ and 10$^{27}$\\nW Hz$^{-1}$ at 1.4 GHz and projected linear sizes between 45 and 430 pc, which\\nfill a region in the radio power-size plane that is currently underpopulated.\\nWe carried out VLBA observations at 4.98 GHz of a sub-sample of 20 sources\\namong the brightest candidate CSOs with the aim of confirming their\\nclassification. We classify 12 sources as CSOs on the basis of their radio\\nstructure and spectral index distribution. In two out of the four CSOs with\\ncore identification, the asymmetry in the flux density of the outer components\\nis in agreement with light travel time effects, and there is no evidence of\\njet-cloud interaction. If we assume a simplistic parametric model, most of the\\nsources in the total sample have a jet power of $\\\\sim 10^{44} - 10^{45}$ erg\\ns$^{-1}$, making their evolutionary paths sensitive to the individual\\nconditions of the jet and its environment.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-05-06T12:01:17Z\"}"}
