{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04965v1\", \"title\": \"Climate adaptation of millet and sorghum varieties in North-Eastern\\n  Senegal: cross-referencing rainfall, thermal and phenological parameters\", \"summary\": \"Millet (Pennisetum glaucum) and sorghum (Sorghum bicolor) are the main\\nrainfed cereals grown in North-Eastern Senegal. However, faced with constraints\\nsuch as falling rainfall, rising temperatures and frequent dry spells, their\\nproduction is tending to decline. This article examines the climatic\\nconstraints and other shocks suffered by rainfed millet varieties Souna__3,\\nICTP 8203, GB 8735, Gawane and Chakti, as well as those as sorghum CE__180-33,\\nPayenne and Golob{\\\\'e}, which are the main varieties released and currently\\ngrown in north-eastern Senegal. Based on data collected in Podor, Matam and\\nLingu{\\\\`e}re, the article analyses the adaptation of different millet and\\nsorghum varieties to climatic condition and their evolution over time The\\nresults show a rainfall deficit since the early 1970s, combined by greater\\nthermal constraints. Analysis of the differences between cumulative rainfall\\nand maximum evapotranspiration for varieties at different growth stages reveals\\nconstant water deficits for Souna__3 millet and CE 180-33 sorghum. In contrast,\\nChakti millet shows positive water balances in over 80% of years in the east\\nand west of the study area, and in 47% of cases in the north. Only Chakti and\\nICTP 8203 are adapted to the climatic conditions of the eastern and western\\nzones, with a probability of suitability of over 80% for the periods 1931-1969\\nand 1999-2020. However, none of the varieties is adapted to the climatic\\nconditions in the north. In addition to these climatic constraints, the\\ninterviewed farmers attribute the decline in agricultural production to\\nlivestock straying, attacks by bird pests and parasitic infestations.\\nexacerbate agricultural losses. It is therefore essential to develop\\ncomplementary strategies including wider dissemination of varieties better\\nadapted to current climatic conditions, such as Chakti and ICTP 8203, and the\\nstrengthening of crop protection systems, notably through biological control\\nand integrated pest management.\", \"main_category\": \"physics.geo-ph\", \"categories\": \"physics.geo-ph\", \"published\": \"2025-04-07T11:52:54Z\"}"}
