{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05328v1\", \"title\": \"SUUM: Timestamp-based Nakamoto-style Blockchains are Vulnerable\", \"summary\": \"We introduce two advanced attack strategies, the Unrestricted Uncle Maker\\n(UUM) Attack and the Staircase-Unrestricted Uncle Maker (SUUM) Attack, which\\nfundamentally threaten the security of timestamp-based Nakamoto-style\\nblockchains by inflicting permanent systemic harm. Unlike prior work that\\nmerely enhances adversarial rewards, these attacks exploit vulnerabilities in\\ntimestamp manipulation and fork selection rules to irreversibly destabilize\\nblockchain fairness and incentive mechanisms. Specifically, the SUUM attack\\nenables adversaries to persistently launch attacks at zero cost, eliminating\\nconstraints on block withholding and risk-free conditions, while systematically\\nmaximizing rewards through coordinated timestamp adjustments and strategic\\nblock release.\\n  Our analysis demonstrates that SUUM adversaries achieve disproportionate\\nreward advantages over both UUM and the original Riskless Uncle Maker (RUM)\\nAttack [CCS '23], with all three strategies surpassing honest mining.\\nCrucially, SUUM's cost-free persistence allows adversaries to indefinitely\\ndrain rewards from honest participants by maintaining minimal difficulty risks\\nthrough precise timestamp manipulation. This creates a self-reinforcing cycle:\\nadversaries amplify their profits while suppressing honest returns, thereby\\npermanently eroding the protocol's security assumptions. Through rigorous\\ntheoretical modeling and simulations, we validate how SUUM's combination of\\ntimestamp tampering, block withholding, and difficulty risk control enables\\nunmitigated exploitation of consensus mechanisms. This work underscores the\\nexistential risks posed by timestamp-based Nakamoto-style protocols and\\nadvocates urgent countermeasures to ensure long-term stability.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.GT\", \"published\": \"2025-05-08T15:20:19Z\"}"}
