{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03562v1\", \"title\": \"Real-Time Person Image Synthesis Using a Flow Matching Model\", \"summary\": \"Pose-Guided Person Image Synthesis (PGPIS) generates realistic person images\\nconditioned on a target pose and a source image. This task plays a key role in\\nvarious real-world applications, such as sign language video generation, AR/VR,\\ngaming, and live streaming. In these scenarios, real-time PGPIS is critical for\\nproviding immediate visual feedback and maintaining user immersion.However,\\nachieving real-time performance remains a significant challenge due to the\\ncomplexity of synthesizing high-fidelity images from diverse and dynamic human\\nposes. Recent diffusion-based methods have shown impressive image quality in\\nPGPIS, but their slow sampling speeds hinder deployment in time-sensitive\\napplications. This latency is particularly problematic in tasks like generating\\nsign language videos during live broadcasts, where rapid image updates are\\nrequired. Therefore, developing a fast and reliable PGPIS model is a crucial\\nstep toward enabling real-time interactive systems. To address this challenge,\\nwe propose a generative model based on flow matching (FM). Our approach enables\\nfaster, more stable, and more efficient training and sampling. Furthermore, the\\nproposed model supports conditional generation and can operate in latent space,\\nmaking it especially suitable for real-time PGPIS applications where both speed\\nand quality are critical. We evaluate our proposed method, Real-Time Person\\nImage Synthesis Using a Flow Matching Model (RPFM), on the widely used\\nDeepFashion dataset for PGPIS tasks. Our results show that RPFM achieves\\nnear-real-time sampling speeds while maintaining performance comparable to the\\nstate-of-the-art models. Our methodology trades off a slight, acceptable\\ndecrease in generated-image accuracy for over a twofold increase in generation\\nspeed, thereby ensuring real-time performance.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-05-06T14:13:44Z\"}"}
