{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14975v1\", \"title\": \"Cyc3D: Fine-grained Controllable 3D Generation via Cycle Consistency\\n  Regularization\", \"summary\": \"Despite the remarkable progress of 3D generation, achieving controllability,\\ni.e., ensuring consistency between generated 3D content and input conditions\\nlike edge and depth, remains a significant challenge. Existing methods often\\nstruggle to maintain accurate alignment, leading to noticeable discrepancies.\\nTo address this issue, we propose \\\\name{}, a new framework that enhances\\ncontrollable 3D generation by explicitly encouraging cyclic consistency between\\nthe second-order 3D content, generated based on extracted signals from the\\nfirst-order generation, and its original input controls. Specifically, we\\nemploy an efficient feed-forward backbone that can generate a 3D object from an\\ninput condition and a text prompt. Given an initial viewpoint and a control\\nsignal, a novel view is rendered from the generated 3D content, from which the\\nextracted condition is used to regenerate the 3D content. This re-generated\\noutput is then rendered back to the initial viewpoint, followed by another\\nround of control signal extraction, forming a cyclic process with two\\nconsistency constraints. \\\\emph{View consistency} ensures coherence between the\\ntwo generated 3D objects, measured by semantic similarity to accommodate\\ngenerative diversity. \\\\emph{Condition consistency} aligns the final extracted\\nsignal with the original input control, preserving structural or geometric\\ndetails throughout the process. Extensive experiments on popular benchmarks\\ndemonstrate that \\\\name{} significantly improves controllability, especially for\\nfine-grained details, outperforming existing methods across various conditions\\n(e.g., +14.17\\\\% PSNR for edge, +6.26\\\\% PSNR for sketch).\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-21T09:05:52Z\"}"}
