{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15921v1\", \"title\": \"ViSMaP: Unsupervised Hour-long Video Summarisation by Meta-Prompting\", \"summary\": \"We introduce ViSMap: Unsupervised Video Summarisation by Meta Prompting, a\\nsystem to summarise hour long videos with no-supervision. Most existing video\\nunderstanding models work well on short videos of pre-segmented events, yet\\nthey struggle to summarise longer videos where relevant events are sparsely\\ndistributed and not pre-segmented. Moreover, long-form video understanding\\noften relies on supervised hierarchical training that needs extensive\\nannotations which are costly, slow and prone to inconsistency. With ViSMaP we\\nbridge the gap between short videos (where annotated data is plentiful) and\\nlong ones (where it's not). We rely on LLMs to create optimised\\npseudo-summaries of long videos using segment descriptions from short ones.\\nThese pseudo-summaries are used as training data for a model that generates\\nlong-form video summaries, bypassing the need for expensive annotations of long\\nvideos. Specifically, we adopt a meta-prompting strategy to iteratively\\ngenerate and refine creating pseudo-summaries of long videos. The strategy\\nleverages short clip descriptions obtained from a supervised short video model\\nto guide the summary. Each iteration uses three LLMs working in sequence: one\\nto generate the pseudo-summary from clip descriptions, another to evaluate it,\\nand a third to optimise the prompt of the generator. This iteration is\\nnecessary because the quality of the pseudo-summaries is highly dependent on\\nthe generator prompt, and varies widely among videos. We evaluate our summaries\\nextensively on multiple datasets; our results show that ViSMaP achieves\\nperformance comparable to fully supervised state-of-the-art models while\\ngeneralising across domains without sacrificing performance. Code will be\\nreleased upon publication.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-22T14:06:01Z\"}"}
