{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15982v1\", \"title\": \"The effects of transport processes on the bulk composition of the first\\n  generation of planetesimals interior to the water iceline\", \"summary\": \"The CHNOS elemental budgets of rocky planets are crucial for their structure,\\nevolution and potential chemical habitability. It is unclear how the nonlocal\\ndisk processes affecting dust in planet-forming disks affect the CHNOS\\nelemental budgets of nascent planets both inside and outside the Solar System.\\nWe aim to quantify the coupled effect of dynamical and collisional processes on\\nthe initial refractory CHNOS budgets of planetesimals, forming interior to the\\nwater ice line for a Solar and non-Solar composition consistent with the star\\nHIP 43393. Methods. We utilize the SHAMPOO code to track the effects of\\ndynamical and collisional processes on 16000 individual dust monomers. Each\\nmonomer is here assigned a refractory chemical composition and mineralogy\\ninformed by the equilibrium condensation code GGCHEM given the P-T conditions\\nat the initial position of the monomer. Monomers travel embedded in aggregates\\nthrough a young class I disk, whose structure is calculated with the ProDiMo\\ncode. Furthermore, monomers are allowed to undergo dehydration and\\ndesulfurization. We find that solid material becomes well-mixed both radially\\nand vertically. For both the Solar and HIP43393 compositions, the solid phase\\nin the disk midplane regions interior to r~0.7AU can become enriched in\\nhydrogen and sulfur by up to 10at% relative to predictions from purely local\\ncalculations. This originates from the inward radial transport of hydrated and\\nsulfur-bearing minerals such as lizardite and iron sulfide. Nonlocal disk\\nprocessing in a young turbulent, massive disk can lead to significant\\ncompositional homogenization of the midplane dust and by extension of the\\ninitial composition of planetesimals. Planetesimals forming at r<0.7AU may\\nbecome enriched in hydrated minerals and sulfur, which could result in more\\nwidespread aqueous alteration interior to the water iceline compared to\\nplanetesimals that emerge...\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-22T15:32:56Z\"}"}
