{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20565v1\", \"title\": \"DLCM: a versatile multi-level solver for heterogeneous multicellular\\n  systems\", \"summary\": \"Computational modeling of multicellular systems may aid in untangling\\ncellular dynamics and emergent properties of biological cell populations. A key\\nchallenge is to balance the level of model detail and the computational\\nefficiency, while using physically interpretable parameters to facilitate\\nmeaningful comparisons with biological data.\\n  For this purpose, we present the DLCM-solver (discrete Laplacian cell\\nmechanics), a flexible and efficient computational solver for spatial and\\nstochastic simulations of populations of cells, developed from first principle\\nto support mechanistic investigations. The solver has been designed as a module\\nin URDME, the unstructured reaction-diffusion master equation open software\\nframework, to allow for the integration of intra-cellular models with\\nextra-cellular features handled by the DLCM. The solver manages discrete cells\\non a fixed lattice and reaction-transport events in a continuous-time Markov\\nchain. Space-continuous micro-environment quantities such as pressure and\\nchemical substances are supported by the framework, permitting a variety of\\nmodeling choices concerning chemotaxis, mechanotaxis, nutrient-driven cell\\ngrowth and death, among others.\\n  An essential and novel feature of the DLCM-solver is the coupling of cellular\\npressure to the curvature of the cell populations by elliptic projection onto\\nthe computational grid, with which we can include effects from surface tension\\nbetween populations.\\n  We demonstrate the flexibility of the framework by implementing benchmark\\nproblems of cell sorting, cellular signaling, tumor growth, and chemotaxis\\nmodels. We additionally formally analyze the computational complexity and show\\nthat it is theoretically optimal for systems based on pressure-driven cell\\nmigration. In summary, the solver balances efficiency and a relatively fine\\nresolution, while supporting a high level of interpretability.\", \"main_category\": \"q-bio.QM\", \"categories\": \"q-bio.QM,q-bio.PE\", \"published\": \"2025-04-29T09:12:16Z\"}"}
