{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10078v1\", \"title\": \"Unleashing Expert Opinion from Social Media for Stock Prediction\", \"summary\": \"While stock prediction task traditionally relies on volume-price and\\nfundamental data to predict the return ratio or price movement trend, sentiment\\nfactors derived from social media platforms such as StockTwits offer a\\ncomplementary and useful source of real-time market information. However, we\\nfind that most social media posts, along with the public sentiment they\\nreflect, provide limited value for trading predictions due to their noisy\\nnature. To tackle this, we propose a novel dynamic expert tracing algorithm\\nthat filters out non-informative posts and identifies both true and inverse\\nexperts whose consistent predictions can serve as valuable trading signals. Our\\napproach achieves significant improvements over existing expert identification\\nmethods in stock trend prediction. However, when using binary expert\\npredictions to predict the return ratio, similar to all other expert\\nidentification methods, our approach faces a common challenge of signal\\nsparsity with expert signals cover only about 4% of all stock-day combinations\\nin our dataset. To address this challenge, we propose a dual graph attention\\nneural network that effectively propagates expert signals across related\\nstocks, enabling accurate prediction of return ratios and significantly\\nincreasing signal coverage. Empirical results show that our propagated\\nexpert-based signals not only exhibit strong predictive power independently but\\nalso work synergistically with traditional financial features. These combined\\nsignals significantly outperform representative baseline models in all\\nquant-related metrics including predictive accuracy, return metrics, and\\ncorrelation metrics, resulting in more robust investment strategies. We hope\\nthis work inspires further research into leveraging social media data for\\nenhancing quantitative investment strategies. The code can be seen in\\nhttps://github.com/wanyunzh/DualGAT.\", \"main_category\": \"cs.CE\", \"categories\": \"cs.CE\", \"published\": \"2025-04-14T10:23:10Z\"}"}
