{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09949v1\", \"title\": \"Pseudo-Label Guided Real-World Image De-weathering: A Learning Framework\\n  with Imperfect Supervision\", \"summary\": \"Real-world image de-weathering aims at removingvarious undesirable\\nweather-related artifacts, e.g., rain, snow,and fog. To this end, acquiring\\nideal training pairs is crucial.Existing real-world datasets are typically\\nconstructed paired databy extracting clean and degraded images from live\\nstreamsof landscape scene on the Internet. Despite the use of strictfiltering\\nmechanisms during collection, training pairs inevitablyencounter inconsistency\\nin terms of lighting, object position, scenedetails, etc, making de-weathering\\nmodels possibly suffer fromdeformation artifacts under non-ideal supervision.\\nIn this work,we propose a unified solution for real-world image\\nde-weatheringwith non-ideal supervision, i.e., a pseudo-label guided\\nlearningframework, to address various inconsistencies within the realworld\\npaired dataset. Generally, it consists of a de-weatheringmodel (De-W) and a\\nConsistent Label Constructor (CLC), bywhich restoration result can be\\nadaptively supervised by originalground-truth image to recover sharp textures\\nwhile maintainingconsistency with the degraded inputs in non-weather\\ncontentthrough the supervision of pseudo-labels. Particularly, a Crossframe\\nSimilarity Aggregation (CSA) module is deployed withinCLC to enhance the\\nquality of pseudo-labels by exploring thepotential complementary information of\\nmulti-frames throughgraph model. Moreover, we introduce an Information\\nAllocationStrategy (IAS) to integrate the original ground-truth imagesand\\npseudo-labels, thereby facilitating the joint supervision forthe training of\\nde-weathering model. Extensive experimentsdemonstrate that our method exhibits\\nsignificant advantageswhen trained on imperfectly aligned de-weathering\\ndatasets incomparison with other approaches.\", \"main_category\": \"cs.GR\", \"categories\": \"cs.GR,cs.CV\", \"published\": \"2025-04-14T07:24:03Z\"}"}
