{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07717v1\", \"title\": \"PR-Attack: Coordinated Prompt-RAG Attacks on Retrieval-Augmented\\n  Generation in Large Language Models via Bilevel Optimization\", \"summary\": \"Large Language Models (LLMs) have demonstrated remarkable performance across\\na wide range of applications, e.g., medical question-answering, mathematical\\nsciences, and code generation. However, they also exhibit inherent limitations,\\nsuch as outdated knowledge and susceptibility to hallucinations.\\nRetrieval-Augmented Generation (RAG) has emerged as a promising paradigm to\\naddress these issues, but it also introduces new vulnerabilities. Recent\\nefforts have focused on the security of RAG-based LLMs, yet existing attack\\nmethods face three critical challenges: (1) their effectiveness declines\\nsharply when only a limited number of poisoned texts can be injected into the\\nknowledge database, (2) they lack sufficient stealth, as the attacks are often\\ndetectable by anomaly detection systems, which compromises their effectiveness,\\nand (3) they rely on heuristic approaches to generate poisoned texts, lacking\\nformal optimization frameworks and theoretic guarantees, which limits their\\neffectiveness and applicability. To address these issues, we propose\\ncoordinated Prompt-RAG attack (PR-attack), a novel optimization-driven attack\\nthat introduces a small number of poisoned texts into the knowledge database\\nwhile embedding a backdoor trigger within the prompt. When activated, the\\ntrigger causes the LLM to generate pre-designed responses to targeted queries,\\nwhile maintaining normal behavior in other contexts. This ensures both high\\neffectiveness and stealth. We formulate the attack generation process as a\\nbilevel optimization problem leveraging a principled optimization framework to\\ndevelop optimal poisoned texts and triggers. Extensive experiments across\\ndiverse LLMs and datasets demonstrate the effectiveness of PR-Attack, achieving\\na high attack success rate even with a limited number of poisoned texts and\\nsignificantly improved stealth compared to existing methods.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.AI\", \"published\": \"2025-04-10T13:09:50Z\"}"}
