{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20538v1\", \"title\": \"Molecular gas in cool-core brightest cluster galaxies at $z\\\\simeq0.4$\", \"summary\": \"Brightest cluster galaxies (BCG) are today passive and very massive galaxies\\nat the center of their clusters, still accreting mass through swallowing\\ncompanions, and flows of cold gas, regulated by radio-mode active galactic\\nnucleus (AGN) feedback. However, their formation history is still a matter of\\ndebate. We report new results based on millimeter observations performed with\\nthe Northern Extended Millimeter Array (NOEMA) interferometer, mapping the cold\\nmolecular gas (CO) that feeds the star formation of distant BCGs. We selected\\nthree among the strongest cool-core BCGs at intermediate redshifts\\n($z\\\\simeq0.4$), namely RX 1532, MACS 1447, and CHIPS 1911. Previous unresolved\\nmillimeter observations and multi-wavelength analysis showed that they are\\namong the most star forming (${\\\\rm SFR}\\\\simeq100~ M_\\\\odot/{\\\\rm yr}$) and gas\\nrich ($M_{H_2}\\\\simeq10^{11}~M_\\\\odot$) BCGs at intermediate redshifts. The\\nselected BCGs are thus caught in a phase of rapid mass assembly, which makes\\nthem ideal targets for high-resolution observations of their molecular gas. By\\ncombining NOEMA intensity and velocity maps with archival images from the\\nHubble Space Telescope, we detect in-situ star formation, filaments of\\naccreting cold gas likely regulated by AGN feedback, disturbed morphology\\nassociated with tidal tails of molecular gas, as well as gas compression and\\ntails originated from stripping of gas. While effective condensation of the\\nintra-cluster medium is required to explain the large molecular gas reservoirs,\\nthe BCGs exhibit a broad variety of environment-driven mechanisms responsible\\nfor the processing of their cold gas: flows of cooling gas (RX 1532), ram\\npressure or sloshing of the intra-cluster medium (MACS 1447), and galactic\\ntides (CHIPS 1911). This study thus sheds new insights on the physical\\nmechanisms responsible for the mass assembly of galaxies hosting AGN at the\\ncenter of clusters.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-29T08:31:45Z\"}"}
