{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10842v1\", \"title\": \"A comprehensive review of remote sensing in wetland classification and\\n  mapping\", \"summary\": \"Wetlands constitute critical ecosystems that support both biodiversity and\\nhuman well-being; however, they have experienced a significant decline since\\nthe 20th century. Back in the 1970s, researchers began to employ remote sensing\\ntechnologies for wetland classification and mapping to elucidate the extent and\\nvariations of wetlands. Although some review articles summarized the\\ndevelopment of this field, there is a lack of a thorough and in-depth\\nunderstanding of wetland classification and mapping: (1) the scientific\\nimportance of wetlands, (2) major data, methods used in wetland classification\\nand mapping, (3) driving factors of wetland changes, (4) current research\\nparadigm and limitations, (5) challenges and opportunities in wetland\\nclassification and mapping under the context of technological innovation and\\nglobal environmental change. In this review, we aim to provide a comprehensive\\nperspective and new insights into wetland classification and mapping for\\nreaders to answer these questions. First, we conduct a meta-analysis of over\\n1,200 papers, encompassing wetland types, methods, sensor types, and study\\nsites, examining prevailing trends in wetland classification and mapping. Next,\\nwe review and synthesize the wetland features and existing data and methods in\\nwetland classification and mapping. We also summarize typical wetland mapping\\nproducts and explore the intrinsic driving factors of wetland changes across\\nmultiple spatial and temporal scales. Finally, we discuss current limitations\\nand propose future directions in response to global environmental change and\\ntechnological innovation. This review consolidates our understanding of wetland\\nremote sensing and offers scientific recommendations that foster transformative\\nprogress in wetland science.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,eess.IV\", \"published\": \"2025-04-15T03:59:36Z\"}"}
