{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11901v1\", \"title\": \"Causality-enhanced Decision-Making for Autonomous Mobile Robots in\\n  Dynamic Environments\", \"summary\": \"The growing integration of robots in shared environments -- such as\\nwarehouses, shopping centres, and hospitals -- demands a deep understanding of\\nthe underlying dynamics and human behaviours, including how, when, and where\\nindividuals engage in various activities and interactions. This knowledge goes\\nbeyond simple correlation studies and requires a more comprehensive causal\\nanalysis. By leveraging causal inference to model cause-and-effect\\nrelationships, we can better anticipate critical environmental factors and\\nenable autonomous robots to plan and execute tasks more effectively. To this\\nend, we propose a novel causality-based decision-making framework that reasons\\nover a learned causal model to predict battery usage and human obstructions,\\nunderstanding how these factors could influence robot task execution. Such\\nreasoning framework assists the robot in deciding when and how to complete a\\ngiven task. To achieve this, we developed also PeopleFlow, a new Gazebo-based\\nsimulator designed to model context-sensitive human-robot spatial interactions\\nin shared workspaces. PeopleFlow features realistic human and robot\\ntrajectories influenced by contextual factors such as time, environment layout,\\nand robot state, and can simulate a large number of agents. While the simulator\\nis general-purpose, in this paper we focus on a warehouse-like environment as a\\ncase study, where we conduct an extensive evaluation benchmarking our causal\\napproach against a non-causal baseline. Our findings demonstrate the efficacy\\nof the proposed solutions, highlighting how causal reasoning enables autonomous\\nrobots to operate more efficiently and safely in dynamic environments shared\\nwith humans.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.AI\", \"published\": \"2025-04-16T09:26:04Z\"}"}
