{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01374v1\", \"title\": \"The Multifractal IP Address Structure: Physical Explanation and\\n  Implications\", \"summary\": \"The structure of IP addresses observed in Internet traffic plays a critical\\nrole for a wide range of networking problems of current interest. For example,\\nmodern network telemetry systems that take advantage of existing data plane\\ntechnologies for line rate traffic monitoring and processing cannot afford to\\nwaste precious data plane resources on traffic that comes from \\\"uninteresting\\\"\\nregions of the IP address space. However, there is currently no\\nwell-established structural model or analysis toolbox that enables a\\nfirst-principles approach to the specific problem of identifying\\n\\\"uninteresting\\\" regions of the address space or the myriad of other networking\\nproblems that prominently feature IP addresses.\\n  To address this key missing piece, we present in this paper a\\nfirst-of-its-kind empirically validated physical explanation for why the\\nobserved IP address structure in measured Internet traffic is multifractal in\\nnature. Our root cause analysis overcomes key limitations of mostly forgotten\\nfindings from ~20 years ago and demonstrates that the Internet processes and\\nmechanisms responsible for how IP addresses are allocated, assigned, and used\\nin today's Internet are consistent with and well modeled by a class of\\nevocative mathematical models called conservative cascades. We complement this\\nroot cause analysis with the development of an improved toolbox that is\\ntailor-made for analyzing finite and discrete sets of IP addresses and includes\\nstatistical estimators that engender high confidence in the inferences they\\nproduce. We illustrate the use of this toolbox in the context of a novel\\naddress structure anomaly detection method we designed and conclude with a\\ndiscussion of a range of challenging open networking problems that are\\nmotivated or inspired by our findings.\", \"main_category\": \"cs.NI\", \"categories\": \"cs.NI\", \"published\": \"2025-04-02T05:36:10Z\"}"}
