{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24154v1\", \"title\": \"Non-linear saturation of gravito-inertial modes excited by tidal\\n  resonances in binary neutron stars\", \"summary\": \"During the last seconds of a binary neutron-star merger, the tidal force can\\nexcite stellar oscillation modes to large amplitudes. From the perspective of\\npremerger electromagnetic emissions and next-generation gravitational-wave\\ndetectors, gravity ($g-$) modes constitute a propitious class. However,\\nexisting estimates for their impact employ linear schemes which may be\\ninaccurate for large amplitudes, as achieved by tidal resonances. With\\nrotation, inertial modes can be excited as well and while their non-linear\\nsaturation has been studied, an extension to fully-consistent gravito-inertial\\nmodes, especially in the neutron-star context, is an open problem. We study the\\nlinear and non-linear saturation of gravito-inertial modes and investigate the\\nastrophysical consequences for binary neutron-star mergers, including the\\npossibility of resonance-induced dynamo activity. A new (non-)linear\\nformulation based on the separation of equilibrium and dynamical tides is\\ndeveloped. Implementing this into the 3D pseudo-spectral code MagIC, a suite of\\nnon-linear simulations of tidally-excited flows with an entropy/composition\\ngradient in a stably-stratified Boussinesq spherical-shell are carried out. The\\nnew formulation accurately reproduces results of linear calculations for\\ngravito-inertial modes with a free surface for low frequencies. For a\\nconstant-density cavity, we show that the axisymmetric differential rotation\\ninduced by nonlinear $_2g$ and $_1g$ modes may theoretically be large enough to\\namplify an ambient magnetic field to $\\\\gtrsim 10^{14}$ G. In addition, rich\\nnon-linear dynamics are observed in the form of a parametric instability for\\nthe $_1g$ mode. The stars are also spun-up, which extends the resonance window\\nfor any given mode.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.SR,gr-qc\", \"published\": \"2025-03-31T14:38:43Z\"}"}
