{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17606v1\", \"title\": \"From surface roughness to crater formation in a 2D multi-scale\\n  simulation of ultrashort pulse laser ablation\", \"summary\": \"Surface roughness plays a critical role in ultrashort pulse laser ablation,\\nparticularly for industrial applications using burst mode operations,\\nmulti-pulse laser processing, and the generation of laser-induced periodic\\nsurface structures. Hence, we address the impact of surface roughness on the\\nresulting laser ablation topography predicted by a simulation model and\\ncompared to experimental results. We present a comprehensive multi-scale\\nsimulation framework that first employs finite-difference-time-domain\\nsimulations for calculating the surface fluence distribution on a rough surface\\nmeasured by an atomic-force-microscope followed by the two-temperature model\\ncoupled with hydrodynamic/solid mechanics simulation for the initial material\\nheating. Lastly, a computational fluid dynamics model for material relaxation\\nand fluid flow is developed and employed. Final state results of aluminum and\\nAISI 304 stainless steel simulations demonstrated alignment with established\\nablation models and crater dimension prediction. Notably, Al exhibited\\nsignificant optical scattering effects due to initial surface roughness of 15\\nnm - being 70 times below the laser wavelength, leading to localized, selective\\nablation processes and substantially altered crater topography compared to\\nidealized conditions. Contrary, AISI 304 with RMS roughness of 2 nm showed no\\ndifference. Hence, we highlight the necessity of incorporating realistic,\\nmaterial-specific surface roughness values into large-scale ablation\\nsimulations. Furthermore, the induced local fluence variations demonstrated the\\ninadequacy of neglecting lateral heat transport effects in this context.\", \"main_category\": \"hep-ex\", \"categories\": \"hep-ex,cond-mat.mtrl-sci\", \"published\": \"2025-04-24T14:29:33Z\"}"}
