{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12266v1\", \"title\": \"Semiparametric Dynamic Copula Models for Portfolio Optimization\", \"summary\": \"The mean-variance portfolio model, based on the risk-return trade-off for\\noptimal asset allocation, remains foundational in portfolio optimization.\\nHowever, its reliance on restrictive assumptions about asset return\\ndistributions limits its applicability to real-world data. Parametric copula\\nstructures provide a novel way to overcome these limitations by accounting for\\nasymmetry, heavy tails, and time-varying dependencies. Existing methods have\\nbeen shown to rely on fixed or static dependence structures, thus overlooking\\nthe dynamic nature of the financial market. In this study, a semiparametric\\nmodel is proposed that combines non-parametrically estimated copulas with\\nparametrically estimated marginals to allow all parameters to dynamically\\nevolve over time. A novel framework was developed that integrates time-varying\\ndependence modeling with flexible empirical beta copula structures. Marginal\\ndistributions were modeled using the Skewed Generalized T family. This\\neffectively captures asymmetry and heavy tails and makes the model suitable for\\npredictive inferences in real world scenarios. Furthermore, the model was\\napplied to rolling windows of financial returns from the USA, India and Hong\\nKong economies to understand the influence of dynamic market conditions. The\\napproach addresses the limitations of models that rely on parametric\\nassumptions. By accounting for asymmetry, heavy tails, and cross-correlated\\nasset prices, the proposed method offers a robust solution for optimizing\\ndiverse portfolios in an interconnected financial market. Through adaptive\\nmodeling, it allows for better management of risk and return across varying\\neconomic conditions, leading to more efficient asset allocation and improved\\nportfolio performance.\", \"main_category\": \"q-fin.PM\", \"categories\": \"q-fin.PM,stat.AP\", \"published\": \"2025-04-16T17:27:52Z\"}"}
