{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16607v1\", \"title\": \"Path Matters: Industrial Data Meet Quantum Optimization\", \"summary\": \"Real-world optimization problems must undergo a series of transformations\\nbefore becoming solvable on current quantum hardware. Even for a fixed problem,\\nthe number of possible transformation paths -- from industry-relevant\\nformulations through binary constrained linear programs (BILPs), to quadratic\\nunconstrained binary optimization (QUBO), and finally to a hardware-executable\\nrepresentation -- is remarkably large. Each step introduces free parameters,\\nsuch as Lagrange multipliers, encoding strategies, slack variables, rounding\\nschemes or algorithmic choices -- making brute-force exploration of all paths\\nintractable. In this work, we benchmark a representative subset of these\\ntransformation paths using a real-world industrial production planning problem\\nwith industry data: the optimization of work allocation in a press shop\\nproducing vehicle parts. We focus on QUBO reformulations and algorithmic\\nparameters for both quantum annealing (QA) and the Linear Ramp Quantum\\nApproximate Optimization Algorithm (LR-QAOA). Our goal is to identify a reduced\\nset of effective configurations applicable to similar industrial settings. Our\\nresults show that QA on D-Wave hardware consistently produces near-optimal\\nsolutions, whereas LR-QAOA on IBM quantum devices struggles to reach comparable\\nperformance. Hence, the choice of hardware and solver strategy significantly\\nimpacts performance. The problem formulation and especially the penalization\\nstrategy determine the solution quality. Most importantly,\\nmathematically-defined penalization strategies are equally successful as\\nhand-picked penalty factors, paving the way for automated QUBO formulation.\\nMoreover, we observe a strong correlation between simulated and quantum\\nannealing performance metrics, offering a scalable proxy for predicting QA\\nbehavior on larger problem instances.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-23T10:45:38Z\"}"}
