{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20618v1\", \"title\": \"Statistical Channel Based Low-Complexity Rotation and Position\\n  Optimization for 6D Movable Antennas Enabled Wireless Communication\", \"summary\": \"Six-dimensional movable antenna (6DMA) is a promising technology to fully\\nexploit spatial variation in wireless channels by allowing flexible adjustment\\nof three-dimensional (3D) positions and rotations of antennas at the\\ntransceiver. In this paper, we investigate the practical low-complexity design\\nof 6DMA-enabled communication systems, including transmission protocol,\\nstatistical channel information (SCI) acquisition, and joint position and\\nrotation optimization of 6DMA surfaces based on the SCI of users. Specifically,\\nan orthogonal matching pursuit (OMP)-based algorithm is proposed for the\\nestimation of SCI of users at all possible position-rotation pairs of 6DMA\\nsurfaces based on the channel measurements at a small subset of\\nposition-rotation pairs. Then, the average sum logarithmic rate of all users is\\nmaximized by jointly designing the positions and rotations of 6DMA surfaces\\nbased on their SCI acquired. Different from prior works on 6DMA which adopt\\nalternating optimization to design 6DMA positions/rotations with iterations, we\\npropose a new sequential optimization approach that first determines 6DMA\\nrotations and then finds their feasible positions to realize the optimized\\nrotations subject to practical antenna placement constraints. Simulation\\nresults show that the proposed sequential optimization significantly reduces\\nthe computational complexity of conventional alternating optimization, while\\nachieving comparable communication performance. It is also shown that the\\nproposed SCI-based 6DMA design can effectively enhance the communication\\nthroughput of wireless networks over existing fixed (position and rotation)\\nantenna arrays, yet with a practically appealing low-complexity implementation.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,eess.SP,math.IT\", \"published\": \"2025-04-29T10:37:34Z\"}"}
