{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02415v1\", \"title\": \"Unveiling Spatiotemporal Properties of the Quasi-periodic Pulsations in\\n  the Balmer Continuum at 3600 \\u00c5 in an X-class Solar White-light Flare\", \"summary\": \"Quasi-periodic pulsations (QPPs) in the Balmer continuum of solar white-light\\nflares (WLFs) are rarely reported, and accurately pinpointing the spatial\\nsource of flaring QPPs remains a significant challenge. We present\\nspatiotemporal characteristics of QPPs of an X2.8 two-ribbon solar WLF\\n(SOL2023-12-14T17:02), which was well observed by the White-light Solar\\nTelescope (WST) aboard the Advanced Space-based Solar Observatory, with\\nhigh-cadence imaging (1--2 s) in the Balmer continuum at 3600 \\\\AA. Combined\\nwith additional multi-instrument data, we find that the enhancement of the WLF\\nin both Balmer and Paschen continua shows strong spatiotemporal correlation\\nwith hard X-ray (HXR) emissions. Notably, the pulses in the WST Balmer\\ncontinuum exhibited a near-zero time lag with most HXR pulses, whereas soft\\nX-ray and extreme ultraviolet emissions showed a lag of 2--3 s. Interestingly,\\nquasi-harmonic QPPs with periods of $\\\\sim$11 s and $\\\\sim$20 s were observed in\\nmultiple wavelengths in the rising phase of the white-light continuum.\\nFurthermore, we employed Fourier transform to spatially locate the QPPs around\\n11 and 20 s, revealing that they primarily originated from the east flare\\nribbon, which exhibited the most substantial continuum enhancement. More\\ninterestingly, we find that the west ribbon contributed significantly to the\\n11-second QPP but had a weaker contribution to the 20-second QPP. Moreover, the\\noccurrence of quasi-harmonic QPPs is temporally coincident with the rapid\\nelongation and separation motions of flare ribbons. Possible mechanisms for the\\nquasi-harmonic QPPs have been discussed. These observations provide valuable\\ninsights into QPP modeling for solar and stellar flares.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,J.2\", \"published\": \"2025-04-03T09:12:01Z\"}"}
