{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01939v1\", \"title\": \"Laboratory evaluation of a wearable instrumented headband for rotational\\n  head kinematics measurement\", \"summary\": \"Mild traumatic brain injuries (mTBI) are a highly prevalent condition with\\nheterogeneous outcomes between individuals. A key factor governing brain tissue\\ndeformation and the risk of mTBI is the rotational kinematics of the head.\\nInstrumented mouthguards are a widely accepted method for measuring rotational\\nhead motions, owing to their robust sensor-skull coupling. However, wearing\\nmouthguards is not feasible in all situations, especially for long-term data\\ncollection. Therefore, alternative wearable devices are needed. In this study,\\nwe present an improved design and data processing scheme for an instrumented\\nheadband. Our instrumented headband utilizes an array of inertial measurement\\nunits (IMUs) and a new data-processing scheme based on continuous wavelet\\ntransforms to address sources of error in the IMU measurements. The headband\\nperformance was evaluated in the laboratory on an anthropomorphic test device,\\nwhich was impacted with a soccer ball to replicate soccer heading. When\\ncomparing the measured peak rotational velocities (PRV) and peak rotational\\naccelerations (PRA) between the reference sensors and the headband for impacts\\nto the front of the head, the correlation coefficients (r) were 0.80 and 0.63,\\nand the normalized root mean square error (NRMSE) values were 0.20 and 0.28,\\nrespectively. However, when considering all impact locations, r dropped to 0.42\\nand 0.34 and NRMSE increased to 0.5 and 0.41 for PRV and PRA, respectively.\\nThis new instrumented headband improves upon previous headband designs in\\nreconstructing the rotational head kinematics resulting from frontal soccer\\nball impacts, providing a potential alternative to instrumented mouthguards.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-02T17:47:07Z\"}"}
