{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16572v1\", \"title\": \"Bridging Data Gaps and Building Knowledge Networks in Indian Football\\n  Analytics\", \"summary\": \"The global rise of football analytics has rapidly transformed how clubs make\\nstrategic decisions. However, in India, the adoption of analytics remains\\nconstrained by institutional resistance, infrastructural limitations, and\\ncultural barriers -- challenges that grassroots innovation and low-cost data\\nsolutions have the potential to overcome. Despite the growing popularity of the\\nIndian Super League, resource scarcity and fragmented governance continue to\\nhinder the widespread adoption and impact of analytics. This mixed-methods\\nstudy explores how informal, decentralised analytics communities -- comprising\\namateur analysts and Twitter-based \\\"data sleuths\\\" -- navigate these constraints\\nthrough peer mentorship and grassroots innovation. Drawing on extensive digital\\nethnography, participant observation, and interviews, the study illustrates how\\nthese informal networks mitigate data scarcity, limited digital infrastructure,\\nand institutional indifference while fostering skill development and\\nprofessional growth. Building on these insights, the paper proposes HCI\\ninterventions such as decentralised knowledge platforms to facilitate\\nstructured, cross-border peer mentorship and low-cost data solutions --\\nincluding AI-assisted player tracking and mobile analytics dashboards -- rooted\\nin principles of frugal innovation. These interventions aim to bridge the data\\ndivide, support inclusive technical engagement in sport, and enhance\\nanalytics-driven decision-making in resource-constrained environments. This\\npaper contributes to HCIxB's focus on cross-border collaboration by\\nhighlighting how community-driven technological adaptation in the Global South\\ncan foster meaningful participation, skill-building, and long-term\\nsustainability through informal learning networks and scalable,\\ncontext-sensitive tools.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-23T09:48:23Z\"}"}
