{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21288v1\", \"title\": \"Algebraic Approach for Orthomax Rotations\", \"summary\": \"In exploratory factor analysis, rotation techniques are employed to derive\\ninterpretable factor loading matrices. Factor rotations deal with\\nequality-constrained optimization problems aimed at determining a loading\\nmatrix based on measure of simplicity, such as ``perfect simple structure'' and\\n``Thurstone simple structure.'' Numerous criteria have been proposed, since the\\nconcept of simple structure is fundamentally ambiguous and involves multiple\\ndistinct aspects. However, most rotation criteria may fail to consistently\\nyield a simple structure that is optimal for analytical purposes, primarily due\\nto two challenges. First, existing optimization techniques, including the\\ngradient projection descent method, exhibit strong dependence on initial values\\nand frequently become trapped in suboptimal local optima. Second, multifaceted\\nnature of simple structure complicates the ability of any single criterion to\\nensure interpretability across all aspects. In certain cases, even when a\\nglobal optimum is achieved, other rotations may exhibit simpler structures in\\nspecific aspects. To address these issues, obtaining all equality-constrained\\nstationary points -- including both global and local optima -- is advantageous.\\nFortunately, many rotation criteria are expressed as algebraic functions, and\\nthe constraints in the optimization problems in factor rotations are formulated\\nas algebraic equations. Therefore, we can employ computational algebra\\ntechniques that utilize operations within polynomial rings to derive exact all\\nequality-constrained stationary points. Unlike existing optimization methods,\\nthe computational algebraic approach can determine global optima and all\\nstationary points, independent of initial values. We conduct Monte Carlo\\nsimulations to examine the properties of the orthomax rotation criteria, which\\ngeneralizes various orthogonal rotation methods.\", \"main_category\": \"math.ST\", \"categories\": \"math.ST,stat.TH\", \"published\": \"2025-04-30T03:44:28Z\"}"}
