{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04212v1\", \"title\": \"MAMMOTH-MOSFIRE: Environmental Effects on Galaxy Interstellar Medium at\\n  $z\\\\sim2$\", \"summary\": \"The MAMMOTH-MOSFIRE program is a deep Keck MOSFIRE K-band spectroscopic\\nfollow-up of emission-line galaxies identified in the MAMMOTH-Grism HST\\nWFC3/G141 slitless spectroscopic survey, targeting the core regions of three\\nmost massive galaxy protoclusters at cosmic noon. To introduce this program, we\\npresent a comprehensive analysis of the emission-line diagnostics for a unique\\nsample of 43 protocluster member galaxies at $z\\\\sim2$, investigating the impact\\nof the overdense environment on their interstellar medium conditions. We\\ncharacterize their ionization and excitation state using the $\\\\rm\\n[N\\\\,II]\\\\lambda$6584, $\\\\rm [S\\\\,II]\\\\lambda\\\\lambda$6717,6731, and $\\\\rm\\n[O\\\\,I]\\\\lambda$6300 BPT diagrams, from a full suite of rest-frame optical\\nemission lines jointly covered by Keck MOSFIRE and HST G141 spectroscopy. Our\\nanalysis reveals a median electron density of $n_{\\\\rm e}\\\\approx290~{\\\\rm\\ncm}^{-3}$ from $\\\\rm [S\\\\,II]$ doublets, consistent with measurements from field\\ngalaxies at similar redshifts. Like their field counterparts at $z\\\\sim2$,\\nprotocluster galaxies exhibit a systematic offset in the N2 BPT diagram\\ncompared to the local star-forming sequence, but no offset in the S2 BPT\\ndiagram. Notably, we find significantly enhanced $\\\\rm [O\\\\,I]/H{\\\\alpha}$ ratios,\\nwhich can be well explained by photoionization models incorporating both $\\\\rm\\nH\\\\,II$ regions and shock excitation. This work highlights the powerful synergy\\nbetween high-resolution Keck MOSFIRE K-band spectroscopy and HST G141 slitless\\nspectroscopy, enabling comprehensive coverage of the rest-frame optical spectra\\nof galaxies at $z\\\\sim2$.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-05-07T08:07:28Z\"}"}
