{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10910v1\", \"title\": \"Full Cooperation in Repeated Multi-Player Games on Hypergraphs\", \"summary\": \"Nearly all living systems, especially humans, depend on collective\\ncooperation for survival and prosperity. However, the mechanisms driving the\\nevolution of cooperative behavior remain poorly understood, particularly in the\\ncontext of simultaneous interactions involving multiple individuals, repeated\\nencounters, and complex interaction structures. Here, we introduce a novel\\nframework for studying repeated multi-player interactions in structured\\npopulations -- repeated multi-player games on hypergraphs -- where multiple\\nindividuals within each hyperedge engage in a repeated game, and each player\\ncan simultaneously participate in many games. We focus on public goods games,\\nwhere individuals differ in their initial endowments, their allocation of\\nendowments across games, and their productivity, which determines the impact of\\ntheir contributions. Through Nash equilibrium analysis, we reveal the intricate\\ninterplay between full cooperation (all individuals contribute their entire\\nendowments, maximizing collective benefits) and key factors such as initial\\nendowments, productivity, contribution strategies, and interaction structure.\\nNotably, while equal endowments are most effective in promoting full\\ncooperation in homogeneous hypergraphs, they can hinder cooperation in\\nheterogeneous hypergraphs, suggesting that equal endowments are not universally\\noptimal. To address this, we propose two optimization strategies: one for\\npolicymakers to adjust endowment distributions and another for players to\\nmodify their contribution strategies. Both approaches successfully promote full\\ncooperation across all studied hypergraphs. Our findings provide novel insights\\ninto the emergence of full cooperation, offering valuable guidance for both\\nplayers and policymakers in fostering collective cooperation.\", \"main_category\": \"cs.GT\", \"categories\": \"cs.GT\", \"published\": \"2025-04-15T06:45:15Z\"}"}
