{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07880v1\", \"title\": \"Sculpting the outer edge of accretion disks in pre-circumbinary binary\\n  black hole systems\", \"summary\": \"Binary black hole systems (BBHs) have become a vivid reality in astrophysics\\nas stellar-mass black hole mergers are now detected through their related\\ngravitational wave emission during the merger stage. If many studies were\\nrecently dedicated to the last stages of BBH where black holes are surrounded\\nby a circumbinary disk (CBD), the structure of these systems prior to the\\nformation of the CBD remains mostly unexplored. The aim of the present article\\nis to investigate the potential modifications induced by the presence of a\\nsecondary black hole onto the structure of the accretion disk surrounding the\\nprimary black hole. We performed 2D classical hydrodynamical simulations of an\\naccretion disk surrounding the primary black hole while taking into account all\\ngravitational effects induced by both the primary black hole and the secondary\\nblack hole orbiting on circular orbits around the center of mass of the\\nsystem.We report three main effects of the presence of a secondary black hole\\norbiting a circular orbit beyond the outer edge of the accretion disk: 1/ the\\nouter radius of the accretion disk is significantly reduced and its ratio to\\nthe black hole separation is directly linked to only the mass ratio of the\\nblack holes; 2/ two spiral arms are visible in the gas density structure of the\\ndisk and 3/ the outer edge of the accretion disk exhibits an elliptical shape\\nthat mainly depends on the mass ratio of the black holes. Our results show that\\nan accretion disk orbiting a primary black hole in a pre-CBD BBH exhibits\\nspecific features induced by the gravitational force generated by the presence\\nof a secondary black hole beyond its outer edge. Such features, directly linked\\nto the binary separation and mass ratio, has therefore the potential to help in\\nthe search and identification of BBH in the pre-CBD stage.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,gr-qc\", \"published\": \"2025-04-10T15:55:18Z\"}"}
