{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10320v1\", \"title\": \"SlowFastVAD: Video Anomaly Detection via Integrating Simple Detector and\\n  RAG-Enhanced Vision-Language Model\", \"summary\": \"Video anomaly detection (VAD) aims to identify unexpected events in videos\\nand has wide applications in safety-critical domains. While semi-supervised\\nmethods trained on only normal samples have gained traction, they often suffer\\nfrom high false alarm rates and poor interpretability. Recently,\\nvision-language models (VLMs) have demonstrated strong multimodal reasoning\\ncapabilities, offering new opportunities for explainable anomaly detection.\\nHowever, their high computational cost and lack of domain adaptation hinder\\nreal-time deployment and reliability. Inspired by dual complementary pathways\\nin human visual perception, we propose SlowFastVAD, a hybrid framework that\\nintegrates a fast anomaly detector with a slow anomaly detector (namely a\\nretrieval augmented generation (RAG) enhanced VLM), to address these\\nlimitations. Specifically, the fast detector first provides coarse anomaly\\nconfidence scores, and only a small subset of ambiguous segments, rather than\\nthe entire video, is further analyzed by the slower yet more interpretable VLM\\nfor elaborate detection and reasoning. Furthermore, to adapt VLMs to\\ndomain-specific VAD scenarios, we construct a knowledge base including normal\\npatterns based on few normal samples and abnormal patterns inferred by VLMs.\\nDuring inference, relevant patterns are retrieved and used to augment prompts\\nfor anomaly reasoning. Finally, we smoothly fuse the anomaly confidence of fast\\nand slow detectors to enhance robustness of anomaly detection. Extensive\\nexperiments on four benchmarks demonstrate that SlowFastVAD effectively\\ncombines the strengths of both fast and slow detectors, and achieves remarkable\\ndetection accuracy and interpretability with significantly reduced\\ncomputational overhead, making it well-suited for real-world VAD applications\\nwith high reliability requirements.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-14T15:30:03Z\"}"}
