{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12013v1\", \"title\": \"Deterministic Parallel High-Quality Hypergraph Partitioning\", \"summary\": \"We present a deterministic parallel multilevel algorithm for balanced\\nhypergraph partitioning that matches the state of the art for non-deterministic\\nalgorithms. Deterministic parallel algorithms produce the same result in each\\ninvocation, which is crucial for reproducibility. Moreover, determinism is\\nhighly desirable in application areas such as VLSI design. While there has been\\ntremendous progress in parallel hypergraph partitioning algorithms recently,\\ndeterministic counterparts for high-quality local search techniques are\\nmissing. Consequently, solution quality is severely lacking in comparison to\\nthe non-deterministic algorithms.\\n  In this work we close this gap. First, we present a generalization of the\\nrecently proposed Jet refinement algorithm. While Jet is naturally amenable to\\ndeterminism, significant changes are necessary to achieve competitive\\nperformance on hypergraphs. We also propose an improved deterministic\\nrebalancing algorithm for Jet. Moreover, we consider the powerful but slower\\nflow-based refinement and introduce a scheme that enables deterministic results\\nwhile building upon a non-deterministic maximum flow algorithm.\\n  As demonstrated in our thorough experimental evaluation, this results in the\\nfirst deterministic parallel partitioner that is competitive to the highest\\nquality solvers. With Jet refinement, we match or exceed the quality of\\nMt-KaHyPar's non-deterministic default configuration while being only 15\\\\%\\nslower on average. We observe self-relative speedups of up to 55 on 64 cores\\nwith a 22.5$\\\\times$ average speedup. Our deterministic flow-based refinement\\nexceeds the quality of the non-deterministic variant by roughly 1\\\\% on average\\nbut requires 31\\\\% more running time.\", \"main_category\": \"cs.DC\", \"categories\": \"cs.DC\", \"published\": \"2025-04-16T12:13:21Z\"}"}
