{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20478v1\", \"title\": \"Tomographic Alcock-Paczynski Test with Marked Correlation Functions\", \"summary\": \"The tomographic Alcock-Paczynski (AP) method, developed over the past decade,\\nexploits redshift evolution for cosmological determination, aiming to mitigate\\ncontamination from redshift distortions and capture nonlinear scale\\ninformation. Marked Correlation Functions (MCFs) extend information beyond the\\ntwo-point correlation. For the first time, this study integrated the\\ntomographic AP test with MCFs to constrain the flat $w$CDM cosmology model. Our\\nfindings show that multiple density weights in MCFs outperform the traditional\\ntwo-point correlation function, reducing the uncertainties of the matter\\ndensity parameter $\\\\Omega_m$ and dark energy equation of state $w$ by 48\\\\% and\\n45\\\\%, respectively. Furthermore, we introduce a novel principal component\\nanalysis (PCA) compression scheme that efficiently projects high-dimensional\\nstatistical measurements into a compact set of eigenmodes while preserving most\\nof the cosmological information. This approach retains significantly more\\ninformation than traditional coarse binning methods, which simply average\\nadjacent bins in a lossy manner. Applying PCA compression also enables the\\neffective use of marked correlation functions in 2D $(s,\\\\mu)$ space, yielding\\nan additional $\\\\sim 50\\\\%$ reduction in error margins. To assess robustness, we\\nincorporate realistic redshift errors expected in future spectroscopic surveys.\\nWhile these errors modestly degrade cosmological constraints, our combined\\nframework, which utiizes MCFs and PCA compression within tomographic AP tests,\\nis less affected and always yield to tight cosmological constraints. This\\nscheme remains highly promising for upcoming slitless spectroscopic surveys,\\nsuch as the Chinese Space Station Telescope (CSST).\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-04-29T07:19:58Z\"}"}
