{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20449v1\", \"title\": \"Moir\\u00e9 Band Engineering in Twisted Trilayer WSe2\", \"summary\": \"We present a systematic theoretical study on the structural and electronic\\nproperties of twisted trilayer transition metal dichalcogenide (TMD) WSe$_2$,\\nwhere two independent moir\\\\'e patterns form between adjacent layers. Using a\\ncontinuum approach, we investigate the optimized lattice structure and the\\nresulting energy band structure, revealing fundamentally different electronic\\nbehaviors between helical and alternating twist configurations. In helical\\ntrilayers, lattice relaxation induces $\\\\alpha\\\\beta$ and $\\\\beta\\\\alpha$ domains,\\nwhere the two moir\\\\'e patterns shift to minimize overlap, while in alternating\\ntrilayers, $\\\\alpha\\\\alpha'$ domains emerge with aligned moir\\\\'e patterns. A key\\nfeature of trilayer TMDs is the summation of moir\\\\'e potentials from the top\\nand bottom layers onto the middle layer, effectively doubling the potential\\ndepth. In helical trilayers, this mechanism generates a Kagome lattice\\npotential in the $\\\\alpha\\\\beta$ domains, giving rise to flat bands\\ncharacteristic of Kagome physics. In alternating trilayers, the enhanced\\npotential confinement forms deep triangular quantum wells, distinct from those\\nfound in bilayer systems. Furthermore, we demonstrate that a moderate\\nperpendicular electric field can switch the layer polarization near the valence\\nband edge, providing an additional degree of tunability. In particular, it\\nenables tuning of the hybridization between orbitals on different layers,\\nallowing for the engineering of diverse and controllable electronic band\\nstructures. Our findings highlight the unique role of moir\\\\'e potential\\nsummation in trilayer systems, offering a broader platform for designing\\nmoir\\\\'e-based electronic and excitonic phenomena beyond those achievable in\\nbilayer TMDs.\", \"main_category\": \"cond-mat.mes-hall\", \"categories\": \"cond-mat.mes-hall\", \"published\": \"2025-04-29T05:47:43Z\"}"}
