{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04491v1\", \"title\": \"Estimating Dynamic Soft Continuum Robot States From Boundaries\", \"summary\": \"Accurate state estimation is essential for effective control of robots. For\\nsoft robots, this task is particularly challenging because their states are\\ninherently infinite-dimensional functions due to the robots' continuous\\ndeformability. Traditional sensing techniques, however, can only provide\\ndiscrete measurements. Recently, a dynamic state estimation method known as a\\nboundary observer was introduced, which leverages Cosserat rod theory to\\nrecover all infinite-dimensional states by measuring only the velocity twist at\\nthe robot's tip. In this work, we present a novel boundary observer that can\\nalso recover infinite-dimensional dynamic states, but instead relies on\\nmeasuring the internal wrench at the robot's base. This design exploits the\\nduality between the velocity twist at the tip and the internal wrench at the\\nbase, with both types of boundary observers being inspired by principles of\\nenergy dissipation. Despite the mathematical duality, the proposed approach\\noffers a distinct advantage: it requires only a 6-axis force/torque sensor\\nembedded at the base, eliminating the need for external sensing systems such as\\nmotion capture cameras. Moreover, combining both tip- and base-based techniques\\nenhances energy dissipation, accelerates convergence, and improves estimation\\naccuracy. We validate the proposed algorithms through both simulation studies\\nand experiments based on tendon-driven continuum robots. Our results\\ndemonstrate that all boundary observers converge to the ground truth within 3\\nseconds, even with significantly deviated initial conditions. Furthermore, they\\nrecover from unknown perturbations and effectively track high-frequency\\nvibrations. We also show that combining the dual techniques further improves\\nconvergence speed and accuracy. Finally, the computational efficiency of these\\nalgorithms indicates their feasibility for real-time state estimation.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-05-07T15:12:41Z\"}"}
