{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10311v1\", \"title\": \"Performance of a Brownian information engine through potential\\n  profiling: Optimum output requisites, Heating-to-Refrigeration transition and\\n  their Re-entrance\", \"summary\": \"Brownian Information engine (BIE) harnesses the energy from a fluctuating\\nenvironment by utilizing the associated information change in the presence of a\\nsingle heat bath. The engine operates in a space-dependent confining potential\\nand requires an appropriate feedback control mechanism. In general, the\\nfeedback controller has three different steps: measurement, feedback, and\\nrelaxation. The feedback step is related to a sudden change in the potential\\nenergy that is essential for a nonzero work output. BIE utilises the amount of\\ninformation (surprise) acquired during the measurement step for the energy\\noutput. However, due to the relaxation process, a certain amount of acquired\\ninformation is lost or becomes unavailable. So, controlling information loss\\nduring relaxation is crucial for the overall efficiency of the engine. The net\\n(available) information, therefore, can be monitored by tuning the feedback\\ncontroller and the shape of the confining potential. In this paper, we explore\\nthe effect of the shape modulation of the confining potential, which may have\\nmultiple stable valleys and unstable hills, on the net available information\\nand, hence, the performance of a BIE that operates under an asymmetric feedback\\nprotocol. We examine the optimal performance requirements of the BIE and the\\namount of maximum work output under different potential profiling. For\\nmonostable trapping, a concave shape in confining potential results in a higher\\nwork output than a convex one. We also find that hills and valleys in the\\nconfining potential may lead to multiple good operating conditions. An\\nappropriate shape modulation can create a heater-refrigerator transition and\\ntheir reentrance due to non-trivial changes in information loss during the\\nrelaxation process.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-04-14T15:19:33Z\"}"}
