{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03633v1\", \"title\": \"CUI-MET: Clinical Utility Index Dose Optimization Approach for\\n  Multiple-Dose, Multiple-Outcome Randomized Trial Designs\", \"summary\": \"Dose optimization in oncology clinical trials has shifted from seeking the\\nmaximum tolerated dose to identifying the Optimal Biological Dose (OBD) that\\nbalances therapeutic benefits and risks across multiple clinical attributes.\\nExisting advanced dose-finding methods can integrate multiple endpoints and\\ncompare dose levels but are often complex or computationally intensive,\\nlimiting their use in early-phase trials. To address these challenges, we\\npropose the Clinical Utility Index Dose Optimization Approach for Multiple-dose\\nMultiple-Outcome Randomized Trial Designs (CUI-MET). This framework integrates\\nmultiple binary endpoints using a clinical utility-based approach, calculating\\na combined clinical utility index (CUI) for each dose level by weighting\\nendpoint responses. Both empirical and modeling methods can estimate marginal\\nprobabilities for each endpoint. These estimated probabilities are then\\ncombined using endpoint-specific weights to compute a utility score for each\\ndose, and the dose with the highest score is selected as optimal. To enhance\\nusability, we implemented these methods in an interactive R Shiny application\\nand demonstrated their functionality through case examples. The framework's\\nflexibility allows for different model selections and endpoint weighting\\nschemes to reflect specific clinical priorities. Bootstrap analysis provides\\nconfidence intervals for the CUI and estimates the probability that each dose\\nis selected as optimal, thereby evaluating the robustness of dose selection. By\\nintegrating multiple endpoints into a single utility index and incorporating\\nuser-friendly visualizations, CUI-MET offers a flexible and accessible solution\\nfor dose optimization in early-phase oncology trials, supporting informed\\ndecision-making and advancing patient-centered care.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME,stat.AP\", \"published\": \"2025-05-06T15:33:45Z\"}"}
