{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02384v1\", \"title\": \"Resistive switching characteristics of Cu/MgO/MoS2/Cu structure\", \"summary\": \"During the study of resistive switching devices, researchers have found that\\nthe influence of the insertion layer cannot be ignored. Many reports have\\nconfirmed that the appropriate insertion layer can significantly improve the\\nperformance of the resistive switching devices. Therefore, in this work, we use\\nmagnetron sputtering to fabricate three devices: Cu/MgO/Cu, Cu/MgO/MoS2/Cu and\\nCu/MoS2/MgO/Cu. Through the characterization test of each device and the\\nmeasurement of the I-V curve, it is found that the resistive switching\\ncharacteristics of the Cu/MgO/Cu device will change greatly after adding an\\nMoS2 insertion layer. The analysis results show that the inserted MoS2 layer\\ndoes not change the main transmission mechanism (space charge limited\\nconduction) of the device, but affects the regulating function of interfacial\\npotential barrier, the effect also is related to the location of MoS2 inserted\\ninto the layer. Among the Cu/MgO/Cu, Cu/MgO/MoS2/Cu and Cu/MoS2/MgO/Cu devices,\\nthe Cu/MgO/MoS2/Cu device exhibits a larger switching ratio (about 103) and a\\nlower reset voltage (about 0.21 V), which can be attributed to the regulation\\nof the interface barrier between MgO and MoS2. In addition, when the MoS2 layer\\nis inserted between the bottom electrodes Cu and MgO, the leakage current of\\nthe device is significantly reduced. Therefore, Cu/MoS2/MgO/Cu device has the\\nhighest commercial value from the point of view of practical applications.\\nFinally, according to the XPS results and XRD results, we establish the\\nconductive filament models for the three devices, and analyze the reasons for\\nthe different resistive switching characteristics of the three devices.\", \"main_category\": \"physics.app-ph\", \"categories\": \"physics.app-ph,cond-mat.mtrl-sci\", \"published\": \"2025-04-03T08:22:36Z\"}"}
