{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20543v1\", \"title\": \"Evolution of precessing binary black holes on eccentric orbits using\\n  orbit-averaged evolution equations\", \"summary\": \"The most general bound binary black hole (BBH) system has an eccentric orbit\\nand precessing spins. The detection of such a system with significant\\neccentricity close to the merger would be a clear signature of dynamical\\nformation. In order to study such systems, it is important to be able to evolve\\ntheir spins and eccentricity from the larger separations at which the binary\\nformed to the smaller separations at which it is detected, or vice versa.\\nKnowledge of the precessional evolution of the binary's orbital angular\\nmomentum can also be used to twist up aligned-spin eccentric waveform models to\\ncreate a spin-precessing eccentric waveform model. In this paper, we present a\\nnew publicly available code to evolve eccentric, precessing BBHs using\\norbit-averaged post-Newtonian (PN) equations from the literature. The\\nspin-precession dynamics is 2PN accurate, i.e., with the leading spin-orbit and\\nspin-spin corrections. The evolution of orbital parameters (orbital frequency,\\neccentricity, and periastron precession), which follow the quasi-Keplerian\\nparametrization, is 3PN accurate in the point particle terms and includes the\\nleading order spin-orbit and spin-spin effects. All the spin-spin terms include\\nthe quadrupole-monopole interaction. The eccentricity enhancement functions in\\nthe fluxes use the high-accuracy hyperasymptotic expansions from Loutrel and\\nYunes [Classical Quantum Gravity {\\\\bf 34} 044003 (2017)]. We discuss various\\nfeatures of the code and study the evolution of the orbital and spin-precession\\nparameters of eccentric, precessing BBHs. In particular, we study the\\ndependence of the spin morphologies on eccentricity, where we find that the\\ntransition point from one spin morphology to another can depend\\nnonmonotonically on eccentricity, and the fraction of binaries in a given\\nmorphology at a given point in the evolution of a population depends on the\\ninstantaneous eccentricity.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc,astro-ph.HE\", \"published\": \"2025-04-29T08:40:07Z\"}"}
