{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04291v1\", \"title\": \"From Incidents to Insights: Patterns of Responsibility following AI\\n  Harms\", \"summary\": \"The AI Incident Database was inspired by aviation safety databases, which\\nenable collective learning from failures to prevent future incidents. The\\ndatabase documents hundreds of AI failures, collected from the news and media.\\nHowever, criticism highlights that the AIID's reliance on media reporting\\nlimits its utility for learning about implementation failures. In this paper,\\nwe accept that the AIID falls short in its original mission, but argue that by\\nlooking beyond technically-focused learning, the dataset can provide new,\\nhighly valuable insights: specifically, opportunities to learn about patterns\\nbetween developers, deployers, victims, wider society, and law-makers that\\nemerge after AI failures. Through a three-tier mixed-methods analysis of 962\\nincidents and 4,743 related reports from the AIID, we examine patterns across\\nincidents, focusing on cases with public responses tagged in the database. We\\nidentify 'typical' incidents found in the AIID, from Tesla crashes to deepfake\\nscams.\\n  Focusing on this interplay between relevant parties, we uncover patterns in\\naccountability and social expectations of responsibility. We find that the\\npresence of identifiable responsible parties does not necessarily lead to\\nincreased accountability. The likelihood of a response and what it amounts to\\ndepends highly on context, including who built the technology, who was harmed,\\nand to what extent. Controversy-rich incidents provide valuable data about\\nsocietal reactions, including insights into social expectations. Equally\\ninformative are cases where controversy is notably absent. This work shows that\\nthe AIID's value lies not just in preventing technical failures, but in\\ndocumenting patterns of harms and of institutional response and social learning\\naround AI incidents. These patterns offer crucial insights for understanding\\nhow society adapts to and governs emerging AI technologies.\", \"main_category\": \"cs.CY\", \"categories\": \"cs.CY\", \"published\": \"2025-05-07T09:59:36Z\"}"}
