{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04592v1\", \"title\": \"AI Governance to Avoid Extinction: The Strategic Landscape and\\n  Actionable Research Questions\", \"summary\": \"Humanity appears to be on course to soon develop AI systems that\\nsubstantially outperform human experts in all cognitive domains and activities.\\nWe believe the default trajectory has a high likelihood of catastrophe,\\nincluding human extinction. Risks come from failure to control powerful AI\\nsystems, misuse of AI by malicious rogue actors, war between great powers, and\\nauthoritarian lock-in. This research agenda has two aims: to describe the\\nstrategic landscape of AI development and to catalog important governance\\nresearch questions. These questions, if answered, would provide important\\ninsight on how to successfully reduce catastrophic risks.\\n  We describe four high-level scenarios for the geopolitical response to\\nadvanced AI development, cataloging the research questions most relevant to\\neach. Our favored scenario involves building the technical, legal, and\\ninstitutional infrastructure required to internationally restrict dangerous AI\\ndevelopment and deployment (which we refer to as an Off Switch), which leads\\ninto an internationally coordinated Halt on frontier AI activities at some\\npoint in the future. The second scenario we describe is a US National Project\\nfor AI, in which the US Government races to develop advanced AI systems and\\nestablish unilateral control over global AI development. We also describe two\\nadditional scenarios: a Light-Touch world similar to that of today and a Threat\\nof Sabotage situation where countries use sabotage and deterrence to slow AI\\ndevelopment.\\n  In our view, apart from the Off Switch and Halt scenario, all of these\\ntrajectories appear to carry an unacceptable risk of catastrophic harm. Urgent\\naction is needed from the US National Security community and AI governance\\necosystem to answer key research questions, build the capability to halt\\ndangerous AI activities, and prepare for international AI agreements.\", \"main_category\": \"cs.CY\", \"categories\": \"cs.CY,cs.AI\", \"published\": \"2025-05-07T17:35:36Z\"}"}
