{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20496v1\", \"title\": \"Large-scale visual SLAM for in-the-wild videos\", \"summary\": \"Accurate and robust 3D scene reconstruction from casual, in-the-wild videos\\ncan significantly simplify robot deployment to new environments. However,\\nreliable camera pose estimation and scene reconstruction from such\\nunconstrained videos remains an open challenge. Existing visual-only SLAM\\nmethods perform well on benchmark datasets but struggle with real-world footage\\nwhich often exhibits uncontrolled motion including rapid rotations and pure\\nforward movements, textureless regions, and dynamic objects. We analyze the\\nlimitations of current methods and introduce a robust pipeline designed to\\nimprove 3D reconstruction from casual videos. We build upon recent deep visual\\nodometry methods but increase robustness in several ways. Camera intrinsics are\\nautomatically recovered from the first few frames using structure-from-motion.\\nDynamic objects and less-constrained areas are masked with a predictive model.\\nAdditionally, we leverage monocular depth estimates to regularize bundle\\nadjustment, mitigating errors in low-parallax situations. Finally, we integrate\\nplace recognition and loop closure to reduce long-term drift and refine both\\nintrinsics and pose estimates through global bundle adjustment. We demonstrate\\nlarge-scale contiguous 3D models from several online videos in various\\nenvironments. In contrast, baseline methods typically produce locally\\ninconsistent results at several points, producing separate segments or\\ndistorted maps. In lieu of ground-truth pose data, we evaluate map consistency,\\nexecution time and visual accuracy of re-rendered NeRF models. Our proposed\\nsystem establishes a new baseline for visual reconstruction from casual\\nuncontrolled videos found online, demonstrating more consistent reconstructions\\nover longer sequences of in-the-wild videos than previously achieved.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-29T07:37:51Z\"}"}
