{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19967v1\", \"title\": \"Enhancing short-term traffic prediction by integrating trends and\\n  fluctuations with attention mechanism\", \"summary\": \"Traffic flow prediction is a critical component of intelligent transportation\\nsystems, yet accurately forecasting traffic remains challenging due to the\\ninteraction between long-term trends and short-term fluctuations. Standard deep\\nlearning models often struggle with these challenges because their\\narchitectures inherently smooth over fine-grained fluctuations while focusing\\non general trends. This limitation arises from low-pass filtering effects, gate\\nbiases favoring stability, and memory update mechanisms that prioritize\\nlong-term information retention. To address these shortcomings, this study\\nintroduces a hybrid deep learning framework that integrates both long-term\\ntrend and short-term fluctuation information using two input features processed\\nin parallel, designed to capture complementary aspects of traffic flow\\ndynamics. Further, our approach leverages attention mechanisms, specifically\\nBahdanau attention, to selectively focus on critical time steps within traffic\\ndata, enhancing the model's ability to predict congestion and other transient\\nphenomena. Experimental results demonstrate that features learned from both\\nbranches are complementary, significantly improving the goodness-of-fit\\nstatistics across multiple prediction horizons compared to a baseline model.\\nNotably, the attention mechanism enhances short-term forecast accuracy by\\ndirectly targeting immediate fluctuations, though challenges remain in fully\\nintegrating long-term trends. This framework can contribute to more effective\\ncongestion mitigation and urban mobility planning by advancing the robustness\\nand precision of traffic prediction models.\", \"main_category\": \"cs.ET\", \"categories\": \"cs.ET,cs.AI,cs.LG,stat.AP\", \"published\": \"2025-04-28T16:38:46Z\"}"}
