{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20744v1\", \"title\": \"DB-GNN: Dual-Branch Graph Neural Network with Multi-Level Contrastive\\n  Learning for Jointly Identifying Within- and Cross-Frequency Coupled Brain\\n  Networks\", \"summary\": \"Within-frequency coupling (WFC) and cross-frequency coupling (CFC) in brain\\nnetworks reflect neural synchronization within the same frequency band and\\ncross-band oscillatory interactions, respectively. Their synergy provides a\\ncomprehensive understanding of neural mechanisms underlying cognitive states\\nsuch as emotion. However, existing multi-channel EEG studies often analyze WFC\\nor CFC separately, failing to fully leverage their complementary properties.\\nThis study proposes a dual-branch graph neural network (DB-GNN) to jointly\\nidentify within- and cross-frequency coupled brain networks. Firstly, DBGNN\\nleverages its unique dual-branch learning architecture to efficiently mine\\nglobal collaborative information and local cross-frequency and within-frequency\\ncoupling information. Secondly, to more fully perceive the global information\\nof cross-frequency and within-frequency coupling, the global perception branch\\nof DB-GNN adopts a Transformer architecture. To prevent overfitting of the\\nTransformer architecture, this study integrates prior within- and\\ncross-frequency coupling information into the Transformer inference process,\\nthereby enhancing the generalization capability of DB-GNN. Finally, a\\nmulti-scale graph contrastive learning regularization term is introduced to\\nconstrain the global and local perception branches of DB-GNN at both\\ngraph-level and node-level, enhancing its joint perception ability and further\\nimproving its generalization performance. Experimental validation on the\\nemotion recognition dataset shows that DB-GNN achieves a testing accuracy of\\n97.88% and an F1- score of 97.87%, reaching the state-of-the-art performance.\", \"main_category\": \"q-bio.NC\", \"categories\": \"q-bio.NC\", \"published\": \"2025-04-29T13:24:37Z\"}"}
