{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04126v1\", \"title\": \"Role of $\\u03a3^*(1/2^-)$ baryons in decay $\\u039b_c\\\\to\\n  \\u039b\\u03c0^+\\u03c0^+\\u03c0^-$\", \"summary\": \"In this work, based on Belle data, we investigate the structure around 1435\\nMeV and the role of the $\\\\Sigma(1380)$ resonance in the decay process\\n$\\\\Lambda_c \\\\to \\\\Lambda \\\\pi^- \\\\pi^+ \\\\pi^+$. The $\\\\Lambda \\\\pi^\\\\pm$ invariant mass\\nspectra are approximately reproduced by the contribution from the\\n$\\\\Sigma(1385)$, modeled as a Breit-Wigner resonance combined with background\\nterms. However, an additional component is required to account for the\\npronounced enhancement near 1435 MeV. To describe this structure, we consider\\ntwo scenarios for the $\\\\Sigma(1435)$: one as a Breit-Wigner resonance with\\nspin-parity $1/2^-$ described via effective Lagrangians, and the other as a\\nrescattering effect arising from coupled-channel interactions. The rescattering\\ncontributions are evaluated using the quasipotential Bethe-Salpeter equation\\napproach. Simulated invariant mass spectra are generated and fitted to the\\nexperimental data. Both the Breit-Wigner and rescattering mechanisms provide\\nreasonable descriptions of the enhancement near 1435 MeV, with the Breit-Wigner\\nscenario yielding a slightly better $\\\\chi^2$. However, the rescattering\\napproach naturally generates a cusp-like structure near threshold, which\\nclosely resembles the feature observed in the data. Furthermore, the inclusion\\nof the $\\\\Sigma(1380)$ resonance with spin-parity $1/2^-$ significantly improves\\nthe fit in the low-energy region and further enhances the description near 1435\\nMeV through interference effects. These results underscore the essential roles\\nof the two $\\\\Sigma^*(1/2^-)$ states in accurately describing the invariant mass\\ndistributions in the decay $\\\\Lambda_c \\\\to \\\\Lambda \\\\pi^+ \\\\pi^+ \\\\pi^-$.\", \"main_category\": \"hep-ph\", \"categories\": \"hep-ph\", \"published\": \"2025-05-07T04:48:05Z\"}"}
