{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09987v1\", \"title\": \"Gravitational metamaterials from optical properties of spacetime media\", \"summary\": \"Gravitational optical properties are here investigated under the hypothesis\\nof spherically-symmetric spacetimes behaving as media. To do so, we first\\nconsider two different definitions of the refractive index, $n_O$, of a\\nspacetime medium and show how to pass from one definition to another by means\\nof a coordinate transformation. Accordingly, the corresponding physical role of\\n$n_O$ is discussed by virtue of the Misner-Sharp mass and the redshift\\ndefinition. Afterwards, we discuss the inclusion of the electromagnetic fields\\nand the equivalence with nonlinear effects induced by geometry. Accordingly,\\nthe infrared and ultraviolet gravity regimes are thus discussed, obtaining\\nbounds from the Solar System, neutron stars and white dwarfs, respectively. To\\ndo so, we also investigate the Snell's law and propose how to possibly\\ndistinguish regular solutions from black holes. As a consequence of our recipe,\\nwe speculate on the existence of \\\\emph{gravitational metamaterials}, whose\\nrefractive index may be negative and explore the corresponding physical\\nimplications, remarking that $n_O<0$ may lead to invisible optical properties,\\nas light is bent in the opposite direction compared to what occurs in ordinary\\ncases. Further, we conjecture that gravitational metamaterials exhibit a\\nparticle-like behavior, contributing to dark matter and propose three toy\\nmodels, highlighting possible advantages and limitations of their use. Finally,\\nwe suggest that such particle-like configurations can be ``dressed\\\" by\\ninteraction, giving rise to \\\\emph{geometric quasiparticles}. We thus construct\\nmodifications of the quantum propagator as due to nonminimal couplings between\\ncurvature and external matter-like fields, finding the corresponding effective\\nmass through a boson mixing mechanism.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc\", \"published\": \"2025-04-14T08:51:56Z\"}"}
