{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00408v1\", \"title\": \"Multi-dimensional optical imaging on a chip\", \"summary\": \"Light inherently consists of multiple dimensions beyond intensity, including\\nspectrum, polarization, etc. The coupling among these high-dimensional optical\\nfeatures provides a compressive characterization of intrinsic material\\nproperties. Because multiple optical dimensions are intrinsically coupled\\nrather than independent, analyzing their inter-relationships and achieving\\ntheir simultaneous acquisition is essential. Despite the existing optical\\ntechniques to obtain different-dimensional data with cumbersome systems, joint\\nacquisition of multi-dimensional optical information on a chip is still a\\nserious challenge, limited by intensity-only photoelectric detection,\\nsingle-dimensional optical elements, and finite bandwidth. In this work, we\\nreport a multi-dimensional on-chip optical imaging (MOCI) architecture, which\\nis functionally composed of three layers, including a multi-dimensional\\nencoding layer to simultaneously encode different dimensions of incident light,\\nan image acquisition layer to collect coupled intensity data, and a\\ncomputational reconstruction layer to recover multi-dimensional images from a\\nsingle frame of coupled measurement. Following the MOCI architecture, we for\\nthe first time fabricated a real-time (74 FPS) on-chip\\npolarization-hyperspectral imaging (PHI) sensor, with 2048$\\\\times$2448 pixels\\nat 61 spectral channels covering the VIS-NIR range and 4 polarization states.\\nWe applied the PHI sensor for simultaneously resolving hyperspectral and\\npolarization information of complex scenes, and for the first time demonstrated\\nnew applications including hyperspectral 3D modeling with normal and height\\nmaps, and hyperspectral sensing against strong reflection and glare...\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics\", \"published\": \"2025-05-01T08:59:18Z\"}"}
