{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07740v1\", \"title\": \"Zero-Shot Cross-Domain Code Search without Fine-Tuning\", \"summary\": \"Code search aims to retrieve semantically relevant code snippets for natural\\nlanguage queries. While pre-trained language models (PLMs) have shown\\nremarkable performance in this task, they struggle in cross-domain scenarios,\\noften requiring costly fine-tuning or facing performance drops in zero-shot\\nsettings. RAPID, which generates synthetic data for model fine-tuning, is\\ncurrently the only effective method for zero-shot cross-domain code search.\\nDespite its effectiveness, RAPID demands substantial computational resources\\nfor fine-tuning and needs to maintain specialized models for each domain,\\nunderscoring the need for a zero-shot, fine-tuning-free approach for\\ncross-domain code search.\\n  The key to tackling zero-shot cross-domain code search lies in bridging the\\ngaps among domains. In this work, we propose to break the query-code matching\\nprocess of code search into two simpler tasks: query-comment matching and\\ncode-code matching. Our empirical study reveals the strong complementarity\\namong the three matching schemas in zero-shot cross-domain settings, i.e.,\\nquery-code, query-comment, and code-code matching. Based on the findings, we\\npropose CodeBridge, a zero-shot, fine-tuning-free approach for cross-domain\\ncode search. Specifically, CodeBridge uses Large Language Models (LLMs) to\\ngenerate comments and pseudo-code, then combines query-code, query-comment, and\\ncode-code matching via PLM-based similarity scoring and sampling-based fusion.\\nExperimental results show that our approach outperforms the state-of-the-art\\nPLM-based code search approaches, i.e., CoCoSoDa and UniXcoder, by an average\\nof 21.4% and 24.9% in MRR, respectively, across three datasets. Our approach\\nalso yields results that are better than or comparable to those of the\\nzero-shot cross-domain code search approach RAPID, which requires costly\\nfine-tuning.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE,cs.CL\", \"published\": \"2025-04-10T13:36:37Z\"}"}
