{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03167v1\", \"title\": \"Enhanced Patterned Fluorescence from Polystyrene through Focused\\n  Electron Beam Irradiation under Various Gases\", \"summary\": \"We report on a novel method for tuning and enhancing fluorescence from\\nirradiated polystyrene through electron-beam exposure in gaseous environments.\\nWe describe the effect of electron dose and ambient gas on the\\nphotoluminescence spectra and yield of irradiated PS films on insulating and\\nconductive substrates. PS films were exposed in an environmental scanning\\nelectron microscope using a 20 keV electron beam, ambient gas pressures from\\nhigh vacuum to 3 mbar, and electron doses from 1.8 to 45 mC cm-2. Irradiated PS\\nfilms were characterized using confocal microscopy, TEM, EDS and FTIR\\nspectroscopy. From emission spectra collected using confocal microscopy we\\nfound that the emission wavelength and photon yield of the irradiated film can\\nbe tuned by both dose and gas pressure. The emission wavelength blue-shifts\\nwith increasing pressure and red-shifts with increasing dose enabling an\\noverall tuning range of 451 - 544 nm. Significant enhancement in the PL\\nintensity, up to 18 times on sapphire substrates under helium when compared to\\nhigh vacuum, are observed. Overall, the highest PL yield is observed on soda\\nlime glass substrates under argon. Also, the photon-yield on conductive\\nsubstrates is significantly smaller than that yield from insulating substrates.\\nTEM images revealed e-beam irradiated PS is amorphous in nature and elemental\\nmapping EDS revealed no signs of film oxidation. FTIR spectroscopy revealed\\nthat under gaseous environments the decay of aromatic and aliphatic C-H\\nstretches is reduced compared to the high vacuum exposure; in all cases,\\nfeatures associated with the phenyl rings are preserved. Localized e-beam\\nsynthesis of fluorophores in PS can be controlled by both dose and by ambient\\ngas pressure. This technique could enable new approaches to photonics where\\nfluorophores with tunable emission properties can be locally introduced by\\ne-beam patterning.\", \"main_category\": \"cond-mat.mes-hall\", \"categories\": \"cond-mat.mes-hall\", \"published\": \"2025-05-06T04:24:05Z\"}"}
