{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10882v1\", \"title\": \"A Quantum Advantage in Localizing Transmission Loss Change in Optical\\n  Networks\", \"summary\": \"The ability to localize transmission loss change to a subset of links in\\noptical networks is crucial for maintaining network reliability, performance\\nand security. \\\\emph{Quantum probes}, implemented by sending blocks of $n$\\ncoherent-state pulses augmented with continuous-variable (CV) squeezing ($n=1$)\\nor weak temporal-mode entanglement ($n>1$) over a lossy channel to a receiver\\nwith homodyne detection capabilities, are known to be more sensitive than their\\nquasi-classical counterparts in detecting a sudden increase in channel loss.\\nThe enhanced sensitivity can be characterized by the increased Kullback-Leibler\\n(KL) divergence of the homodyne output, before and after the loss change\\noccurs. When combined with the theory of quickest change detection (QCD), the\\nincrease in KL divergence translates into a decrease in detection latency.\\n  In this work, we first revisit quantum probes over a channel, generalizing\\nprevious results on $n=1$ (CV squeezed states) to arbitrary values of $n$.\\nAssuming a subset of nodes in an optical network is capable of sending and\\nreceiving such probes through intermediate nodes with all-optical switching\\ncapabilities, we present a scheme for quickly detecting the links that have\\nsuffered a sudden drop in transmissivity. Since quantum probes lose their\\nsensitivity with increasing loss in the channel, we first propose a probe\\nconstruction algorithm that makes the set of links suffering transmission loss\\nchange identifiable, while minimizing the longest distance a probe traverses.\\nWe then introduce new cumulative sum (CUSUM) statistics with a stopping rule,\\nwhich allows us to run the CUSUM algorithm to quickly localize the lossy links\\nusing our constructed probes. Finally, we show that the proposed scheme\\nachieves a quantum advantage in decreasing the detection delay.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cs.NI\", \"published\": \"2025-04-15T05:24:51Z\"}"}
