{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00539v1\", \"title\": \"Unified QMF equation of state for neutron star matter: Static and\\n  dynamic properties\", \"summary\": \"We construct a set of unified equations of state based on the quark mean\\nfield (QMF) model, calibrated to different values of nuclear symmetry energy\\nslope at the saturation density ($L_0$), with the aim of exploring both the\\nstatic properties and dynamical behavior of neutron stars (NSs), and building a\\ncoherent picture of their internal structure. We assess the performance of\\nthese QMF models in describing the mass-radius relation, the cooling evolution\\nof isolated NSs and X-ray transients, and the instabilities (e.g., the r-mode).\\nIn comparison to relativistic mean field (RMF) models formulated at the\\nhadronic level, the QMF model predicts heavier nuclear clusters and larger\\nWigner-Seitz cell sizes in the NS crust, while the density of the free neutron\\ngas remains largely similar between the two approaches. For the cooling of\\nisolated NSs, the thermal evolution is found to be insensitive to both the\\nmany-body model and the symmetry energy slope in the absence of the direct Urca\\n(dUrca) process. However, when rapid cooling via the dUrca process is allowed,\\nin the case of large $L_0$ values (e.g., $L_0 \\\\gtrsim 80$ MeV) in our study,\\nthe QMF model predicts a longer thermal relaxation time. Both the QMF and RMF\\nmodels can reproduce cooling curves consistent with observations of X-ray\\ntransients (e.g., KS 1731--260) during their crustal cooling phase, although\\nstellar parameters show slight variations depending on the model and symmetry\\nenergy slope. Within our unified framework, a larger $L_0$ value generally\\nresults in a wider instability window, while increasing the stellar mass tends\\nto suppress the instability window. We also provide simple power-law\\nparameterizations that quantify the dependence of bulk and shear viscosities on\\nthe symmetry energy slope for nuclear matter at saturation density.\", \"main_category\": \"nucl-th\", \"categories\": \"nucl-th,astro-ph.HE\", \"published\": \"2025-05-01T14:05:15Z\"}"}
