{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16651v1\", \"title\": \"MAYA: Addressing Inconsistencies in Generative Password Guessing through\\n  a Unified Benchmark\", \"summary\": \"The rapid evolution of generative models has led to their integration across\\nvarious fields, including password guessing, aiming to generate passwords that\\nresemble human-created ones in complexity, structure, and patterns. Despite\\ngenerative model's promise, inconsistencies in prior research and a lack of\\nrigorous evaluation have hindered a comprehensive understanding of their true\\npotential. In this paper, we introduce MAYA, a unified, customizable,\\nplug-and-play password benchmarking framework. MAYA provides a standardized\\napproach for evaluating generative password-guessing models through a rigorous\\nset of advanced testing scenarios and a collection of eight real-life password\\ndatasets. Using MAYA, we comprehensively evaluate six state-of-the-art\\napproaches, which have been re-implemented and adapted to ensure\\nstandardization, for a total of over 15,000 hours of computation. Our findings\\nindicate that these models effectively capture different aspects of human\\npassword distribution and exhibit strong generalization capabilities. However,\\ntheir effectiveness varies significantly with long and complex passwords.\\nThrough our evaluation, sequential models consistently outperform other\\ngenerative architectures and traditional password-guessing tools, demonstrating\\nunique capabilities in generating accurate and complex guesses. Moreover,\\nmodels learn and generate different password distributions, enabling a\\nmulti-model attack that outperforms the best individual model. By releasing\\nMAYA, we aim to foster further research, providing the community with a new\\ntool to consistently and reliably benchmark password-generation techniques. Our\\nframework is publicly available at\\nhttps://github.com/williamcorrias/MAYA-Password-Benchmarking\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.AI,cs.LG\", \"published\": \"2025-04-23T12:16:59Z\"}"}
