{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02735v1\", \"title\": \"Pushing the Limit of PPG Sensing in Sedentary Conditions by Addressing\\n  Poor Skin-sensor Contact\", \"summary\": \"Photoplethysmography (PPG) is a widely used non-invasive technique for\\nmonitoring cardiovascular health and various physiological parameters on\\nconsumer and medical devices. While motion artifacts are well-known challenges\\nin dynamic settings, suboptimal skin-sensor contact in sedentary conditions - a\\ncritical issue often overlooked in existing literature - can distort PPG signal\\nmorphology, leading to the loss or shift of essential waveform features and\\ntherefore degrading sensing performance. In this work, we propose CP-PPG, a\\nnovel approach that transforms Contact Pressure-distorted PPG signals into ones\\nwith the ideal morphology. CP-PPG incorporates a novel data collection\\napproach, a well-crafted signal processing pipeline, and an advanced deep\\nadversarial model trained with a custom PPG-aware loss function. We validated\\nCP-PPG through comprehensive evaluations, including 1) morphology\\ntransformation performance on our self-collected dataset, 2) downstream\\nphysiological monitoring performance on public datasets, and 3) in-the-wild\\nperformance. Extensive experiments demonstrate substantial and consistent\\nimprovements in signal fidelity (Mean Absolute Error: 0.09, 40% improvement\\nover the original signal) as well as downstream performance across all\\nevaluations in Heart Rate (HR), Heart Rate Variability (HRV), Respiration Rate\\n(RR), and Blood Pressure (BP) estimation (on average, 21% improvement in HR;\\n41-46% in HRV; 6% in RR; and 4-5% in BP). These findings highlight the critical\\nimportance of addressing skin-sensor contact issues for accurate and dependable\\nPPG-based physiological monitoring. Furthermore, CP-PPG can serve as a generic,\\nplug-in API to enhance PPG signal quality.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC,cs.LG\", \"published\": \"2025-04-03T16:22:15Z\"}"}
