{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11360v1\", \"title\": \"Posterior Consistency in Parametric Models via a Tighter Notion of\\n  Identifiability\", \"summary\": \"We investigate Bayesian posterior consistency in the context of parametric\\nmodels with proper priors. While typical state-of-the-art approaches rely on\\nregularity conditions that are difficult to verify and often misaligned with\\nthe actual mechanisms driving posterior consistency, we propose an alternative\\nframework centered on a simple yet general condition we call ''sequential\\nidentifiability''. This concept strengthens the usual identifiability\\nassumption by requiring that any sequence of parameters whose induced\\ndistributions converge to the true data-generating distribution must itself\\nconverge to the true parameter value. We demonstrate that sequential\\nidentifiability, combined with a standard Kullback--Leibler prior support\\ncondition, is sufficient to ensure posterior consistency. Moreover, we show\\nthat failure of this condition necessarily entails a specific and pathological\\nform of oscillations of the model around the true density, which cannot exist\\nwithout intentional design. This leads to the important insight that posterior\\ninconsistency may be safely ruled out, except in the unrealistic scenario where\\nthe modeler possesses precise knowledge of the data-generating distribution and\\ndeliberately incorporates oscillatory pathologies into the model targeting the\\ncorresponding density. Taken together, these results provide a unified\\nperspective on both consistency and inconsistency in parametric settings,\\nsignificantly expanding the class of models for which posterior consistency can\\nbe rigorously established. To illustrate the strength and versatility of our\\nframework, we construct a one-dimensional model that violates standard\\nregularity conditions and fails to admit a consistent maximum likelihood\\nestimator, yet supports a complete posterior consistency analysis via our\\napproach.\", \"main_category\": \"math.ST\", \"categories\": \"math.ST,stat.TH,G.3\", \"published\": \"2025-04-15T16:26:34Z\"}"}
