{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12906v1\", \"title\": \"Properties and applications of $\\\\rm{Ar-H_2}$ atmospheric pressure plasma\\n  jets\", \"summary\": \"Whether for materials processing or medical applications, the use of\\natmospheric pressure plasma jets (APPJs) has emerged as a relevant alternative\\nto conventional methods. Within the APPJs research field, the search for\\ninnovation aims not only to solve existing problems, but also to explore novel\\noptions for generating plasma jets and find new possible applications. In this\\nwork, the properties of $\\\\rm{Ar-H_2}$ APPJs generated using two plasma sources,\\nwhich differ basically in the generated voltage frequency, amplitude and\\nwaveform, were studied through electrical, thermal and optical\\ncharacterization. Discharge and plasma parameters were analyzed as a function\\nof the $\\\\rm{H_2}$ content in the gas mixture, with this parameter varying from\\n$0\\\\%$ to $3.5\\\\%$. In all cases, the discharge power, electron density as well\\nas the rotational, vibrational and gas temperatures presented a trend of\\ngrowing when the proportion of $\\\\rm{H_2}$ in the gas composition was increased.\\nOptical emission spectroscopy revealed that the same reactive species were\\nproduced for both plasma sources, except for nitric oxide (NO), which was\\nobserved only for the one operated at higher frequency (PS #1). Applications on\\npolymer (polypropylene, PP) and water treatment were performed using PS #1\\nwithout $\\\\rm{H_2}$ and with $3.5\\\\%$ of $\\\\rm{H_2}$ in the gas mixture. NH\\nfunctional groups were detected on the PP surface in the presence of $\\\\rm{H_2}$\\nin the gas composition. This indicates a possible way to increase the nitrogen\\ncontent on polymer surfaces. The results of water treatment revealed that\\nammonia ($\\\\rm{NH_3}$) is also produced when there is $\\\\rm{H_2}$ in the working\\ngas. This opens an alternative for the use of plasma treated water in\\nagriculture.\", \"main_category\": \"physics.plasm-ph\", \"categories\": \"physics.plasm-ph\", \"published\": \"2025-04-17T12:52:45Z\"}"}
