{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20450v1\", \"title\": \"Atmospheric C/O Ratios of Sub-Neptunes with Magma Oceans: Homemade\\n  rather than Inherited\", \"summary\": \"Recently, the James Webb Space Telescope has enabled detailed spectroscopic\\ncharacterization of sub-Neptune atmospheres. With detections of carbon- and\\noxygen-bearing species such as CO, CO$_2$, CH$_4$, and H$_2$O, a central\\nquestion is whether the atmospheric C/O ratio, commonly used to trace formation\\nlocation in giant planets, can serve a similar diagnostic role for\\nsub-Neptunes. We use the global chemical equilibrium framework of Schlichting &\\nYoung (2022) to quantify how magma ocean-atmosphere interactions affect the\\natmospheric C/O ratio. We find that the resulting C/O ratios range from several\\norders of magnitude below solar to a few times solar. The atmospheric C/O ratio\\nin sub-Neptunes is therefore not inherited from the protoplanetary disk, but\\ninstead emerges from chemical equilibrium between the atmosphere and the\\nunderlying magma ocean. Planetary mass, atmospheric mass fraction, and thermal\\nstate all strongly influence the atmospheric C/O ratio. In addition, carbon\\npartitioning into the metal phase typically reduces the atmospheric C/O ratio\\nsubstantially, particularly for atmospheric mass fractions less than a few\\npercent. Finally, we couple the deep equilibrium compositions to 1D atmospheric\\nmodels that self-consistently solve for the pressure-temperature structure and\\nchemical composition, including photochemistry. We find that the C/O ratio\\nvaries with altitude under low vertical mixing conditions (K$_\\\\text{zz}=10^4$\\ncm$^2$s$^{-1}$), but remains constant under strong mixing (K$_\\\\text{zz}=10^7$\\ncm$^2$s$^{-1}$). Our results imply that observed C/O ratios of sub-Neptunes can\\nbe used to probe their interiors. Specifically, C/O ratios much lower than host\\nstar values would imply an underlying magma ocean with iron metal having\\nsequestered significant amounts of carbon.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-29T05:53:42Z\"}"}
