{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06787v1\", \"title\": \"Communicating complex statistical models to a public health audience:\\n  translating science into action with the FARSI approach\", \"summary\": \"Background. Effectively communicating complex statistical model outputs is a\\nmajor challenge in public health. This study introduces the FARSI approach\\n(Fast, Accessible, Reliable, Secure, Informative) as a framework to enhance the\\ntranslation of intricate statistical findings into actionable insights for\\npolicymakers and stakeholders. We apply this framework in a real-world case\\nstudy on chronic disease monitoring in Italy.\\n  Methods. The FARSI framework outlines key principles for developing\\nuser-friendly tools that improve the translation of statistical results. We\\napplied these principles to create an open-access web application using R\\nShiny, designed to communicate chronic disease prevalence estimates from a\\nBayesian spatio-temporal logistic model. The case study highlights the\\nimportance of an intuitive design for fast accessibility, validated data and\\nexpert feedback for reliability, aggregated data for security, and insights\\ninto prevalence population subgroups, which were previously unobservable, for\\ninformativeness.\\n  Results. The web application enables stakeholders to explore disease\\nprevalence across populations and geographical area through dynamic\\nvisualizations. It facilitates public health monitoring by, for instance,\\nidentifying disparities at the local level and assessing risk factors such as\\nsmoking. Its user-friendly interface enhances accessibility, making statistical\\nfindings more actionable. Conclusions. The FARSI framework provides a\\nstructured approach to improving the communication of complex research\\nfindings. By making statistical models more accessible and interpretable, it\\nsupports evidence-based decision-making in public health and increases the\\nsocietal impact of research.\", \"main_category\": \"stat.OT\", \"categories\": \"stat.OT,stat.AP,stat.ME\", \"published\": \"2025-04-09T11:20:12Z\"}"}
