{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04322v1\", \"title\": \"Verification of Digital Twins using Classical and Statistical Model\\n  Checking\", \"summary\": \"With the increasing adoption of digital techniques, the concept of digital\\ntwin (DT) has received a widespread attention in both industry and academia.\\nWhile several definitions exist for a DT, most definitions focus on the\\nexistence of a virtual entity (VE) of a real-world object or process, often\\ncomprising interconnected models which interact with each other, undergoing\\nchanges continuously owing to the synchronization with the real-world object.\\nThese interactions might lead to inconsistencies at execution time, due to\\ntheir highly stochastic and/or time-critical nature, which may lead to\\nundesirable behavior. In addition, the continuously varying nature of VE owing\\nto its synchronization with the real-world object further contributes to the\\ncomplexity arising from these interactions and corresponding model execution\\ntimes, which could possibly affect its overall functioning at runtime. This\\ncreates a need to perform (continuous) verification of the VE, to ensure that\\nit behaves consistently at runtime by adhering to desired properties such as\\ndeadlock freeness, functional correctness, liveness and timeliness. Some\\ncritical properties such as deadlock freeness can only be verified using\\nclassical model checking; on the other hand, statistical model checking\\nprovides the possibility to model actual stochastic temporal behavior. We\\ntherefore propose to use both these techniques to verify the correctness and\\nthe fulfillment of desirable properties of VE. We present our observations and\\nfindings from applying these techniques on the DT of an autonomously driving\\ntruck. Results from these verification techniques suggest that this DT adheres\\nto properties of deadlock freeness and functional correctness, but not adhering\\nto timeliness properties.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE,cs.ET\", \"published\": \"2025-05-07T11:12:46Z\"}"}
