{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04364v1\", \"title\": \"Benchmarking LLMs' Swarm intelligence\", \"summary\": \"Large Language Models (LLMs) show potential for complex reasoning, yet their\\ncapacity for emergent coordination in Multi-Agent Systems (MAS) when operating\\nunder strict constraints-such as limited local perception and communication,\\ncharacteristic of natural swarms-remains largely unexplored, particularly\\nconcerning the nuances of swarm intelligence. Existing benchmarks often do not\\nfully capture the unique challenges of decentralized coordination that arise\\nwhen agents operate with incomplete spatio-temporal information. To bridge this\\ngap, we introduce SwarmBench, a novel benchmark designed to systematically\\nevaluate the swarm intelligence capabilities of LLMs acting as decentralized\\nagents. SwarmBench features five foundational MAS coordination tasks within a\\nconfigurable 2D grid environment, forcing agents to rely primarily on local\\nsensory input (k x k view) and local communication. We propose metrics for\\ncoordination effectiveness and analyze emergent group dynamics. Evaluating\\nseveral leading LLMs in a zero-shot setting, we find significant performance\\nvariations across tasks, highlighting the difficulties posed by local\\ninformation constraints. While some coordination emerges, results indicate\\nlimitations in robust planning and strategy formation under uncertainty in\\nthese decentralized scenarios. Assessing LLMs under swarm-like conditions is\\ncrucial for realizing their potential in future decentralized systems. We\\nrelease SwarmBench as an open, extensible toolkit-built upon a customizable and\\nscalable physical system with defined mechanical properties. It provides\\nenvironments, prompts, evaluation scripts, and the comprehensive experimental\\ndatasets generated, aiming to foster reproducible research into LLM-based MAS\\ncoordination and the theoretical underpinnings of Embodied MAS. Our code\\nrepository is available at https://github.com/x66ccff/swarmbench.\", \"main_category\": \"cs.MA\", \"categories\": \"cs.MA,cs.CL\", \"published\": \"2025-05-07T12:32:01Z\"}"}
