{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04921v1\", \"title\": \"Perception, Reason, Think, and Plan: A Survey on Large Multimodal\\n  Reasoning Models\", \"summary\": \"Reasoning lies at the heart of intelligence, shaping the ability to make\\ndecisions, draw conclusions, and generalize across domains. In artificial\\nintelligence, as systems increasingly operate in open, uncertain, and\\nmultimodal environments, reasoning becomes essential for enabling robust and\\nadaptive behavior. Large Multimodal Reasoning Models (LMRMs) have emerged as a\\npromising paradigm, integrating modalities such as text, images, audio, and\\nvideo to support complex reasoning capabilities and aiming to achieve\\ncomprehensive perception, precise understanding, and deep reasoning. As\\nresearch advances, multimodal reasoning has rapidly evolved from modular,\\nperception-driven pipelines to unified, language-centric frameworks that offer\\nmore coherent cross-modal understanding. While instruction tuning and\\nreinforcement learning have improved model reasoning, significant challenges\\nremain in omni-modal generalization, reasoning depth, and agentic behavior. To\\naddress these issues, we present a comprehensive and structured survey of\\nmultimodal reasoning research, organized around a four-stage developmental\\nroadmap that reflects the field's shifting design philosophies and emerging\\ncapabilities. First, we review early efforts based on task-specific modules,\\nwhere reasoning was implicitly embedded across stages of representation,\\nalignment, and fusion. Next, we examine recent approaches that unify reasoning\\ninto multimodal LLMs, with advances such as Multimodal Chain-of-Thought (MCoT)\\nand multimodal reinforcement learning enabling richer and more structured\\nreasoning chains. Finally, drawing on empirical insights from challenging\\nbenchmarks and experimental cases of OpenAI O3 and O4-mini, we discuss the\\nconceptual direction of native large multimodal reasoning models (N-LMRMs),\\nwhich aim to support scalable, agentic, and adaptive reasoning and planning in\\ncomplex, real-world environments.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.CL\", \"published\": \"2025-05-08T03:35:23Z\"}"}
