{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02416v1\", \"title\": \"Hyperspectral Remote Sensing Images Salient Object Detection: The First\\n  Benchmark Dataset and Baseline\", \"summary\": \"The objective of hyperspectral remote sensing image salient object detection\\n(HRSI-SOD) is to identify objects or regions that exhibit distinct spectrum\\ncontrasts with the background. This area holds significant promise for\\npractical applications; however, progress has been limited by a notable\\nscarcity of dedicated datasets and methodologies. To bridge this gap and\\nstimulate further research, we introduce the first HRSI-SOD dataset, termed\\nHRSSD, which includes 704 hyperspectral images and 5327 pixel-level annotated\\nsalient objects. The HRSSD dataset poses substantial challenges for salient\\nobject detection algorithms due to large scale variation, diverse\\nforeground-background relations, and multi-salient objects. Additionally, we\\npropose an innovative and efficient baseline model for HRSI-SOD, termed the\\nDeep Spectral Saliency Network (DSSN). The core of DSSN is the Cross-level\\nSaliency Assessment Block, which performs pixel-wise attention and evaluates\\nthe contributions of multi-scale similarity maps at each spatial location,\\neffectively reducing erroneous responses in cluttered regions and emphasizes\\nsalient regions across scales. Additionally, the High-resolution Fusion Module\\ncombines bottom-up fusion strategy and learned spatial upsampling to leverage\\nthe strengths of multi-scale saliency maps, ensuring accurate localization of\\nsmall objects. Experiments on the HRSSD dataset robustly validate the\\nsuperiority of DSSN, underscoring the critical need for specialized datasets\\nand methodologies in this domain. Further evaluations on the HSOD-BIT and\\nHS-SOD datasets demonstrate the generalizability of the proposed method. The\\ndataset and source code are publicly available at\\nhttps://github.com/laprf/HRSSD.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-03T09:12:42Z\"}"}
