{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11188v1\", \"title\": \"Clinically Interpretable Survival Risk Stratification in Head and Neck\\n  Cancer Using Bayesian Networks and Markov Blankets\", \"summary\": \"Purpose: To identify a clinically interpretable subset of survival-relevant\\nfeatures in HN cancer using Bayesian Network (BN) and evaluate its prognostic\\nand causal utility. Methods and Materials: We used the RADCURE dataset,\\nconsisting of 3,346 patients with H&N cancer treated with definitive\\n(chemo)radiotherapy. A probabilistic BN was constructed to model dependencies\\namong clinical, anatomical, and treatment variables. The Markov Blanket (MB) of\\ntwo-year survival (SVy2) was extracted and used to train a logistic regression\\nmodel. After excluding incomplete cases, a temporal split yielded a train/test\\n(2,174/820) dataset using 2007 as the cutoff year. Model performance was\\nassessed using area under the ROC curve (AUC), C-index, and Kaplan-Meier (KM)\\nsurvival stratification. Model fit was further evaluated using a log-likelihood\\nratio (LLR) test. Causal inference was performed using do-calculus\\ninterventions on MB variables. Results: The MB of SVy2 included 6 clinically\\nrelevant features: ECOG performance status, T-stage, HPV status, disease site,\\nthe primary gross tumor volume (GTVp), and treatment modality. The model\\nachieved an AUC of 0.65 and C-index of 0.78 on the test dataset, significantly\\nstratifying patients into high- and low-risk groups (log-rank p < 0.01). Model\\nfit was further supported by a log-likelihood ratio of 70.32 (p < 0.01).\\nSubgroup analyses revealed strong performance in HPV-negative (AUC = 0.69,\\nC-index = 0.76), T4 (AUC = 0.69, C-index = 0.80), and large-GTV (AUC = 0.67,\\nC-index = 0.75) cohorts, each showing significant KM separation. Causal\\nanalysis further supported the positive survival impact of ECOG 0, HPV-positive\\nstatus, and chemoradiation. Conclusions: A compact, MB-derived BN model can\\nrobustly stratify survival risk in HN cancer. The model enables explainable\\nprognostication and supports individualized decision-making across key clinical\\nsubgroups.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph\", \"published\": \"2025-04-15T13:47:35Z\"}"}
