{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04385v1\", \"title\": \"Formation of Al II lines and photospheric aluminium abundances in B-type\\n  stars\", \"summary\": \"Aluminium abundances of B-type stars were spectroscopically determined in\\norder to get information about the galactic gas composition at the time of\\ntheir formation. For this purpose, two AlII lines at 6243 and 4663A were\\nemployed. The non-LTE effect of these AlII lines generally acts in the\\ndirection of weakening (i.e., profile becomes shallower) caused by a decrease\\nof line opacity (due to overionization) along with an enhanced line source\\nfunction (overexcitation), and this effect tends to become progressively larger\\nwith an increase in Teff as well as with a decrease in log g (surface gravity).\\nRegarding the AlII 6243 line, while the non-LTE calculation qualitatively\\nreproduces its overall behavior (e.g., transition from absorption to emission\\nat early B-type), some Teff-dependent systematic trend remains unremoved in the\\nnon-LTE abundances of normal stars, which means that non-LTE corrections\\nevaluated for this line are quantitatively insufficient. Meanwhile, for the\\ncase of the Al II 4663 line, which is more advantageous than the 6243 line in\\nthe sense that it is stronger without showing any emission, the resulting\\nnon-LTE abundances of ordinary B stars are almost constant at the solar\\nabundance (A~6.5) over the wide Teff range (~10000-20000K), suggesting that the\\nabundances derived from this line are successfully non-LTE-corrected and\\ntrustable. Therefore, according to the results from the AlII 4663 line, we may\\nconclude that the Al abundance of the galactic gas in the recent past (several\\ntimes ~10^7-10^8 yr ago) is almost consistent with the solar composition. As to\\nthe Al abundances of HgMn stars (Teff<15000K), our analysis confirmed that this\\nelement is conspicuously deficient (by ~0.5-2 dex in comparison with the Sun)\\nin the photosphere of these chemically peculiar stars, as already reported in\\nprevious studies.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-05-07T13:07:15Z\"}"}
