{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23784v1\", \"title\": \"Sample-based subsampling strategies to identify microplastics in the\\n  presence of a high number of particles using quantum-cascade laser-based\\n  infrared imaging\", \"summary\": \"Microplastics (MPs) are ubiquitous in all ecosystems, affecting wildlife and,\\nultimately, human health. The complexity of natural samples plus the\\nunspecificity of their treatments to isolate polymers renders the\\ncharacterization of thousands of particles impractical for environmental\\nmonitoring using conventional spectroscopic techniques. Two primary solutions\\nare to analyze a small fraction of the sample or to measure only a subset of\\nparticles present over a holder, known as subsampling. A strategy to subsample\\nreflective Kevley slides and gold-coated filters using quantum-cascade\\nlaser-based infrared imaging is proposed here, as this technology is a\\npromising tool for MPs monitoring. In contrast to most previous approaches that\\nstruggle to propose general subsampling schemes, we introduce the concept of\\nsample-based subsampling. This can be applied ex-ante always and it highlights\\nthe best subsampling areas for a sample after a preliminary assay to count the\\ntotal number of particles on a holder. The error at this stage acts as a proxy\\nto minimize errors when evaluating the number of particles and MPs,\\nsignificantly enhancing the feasibility of large-scale MPs monitoring. The\\npredictive ability of the approach was tested for fibres and fragments, for\\ntotal amounts of particles and MPs. Further, the evaluations were disaggregated\\nby size and polymer type. In most situations the reference values were\\ncontained in the confidence intervals of the predicted values (often within the\\n68 % ones) and relative errors were lower than 25 %. Exceptions occurred when\\nvery scarce (one or two) items of a given size or polymer were present on the\\noverall holder. The approach was compared to other systematic ad-hoc\\nstrategies.\", \"main_category\": \"physics.ins-det\", \"categories\": \"physics.ins-det\", \"published\": \"2025-03-31T07:02:04Z\"}"}
