{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13172v1\", \"title\": \"SemCORE: A Semantic-Enhanced Generative Cross-Modal Retrieval Framework\\n  with MLLMs\", \"summary\": \"Cross-modal retrieval (CMR) is a fundamental task in multimedia research,\\nfocused on retrieving semantically relevant targets across different\\nmodalities. While traditional CMR methods match text and image via\\nembedding-based similarity calculations, recent advancements in pre-trained\\ngenerative models have established generative retrieval as a promising\\nalternative. This paradigm assigns each target a unique identifier and\\nleverages a generative model to directly predict identifiers corresponding to\\ninput queries without explicit indexing. Despite its great potential, current\\ngenerative CMR approaches still face semantic information insufficiency in both\\nidentifier construction and generation processes. To address these limitations,\\nwe propose a novel unified Semantic-enhanced generative Cross-mOdal REtrieval\\nframework (SemCORE), designed to unleash the semantic understanding\\ncapabilities in generative cross-modal retrieval task. Specifically, we first\\nconstruct a Structured natural language IDentifier (SID) that effectively\\naligns target identifiers with generative models optimized for natural language\\ncomprehension and generation. Furthermore, we introduce a Generative Semantic\\nVerification (GSV) strategy enabling fine-grained target discrimination.\\nAdditionally, to the best of our knowledge, SemCORE is the first framework to\\nsimultaneously consider both text-to-image and image-to-text retrieval tasks\\nwithin generative cross-modal retrieval. Extensive experiments demonstrate that\\nour framework outperforms state-of-the-art generative cross-modal retrieval\\nmethods. Notably, SemCORE achieves substantial improvements across benchmark\\ndatasets, with an average increase of 8.65 points in Recall@1 for text-to-image\\nretrieval.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR,cs.CL,cs.MM\", \"published\": \"2025-04-17T17:59:27Z\"}"}
