{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03327v1\", \"title\": \"Very High-Resolution Forest Mapping with TanDEM-X InSAR Data and\\n  Self-Supervised Learning\", \"summary\": \"Deep learning models have shown encouraging capabilities for mapping\\naccurately forests at medium resolution with TanDEM-X interferometric SAR data.\\nSuch models, as most of current state-of-the-art deep learning techniques in\\nremote sensing, are trained in a fully-supervised way, which requires a large\\namount of labeled data for training and validation. In this work, our aim is to\\nexploit the high-resolution capabilities of the TanDEM-X mission to map forests\\nat 6 m. The goal is to overcome the intrinsic limitations posed by\\nmidresolution products, which affect, e.g., the detection of narrow roads\\nwithin vegetated areas and the precise delineation of forested regions\\ncontours. To cope with the lack of extended reliable reference datasets at such\\na high resolution, we investigate self-supervised learning techniques for\\nextracting highly informative representations from the input features, followed\\nby a supervised training step with a significantly smaller number of reliable\\nlabels. A 1 m resolution forest/non-forest reference map over Pennsylvania,\\nUSA, allows for comparing different training approaches for the development of\\nan effective forest mapping framework with limited labeled samples. We select\\nthe best-performing approach over this test region and apply it in a real-case\\nforest mapping scenario over the Amazon rainforest, where only very few labeled\\ndata at high resolution are available. In this challenging scenario, the\\nproposed self-supervised framework significantly enhances the classification\\naccuracy with respect to fully-supervised methods, trained using the same\\namount of labeled data, representing an extremely promising starting point for\\nlarge-scale, very high-resolution forest mapping with TanDEM-X data.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI,cs.LG,eess.IV\", \"published\": \"2025-05-06T08:54:28Z\"}"}
