{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15268v1\", \"title\": \"Beating the Correlation Breakdown: Robust Inference, Flexible Scenarios,\\n  and Stress Testing for Financial Portfolios\", \"summary\": \"We live in a multivariate world, and effective modeling of financial\\nportfolios, including their construction, allocation, forecasting, and risk\\nanalysis, simply is not possible without explicitly modeling the dependence\\nstructure of their assets. Dependence structure can drive portfolio results\\nmore than many other parameters in investment and risk models, sometimes even\\nmore than their combined effects, but the literature provides relatively little\\nto define the finite-sample distributions of dependence measures in useable and\\nuseful ways under challenging, real-world financial data conditions. Yet this\\nis exactly what is needed to make valid inferences about their estimates, and\\nto use these inferences for a myriad of essential purposes, such as hypothesis\\ntesting, dynamic monitoring, realistic and granular scenario and reverse\\nscenario analyses, and mitigating the effects of correlation breakdowns during\\nmarket upheavals (which is when we need valid inferences the most). This work\\ndevelops a new and straightforward method, Nonparametric Angles-based\\nCorrelation (NAbC), for defining the finite-sample distributions of any\\ndependence measure whose matrix of pairwise associations is positive definite\\n(e.g. Pearsons, Kendalls Tau, Spearmans Rho, Chatterjees, Lancasters, Szekelys,\\nand their many variants). The solution remains valid under marginal asset\\ndistributions characterized by notably different and varying degrees of serial\\ncorrelation, non-stationarity, heavy-tailedness, and asymmetry. Notably, NAbCs\\np-values and confidence intervals remain analytically consistent at both the\\nmatrix level and the pairwise cell level. Finally, NAbC maintains validity even\\nwhen selected cells in the matrix are frozen for a given scenario or stress\\ntest, that is, unaffected by the scenario, thus enabling flexible, granular,\\nand realistic scenarios.\", \"main_category\": \"q-fin.RM\", \"categories\": \"q-fin.RM,q-fin.PM,q-fin.ST,stat.AP,G.3\", \"published\": \"2025-04-21T17:52:36Z\"}"}
