{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05053v1\", \"title\": \"Statistical method for A-RNA and B-DNA\", \"summary\": \"Nucleic acids have been regarded as stiff polymers with long-range\\nflexibility and generally modeled using elastic rod models of polymer physics.\\nNotwithstanding, investigations carried out over the past few years on single\\nfragments of order $\\\\sim 100$ base pairs have revealed remarkable flexibility\\nproperties at short scales and called for theoretical approaches that emphasize\\nthe role of the bending fluctuations at single sites along the molecule stack.\\nHere, we review a three dimensional mesoscopic Hamiltonian model which assumes\\na discrete representation of the double stranded (ds) molecules at the level of\\nthe nucleotides. The model captures the fundamental local interactions between\\nadjacent sugar-phosphate groups and the pairwise interactions between\\ncomplementary base pair mates. A statistical method based on the path integral\\nformalism sets the ensemble of the base pair breathing fluctuations which are\\nincluded in the partition function and permits to derive the thermodynamics and\\nthe elastic response of single molecules to external forces. We apply the model\\nto the computation of the twist-stretch relations for fragments of ds-DNA and\\nds-RNA, showing that the obtained opposite pattern (DNA overtwists whereas RNA\\nuntwists versus force) follows from the different structural features of the\\ntwo helices. Moreover, we focus on the DNA stretching due to the confinement in\\nnano-pores and, finally, on the computation of the cyclization probability of\\nopen ends molecules of $\\\\sim 100$ base pairs under physiological conditions.\\nThe mesoscopic model shows a distinct advantage over the elastic rod model in\\nestimating the molecule bendability at short length scale.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft,cond-mat.mes-hall,physics.bio-ph,q-bio.BM\", \"published\": \"2025-05-08T08:46:22Z\"}"}
