{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15853v1\", \"title\": \"DFT exploration of pressure dependent physical properties of the\\n  recently discovered La3Ni2O7 superconductor\", \"summary\": \"The recent discovery of superconductivity in Ruddlesden-Popper bilayer\\nnickelate La3Ni2O7 under pressure has drawn a lot of interest. La3Ni2O7 is\\nisostructural with cuprates in some respect. Investigation of its properties\\nwill undoubtedly provide new insights into high-Tc superconductivity. In the\\npresent work, we study structural, mechanical, elastic, optoelectronic,\\nthermophysical properties, and Fermi surface topology of La3Ni2O7 under\\npressure within the range of 30-40 GPa employing the density functional theory\\n(DFT). The calculated structural parameters agree well with the earlier\\nexperimental findings. The structural, mechanical, and thermodynamical\\nstability is justified across the entire pressure range. The computed elastic\\nmoduli classify the compound as ductile, and the material's ductility is\\nlargely unaffected by pressure. The compound has a high level of machinability\\nindex and dry lubricity. The electronic band structure reveals metallic feature\\nof La3Ni2O7. The Debye temperature, thermal conductivity, and melting\\ntemperature increase with increasing pressure, but in an anomalous manner. The\\ncharacteristic peaks in refractive index, reflectivity, and photoconductivity\\nexhibit a small shift towards higher energy for all polarizations of the\\nelectric field vector with increasing pressure. The investigated material might\\nbe a good ultraviolet radiation absorber and can be used as an anti-reflection\\nsystem. Moreover, the pressure dependent electronic density of states at the\\nFermi level, pressure induced negligible variations in the repulsive Coulomb\\npseudopotential, and the changes in the Debye temperature have been used to\\nexplore the effect of pressure on the superconducting transition temperature in\\nthis study.\", \"main_category\": \"cond-mat.supr-con\", \"categories\": \"cond-mat.supr-con,cond-mat.mtrl-sci\", \"published\": \"2025-04-22T12:49:03Z\"}"}
