{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04514v1\", \"title\": \"Quantum thermodynamics and semi-definite optimization\", \"summary\": \"In quantum thermodynamics, a system is described by a Hamiltonian and a list\\nof non-commuting charges representing conserved quantities like particle number\\nor electric charge, and an important goal is to determine the system's minimum\\nenergy in the presence of these conserved charges. In optimization theory, a\\nsemi-definite program (SDP) involves a linear objective function optimized over\\nthe cone of positive semi-definite operators intersected with an affine space.\\nThese problems arise from differing motivations in the physics and optimization\\ncommunities and are phrased using very different terminology, yet they are\\nessentially identical mathematically. By adopting Jaynes' mindset motivated by\\nquantum thermodynamics, we observe that minimizing free energy in the\\naforementioned thermodynamics problem, instead of energy, leads to an elegant\\nsolution in terms of a dual chemical potential maximization problem that is\\nconcave in the chemical potential parameters. As such, one can employ standard\\n(stochastic) gradient ascent methods to find the optimal values of these\\nparameters, and these methods are guaranteed to converge quickly. At low\\ntemperature, the minimum free energy provides an excellent approximation for\\nthe minimum energy. We then show how this Jaynes-inspired gradient-ascent\\napproach can be used in both first- and second-order classical and hybrid\\nquantum-classical algorithms for minimizing energy, and equivalently, how it\\ncan be used for solving SDPs, with guarantees on the runtimes of the\\nalgorithms. The approach discussed here is well grounded in quantum\\nthermodynamics and, as such, provides physical motivation underpinning why\\nalgorithms published fifty years after Jaynes' seminal work, including the\\nmatrix multiplicative weights update method, the matrix exponentiated gradient\\nupdate method, and their quantum algorithmic generalizations, perform well at\\nsolving SDPs.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cond-mat.stat-mech\", \"published\": \"2025-05-07T15:40:15Z\"}"}
