{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16836v1\", \"title\": \"Snorkeling in dark waters: A longitudinal surface exploration of unique\\n  Tor Hidden Services (Extended Version)\", \"summary\": \"The Onion Router (Tor) is a controversial network whose utility is constantly\\nunder scrutiny. On the one hand, it allows for anonymous interaction and\\ncooperation of users seeking untraceable navigation on the Internet. This\\nfreedom also attracts criminals who aim to thwart law enforcement\\ninvestigations, e.g., trading illegal products or services such as drugs or\\nweapons. Tor allows delivering content without revealing the actual hosting\\naddress, by means of .onion (or hidden) services. Different from regular\\ndomains, these services can not be resolved by traditional name services, are\\nnot indexed by regular search engines, and they frequently change. This\\ngenerates uncertainty about the extent and size of the Tor network and the type\\nof content offered.\\n  In this work, we present a large-scale analysis of the Tor Network. We\\nleverage our crawler, dubbed Mimir, which automatically collects and visits\\ncontent linked within the pages to collect a dataset of pages from more than\\n25k sites. We analyze the topology of the Tor Network, including its depth and\\nreachability from the surface web. We define a set of heuristics to detect the\\npresence of replicated content (mirrors) and show that most of the analyzed\\ncontent in the Dark Web (82% approx.) is a replica of other content. Also, we\\ntrain a custom Machine Learning classifier to understand the type of content\\nthe hidden services offer. Overall, our study provides new insights into the\\nTor network, highlighting the importance of initial seeding for focus on\\nspecific topics, and optimize the crawling process. We show that previous work\\non large-scale Tor measurements does not consider the presence of mirrors,\\nwhich biases their understanding of the Dark Web topology and the distribution\\nof content.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR\", \"published\": \"2025-04-23T15:59:16Z\"}"}
