{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05894v1\", \"title\": \"Why do zeroes happen? A model-based approach for demand classification\", \"summary\": \"Effective demand forecasting is critical for inventory management, production\\nplanning, and decision making across industries. Selecting the appropriate\\nmodel and suitable features to efficiently capture patterns in the data is one\\nof the main challenges in demand forecasting. In reality, this becomes even\\nmore complicated when the recorded sales have zeroes, which can happen\\nnaturally or due to some anomalies, such as stockouts and recording errors.\\nMistreating the zeroes can lead to the application of inappropriate forecasting\\nmethods, and thus leading to poor decision making. Furthermore, the demand\\nitself can have different fundamental characteristics, and being able to\\ndistinguish one type from another might bring substantial benefits in terms of\\naccuracy and thus decision making. We propose a two-stage model-based\\nclassification framework that in the first step, identifies artificially\\noccurring zeroes, and then classifies demand to one of the possible types:\\nregular/intermittent, intermittent smooth/lumpy, fractional/count. The\\nframework utilises statistical modelling and information criteria to detect\\nanomalous zeroes and then classify demand into those categories. We then argue\\nthat different types of demand need different features, and show empirically\\nthat they tend to increase the accuracy of the forecasting methods compared to\\nthose applied directly to the dataset without the generated features and the\\ntwo-stage framework. Our general practical recommendation based on that is to\\nuse the mixture approach for intermittent demand, capturing the demand sizes\\nand demand probability separately, as it seems to improve the accuracy of\\ndifferent forecasting approaches.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,stat.ME\", \"published\": \"2025-04-08T10:45:30Z\"}"}
