{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20723v1\", \"title\": \"Cosmology from LOFAR Two-metre Sky Survey Data Release 2:\\n  Counts-in-Cells Statistics\", \"summary\": \"We investigate the statistical distribution of source counts-in-cells in the\\nsecond data release of the LOFAR Two-Metre Sky Survey (LoTSS-DR2) and we test a\\ncomputationally cheap method based on the counts-in-cells to estimate the\\ntwo-point correlation function. We compare three stochastic models for the\\ncounts-in-cells which result in a Poisson distribution, a compound Poisson\\ndistribution, and a negative binomial distribution. By analysing the variance\\nof counts-in-cells for various cell sizes, we fit the reduced normalised\\nvariance to a single power-law model representing the angular two-point\\ncorrelation function. Our analysis confirms that radio sources are not Poisson\\ndistributed, which is most likely due to multiple physical components of radio\\nsources. Employing instead a Cox process, we show that there is strong evidence\\nin favour of the negative binomial distribution above a flux density threshold\\nof 2 mJy. Additionally, the mean number of radio components derived from the\\nnegative binomial distribution is in good agreement with corresponding\\nestimates based on the value-added catalogue of LoTSS-DR2. The scaling of the\\ncounts-in-cells normalised variance with cell size is in good agreement with a\\npower-law model for the angular two-point correlation. At a flux density\\nthreshold of 2 mJy and a signal-to-noise ratio of 7.5 for individual radio\\nsources, we find that for a range of angular scales large enough to not be\\naffected by the multi-component nature of radio sources, the value of the\\nexponent of the power law ranges from -0.8 to -1.05. This closely aligns with\\nfindings from previous optical, infrared, and radio surveys of the large scale\\nstructure. The scaling of the counts-in-cells statistics with cell size\\nprovides a computationally efficient method to estimate the two-point\\ncorrelation properties, offering a valuable tool for future large-scale\\nstructure studies.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-04-29T13:02:28Z\"}"}
