{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19507v1\", \"title\": \"\\\\textit{From Freshness to Effectiveness}: Goal-Oriented Sampling for\\n  Remote Decision Making\", \"summary\": \"Data freshness, measured by Age of Information (AoI), is highly relevant in\\nnetworked applications such as Vehicle to Everything (V2X), smart health\\nsystems, and Industrial Internet of Things (IIoT). Yet, freshness alone does\\nnot equate to informativeness. In decision-critical settings, some stale data\\nmay prove more valuable than fresh updates. To explore this nuance, we move\\nbeyond AoI-centric policies and investigate how data staleness impacts\\ndecision-making under data-staleness-induced uncertainty. We pose a central\\nquestion: What is the value of information, when freshness fades, and only its\\npower to shape remote decisions remains? To capture this endured value, we\\npropose AR-MDP, an Age-aware Remote Markov Decision Process framework, which\\nco-designs optimal sampling and remote decision-making under a sampling\\nfrequency constraint and random delay. To efficiently solve this problem, we\\ndesign a new two-stage hierarchical algorithm namely Quick\\nBellman-Linear-Program (QuickBLP), where the first stage involves solving the\\nDinkelbach root of a Bellman variant and the second stage involves solving a\\nstreamlined linear program (LP). For the tricky first stage, we propose a new\\nOne-layer Primal-Dinkelbach Synchronous Iteration (OnePDSI) method, which\\novercomes the re-convergence and non-expansive divergence present in existing\\nper-sample multi-layer algorithms. Through rigorous convergence analysis of our\\nproposed algorithms, we establish that the worst-case optimality gap in OnePDSI\\nexhibits exponential decay with respect to iteration $K$ at a rate of\\n$\\\\mathcal{O}(\\\\frac{1}{R^K})$. Through sensitivity analysis, we derive a\\nthreshold for the sampling frequency, beyond which additional sampling does not\\nyield further gains in decision-making. Simulation results validate our\\nanalyses.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-04-28T06:17:09Z\"}"}
