{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05001v1\", \"title\": \"StabStitch++: Unsupervised Online Video Stitching with Spatiotemporal\\n  Bidirectional Warps\", \"summary\": \"We retarget video stitching to an emerging issue, named warping shake, which\\nunveils the temporal content shakes induced by sequentially unsmooth warps when\\nextending image stitching to video stitching. Even if the input videos are\\nstable, the stitched video can inevitably cause undesired warping shakes and\\naffect the visual experience. To address this issue, we propose StabStitch++, a\\nnovel video stitching framework to realize spatial stitching and temporal\\nstabilization with unsupervised learning simultaneously. First, different from\\nexisting learning-based image stitching solutions that typically warp one image\\nto align with another, we suppose a virtual midplane between original image\\nplanes and project them onto it. Concretely, we design a differentiable\\nbidirectional decomposition module to disentangle the homography transformation\\nand incorporate it into our spatial warp, evenly spreading alignment burdens\\nand projective distortions across two views. Then, inspired by camera paths in\\nvideo stabilization, we derive the mathematical expression of stitching\\ntrajectories in video stitching by elaborately integrating spatial and temporal\\nwarps. Finally, a warp smoothing model is presented to produce stable stitched\\nvideos with a hybrid loss to simultaneously encourage content alignment,\\ntrajectory smoothness, and online collaboration. Compared with StabStitch that\\nsacrifices alignment for stabilization, StabStitch++ makes no compromise and\\noptimizes both of them simultaneously, especially in the online mode. To\\nestablish an evaluation benchmark and train the learning framework, we build a\\nvideo stitching dataset with a rich diversity in camera motions and scenes.\\nExperiments exhibit that StabStitch++ surpasses current solutions in stitching\\nperformance, robustness, and efficiency, offering compelling advancements in\\nthis field by building a real-time online video stitching system.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-05-08T07:12:23Z\"}"}
