{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10916v1\", \"title\": \"Embedding Radiomics into Vision Transformers for Multimodal Medical\\n  Image Classification\", \"summary\": \"Background: Deep learning has significantly advanced medical image analysis,\\nwith Vision Transformers (ViTs) offering a powerful alternative to\\nconvolutional models by modeling long-range dependencies through\\nself-attention. However, ViTs are inherently data-intensive and lack\\ndomain-specific inductive biases, limiting their applicability in medical\\nimaging. In contrast, radiomics provides interpretable, handcrafted descriptors\\nof tissue heterogeneity but suffers from limited scalability and integration\\ninto end-to-end learning frameworks. In this work, we propose the\\nRadiomics-Embedded Vision Transformer (RE-ViT) that combines radiomic features\\nwith data-driven visual embeddings within a ViT backbone.\\n  Purpose: To develop a hybrid RE-ViT framework that integrates radiomics and\\npatch-wise ViT embeddings through early fusion, enhancing robustness and\\nperformance in medical image classification.\\n  Methods: Following the standard ViT pipeline, images were divided into\\npatches. For each patch, handcrafted radiomic features were extracted and fused\\nwith linearly projected pixel embeddings. The fused representations were\\nnormalized, positionally encoded, and passed to the ViT encoder. A learnable\\n[CLS] token aggregated patch-level information for classification. We evaluated\\nRE-ViT on three public datasets (including BUSI, ChestXray2017, and Retinal\\nOCT) using accuracy, macro AUC, sensitivity, and specificity. RE-ViT was\\nbenchmarked against CNN-based (VGG-16, ResNet) and hybrid (TransMed) models.\\n  Results: RE-ViT achieved state-of-the-art results: on BUSI,\\nAUC=0.950+/-0.011; on ChestXray2017, AUC=0.989+/-0.004; on Retinal OCT,\\nAUC=0.986+/-0.001, which outperforms other comparison models.\\n  Conclusions: The RE-ViT framework effectively integrates radiomics with ViT\\narchitectures, demonstrating improved performance and generalizability across\\nmultimodal medical image classification tasks.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph,cs.CV\", \"published\": \"2025-04-15T06:55:58Z\"}"}
