{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17450v1\", \"title\": \"Optimizing thermoelectric performance of graphene antidot lattices via\\n  quantum transport and machine-learning molecular dynamics simulations\", \"summary\": \"Thermoelectric materials, which can convert waste heat to electricity or be\\nutilized as solid-state coolers, hold promise for sustainable energy\\napplications. However, optimizing thermoelectric performance remains a\\nsignificant challenge due to the complex interplay between electronic and\\nthermal transport properties. In this work, we systematically optimize $ZT$ in\\ngraphene antidot lattices (GALs), nanostructured graphene sheets with periodic\\nnanopores characterized by two geometric parameters: the hexagonal unit cell\\nside length $L$ and the antidot radius $R$. The lattice thermal conductivity is\\ndetermined through machine-learned potential-driven molecular dynamics (MD)\\nsimulations, while electronic transport properties are computed using\\nlinear-scaling quantum transport in combination with MD trajectories based on a\\nbond-length-dependent tight-binding model. This method is able to account for\\nelectron-phonon scattering, allowing access to diffusive transport in\\nlarge-scale systems, overcoming limitations of previous methods based on\\nnonequilibrium Green function formalism. Our results show that the introduction\\nof the antidots effectively decouples lattice and electronic transport and lead\\nto a favorable and significant violation of the Wiedemann-Franz law. We find\\nthat optimal $ZT$ values occur in GALs with intermediate $L$ and $R$, closely\\ncorrelated with peak power factor values. Notably, thermoelectric performance\\npeaks near room temperature, with maximal $ZT$ values approaching 2,\\nhighlighting GALs as promising candidates for high-performance thermoelectric\\nenergy conversion.\", \"main_category\": \"cond-mat.mes-hall\", \"categories\": \"cond-mat.mes-hall,cond-mat.mtrl-sci\", \"published\": \"2025-04-24T11:29:06Z\"}"}
