{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01427v1\", \"title\": \"Observational diversity of bright long-lived Type II supernovae\", \"summary\": \"In various types of supernovae (SNe), strong interaction between the SN\\nejecta and circumstellar material (CSM) has been reported. This raises\\nquestions on their progenitors and mass-loss processes shortly before the\\nexplosion. Recently, the bright long-lived Type~II SN 2021irp was proposed to\\nbe a standard Type II SN interacting with disk-like CSM. The observational\\nproperties suggest that the progenitor was a massive star in a binary system\\nand underwent a mass-ejection process due to the binary interaction just before\\nthe explosion. Here, we study the diversity of the observational properties of\\nbright long-lived Type II (21irp-like) SNe. We analyse the diversity of their\\nCSM properties, in order to understand their progenitors and mass-loss\\nmechanisms and their relations with the other types of interacting SNe. We\\nperformed photometry, spectroscopy, and/or polarimetry for four 21irp-like SNe.\\nBased on these observations as well as published data of SN~2021irp itself and\\nwell-observed bright and long-lived type II SNe including SNe~2010jl, 2015da\\nand 2017hcc, we discuss their CSM characteristics. This sample of SNe shows\\nluminous and long-lived photometric evolution, with some variations in the\\nphotometric evolution (from $\\\\sim-17$ to $\\\\sim-20$ absolute mag in the $r$/$o$\\nband even at $\\\\sim 200$ days after the explosion). They show photospheric\\nspectra characterized mainly by Balmer lines for several hundreds of days, with\\nsome variations in the shapes of the lines. They show high polarization with\\nslight variations in the polarization degrees with rapid declines with time\\n(from $\\\\sim3-6$ \\\\% before the peak to $\\\\sim1$ \\\\% at $\\\\sim200$ days after the\\npeak). The observational properties are consistent with the\\ndisk-CSM-interaction scenario, i.e., typical Type~II SNe interacting with\\ndisk-like CSM.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.SR\", \"published\": \"2025-04-02T07:26:35Z\"}"}
