{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05173v1\", \"title\": \"PRDTs: Composable Knowledge-Based Consensus Protocols with Replicated\\n  Data Types\", \"summary\": \"Consensus protocols are fundamental in distributed systems as they enable\\nsoftware with strong consistency properties. However, designing optimized\\nprotocols for specific use-cases under certain system assumptions is typically\\na laborious and error-prone process requiring expert knowledge. While most\\nrecent optimized protocols are variations of well-known algorithms like Paxos\\nor Raft, they often necessitate complete re-implementations, potentially\\nintroducing new bugs and complicating the application of existing verification\\nresults.This approach stands in the way of application-specific consistency\\nprotocols that can easily be amended or swapped out, depending on the given\\napplication and deployment scenario.\\n  We propose Protocol Replicated Data Types (PRDTs), a novel programming model\\nfor implementing consensus protocols using replicated data types (RDTs).\\nInspired by the knowledge-based view of consensus, PRDTs employ RDTs to\\nmonotonically accumulate until agreement is reached. This approach allows for\\nimplementations focusing on high-level protocol logic with minimal network\\nenvironment assumptions. Moreover, by applying existing algebraic composition\\ntechniques for RDTs in the PRDT context, we enable composable protocol\\nbuilding-blocks for implementing complex protocols. We present a formal model\\nof our approach, demonstrate its application in PRDT-based implementations of\\nexisting protocols, and report empirical evaluation results. Our findings\\nindicate that the PRDT approach offers enhanced flexibility and composability\\nin protocol design, facilitates reasoning about correctness, and does not\\nsuffer from inherent performance limitations that would prevent its use in\\nreal-world applications.\", \"main_category\": \"cs.PL\", \"categories\": \"cs.PL,cs.DC\", \"published\": \"2025-04-07T15:17:35Z\"}"}
