{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17725v1\", \"title\": \"STGen: A Novel Lightweight IoT Testbed for Generating Sensor Traffic for\\n  the Experimentation of IoT Protocol and its Application in Hybrid Network\", \"summary\": \"A Wireless Sensor Network (WSN) is a network that does not rely on a fixed\\ninfrastructure and consists of numerous sensors, such as temperature, humidity,\\nGPS, and cameras, equipped with onboard processors that manage and monitor the\\nenvironment in a specific area. As a result, building a real sensor network\\ntestbed for verifying, validating, or experimenting with a newly designed\\nprotocol presents considerable challenges in adapting a laboratory scenario due\\nto the significant financial and logistical barriers, such as the need for\\nspecialized hardware and large-scale deployments. Additionally, WSN suffers\\nfrom severe constraints such as restricted power supply, short communication\\nrange, limited bandwidth availability, and restricted memory storage.\\nAddressing these challenges, this work presents a flexible testbed solution\\nnamed STGen that enables researchers to experiment with IoT protocols in a\\nhybrid environment that emulates WSN implementations with the physical Internet\\nthrough a dedicated physical server named STGen core, which receives sensor\\ntraffic and processes it for further actions. The STGen testbed is lightweight\\nin memory usage and easy to deploy. Most importantly, STGen supports\\nlarge-scale distributed systems, facilitates experimentation with IoT\\nprotocols, and enables integration with back-end services for big data\\nanalytics and statistical insights. The key feature of STGen is the integration\\nof real-world IoT protocols and their applications with WSN. Its modular and\\nlightweight design makes STGen efficient and enables it to outperform other\\npopular testbeds, such as Gotham and GothX, reducing memory usage by 89\\\\%.\\nWhile GothX takes approximately 26 minutes to establish a large topology with\\nfour VM nodes and 498 Docker nodes, STGen requires only 1.645 seconds to\\ninitialize the platform with 500 sensor nodes.\", \"main_category\": \"cs.NI\", \"categories\": \"cs.NI\", \"published\": \"2025-04-24T16:38:37Z\"}"}
