{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16034v1\", \"title\": \"LHCspin: a Polarized Gas Target for LHC\", \"summary\": \"The goal of the LHCspin project is to develop innovative solutions for\\nmeasuring the 3D structure of nucleons in high-energy polarized fixed-target\\ncollisions at LHC, exploring new processes and exploiting new probes in a\\nunique, previously unexplored, kinematic regime. A precise multi-dimensional\\ndescription of the hadron structure has, in fact, the potential to deepen our\\nunderstanding of the strong interactions and to provide a much more precise\\nframework for measuring both Standard Model and Beyond Standard Model\\nobservables. This ambitious task poses its basis on the recent experience with\\nthe successful installation and operation of the SMOG2 unpolarized gas target\\nin front of the LHCb spectrometer. Besides allowing for interesting physics\\nstudies ranging from astrophysics to heavy-ion physics, SMOG2 provides an ideal\\nbenchmark for studying beam-target dynamics at the LHC and demonstrates the\\nfeasibility of simultaneous operation with beam-beam collisions. With the\\ninstallation of the proposed polarized target system, LHCb will become the\\nfirst experiment to simultaneously collect data from unpolarized beam-beam\\ncollisions at $\\\\sqrt{s}$=14 TeV and polarized and unpolarized beam-target\\ncollisions at $\\\\sqrt{s_{NN}}\\\\sim$100 GeV. LHCspin has the potential to open new\\nfrontiers in physics by exploiting the capabilities of the world's most\\npowerful collider and one of the most advanced spectrometers. This document\\nalso highlights the need to perform an R\\\\&D campaign and the commissioning of\\nthe apparatus at the LHC Interaction Region 4 during the Run 4, before its\\nfinal installation in LHCb. This opportunity could also allow to undertake\\npreliminary physics measurements with unprecedented conditions.\", \"main_category\": \"hep-ex\", \"categories\": \"hep-ex\", \"published\": \"2025-04-22T16:58:08Z\"}"}
