{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05416v1\", \"title\": \"Variable Selection for Fixed and Random Effects in Multilevel Functional\\n  Mixed Effects Models\", \"summary\": \"We develop a new method for simultaneously selecting fixed and random effects\\nin a multilevel functional regression model. The proposed method is motivated\\nby accelerometer-derived physical activity data from the 2011-12 cohort of the\\nNational Health and Nutrition Examination Survey (NHANES), where we are\\ninterested in identifying age and race-specific heterogeneity in covariate\\neffects on the diurnal patterns of physical activity across the lifespan.\\nExisting methods for variable selection in function-on-scalar regression have\\nprimarily been designed for fixed effect selection and for single-level\\nfunctional data. In high-dimensional multilevel functional regression, the\\npresence of cluster-specific heterogeneity in covariate effects could be\\ndetected through sparsity in fixed and random effects, and for this purpose, we\\npropose a multilevel functional mixed effects selection (MuFuMES) method. The\\nfixed and random functional effects are modelled using splines, with\\nspike-and-slab group lasso (SSGL) priors on the unknown parameters of interest\\nand a computationally efficient MAP estimation approach is employed for mixed\\neffect selection through an Expectation Conditional Maximization (ECM)\\nalgorithm. Numerical analysis using simulation study illustrates the\\nsatisfactory selection accuracy of the variable selection method in having a\\nnegligible false-positive and false-negative rate. The proposed method is\\napplied to the accelerometer data from the NHANES 2011-12 cohort, where it\\neffectively identifies age and race-specific heterogeneity in covariate effects\\non the diurnal patterns of physical activity, recovering biologically\\nmeaningful insights.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME\", \"published\": \"2025-05-08T16:57:06Z\"}"}
