{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12756v1\", \"title\": \"Ultrafast laser high-aspect-ratio extreme nanostructuring of glass\\n  beyond \\u03bb/100\", \"summary\": \"The ultimate feature size is key in ultrafast laser material processing. A\\ncapacity to signiicantly exceed optical limits and to structure below 100nm is\\nessential to advance ultrafast processing into the field of metamaterials. Such\\nachievement requires to combine the control of optical near-fields and of\\nmaterial reactions, while preserving the exibility of long working distances,\\ncompatible with a mature laser process. Using sub-ps and ps non-diffractive\\nBessel beams, we demonstrate unprecedented feature sizes below a hundredth of\\nthe incident 1$\\\\mu$m wavelength over an extended focus depth of tens of $\\\\mu$m.\\nRecord features sizes, down to 7nm, result from self-generated near-field light\\ncomponents initiated by cavities induced by far-field radiation in a\\nback-surface illumination geometry. This sustains the generation of more\\nconfined near-field evanescent components along the laser scan with nm pitch,\\nperpendicular to the incident field direction, driving by local thermal\\nablation a super-resolved laser structuring process. The near-field pattern is\\nreplicated with high robustness, advancing towards a 10nm nanoscribing tool\\nwith a $\\\\mu$m-sized laser pen. The process is controllable by the field\\norientation. The non-diffractive irradiation develops evanescent fields over\\nthe focusing length, resulting in a high aspect ratio trenching with nm section\\nand $\\\\mu$m depth. Higher energy doses trigger the self-organization of\\nquasi-periodic patterns seeded by spatially modulated scattering, similarly to\\noptical modelocking. A predictive multipulse simulation method validates the\\nfar-field-induced near-field electromagnetic scenario of void nanochannel\\ngrowth and replication, indicating the processing range and resolution on the\\nsurface and in the depth.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics\", \"published\": \"2025-04-17T08:48:58Z\"}"}
