{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19896v1\", \"title\": \"Tracing the ejecta structure of SN 1987A: Insights and diagnostics from\\n  3D MHD simulations\", \"summary\": \"Supernova (SN) 1987A provides a unique window into the aftermath of a massive\\nstellar explosion, offering key insights into the ejecta's morphology,\\ncomposition, explosion mechanism, progenitor system, and circumstellar medium\\n(CSM) interaction. We investigate large-scale ejecta asymmetries in SN 1987A.\\nBy comparing the simulations with JWST observations and making predictions for\\nXRISM, we aim to refine our understanding of the explosion mechanism and the\\nremnant's evolution. We performed 3D MHD simulations that trace the evolution\\nof SN 1987A from the SN to the SNR, extending our predictions up to 5000 years\\ninto the future and considering the Ni-bubble effects. The simulation results\\nare compared with JWST observations and used to predict XRISM spectra, to\\nevaluate the accuracy of the modeled ejecta structure. Our simulations\\nreproduce the large-scale Fe-rich ejecta morphology seen by JWST, revealing two\\nclumps suggestive of a bipolar explosion. Ni-bubble effects in the first year\\nboost Fe-rich ejecta expansion and their interaction with the reverse shock.\\nHowever, discrepancies with JWST observations in clump velocities and spatial\\ndistribution suggest stronger explosion asymmetries than modeled. Since 2021,\\nour models predict that shocked ejecta have contributed increasingly to X-ray\\nemission, now rivaling shocked CSM and soon dominating as the latter fades.\\nFuture XRISM observations will trace the evolution of these ejecta structures,\\nrefining constraints on explosion geometry. Early remnant asymmetries from CSM\\ninteraction may persist for at least 100 years. Our results underscore the role\\nof asymmetric core-collapse mechanisms in shaping SN 1987A's ejecta and\\nconstraining its explosion geometry. Future studies should explore more extreme\\nasymmetries, in neutrino-driven core collapse or magneto-rotational SN models,\\nto identify the origin of its bipolar Fe-rich structure.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.SR\", \"published\": \"2025-04-28T15:28:40Z\"}"}
