{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20717v1\", \"title\": \"Timing analysis of the black-hole candidate Swift J1727.8-1613:\\n  detection of a dip-like feature in the high-energy cross spectrum\", \"summary\": \"We present a timing analysis of observations with the Hard X-ray Modulation\\nTelescope of the black hole X-ray transient Swift J1727.8-1613 during its 2023\\noutburst. We detect, for the first time in a black hole X-ray binary, a\\nprominent dip at ~ 3-15 Hz in the real part of the cross spectrum between\\nhigh-energy (>25 keV) and low-energy (<10 keV) photons in the Low Hard and Hard\\nIntermediate States, during which the QPO frequency rapidly increases and then\\nstabilizes at ~ 1.0-1.5 Hz. Remarkably, the real part of the cross spectrum\\nreaches negative values at the frequencies around the minimum of the dip,\\nindicative of a phase lag ranging between ${\\\\pi}/2$ and ${\\\\pi}$ in this\\nfrequency range. We fit the power spectra and the real and imaginary parts of\\nthe cross spectra simultaneously using a multi-Lorentzian model. Among the lag\\nmodels, the Gaussian phase-lag model provides a slightly better reduced\\n${\\\\chi}^2$ than the constant phase-lag and constant time-lag models, while it\\nalso alleviates the degeneracy associated with those models. From the\\nparameters of the Lorentzian that fits the dip, we estimate the size of the\\naccretion flow, which consistently exceeds 10,000 km as the QPO frequency\\nincreases from 0.13 Hz to 2.0 Hz. Furthermore, both the energy-dependent\\nphase-lag and fractional-rms spectra of the dip exhibit a change in trend\\naround 15 keV, with the phase lag dropping and rms reaching a local minimum.\\nThese spectra closely resemble the shapes predicted by the time-dependent\\nComptonization model, vKompth, for a low feedback factor, offering a pathway to\\nexplain the radiative properties of the corona. Additionally, the coherence\\nfunction suggests a diversity of variability components, potentially arising\\nfrom different parts of the corona.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-29T12:56:14Z\"}"}
