{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06904v1\", \"title\": \"Engineering solutions for non-stationary gas pipeline reconstruction and\\n  emergency management\", \"summary\": \"The reconstruction, management, and optimization of gas pipelines is of\\nsignificant importance for solving modern engineering problems. This paper\\npresents innovative methodologies aimed at the effective reconstruction of gas\\npipelines under unstable conditions. The research encompasses the application\\nof machine learning and optimization algorithms, targeting the enhancement of\\nsystem reliability and the optimization of interventions during emergencies.\\nThe findings of the study present engineering solutions aimed at addressing the\\nchallenges in real-world applications by comparing the performance of various\\nalgorithms. Consequently, this work contributes to the advancement of\\ncutting-edge approaches in the field of engineering and opens new perspectives\\nfor future research. A highly reliable and efficient technological Figure has\\nbeen proposed for managing emergency processes in gas transportation based on\\nthe principles of the reconstruction phase. For complex gas pipeline systems,\\nnew approaches have been investigated for the modernization of existing control\\nprocess monitoring systems. These approaches are based on modern achievements\\nin control theory and information technology, aiming to select emergency and\\ntechnological modes. One of the pressing issues is to develop a method to\\nminimize the transmission time of measured and controlled data on\\nnon-stationary flow parameters of gas networks to dispatcher control centers.\\nTherefore, the reporting Figures obtained for creating a reliable information\\nbase for dispatcher centers using modern methods to efficiently manage the gas\\ndynamic processes of non-stationary modes are of particular importance.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC\", \"published\": \"2025-04-09T14:05:44Z\"}"}
