{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04970v1\", \"title\": \"Over-the-Air ODE-Inspired Neural Network for Dual Task-Oriented Semantic\\n  Communications\", \"summary\": \"Analog machine-learning hardware platforms promise greater speed and energy\\nefficiency than their digital counterparts. Specifically, over-the-air analog\\ncomputation allows offloading computation to the wireless propagation through\\ncarefully constructed transmitted signals. In addition, reconfigurable\\nintelligent surface (RIS) is emerging as a promising solution for\\nnext-generation wireless networks, offering the ability to tailor the\\ncommunication environment. Leveraging the advantages of RIS, we design and\\nimplement the ordinary differential equation (ODE) neural network using\\nover-the-air computation (AirComp) and demonstrate its effectiveness for dual\\ntasks. We engineer the ambient wireless propagation environment through\\ndistributed RISs to create an architecture termed the over-the-air ordinary\\ndifferential equation (Air-ODE) network. Unlike the conventional digital\\nODE-inspired neural network, the Air-ODE block utilizes the physics of wave\\nreflection and the reconfigurable phase shifts of RISs to implement an ODE\\nblock in the analog domain, enhancing spectrum efficiency. Moreover, the\\nadvantages of Air-ODE are demonstrated in a deep learning-based semantic\\ncommunication (DeepSC) system by extracting effective semantic information to\\nreduce the data transmission load, while achieving the dual functions of image\\nreconstruction and semantic tagging simultaneously at the receiver. Simulation\\nresults show that the analog Air-ODE network can achieve similar performance to\\nthe digital ODE-inspired network. Specifically, for the image reconstruction\\nand semantic tagging task, compared with the analog network without the Air-ODE\\nblock, the Air-ODE block can achieve around 2 times gain in both reconstruction\\nquality and tagging accuracy.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-05-08T06:02:10Z\"}"}
