{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13020v1\", \"title\": \"Euclid preparation. Estimating galaxy physical properties using CatBoost\\n  chained regressors with attention\", \"summary\": \"Euclid will image ~14000 deg^2 of the extragalactic sky at visible and NIR\\nwavelengths, providing a dataset of unprecedented size and richness that will\\nfacilitate a multitude of studies into the evolution of galaxies. In the vast\\nmajority of cases the main source of information will come from broad-band\\nimages and data products thereof. Therefore, there is a pressing need to\\nidentify or develop scalable yet reliable methodologies to estimate the\\nredshift and physical properties of galaxies using broad-band photometry from\\nEuclid, optionally including ground-based optical photometry also. To address\\nthis need, we present a novel method to estimate the redshift, stellar mass,\\nstar-formation rate, specific star-formation rate, E(B-V), and age of galaxies,\\nusing mock Euclid and ground-based photometry. The main novelty of our\\nproperty-estimation pipeline is its use of the CatBoost implementation of\\ngradient-boosted regression-trees, together with chained regression and an\\nintelligent, automatic optimization of the training data. The pipeline also\\nincludes a computationally-efficient method to estimate prediction\\nuncertainties, and, in the absence of ground-truth labels, provides accurate\\npredictions for metrics of model performance up to z~2. We apply our pipeline\\nto several datasets consisting of mock Euclid broad-band photometry and mock\\nground-based ugriz photometry, to evaluate the performance of our methodology\\nfor estimating the redshift and physical properties of galaxies detected in the\\nEuclid Wide Survey. The quality of our photometric redshift and physical\\nproperty estimates are highly competitive overall, validating our modeling\\napproach. We find that the inclusion of ground-based optical photometry\\nsignificantly improves the quality of the property estimation, highlighting the\\nimportance of combining Euclid data with ancillary ground-based optical data.\\n(Abridged)\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.IM\", \"published\": \"2025-04-17T15:28:36Z\"}"}
