{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10331v1\", \"title\": \"LL-Gaussian: Low-Light Scene Reconstruction and Enhancement via Gaussian\\n  Splatting for Novel View Synthesis\", \"summary\": \"Novel view synthesis (NVS) in low-light scenes remains a significant\\nchallenge due to degraded inputs characterized by severe noise, low dynamic\\nrange (LDR) and unreliable initialization. While recent NeRF-based approaches\\nhave shown promising results, most suffer from high computational costs, and\\nsome rely on carefully captured or pre-processed data--such as RAW sensor\\ninputs or multi-exposure sequences--which severely limits their practicality.\\nIn contrast, 3D Gaussian Splatting (3DGS) enables real-time rendering with\\ncompetitive visual fidelity; however, existing 3DGS-based methods struggle with\\nlow-light sRGB inputs, resulting in unstable Gaussian initialization and\\nineffective noise suppression. To address these challenges, we propose\\nLL-Gaussian, a novel framework for 3D reconstruction and enhancement from\\nlow-light sRGB images, enabling pseudo normal-light novel view synthesis. Our\\nmethod introduces three key innovations: 1) an end-to-end Low-Light Gaussian\\nInitialization Module (LLGIM) that leverages dense priors from learning-based\\nMVS approach to generate high-quality initial point clouds; 2) a dual-branch\\nGaussian decomposition model that disentangles intrinsic scene properties\\n(reflectance and illumination) from transient interference, enabling stable and\\ninterpretable optimization; 3) an unsupervised optimization strategy guided by\\nboth physical constrains and diffusion prior to jointly steer decomposition and\\nenhancement. Additionally, we contribute a challenging dataset collected in\\nextreme low-light environments and demonstrate the effectiveness of\\nLL-Gaussian. Compared to state-of-the-art NeRF-based methods, LL-Gaussian\\nachieves up to 2,000 times faster inference and reduces training time to just\\n2%, while delivering superior reconstruction and rendering quality.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-14T15:39:31Z\"}"}
