{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04274v1\", \"title\": \"Integrated Airline Fleet and Crew Recovery through Local Search\", \"summary\": \"Airline operations are prone to delays and disruptions, since the schedules\\nare generally tight and depend on a lot of resources. When disruptions occur,\\nthe flight schedule needs to be adjusted such that the operation can continue.\\nSince this happens during the day of operations, this needs to be done as close\\nto real time as possible, posing a challenge with respect to computation time.\\nMoreover, to limit the impact of disruptions, we want a solution with minimal\\ncost and passenger impact. Since airline operations include many interlinked\\ndecisions, an integrated approach leads to better overall solutions. We\\nspecifically look at resolving these disruptions in both the aircraft and crew\\nschedules. Resolving these disruptions is complex, especially when it is done\\nin an integrated way, i.e. including multiple different resources.\\n  To solve this problem in an integrated manner, we developed a fast simulated\\nannealing approach. To the best of our knowledge, we are the first to develop a\\nlocal search approach to resolve airline disruptions in an integrated way. This\\napproach is compared with traditional approaches, and an experimental study is\\ndone to evaluate different neighbour generation methods, and to investigate\\ndifferent recovery scenarios and strategies. The comparison is done using real\\nworld data from KLM Royal Dutch Airlines. Here, we show that our approach\\nresolves disruptions quickly and in a cost-efficient manner, and that it\\noutperforms traditional approaches. Compared to naive delay propagation, our\\nmethod saves 40% in non-performance costs. Moreover, while most airlines use\\ntools that consider resources separately, our approach shows that integrated\\ndisruption management is possible within 30 seconds.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC\", \"published\": \"2025-05-07T09:24:06Z\"}"}
