{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15969v1\", \"title\": \"Improved energy-based scatter estimation by incorporating local energy\\n  spectra and accelerating the parametric fitting\", \"summary\": \"PET requires accurate, precise, and efficient scatter correction techniques.\\nConventional scatter estimation typically relies on tail-fitted single-scatter\\nsimulation (SSS) strategy. However, the accuracy of tail-fitted SSS is limited,\\nfor example, by mismatches between the attenuation image and the PET emission\\ndata or by the presence of activity outside the FOV. These shortcomings can be\\naddressed using energy-based scatter estimation (EBSE), as recently proposed by\\nEfthimiou et al. and Hamill et al. The aim of this work is to 1. improve the\\naccuracy of EBSE by accounting for the LOR dependence of the energy spectrum of\\nunscattered photons, 2. improve the computational speed of EBSE through better\\ninitialization and a more efficient optimization algorithm. The proposed\\nimproved EBSE method models the energy probability density function (PDF) of\\nboth single and multiple scattered photons, and incorporates a\\nposition-dependent energy PDF for unscattered photons. These energy PDFs form\\nthe basis of two forward models used for scatter estimation based on 2D energy\\nhistograms. The performance of these models were evaluated using GATE Monte\\nCarlo simulations and a NEMA phantom acquisition on a GE SIGNA PET/MR scanner.\\nFurthermore, we assessed the stability of EBSE across the forward models by\\nvarying the number of counts in the 2D energy histograms via data mashing. EBSE\\noutperformed tail-fitted SSS, particularly in regions near out-of-FOV activity.\\nOur GATE simulations showed that incorporating a local energy for unscattered\\nphotons improves off-center regional quantification by approximately 2% points.\\nAdditionally, improved initialization combined with the NEGML optimizer\\nenabling execution on a mashed TOF sinogram in 12 minutes on six-core CPU. The\\nproposed method enhances both the accuracy and computational efficiency of\\nEBSE, making it well-suited for clinical applications.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph\", \"published\": \"2025-04-22T15:09:54Z\"}"}
