{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11951v1\", \"title\": \"Pulsatile Magnetized $Cu$-$Al_{2}O_{3}$/Casson Blood Flow Through an\\n  Elliptical Stenotic Artery for Drug Delivery Applications\", \"summary\": \"Among cardiovascular diseases, atherosclerosis is a primary cause of\\nstenosis, involving the accumulation of plaques in the inner lining of an\\nartery. Inspired by drug delivery applications, the proposed study aims to\\nexamine the numerical modeling of a two-dimensional, axisymmetric, and\\ntime-dependent hybrid nanofluid composed of copper $(Cu)$, alumina\\n$(Al_{2}O_{3})$ nanoparticles, and blood as base fluid. Blood, modeled by the\\nnon-Newtonian Casson model, flows through an elliptical stenotic artery. The\\npulsatile nature of the pressure gradient and magnetic field impact with the\\nHall current parameter are also taken into account in this study. A finite\\ndifference technique, forward in time and central in space (FTCS), is deployed\\nto numerically discretize the transformed dimensionless model using MATLAB.\\nComprehensive visualization of the effects of hemodynamic, geometric, and\\nnanoscale parameters on transport characteristics, and extensive graphical\\nresults for blood flow characteristics are provided. A comparison is made among\\nblood, regular nanofluid, and hybrid nanofluid to analyze their properties in\\nrelation to fluid flow and heat transfer. An augmentation in the non-Newtonian\\nparameter results in an amplification of velocity and in a reduction of the\\ntemperature profile. Incorporating $Cu$ and $Al_2O_3$ nanoparticles into the\\nfluid results in a decrease of velocity and an increase of temperature. These\\nfindings possess significant practical implications for applications where\\nefficient heat transfer is essential, such as in drug delivery systems and the\\nthermal management of biomedical devices. However, the observed reduction in\\nvelocity may necessitate modifications to flow conditions to ensure optimal\\noperational performance in these contexts.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-16T10:28:37Z\"}"}
