{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12161v1\", \"title\": \"Search for an exotic decay of the 125 GeV Higgs boson to a pair of light\\n  pseudoscalars in the final state of two muons and two c-quarks in\\n  proton-proton collisions at $\\\\sqrt{s} = 13\\\\;\\\\text{TeV}$ with CMS Open Data\", \"summary\": \"A search is performed for pairs of light pseudoscalar bosons (a) produced\\nfrom decays of the 125 GeV Higgs boson ($\\\\text{h}_{125}$). The analysis is\\nbased on publicly available data collected in 2016 by the CMS experiment at the\\nLHC in proton-proton collisions at a center-of-mass energy of 13 TeV. The\\namount of data analyzed corresponds to an integrated luminosity of 16.4\\n$\\\\text{fb}^{-1}$. The analysis explores for the first time at the LHC the final\\nstate exhibiting two muons and two c-quarks, which originate from\\nflavor-asymmetric decays of the pseudoscalar pair. The search probes the\\npseudoscalar boson mass interval comprised between 4 and 11 GeV, which\\nrepresents a region where the light bosons exhibit a considerable Lorentz\\nboost, and thus their decay products overlap. No significant deviation from the\\nstandard model expectation is observed. Model-independent upper limits at 95%\\nconfidence level are set on the product of the cross section and branching\\nfraction for the ${\\\\text{h}_{125} \\\\rightarrow \\\\text{a}\\\\text{a} \\\\rightarrow\\n\\\\mu^{-}\\\\mu^{+} c\\\\bar{c}}$ process relative to the standard model Higgs boson\\nproduction cross section, reaching a minimum value close to $3.3 \\\\times\\n10^{-4}$. The results are interpreted in the context of two Higgs doublets plus\\nsinglet models and compared to existing experimental results covering other\\ndecay channels. The exclusion limits obtained by this search improve the\\ncurrent constraints set by various LHC searches in scenarios where the coupling\\nof the light boson to up-type quarks is enhanced.\", \"main_category\": \"hep-ex\", \"categories\": \"hep-ex\", \"published\": \"2025-04-16T15:10:57Z\"}"}
