{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11398v1\", \"title\": \"Breaking a Long-Standing Barrier: 2-$\\\\varepsilon$ Approximation for\\n  Steiner Forest\", \"summary\": \"The Steiner Forest problem, also known as the Generalized Steiner Tree\\nproblem, is a fundamental optimization problem on edge-weighted graphs where,\\ngiven a set of vertex pairs, the goal is to select a minimum-cost subgraph such\\nthat each pair is connected. This problem generalizes the Steiner Tree problem,\\nfirst introduced in 1811, for which the best known approximation factor is 1.39\\n[Byrka, Grandoni, Rothvo{\\\\ss}, and Sanit\\\\`a, 2010] (Best Paper award, STOC\\n2010).\\n  The celebrated work of [Agrawal, Klein, and Ravi, 1989] (30-Year Test-of-Time\\naward, STOC 2023), along with refinements by [Goemans and Williamson, 1992]\\n(SICOMP'95), established a 2-approximation for Steiner Forest over 35 years\\nago. Jain's (FOCS'98) pioneering iterative rounding techniques later extended\\nthese results to higher connectivity settings. Despite the long-standing\\nimportance of this problem, breaking the approximation factor of 2 has remained\\na major challenge, raising suspicions that achieving a better factor -- similar\\nto Vertex Cover -- might indeed be hard. Notably, fundamental works, including\\nthose by Gupta and Kumar (STOC'15) and Gro{\\\\ss} et al. (ITCS'18), introduced\\n96- and 69-approximation algorithms, possibly with the hope of paving the way\\nfor a breakthrough in achieving a constant-factor approximation below 2 for the\\nSteiner Forest problem.\\n  In this paper, we break the approximation barrier of 2 by designing a novel\\ndeterministic algorithm that achieves a $2 - 10^{-11}$ approximation for this\\nfundamental problem. As a key component of our approach, we also introduce a\\nnovel dual-based local search algorithm for the Steiner Tree problem with an\\napproximation guarantee of $1.943$, which is of independent interest.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS\", \"published\": \"2025-04-15T17:13:48Z\"}"}
