{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19944v1\", \"title\": \"Probabilistic and Causal Satisfiability: Constraining the Model\", \"summary\": \"We study the complexity of satisfiability problems in probabilistic and\\ncausal reasoning. Given random variables $X_1, X_2,\\\\ldots$ over finite domains,\\nthe basic terms are probabilities of propositional formulas over atomic events\\n$X_i = x_i$, such as $P(X_1 = x_1)$ or $P(X_1 = x_1 \\\\vee X_2 = x_2)$. The basic\\nterms can be combined using addition (yielding linear terms) or multiplication\\n(polynomial terms). The probabilistic satisfiability problem asks whether a\\njoint probability distribution satisfies a Boolean combination of\\n(in)equalities over such terms. Fagin et al. (1990) showed that for basic and\\nlinear terms, this problem is NP-complete, making it no harder than Boolean\\nsatisfiability, while Moss\\\\'e et al. (2022) proved that for polynomial terms,\\nit is complete for the existential theory of the reals.\\n  Pearl's Causal Hierarchy (PCH) extends the probabilistic setting with\\ninterventional and counterfactual reasoning, enriching the expressiveness of\\nlanguages. However, Moss\\\\'e et al. (2022) found that satisfiability complexity\\nremains unchanged. Van der Zander et al. (2023) showed that introducing a\\nmarginalization operator to languages induces a significant increase in\\ncomplexity.\\n  We extend this line of work by adding two new dimensions to the problem by\\nconstraining the models. First, we fix the graph structure of the underlying\\nstructural causal model, motivated by settings like Pearl's do-calculus, and\\ngive a nearly complete landscape across different arithmetics and PCH levels.\\nSecond, we study small models. While earlier work showed that satisfiable\\ninstances admit polynomial-size models, this is no longer guaranteed with\\ncompact marginalization. We characterize the complexities of satisfiability\\nunder small-model constraints across different settings.\", \"main_category\": \"cs.CC\", \"categories\": \"cs.CC,cs.AI,cs.LO\", \"published\": \"2025-04-28T16:14:06Z\"}"}
