{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21270v1\", \"title\": \"A Framework for Elastic Adaptation of User Multiple Intents in\\n  Sequential Recommendation\", \"summary\": \"Recently, substantial research has been conducted on sequential\\nrecommendation, with the objective of forecasting the subsequent item by\\nleveraging a user's historical sequence of interacted items. Prior studies\\nemploy both capsule networks and self-attention techniques to effectively\\ncapture diverse underlying intents within a user's interaction sequence,\\nthereby achieving the most advanced performance in sequential recommendation.\\nHowever, users could potentially form novel intents from fresh interactions as\\nthe lengths of user interaction sequences grow. Consequently, models need to be\\ncontinually updated or even extended to adeptly encompass these emerging user\\nintents, referred as incremental multi-intent sequential recommendation. % We\\nrefer to this problem as incremental multi-intent sequential recommendation,\\nwhich has not yet been well investigated in the existing literature. In this\\npaper, we propose an effective Incremental learning framework for user\\nMulti-intent Adaptation in sequential recommendation called IMA, which augments\\nthe traditional fine-tuning strategy with the existing-intents retainer,\\nnew-intents detector, and projection-based intents trimmer to adaptively expand\\nthe model to accommodate user's new intents and prevent it from forgetting\\nuser's existing intents. Furthermore, we upgrade the IMA into an Elastic\\nMulti-intent Adaptation (EMA) framework which can elastically remove inactive\\nintents and compress user intent vectors under memory space limit. Extensive\\nexperiments on real-world datasets verify the effectiveness of the proposed IMA\\nand EMA on incremental multi-intent sequential recommendation, compared with\\nvarious baselines.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-04-30T02:55:30Z\"}"}
