{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17239v1\", \"title\": \"Polydisperse polymer networks with irregular topologies\", \"summary\": \"The structure of polymer networks, defined by chain lengths and connectivity\\npatterns, fundamentally influences their bulk properties. Despite decades of\\nresearch, many open questions remain regarding structure-property\\nrelationships, particularly in heterogeneous networks. While existing polymer\\nnetwork models connect chain properties to emergent network behavior, they are\\noften limited to monodisperse networks with regular connectivities, making the\\nextension to heterogeneous systems an active area of research. In this work, we\\nintroduce a novel modeling framework that shifts the focus from individual\\npolymer chains to cross-links and their connected chains as the fundamental\\nunit of analysis. This perspective enables direct incorporation of structural\\nheterogeneity by averaging over cross-links with different chain lengths and\\ncoordination numbers. We establish important connections between polymerization\\ntheory and statistical descriptors of network structure, providing key\\ncomponents of a theoretical foundation for predicting properties from the\\nsynthesis parameters. Our results demonstrate that increased variance in\\nmonomer numbers generally leads to network softening, while in bimodal\\nnetworks, the onset of strain stiffening is controlled by shorter chains and\\nthe stiffening response is modulated by the ratio of short to long chains. By\\nderiving closed-form approximations valid in both the limits of (1) small\\ndeformation and (2) finite deformation but with small polydispersity, we offer\\nan efficient computational approach to modeling complex networks. This\\nframework represents an advance toward the rational modeling and design of\\nheterogeneous polymer networks with structures tailored for specific\\nproperties.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-04-24T04:25:12Z\"}"}
