{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16522v1\", \"title\": \"On Bell numbers of type $D$\", \"summary\": \"In this paper, we will introduce Bell numbers $D(n)$ of type $D$ as an\\nanalogue to the classical Bell numbers related to all the partitions of the set\\n$[n]$. Then based on a signed set partition of type $D$, we will construct the\\nrecurrence relations of Bell numbers $D(n)$. In addition, we deduce the\\nexponential generating function for $D(n)$. Finally, we will provide an\\nexplicit formula for $D(n)$.\", \"main_category\": \"math.CO\", \"categories\": \"math.CO\", \"published\": \"2025-04-23T08:46:10Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16538v1\", \"title\": \"Streetscape Analysis with Generative AI (SAGAI): Vision-Language\\n  Assessment and Mapping of Urban Scenes\", \"summary\": \"Streetscapes are an essential component of urban space. Their assessment is\\npresently either limited to morphometric properties of their mass skeleton or\\nrequires labor-intensive qualitative evaluations of visually perceived\\nqualities. This paper introduces SAGAI: Streetscape Analysis with Generative\\nArtificial Intelligence, a modular workflow for scoring street-level urban\\nscenes using open-access data and vision-language models. SAGAI integrates\\nOpenStreetMap geometries, Google Street View imagery, and a lightweight version\\nof the LLaVA model to generate structured spatial indicators from images via\\ncustomizable natural language prompts. The pipeline includes an automated\\nmapping module that aggregates visual scores at both the point and street\\nlevels, enabling direct cartographic interpretation. It operates without\\ntask-specific training or proprietary software dependencies, supporting\\nscalable and interpretable analysis of urban environments. Two exploratory case\\nstudies in Nice and Vienna illustrate SAGAI's capacity to produce geospatial\\noutputs from vision-language inference. The initial results show strong\\nperformance for binary urban-rural scene classification, moderate precision in\\ncommercial feature detection, and lower estimates, but still informative, of\\nsidewalk width. Fully deployable by any user, SAGAI can be easily adapted to a\\nwide range of urban research themes, such as walkability, safety, or urban\\ndesign, through prompt modification alone.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.LG\", \"published\": \"2025-04-23T09:08:06Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16554v1\", \"title\": \"Temperature switchable self-propulsion activity of liquid crystalline\\n  microdroplets\", \"summary\": \"We report on a switchable emulsion droplet microswimmer by utilizing a\\ntemperature-dependent transition of the droplet phase. The droplets, made from\\na liquid crystalline (LC) smectic phase material ($T =$ 25 $^{\\\\circ}$C),\\nself-propel only in their nematic and isotropic phases at elevated temperatures\\n($T\\\\ge$ 33.5 $^{\\\\circ}$C). This transition between motile and non-motile states\\nis fully reversible - in the motile state, the droplets exhibit persistent\\nmotion and directional memory over multiple heating-cooling cycles. Further, we\\ndistinguish the state of rest from the state of motion by characterizing the\\nchemical and hydrodynamic fields of the droplets. Next, we map the motility\\nbehaviour of the droplets across varying surfactant concentrations and\\ntemperatures, observing that swimming occurs only at sufficiently high\\nsurfactant concentrations above and temperatures above the smectic-nematic\\nphase transition temperature $\\\\textit{i.e.}$ $T\\\\ge$ 33.5 $^{\\\\circ}$C. Our work\\nenvisions the potential of LC emulsion droplets as switchable microswimmers.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-04-23T09:32:19Z\"}"}
