{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05046v1\", \"title\": \"MotionPRO: Exploring the Role of Pressure in Human MoCap and Beyond\", \"summary\": \"Existing human Motion Capture (MoCap) methods mostly focus on the visual\\nsimilarity while neglecting the physical plausibility. As a result, downstream\\ntasks such as driving virtual human in 3D scene or humanoid robots in real\\nworld suffer from issues such as timing drift and jitter, spatial problems like\\nsliding and penetration, and poor global trajectory accuracy. In this paper, we\\nrevisit human MoCap from the perspective of interaction between human body and\\nphysical world by exploring the role of pressure. Firstly, we construct a\\nlarge-scale human Motion capture dataset with Pressure, RGB and Optical sensors\\n(named MotionPRO), which comprises 70 volunteers performing 400 types of\\nmotion, encompassing a total of 12.4M pose frames. Secondly, we examine both\\nthe necessity and effectiveness of the pressure signal through two challenging\\ntasks: (1) pose and trajectory estimation based solely on pressure: We propose\\na network that incorporates a small kernel decoder and a long-short-term\\nattention module, and proof that pressure could provide accurate global\\ntrajectory and plausible lower body pose. (2) pose and trajectory estimation by\\nfusing pressure and RGB: We impose constraints on orthographic similarity along\\nthe camera axis and whole-body contact along the vertical axis to enhance the\\ncross-attention strategy to fuse pressure and RGB feature maps. Experiments\\ndemonstrate that fusing pressure with RGB features not only significantly\\nimproves performance in terms of objective metrics, but also plausibly drives\\nvirtual humans (SMPL) in 3D scene. Furthermore, we demonstrate that\\nincorporating physical perception enables humanoid robots to perform more\\nprecise and stable actions, which is highly beneficial for the development of\\nembodied artificial intelligence. Project page is available at:\\nhttps://nju-cite-mocaphumanoid.github.io/MotionPRO/\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-07T13:17:24Z\"}"}
