{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19791v1\", \"title\": \"Low-Complexity Channel Estimation Protocol for Non-Diagonal RIS-Assisted\\n  Communications\", \"summary\": \"Non-diagonal reconfigurable intelligent surfaces (RIS) offer enhanced\\nwireless signal manipulation over conventional RIS by enabling the incident\\nsignal on any of its $M$ elements to be reflected from another element via an\\n$M \\\\times M$ switch array. To fully exploit this flexible configuration, the\\nacquisition of individual channel state information (CSI) is essential.\\nHowever, due to the passive nature of the RIS, cascaded channel estimation is\\nperformed, as the RIS itself lacks signal processing capabilities. This entails\\nestimating the CSI for all $M \\\\times M$ switch array permutations, resulting in\\na total of $M!$ possible configurations, to identify the optimal one that\\nmaximizes the channel gain. This process leads to long uplink training\\nintervals, which degrade spectral efficiency and increase uplink energy\\nconsumption. In this paper, we propose a low-complexity channel estimation\\nprotocol that substantially reduces the need for exhaustive $M!$ permutations\\nby utilizing only three configurations to optimize the non-diagonal RIS switch\\narray and beamforming for single-input single-output (SISO) and multiple-input\\nsingle-output (MISO) systems. Specifically, our three-stage pilot-based\\nprotocol estimates scaled versions of the user-RIS and RIS-base-station (BS)\\nchannels in the first two stages using the least square (LS) estimator and the\\ncommonly used ON/OFF protocol from conventional RIS. In the third stage, the\\ncascaded user-RIS-BS channels are estimated to enable efficient beamforming\\noptimization. Complexity analysis shows that our proposed protocol\\nsignificantly reduces the BS computational load from $\\\\mathcal{O}(NM\\\\times M!)$\\nto $\\\\mathcal{O}(NM)$, where $N$ is the number of BS antennas. This complexity\\nis similar to the conventional ON/OFF-based LS estimation for conventional\\ndiagonal RIS.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-28T13:34:21Z\"}"}
