{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12629v1\", \"title\": \"Sampling-based Quantum Optimization Algorithm with Quantum Relaxation\", \"summary\": \"Variational Quantum Algorithm (VQA) is a hybrid algorithm for noisy quantum\\ndevices. However, statistical fluctuations and physical noise degrade the\\nsolution quality, so it is difficult to maintain applicability for large-scale\\nproblems. In contrast, Sampling-based Quantum Algorithms have recently been\\nsuccessfully applied to large-scale quantum chemistry problems. The quantum\\ndevice is used only for sampling, and the ground state and its energy are\\nestimated on the classical device. In this study, we propose the Sampling-based\\nQuantum Optimization Algorithm (SQOA). Two challenges exist in constructing a\\nSampling-based Quantum Algorithm for combinatorial optimization. The first\\nchallenge is that we need to encode the optimization problem in a non-diagonal\\nHamiltonian, even though many VQAs encode it into the Ising Hamiltonian, which\\nis diagonal. The second challenge is that we need a method to prepare the input\\nstate to be sampled efficiently. We employ the Quantum Relaxation (QR) method\\nfor the first challenge, which encodes multiple classical variables in one\\nqubit. It reduces required qubits compared to the Ising Hamiltonian approach.\\nMoreover, we investigate the parameter transferability in the Quantum\\nAlternating Operator Ansatz for QR Hamiltonians for the second challenge. We\\nshow that restricting parameters to a linear form exhibits moderate\\ntransferability for 3-regular MaxCut problems, similar to transferability\\nobserved in the Quantum Approximate Optimization Algorithm. This property\\nallows us to efficiently prepare the input state for a large instance using the\\nparameters from a small instance. We leveraged transferability to create input\\nstates and applied SQOA with QR to the MaxCut instances. Transferring\\nparameters from a 20-node problem demonstrates that SQOA with QR provides\\nhigh-quality solutions for 40-node problems without variational parameter\\noptimization.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-17T04:13:51Z\"}"}
