{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11122v1\", \"title\": \"What it takes to break a liquid: analysis of the cavitation threshold in\\n  various media\", \"summary\": \"Cavitation has historically been related to parameters measured at\\nequilibrium, such as vapor pressure and surface tension. However, nucleation\\nmight occur when the liquid is metastable, especially for fast phenomena such\\nas cavitation induced by high-frequency acoustic waves. This is one of the\\nreasons for the large discrepancy between the experimental estimate of the\\ncavitation threshold and the theory's predictions.\\n  Our investigation aims to identify nucleation thresholds in various\\nsubstances characterized by different physical properties. The experiments were\\nperformed by initiating nucleation through ultrasound at 24 kHz. The cavitation\\nonset was studied using a novel procedure based on high-speed imaging and\\nacoustic measurements with a hydrophone. Combining these two techniques allowed\\nus to define the exact instant cavitation occurred in the liquid medium. The\\nbubble nucleation was framed at 200,000 fps with a spatial resolution in the\\norder of micrometers. Such fine temporal and spatial resolutions allowed us to\\ntrack the expansion of the cavitation bubble right after its onset. We tested\\nfive different substances and tracked the amplitude of the transducer\\noscillation to reconstruct the pressure field when cavitation occurs. This\\nallows us to identify the liquid's acoustic cavitation threshold (tensile\\nstrength). The data collected confirmed that the vapor pressure is not a good\\nindicator of the occurrence of cavitation for acoustic systems. Furthermore,\\nall substances exhibit similar behavior despite their different physical\\nproperties. This might seem counterintuitive, but it sheds light on the\\nnucleation mechanism that originates cavitation in a lab-scale acoustic system.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-15T12:09:58Z\"}"}
