{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17583v1\", \"title\": \"Shared Randomness in Locally Checkable Problems: The Role of\\n  Computational Assumptions\", \"summary\": \"Shared randomness is a valuable resource in distributed computing, but what\\nhappens when the shared random string can affect the inputs to the system?\\n  Consider the class of distributed graph problems where the correctness of\\nsolutions can be checked locally, known as Locally Checkable Labelings (LCL).\\nLCL problems have been extensively studied in the LOCAL model, where nodes\\noperate in synchronous rounds and have access only to local information. This\\nhas led to intriguing insights regarding the power of private randomness. E.g.,\\nfor certain round complexity classes, derandomization does not incur an\\noverhead (asymptotically).\\n  This work considers a setting where the randomness is public. Recently, an\\nLCL problem for which shared randomness can reduce the round complexity was\\ndiscovered by Balliu et al. (2024). This result applies to inputs set\\nobliviously of the shared randomness, which may not always be a plausible\\nassumption.\\n  We define a model where the inputs can be adversarially chosen, even based on\\nthe shared randomness, which we now call preset public coins. We study LCL\\nproblems in the preset public coins model, under assumptions regarding the\\ncomputational power of the adversary that selects the input. We show\\nconnections to hardness in the class TFNP. Our results are:\\n  1. Assuming the existence of a hard-on-average problem in TFNP (which follows\\nfrom fairly benign cryptographic assumptions), we show an LCL problem that, in\\nthe preset public coins model, demonstrates a gap in the round complexity\\nbetween polynomial-time adversaries and unbounded ones.\\n  2. If there exists an LCL problem for which the error probability is\\nsignificantly higher when facing unbounded adversaries, then a hard-on-average\\nproblem in TFNP/poly must exist.\", \"main_category\": \"cs.DC\", \"categories\": \"cs.DC\", \"published\": \"2025-04-24T14:13:09Z\"}"}
