{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17538v1\", \"title\": \"SimFLEX: a methodology for comparative analysis of urban areas for\\n  implementing new on-demand feeder bus services\", \"summary\": \"On-demand feeder bus services present an innovative solution to urban\\nmobility challenges, yet their success depends on thorough assessment and\\nstrategic planning. Despite their potential, a comprehensive framework for\\nevaluating feasibility and identifying suitable service areas remains\\nunderdeveloped. Simulation Framework for Feeder Location Evaluation (SimFLEX)\\nuses spatial, demographic, and transport-specific data to run microsimulations\\nand compute key performance indicators (KPIs), including service\\nattractiveness, waiting time reduction, and added value. SimFLEX employs\\nmultiple replications to estimate demand and mode choices and integrates\\nOpenTripPlanner (OTP) for public transport routing and ExMAS for calculating\\nshared trip attributes and KPIs. For each demand scenario, we model the\\ntraveler learning process using the method of successive averages (MSA),\\nstabilizing the system. After stabilization, we calculate KPIs for comparative\\nand sensitivity analyzes. We applied SimFLEX to compare two remote urban areas\\nin Krakow, Poland - Bronowice and Skotniki - the candidates for service launch.\\nOur analysis revealed notable differences between analyzed areas: Skotniki\\nexhibited higher service attractiveness (up to 30%) and added value (up to 7%),\\nwhile Bronowice showed greater potential for reducing waiting times (by nearly\\n77%). To assess the reliability of our model output, we conducted a sensitivity\\nanalysis across a range of alternative-specific constants (ASC). The results\\nconsistently confirmed Skotniki as the superior candidate for service\\nimplementation. SimFLEX can be instrumental for policymakers to estimate new\\nservice performance in the considered area, publicly available and applicable\\nto various use cases. It can integrate alternative models and approaches,\\nmaking it a versatile tool for policymakers and urban planners to enhance urban\\nmobility.\", \"main_category\": \"physics.soc-ph\", \"categories\": \"physics.soc-ph,cs.CY\", \"published\": \"2025-04-24T13:27:49Z\"}"}
