{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17630v1\", \"title\": \"Geometry-induced asymmetric level coupling\", \"summary\": \"Tailoring energy levels in quantum systems via Hamiltonian control parameters\\nis essential for designing quantum thermodynamic devices and materials.\\nHowever, conventional methods for manipulating finite-size systems, such as\\ntuning external fields or system size, typically lead to uniform spectral\\nshifts, limiting precise control. A recently introduced technique, called the\\nsize-invariant shape transformation, overcomes this by introducing a new\\ncontrol parameter that deforms the potential landscape without altering system\\nsize, enabling nonuniform level scaling. This shape parameter gives rise to\\nquantum shape effects in confined systems, conceptually distinct from quantum\\nsize effects. We explore the limits of this phenomenon by asking: what is the\\nminimal system in which such spectral behavior can emerge? We show that even a\\ntwo-level system can exhibit thermodynamic consequences of quantum shape\\neffects, including spontaneous transitions into lower-entropy states, a feature\\nabsent in classical thermodynamics for non-interacting systems. We identify the\\norigin as geometry-induced asymmetric level coupling, where the ground-state\\nenergy and level spacing respond oppositely to shape changes. This extends to\\nmany-level systems, where the thermally averaged level spacing and ground-state\\nenergy evolve in opposite directions. We construct spontaneity maps revealing\\nenergy- and entropy-driven spontaneous processes. These behaviors emerge under\\nquasistatic, isothermal deformations and show how geometry alone can induce\\nthermodynamic effects typically exclusive to interacting or open systems. Our\\nresults offer a broadly applicable route to spectral gap control in quantum\\ntechnologies.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cond-mat.mes-hall,cond-mat.stat-mech\", \"published\": \"2025-04-24T14:58:44Z\"}"}
