{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05144v1\", \"title\": \"Output correction factors in a 1.5 T magnetic field determined at the\\n  central axis and at the lateral dose maximum for five detectors using alanine\", \"summary\": \"In recent literature, the output correction factor in a 1.5T magnetic field,\\nkB,Q,Clin, were determined only for the central axis (CAX), including our last\\nwork. At an MR-linac, the determination of the CAX position relies on e.g.\\nMV-imaging and is at small field sizes located at the penumbra, whereas the\\nmaximum of the lateral profile (MAX) position is directly measurable. This\\nstudy determined kB,Q,Ratio - the influence of the magnetic field on the output\\ncorrection factor without a magnetic field, kQ,Clin - and kB,Q,Clin for both\\nCAX and MAX fully experimentally for two MR-optimized ionization chambers,\\ntheir conventional counterparts, and a solid-state detector. Additionally, the\\nuncertainty due to intra-type variation for tabulated kB,Q,Clin was estimated.\\nMeasurements were conducted using an experimental setup consisting of a mobile\\nelectromagnet positioned in front of a standard clinical linac (6MV, 1.5T).\\nIntra-type variation for the solid-state detector was assessed using four\\ndetectors. The change of absorbed dose to water was determined with alanine.\\nWithin the uncertainty, no difference in kB,Q,Ratio was observed between the\\nMR-optimized chambers and their conventional counterparts. For the solid-state\\ndetector, no difference between CAX and MAX was observed. For all detectors,\\nkB,Q,Clin remained constant down to a field size of 3x3cm2. At smaller field\\nsizes, for MAX and for all detectors, kB,Q,Ratio decreased linearly. The\\nmaximum intra-type variation standard uncertainty was 0.009 for the smallest\\nfield size, with and without a magnetic field. In summary, kB,Q,Ratio and\\nkB,Q,Clin, including its uncertainty, was successfully determined for five\\ndetectors at both CAX and MAX. For ionization chambers, kB,Q,Clin is lower at\\nMAX, whereas for the solid-state detector, it remains the same. For the\\ntabulated correction factors uncertainty, intra-type variation must be\\nconsidered.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph,physics.ins-det\", \"published\": \"2025-05-08T11:28:49Z\"}"}
