{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15034v1\", \"title\": \"Predicting Methane Adsorption in Metal-Substituted MOFs: A Comparative\\n  Study between Density Functional Theory and Machine Learning\", \"summary\": \"Metal-organic frameworks (MOFs) are promising materials for methane capture\\ndue to their high surface area and tunable properties. Metal substitution\\nrepresents a powerful strategy to enhance MOF performance, yet systematic\\nexploration of the vast chemical space remains challenging. In this work, we\\ncompare density functional theory (DFT) and machine learning (ML) in predicting\\nmethane adsorption properties in metal-substituted variants of three\\nhigh-performing MOFs: M-HKUST-1, M-ATC, and M-ZIF-8 (M = Cu, Zn). DFT\\ncalculations reveal significant differences in methane binding energetics\\nbetween Cu and Zn variants of all three MOFs. On the other hand, we fine-tuned\\na pretrained multimodal ML model, PMTransformer, on a curated subset of\\nhypothetical MOF (hMOF) structures to predict macroscopic adsorption\\nproperties. While the model qualitatively predicts adsorption properties for\\nthe original unaltered MOFs, it fails to distinguish between metal variants\\ndespite their different binding energetics identified by DFT. We trace this\\nlimitation to the hMOF training data generated using Grand Canonical Monte\\nCarlo (GCMC) simulations based on classical force fields (UFF/TraPPE). Our\\nstudy highlights a key challenge in ML-based MOF screening: ML models inherit\\nthe limitations of their training data, particularly when electronic effects\\nsignificantly impact adsorption behavior. Our findings emphasize the need for\\nimproved force fields or hybrid GCMC/DFT datasets to incorporate both geometric\\nand electronic factors for accurate prediction of adsorption properties in\\nmetal-substituted MOFs.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,physics.chem-ph\", \"published\": \"2025-04-21T11:41:32Z\"}"}
