{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00251v1\", \"title\": \"Multi-start Optimization Method via Scalarization based on Target\\n  Point-based Tchebycheff Distance for Multi-objective Optimization\", \"summary\": \"Multi-objective optimization is crucial in scientific and industrial\\napplications where solutions must balance trade-offs among conflicting\\nobjectives. State-of-the-art methods, such as NSGA-III and MOEA/D, can handle\\nmany objectives but struggle with coverage issues, particularly in cases\\ninvolving inverted triangular Pareto fronts or strong nonlinearity. Moreover,\\nNSGA-III often relies on simulated binary crossover, which deteriorates in\\nproblems with variable dependencies. In this study, we propose a novel\\nmulti-start optimization method that addresses these challenges. Our approach\\nintroduces a newly introduced scalarization technique, the Target Point-based\\nTchebycheff Distance (TPTD) method, which significantly improves coverage on\\nproblems with inverted triangular Pareto fronts. For efficient multi-start\\noptimization, TPTD leverages a target point defined in the objective space,\\nwhich plays a critical role in shaping the scalarized function. The position of\\nthe target point is adaptively determined according to the shape of the Pareto\\nfront, ensuring improvement in coverage. Furthermore, the flexibility of this\\nscalarization allows seamless integration with powerful single-objective\\noptimization methods, such as natural evolution strategies, to efficiently\\nhandle variable dependencies. Experimental results on benchmark problems,\\nincluding those with inverted triangular Pareto fronts, demonstrate that our\\nmethod outperforms NSGA-II, NSGA-III, and MOEA/D-DE in terms of the Hypervolume\\nindicator. Notably, our approach achieves computational efficiency improvements\\nof up to 474 times over these baselines.\", \"main_category\": \"cs.NE\", \"categories\": \"cs.NE\", \"published\": \"2025-05-01T02:27:25Z\"}"}
