{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07777v1\", \"title\": \"Adaptive Detection of Fast Moving Celestial Objects Using a Mixture of\\n  Experts and Physical-Inspired Neural Network\", \"summary\": \"Fast moving celestial objects are characterized by velocities across the\\ncelestial sphere that significantly differ from the motions of background\\nstars. In observational images, these objects exhibit distinct shapes,\\ncontrasting with the typical appearances of stars. Depending on the\\nobservational method employed, these celestial entities may be designated as\\nnear-Earth objects or asteroids. Historically, fast moving celestial objects\\nhave been observed using ground-based telescopes, where the relative stability\\nof stars and Earth facilitated effective image differencing techniques\\nalongside traditional fast moving celestial object detection and classification\\nalgorithms. However, the growing prevalence of space-based telescopes, along\\nwith their diverse observational modes, produces images with different\\nproperties, rendering conventional methods less effective. This paper presents\\na novel algorithm for detecting fast moving celestial objects within star\\nfields. Our approach enhances state-of-the-art fast moving celestial object\\ndetection neural networks by transforming them into physical-inspired neural\\nnetworks. These neural networks leverage the point spread function of the\\ntelescope and the specific observational mode as prior information; they can\\ndirectly identify moving fast moving celestial objects within star fields\\nwithout requiring additional training, thereby addressing the limitations of\\ntraditional techniques. Additionally, all neural networks are integrated using\\nthe mixture of experts technique, forming a comprehensive fast moving celestial\\nobject detection algorithm. We have evaluated our algorithm using simulated\\nobservational data that mimics various observations carried out by space based\\ntelescope scenarios and real observation images. Results demonstrate that our\\nmethod effectively detects fast moving celestial objects across different\\nobservational modes.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM,astro-ph.EP,cs.CV,cs.LG,physics.optics\", \"published\": \"2025-04-10T14:15:30Z\"}"}
