{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13118v1\", \"title\": \"CEERS: Forging the First Dust Grains in the Universe? A Population of\\n  Galaxies with spectroscopically-derived Extremely Low Dust Attenuation\\n  (GELDA) at 4.0<z<11.4\", \"summary\": \"Aims: This paper investigates the coevolution of metals and dust for 173\\ngalaxies at $4.0<z<11.4$ observed with JWST/NIRSpec in the CEERS project. We\\nfocus on galaxies with extremely low dust attenuation to understand the\\nphysical mechanisms at play. Methods: We developed a new version of the\\n\\\\texttt{CIGALE} code that integrates spectroscopic and photometric data. By\\nstatistically comparing observations with modeled spectra, we derive physical\\nparameters to constrain these mechanisms. Results: Our analysis reveals a\\npopulation of 49 extremely low dust attenuation galaxies (GELDAs), consistent\\nwith $A_{FUV} = 0.0$ within $2\\\\sigma$ and $M_{\\\\star} < 10^9 M_\\\\odot$. The\\nstacked spectrum of GELDAs shows a very blue UV slope $\\\\beta_{FUV} = -2.451 \\\\pm\\n0.066$ and a Balmer decrement H$\\\\alpha$/H$\\\\beta = 2.932 \\\\pm 0.660$, consistent\\nwith no dust and Case B recombination with minimal underlying absorption.\\nNotably, GELDAs are more prevalent at $z > 8.8$ (83.3\\\\%) than at lower\\nredshifts (26.3\\\\%), suggesting they could dominate in the early Universe.\\n  Using a far-infrared dust spectrum from the ALPINE sample, we study\\n$M_{dust}$ vs. $M_{\\\\star}$ trends. These exhibit upper and lower sequences\\nconnected by transitional galaxies. Our comparison with models indicates a\\ncritical transition around $M_{\\\\star} \\\\approx 10^{8.5}\\\\,M_\\\\odot$, from dust\\ndominated by stellar sources (SNe and AGB stars) to dust growth via gas\\naccretion. This corresponds to a metallicity of $12 + \\\\log_{10}(O/H) = 7.60$\\n($Z/Z_\\\\odot \\\\approx 0.1$), aligning with the point where ISM dust growth\\nmatches stellar dust production.\\n  The sample has a high gas fraction ($f_{\\\\mathrm{gas}} \\\\gtrsim 0.9$), with no\\nsignificant gas expulsion, and high surface gas densities. This leads to low\\nstar formation efficiencies compared to sub-millimeter galaxies. GELDAs may\\nhelp explain the observed excess of bright galaxies at $z \\\\gtrsim 9$.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-17T17:37:14Z\"}"}
