{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03395v1\", \"title\": \"A chemically etched D-band waveguide orthomode transducer for CMB\\n  measurements\", \"summary\": \"This study presents a prototype D-band waveguide orthomode transducer (OMT)\\nfabricated using chemically etched brass platelets. This method offers a fast,\\ncost-effective, and scalable approach for producing waveguide OMTs above 100\\nGHz, making it well-suited for current and future Cosmic Microwave Background\\npolarization experiments, where large focal planes with thousands of receivers\\nare required to detect the faint primordial \\\\textit{B}-modes. Chemical etching\\nhas already demonstrated its effectiveness in manufacturing corrugated feedhorn\\narrays with state-of-the-art performance up to 150 GHz. Here, we evaluate its\\napplicability to more complex structures, such as OMTs.\\n  We designed a single OMT prototype operating in the 130-170 GHz range,\\nfabricated by chemically etching 0.15 mm-thick brass plates, which were then\\nstacked, aligned, and mechanically clamped. Simulations based on metrological\\nmeasurements of the OMT profile predict return losses below $-$10 dB, isolation\\nbetter than $-$30 dB, and transmission around $-$0.5 dB.\\n  The measured transmission and isolation, however, is around $-$1.5/$-$2 dB\\nand $<-$20 dB, respectively. Further simulations show that the degradation in\\nthe transmission is related to defects and roughness along the etched profile\\n($\\\\mathrm{RMS}\\\\simeq$3 $\\\\mu$m), which is a typical and unavoidable effect of\\nchemical etching. The discrepancy in isolation, instead, could arise from a\\nslight rotation ($\\\\sim$3$^{\\\\circ}$) of the polarization angle within the\\nmeasurement chain.\\n  Our results show that chemical etching is a fast, low-cost, and scalable\\ntechnique for producing waveguide OMTs with state-of-the-art performance in\\nterms of return loss and isolation. However, at frequencies above 100 GHz the\\ntransmission coefficient may degrade due to the mechanical precision\\nlimitations of chemical etching.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM\", \"published\": \"2025-05-06T10:19:13Z\"}"}
