{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12133v1\", \"title\": \"Coherent EUV scatterometry of 2D periodic structure profiles with\\n  mathematically optimal experimental design\", \"summary\": \"Extreme ultraviolet (EUV) scatterometry is an increasingly important\\nmetrology that can measure critical parameters of periodic nanostructured\\nmaterials in a fast, accurate, and repeatable manner and with high sensitivity\\nto nanoscale structure and material composition. Because of this, EUV\\nscatterometry could support manufacturing of semiconductor devices or polymer\\nmetamaterials, addressing the limitations of traditional imaging methods such\\nas resolution and field of view, sample damage, throughput, or low sensitivity.\\nHere we use EUV scatterometry to measure the profile of an industrially\\nrelevant 2D periodic interconnect structure, using $\\\\lambda = 29$ nm light from\\na table-top high harmonic generation source. We show that EUV scatterometry is\\nsensitive to out-of-plane features with single-nanometer sensitivity.\\nFurthermore, we also apply a methodology based on the Fisher information matrix\\nto optimize experimental design parameters, such as incidence angles and\\nwavelength, to show how measurement sensitivity can be maximized. This\\nmethodology reveals the strong dependence of measurement sensitivity on both\\nincidence angle and wavelength $-$ even in a simple two-parameter case. Through\\na simultaneous optimization of incidence angles and wavelength, we determine\\nthat the most sensitive measurement of the quantities of interest can be made\\nat a wavelength of $\\\\sim$14 nm. In the future, by reducing sample contamination\\ndue to sample preparation, deep sub-nanometer sensitivity to axial profiles and\\n2D structures will be possible. Our results are an important step in guiding\\nEUV scatterometry towards increased accuracy and throughput with a priori\\ncomputations and by leveraging new experimental capabilities.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics\", \"published\": \"2025-04-16T14:46:03Z\"}"}
