{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10863v1\", \"title\": \"Intertwined fluctuations and isotope effects in the Hubbard-Holstein\\n  model on the square lattice from functional renormalization\", \"summary\": \"Electron-electron and electron-phonon interactions are responsible for the\\nformation of spin, charge, and superconducting correlations in layered quantum\\nmaterials. A paradigmatic model for such materials that captures both kinds of\\ninteractions is the two-dimensional Hubbard-Holstein model with a\\ndispersionless Einstein phonon. In this work, we provide a detailed analysis of\\nthe magnetic, density, and superconducting fluctuations at and away from\\nhalf-filling. To that end, we employ the functional renormalization group using\\nthe recently introduced extension of the single-boson exchange formulation.\\nMore precisely, we go beyond previous approaches to the model by resolving the\\nfull frequency dependence of the two-particle vertex and taking into account\\nthe feedback from the electronic self-energy. We perform broad parameter scans\\nin the space of Hubbard repulsion, electron-phonon coupling strength, and\\nphonon frequency to explore the leading magnetic, density, and superconducting\\nsusceptibilities from the adiabatic to the anti-adiabatic regime. Our numerical\\ndata reveal that self-energy effects lead to an enhancement of the $d$-wave\\nsuperconducting susceptibility towards larger phonon frequencies, in contrast\\nto earlier isotope-effect studies. At small phonon frequencies, large density\\ncontributions to the $s$-wave superconducting susceptibility change sign and\\neventually lead to a reduction of $s$-wave superconductivity with increasing\\nelectron-phonon coupling, signaling the breakdown of Migdal-Eliashberg theory.\\nWe analyze our findings systematically, employing detailed diagnostics of the\\nintertwined fluctuations and pinning down the various positive and negative\\nisotope effects of the physical susceptibilities.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el,cond-mat.supr-con\", \"published\": \"2025-04-15T04:49:50Z\"}"}
