{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11847v1\", \"title\": \"Ultra-Efficient Kidney Stone Fragment Removal via Spinner-Induced\\n  Synergistic Circulation and Spiral Flow\", \"summary\": \"Kidney stones can cause severe pain and complications such as chronic kidney\\ndisease or kidney failure. Retrograde intrarenal surgery (RIRS), which uses\\nlaser lithotripsy to fragment stones for removal via a ureteroscope, is widely\\nadopted due to its safety and effectiveness. However, conventional fragment\\nremoval methods using basketing and vacuum-assisted aspiration are inefficient,\\nas they can capture only 1 to 3 fragments (1--3\\\\,mm in size) per pass, often\\nrequiring dozens to hundreds of ureteroscope passes during a single procedure\\nto completely remove the fragments. These limitations lead to prolonged\\nprocedures and residual fragments that contribute to high recurrence rates. To\\naddress these limitations, we present a novel spinner device that enables\\nultra-efficient fragment removal through spinning-induced localized suction.\\nThe spinner generates a three-dimensional spiral and circulating flow field\\nthat dislodges and draws fragments into its cavity even from distances over\\n20\\\\,mm, eliminating the need to chase fragments. It can capture over 60\\nfragments (0.5--2\\\\,mm) or over 15 larger fragments (2--3\\\\,mm) in a single pass,\\nsignificantly improving removal efficiency. In this work, the spinner design is\\noptimized via computational fluid dynamics to maximize suction performance.\\n\\\\textit{In vitro} testing demonstrates near 100\\\\% capture rates for up to 60\\nfragments in a single operation and superior large-distance capture efficacy\\ncompared to vacuum-assisted methods. \\\\textit{Ex vivo} testing of the integrated\\nspinner-ureteroscope system in a porcine kidney confirmed its high performance\\nby capturing 45 fragments in just 4 seconds during a single pass and achieving\\ncomplete fragment clearance within a few passes.\", \"main_category\": \"physics.app-ph\", \"categories\": \"physics.app-ph,physics.med-ph\", \"published\": \"2025-04-16T08:10:16Z\"}"}
