{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11964v1\", \"title\": \"Self-induced topological edge states in a lattice with onsite\\n  nonlinearity\", \"summary\": \"Topological edge states typically arise at the boundaries of topologically\\nnontrivial structures or at interfaces between regions with differing\\ntopological invariants. When topological systems are extended into the\\nnonlinear regime, linear topological edge states bifurcate into nonlinear\\ncounterparts, and topological gap solitons emerge in the bulk of the\\nstructures. Despite extensive studies of these two types of nonlinear states,\\nself-induced topological edge states localized at the physical boundaries of\\noriginally nontopological structures remain underexplored. Unlike the\\npreviously reported self-induced topological transitions driven by nonlinear\\ncouplings, which are conceptually straightforward but less common in realistic\\ninteracting systems, here we experimentally realize self-induced topological\\nedge states in a lattice with onsite nonlinearity. Leveraging the strong and\\ntunable nonlinearity of electrical circuits, we systematically investigate the\\nlocalized states in a nonlinear Su-Schrieffer-Heeger model. Besides revisiting\\nthe nonlinear topological edge states and topological gap solitons, we uncover\\na novel type of self-induced topological edge states which exhibit the hallmark\\nfeatures of linear topological edge states, including sublattice polarization,\\nphase jumps, and decaying tails that approach zero. A distinctive feature of\\nthese states is the boundary-induced power threshold for existence. Our results\\nare broadly applicable and can be readily extended to photonic and cold atomic\\nsystems, where onsite nonlinearities naturally arise from interparticle\\ninteractions. Our work unveils new opportunities for exploring novel correlated\\ntopological states of light and matter, and paves the way for the development\\nof robust photonic devices and topological quantum computation.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics,nlin.PS\", \"published\": \"2025-04-16T10:54:56Z\"}"}
