{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00429v1\", \"title\": \"On the structure of big bang singularities in spatially homogenous\\n  solutions to the Einstein non-linear scalar field equations\", \"summary\": \"The subject of this article is the structure of big bang singularities in\\nspatially homogeneous solutions to the Einstein non-linear scalar field\\nequations. In particular, we focus on Bianchi class A; i.e., developments\\narising from left invariant initial data on unimodular $3$-dimensional Lie\\ngroups. We prove that solutions are either vacuum or matter dominated,\\ndepending on whether the limit of an expansion normalised normal derivative of\\nthe scalar field is zero or not, respectively. The main result concerning the\\nasymptotics in the direction of the singularity is, essentially, that solutions\\ninduce data on the singularity, with two exceptions: vacuum dominated Bianchi\\ntype VIII and IX without additional symmetries (they are neither isotropic nor\\nlocally rotationally symmetric) exhibit BKL-type oscillations. Disregarding the\\nexceptions, there is in fact a bijection between initial data on the\\nsingularity and developments. Initial data on the singularity thus play a\\ncentral role in the analysis; they both parameterise developments and give\\noptimal asymptotic information. However, the main point of the article is to\\nprove that the set of isometry classes of initial data on the singularity (of a\\nfixed Bianchi type and symmetry (such as isotropy, local rotational symmetry\\netc.)) has a smooth structure; that the set of isometry classes of developments\\n(similarly restricted) has a smooth structure which fits together with the\\nnatural smooth structure of isometry classes of regular initial data with fixed\\nmean curvature; and that the Einstein flow generates a diffeomorphism between\\nthe two sets. However, the article contains substantial additional information,\\nsuch as, e.g., the construction of a large class of spatially locally\\nhomogeneous solutions that can be demonstrated to be globally non-linearly\\nstable (in the absence of symmetries) both to the future and to the past.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc,math-ph,math.MP\", \"published\": \"2025-05-01T09:58:07Z\"}"}
