{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12074v1\", \"title\": \"Learning from the Past: Adaptive Parallelism Tuning for Stream\\n  Processing Systems\", \"summary\": \"Distributed stream processing systems rely on the dataflow model to define\\nand execute streaming jobs, organizing computations as Directed Acyclic Graphs\\n(DAGs) of operators. Adjusting the parallelism of these operators is crucial to\\nhandling fluctuating workloads efficiently while balancing resource usage and\\nprocessing performance. However, existing methods often fail to effectively\\nutilize execution histories or fully exploit DAG structures, limiting their\\nability to identity bottlenecks and determine the optimal parallelism. In this\\npaper, we propose StreamTune, a novel approach for adaptive paralelism tuning\\nin stream processing systems. StreamTune incorporates a pre-training and\\nfine-tuning framework that leverages global knowledge from historical execution\\ndata for job-specific parallelism tuning. In the pre-training phase, Stream\\nTune clusters the historical data with Graph Edit Distance and pre-trains a\\nGraph Neural Networkbased encoder per cluster to capture the correlation\\nbetween the operator parallelism, DAG structures, and the identified\\noperator-level bottlenecks. In the online tuning phase, StreamTune iteratively\\nrefines operator parallelism recommendations using an operator-level bottleneck\\nprediction model enforced with a monotonic constraint, which aligns with the\\nobserved system performance behavior. Evaluation results demonstrate that\\nStreamTune reduces reconfigurations by up to 29.6% and parallelism degrees by\\nup to 30.8% in Apache Flink under a synthetic workload. In Timely Dataflow,\\nStreamTune achieves up to an 83.3% reduction in parallelism degrees while\\nmaintaining comparable processing performance under the Nexmark benchmark, when\\ncompared to the state-of-the-art methods.\", \"main_category\": \"cs.DC\", \"categories\": \"cs.DC,cs.DB\", \"published\": \"2025-04-16T13:30:55Z\"}"}
