{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11054v1\", \"title\": \"Zero-Shot Whole-Body Humanoid Control via Behavioral Foundation Models\", \"summary\": \"Unsupervised reinforcement learning (RL) aims at pre-training agents that can\\nsolve a wide range of downstream tasks in complex environments. Despite recent\\nadvancements, existing approaches suffer from several limitations: they may\\nrequire running an RL process on each downstream task to achieve a satisfactory\\nperformance, they may need access to datasets with good coverage or\\nwell-curated task-specific samples, or they may pre-train policies with\\nunsupervised losses that are poorly correlated with the downstream tasks of\\ninterest. In this paper, we introduce a novel algorithm regularizing\\nunsupervised RL towards imitating trajectories from unlabeled behavior\\ndatasets. The key technical novelty of our method, called Forward-Backward\\nRepresentations with Conditional-Policy Regularization, is to train\\nforward-backward representations to embed the unlabeled trajectories to the\\nsame latent space used to represent states, rewards, and policies, and use a\\nlatent-conditional discriminator to encourage policies to ``cover'' the states\\nin the unlabeled behavior dataset. As a result, we can learn policies that are\\nwell aligned with the behaviors in the dataset, while retaining zero-shot\\ngeneralization capabilities for reward-based and imitation tasks. We\\ndemonstrate the effectiveness of this new approach in a challenging humanoid\\ncontrol problem: leveraging observation-only motion capture datasets, we train\\nMeta Motivo, the first humanoid behavioral foundation model that can be\\nprompted to solve a variety of whole-body tasks, including motion tracking,\\ngoal reaching, and reward optimization. The resulting model is capable of\\nexpressing human-like behaviors and it achieves competitive performance with\\ntask-specific methods while outperforming state-of-the-art unsupervised RL and\\nmodel-based baselines.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-15T10:41:11Z\"}"}
