{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16613v1\", \"title\": \"UAV-Mounted IRS (UMI) in the Presence of Hovering Fluctuations: 3D\\n  Pattern Characterization and Performance Analysis\", \"summary\": \"This paper investigates unmanned aerial vehicle (UAV)-mounted intelligent\\nreflecting surfaces (IRS) to leverage the benefits of this technology for\\nfuture communication networks, such as 6G. Key advantages include enhanced\\nspectral and energy efficiency, expanded network coverage, and flexible\\ndeployment. One of the main challenges in employing UAV-mounted IRS (UMI)\\ntechnology is the random fluctuations of hovering UAVs. Focusing on this\\nchallenge, this paper explores the capabilities of UMI with passive/active\\nelements affected by UAV fluctuations in both horizontal and vertical angles,\\nconsidering the three-dimensional (3D) radiation pattern of the IRS. The\\nrelationship between UAV fluctuations and IRS pattern is investigated by taking\\ninto account the random angular vibrations of UAVs. A tractable and closed-form\\ndistribution function for the IRS pattern is derived, using linear\\napproximation and by dividing it into several sectors. In addition, closed-form\\nexpressions for outage probability (OP) are obtained using central limit\\ntheorem (CLT) and Gamma approximation. The theoretical expressions are\\nvalidated through Monte Carlo simulations. The findings indicate that the\\nrandom fluctuations of hovering UAVs have a notable impact on the performance\\nof UMI systems. To avoid link interruptions due to UAV instability, IRS should\\nutilize fewer elements, even though this leads to a decrease in directivity. As\\na result, unlike terrestrial IRS, incorporating more elements into aerial IRS\\nsystems does not necessarily improve performance due to the fluctuations in\\nUAV. Numerical results show that the OP can be minimized by selecting the\\noptimal number of IRS elements and using active elements.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-23T10:59:03Z\"}"}
