{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19744v1\", \"title\": \"Lossy Beyond Diagonal Reconfigurable Intelligent Surfaces: Modeling and\\n  Optimization\", \"summary\": \"Beyond diagonal reconfigurable intelligent surface (BD-RIS) has emerged as an\\nadvancement and generalization of the conventional diagonal RIS (D-RIS) by\\nintroducing tunable interconnections between RIS elements, enabling smarter\\nwave manipulation and enlarged coverage. While BD-RIS has demonstrated\\nadvantages over D-RIS in various aspects, most existing works rely on the\\nassumption of a lossless model, leaving practical considerations unaddressed.\\nThis paper thus proposes a lossy BD-RIS model and develops corresponding\\noptimization algorithms for various BD-RIS-aided communication systems. First,\\nby leveraging admittance parameter analysis, we model each tunable admittance\\nbased on a lumped circuit with losses and derive an expression of a circle\\ncharacterizing the real and imaginary parts of each tunable admittance. We then\\nconsider the received signal power maximization in single-user single-input\\nsingle-output (SISO) systems with the proposed lossy BD-RIS model. To solve the\\noptimization problem, we design an effective algorithm by carefully exploiting\\nthe problem structure. Specifically, an alternating direction method of\\nmultipliers (ADMM) framework is custom-designed to deal with the complicated\\nconstraints associated with lossy BD-RIS. Furthermore, we extend the proposed\\nalgorithmic framework to more general multiuser multiple-input single-output\\n(MU-MISO) systems, where the transmit precoder and BD-RIS scattering matrix are\\njointly designed to maximize the sum-rate of the system. Finally, simulation\\nresults demonstrate that all BD-RIS architectures still outperform D-RIS in the\\npresence of losses, but the optimal BD-RIS architectures in the lossless case\\nare not necessarily optimal in the lossy case, e.g. group-connected BD-RIS can\\noutperform fully- and tree-connected BD-RISs in SISO systems with relatively\\nhigh losses, whereas the opposite always holds true in the lossless case.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP,cs.IT,math.IT\", \"published\": \"2025-04-28T12:45:33Z\"}"}
