{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20009v1\", \"title\": \"Kinodynamic Trajectory Following with STELA: Simultaneous Trajectory\\n  Estimation & Local Adaptation\", \"summary\": \"State estimation and control are often addressed separately, leading to\\nunsafe execution due to sensing noise, execution errors, and discrepancies\\nbetween the planning model and reality. Simultaneous control and trajectory\\nestimation using probabilistic graphical models has been proposed as a unified\\nsolution to these challenges. Previous work, however, relies heavily on\\nappropriate Gaussian priors and is limited to holonomic robots with linear\\ntime-varying models. The current research extends graphical optimization\\nmethods to vehicles with arbitrary dynamical models via Simultaneous Trajectory\\nEstimation and Local Adaptation (STELA). The overall approach initializes\\nfeasible trajectories using a kinodynamic, sampling-based motion planner. Then,\\nit simultaneously: (i) estimates the past trajectory based on noisy\\nobservations, and (ii) adapts the controls to be executed to minimize\\ndeviations from the planned, feasible trajectory, while avoiding collisions.\\nThe proposed factor graph representation of trajectories in STELA can be\\napplied for any dynamical system given access to first or second-order state\\nupdate equations, and introduces the duration of execution between two states\\nin the trajectory discretization as an optimization variable. These features\\nprovide both generalization and flexibility in trajectory following. In\\naddition to targeting computational efficiency, the proposed strategy performs\\nincremental updates of the factor graph using the iSAM algorithm and introduces\\na time-window mechanism. This mechanism allows the factor graph to be\\ndynamically updated to operate over a limited history and forward horizon of\\nthe planned trajectory. This enables online updates of controls at a minimum of\\n10Hz. Experiments demonstrate that STELA achieves at least comparable\\nperformance to previous frameworks on idealized vehicles with linear\\ndynamics.[...]\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-28T17:29:22Z\"}"}
