{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12981v1\", \"title\": \"Efficient Chebyshev Reconstruction for the Anisotropic Equilibrium Model\\n  in Magnetic Particle Imaging\", \"summary\": \"Magnetic Particle Imaging (MPI) is a tomographic imaging modality capable of\\nreal-time, high-sensitivity mapping of superparamagnetic iron oxide\\nnanoparticles. Model-based image reconstruction provides an alternative to\\nconventional methods that rely on a measured system matrix, eliminating the\\nneed for laborious calibration measurements. Nevertheless, model-based\\napproaches must account for the complexities of the imaging chain to maintain\\nhigh image quality. A recently proposed direct reconstruction method leverages\\nweighted Chebyshev polynomials in the frequency domain, removing the need for a\\nsimulated system matrix. However, the underlying model neglects key physical\\neffects, such as nanoparticle anisotropy, leading to distortions in\\nreconstructed images. To mitigate these artifacts, an adapted direct Chebyshev\\nreconstruction (DCR) method incorporates a spatially variant deconvolution\\nstep, significantly improving reconstruction accuracy at the cost of increased\\ncomputational demands. In this work, we evaluate the adapted DCR on six\\nexperimental phantoms, demonstrating enhanced reconstruction quality in real\\nmeasurements and achieving image fidelity comparable to or exceeding that of\\nsimulated system matrix reconstruction. Furthermore, we introduce an efficient\\napproximation for the spatially variable deconvolution, reducing both runtime\\nand memory consumption while maintaining accuracy. This method achieves\\ncomputational complexity of O(N log N ), making it particularly beneficial for\\nhigh-resolution and three-dimensional imaging. Our results highlight the\\npotential of the adapted DCR approach for improving model-based MPI\\nreconstruction in practical applications.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph,cs.NA,eess.IV,math.NA\", \"published\": \"2025-04-17T14:37:49Z\"}"}
