{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20578v1\", \"title\": \"From small dust to micron-sized aggregates: the influence of structure\\n  and composition on the dust optical properties\", \"summary\": \"Models of astrophysical dust are key to understand several physical\\nprocesses, from the role of dust grains as cooling agents in the ISM to their\\nevolution in dense circumstellar disks, explaining the occurrence of planetary\\nsystems around many stars. Currently, most models aim at providing optical\\nproperties for dust grains in the diffuse ISM, and many do not account properly\\nfor complexity in composition and structure when dust is expected to evolve in\\ndense astrophysical environments. Our purpose is to investigate, with a pilot\\nsample of micron-size dust grains, the influence of dust structure, porosity,\\nand composition when computing the optical properties of grown dust grains in\\nthe infrared and millimetre domains, where observations are widely used to\\nconstrain the dust properties. Starting from the small dust grains developed in\\nthe THEMIS 2.0 model, we use the Discrete Dipole Approximation to compute the\\noptical properties of 1 um grains, varying the hypotheses made on their\\ncomposition and structure. We look at the dust scattering, emission and\\nextinction to isolate potential simplifications and unavoidable differences\\nbetween grain structures. We note that both dust structure and porosity\\ninfluence the dust properties in infrared and millimetre ranges, demonstrating\\nthat dust aggregates cannot be correctly approximated by compact or porous\\nspheres. In particular, we show that the dust emissivity index in the\\nmillimetre can vary with fixed grain size. We shed light on the importance of\\ntaking the dust structure and porosity into account when interpreting\\nobservations in environments where dust grains may have evolved significantly.\\nEfforts in carrying out physical models of grain growth, for instance, are\\nrequired to establish realistic constraints on the structure of grown dust\\ngrains, and will be used in the future to build realistic dust models for the\\ndense ISM.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-29T09:33:49Z\"}"}
