{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04989v1\", \"title\": \"CPP-DIP: Multi-objective Coverage Path Planning for MAVs in Dispersed\\n  and Irregular Plantations\", \"summary\": \"Coverage Path Planning (CPP) is vital in precision agriculture to improve\\nefficiency and resource utilization. In irregular and dispersed plantations,\\ntraditional grid-based CPP often causes redundant coverage over non-vegetated\\nareas, leading to waste and pollution. To overcome these limitations, we\\npropose CPP-DIP, a multi-objective CPP framework designed for Micro Air\\nVehicles (MAVs). The framework transforms the CPP task into a Traveling\\nSalesman Problem (TSP) and optimizes flight paths by minimizing travel\\ndistance, turning angles, and intersection counts. Unlike conventional\\napproaches, our method does not rely on GPS-based environmental modeling.\\nInstead, it uses aerial imagery and a Histogram of Oriented Gradients\\n(HOG)-based approach to detect trees and extract image coordinates. A\\ndensity-aware waypoint strategy is applied: Kernel Density Estimation (KDE) is\\nused to reduce redundant waypoints in dense regions, while a greedy algorithm\\nensures complete coverage in sparse areas. To verify the generality of the\\nframework, we solve the resulting TSP using three different methods: Greedy\\nHeuristic Insertion (GHI), Ant Colony Optimization (ACO), and Monte Carlo\\nReinforcement Learning (MCRL). Then an object-based optimization is applied to\\nfurther refine the resulting path. Additionally, CPP-DIP integrates ForaNav,\\nour insect-inspired navigation method, for accurate tree localization and\\ntracking. The experimental results show that MCRL offers a balanced solution,\\nreducing the travel distance by 16.9 % compared to ACO while maintaining a\\nsimilar performance to GHI. It also improves path smoothness by reducing\\nturning angles by 28.3 % and 59.9 % relative to ACO and GHI, respectively, and\\neffectively eliminates intersections. These results confirm the robustness and\\neffectiveness of CPP-DIP in different TSP solvers.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-05-08T06:52:22Z\"}"}
