{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19594v1\", \"title\": \"Mapping the Italian Telegram Ecosystem\", \"summary\": \"Telegram has become a major space for political discourse and alternative\\nmedia. However, its lack of moderation allows misinformation, extremism, and\\ntoxicity to spread. While prior research focused on these particular phenomena\\nor topics, these have mostly been examined separately, and a broader\\nunderstanding of the Telegram ecosystem is still missing. In this work, we fill\\nthis gap by conducting a large-scale analysis of the Italian Telegram sphere,\\nleveraging a dataset of 186 million messages from 13,151 chats collected in\\n2023. Using network analysis, Large Language Models, and toxicity detection\\ntools, we examine how different thematic communities form, align ideologically,\\nand engage in harmful discourse within the Italian cultural context. Results\\nshow strong thematic and ideological homophily. We also identify mixed\\nideological communities where far-left and far-right rhetoric coexist on\\nparticular geopolitical issues. Beyond political analysis, we find that\\ntoxicity, rather than being isolated in a few extreme chats, appears widely\\nnormalized within highly toxic communities. Moreover, we find that Italian\\ndiscourse primarily targets Black people, Jews, and gay individuals\\nindependently of the topic. Finally, we uncover common trend of intra-national\\nhostility, where Italians often attack other Italians, reflecting regional and\\nintra-regional cultural conflicts that can be traced back to old historical\\ndivisions. This study provides the first large-scale mapping of the Italian\\nTelegram ecosystem, offering insights into ideological interactions, toxicity,\\nand identity-targets of hate and contributing to research on online toxicity\\nacross different cultural and linguistic contexts on Telegram.\", \"main_category\": \"cs.SI\", \"categories\": \"cs.SI,cs.AI\", \"published\": \"2025-04-28T08:58:18Z\"}"}
