{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16750v1\", \"title\": \"Tunable Inter-Edge Interactions in a Bilayer Graphene Quantum Hall\\n  Antidot\", \"summary\": \"Electronic interferometers in the quantum Hall regime are one of the best\\ntools to study the statistical properties of localized quasiparticles in the\\ntopologically protected bulk. However, since their behavior is probed via\\nchiral edge modes, bulk-to-edge and inter-edge interactions are two important\\neffects that affect the observations. Moreover, almost all kinds of\\ninterferometers heavily rely on a pair of high-quality quantum point contacts\\nwhere the presence of impurities significantly modifies the behavior of such\\nconstrictions, which in turn can alter the outcome of the measurements.\\nAntidots, potential hills in the quantum Hall regime, are particularly valuable\\nin this context, as they overcome the geometric limitations of conventional\\ngeometries and act as controlled impurities within a quantum point contact.\\nFurthermore, antidots allow for quasiparticle charge detection through simple\\nconductance measurements, replacing the need for complex techniques such as\\nshot noise. Here, we use a gate-defined bilayer graphene antidot, operated in\\nthe Coulomb-dominated regime. By varying the antidot potential, we can tune\\ninter-edge interactions, enabling a crossover from a single-dot to a double-dot\\nbehavior. In the latter, strong coupling between the two edge states leads to\\nedge-state pairing, resulting in a measured doubling of the tunneling charge.\\nWe find that in certain regimes, the inter-edge coupling completely dominates\\nover other energy scales of the system, overshadowing the interference effects\\nthese devices are mainly designed to probe. These results highlight the\\nsignificant role of inter-edge interactions and establish antidots as a\\nversatile platform for exploring quantum Hall interferometry.\", \"main_category\": \"cond-mat.mes-hall\", \"categories\": \"cond-mat.mes-hall\", \"published\": \"2025-04-23T14:19:20Z\"}"}
