{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21636v1\", \"title\": \"Optimal fermion-qubit mappings via quadratic assignment\", \"summary\": \"Simulation of fermionic systems is one of the most promising applications of\\nquantum computers. It spans problems in quantum chemistry, high-energy physics\\nand condensed matter. Underpinning the core steps of any quantum simulation\\nalgorithm, fermion-qubit mappings translate the fermionic interactions to the\\noperators and states of quantum computers. This translation is highly\\nnon-trivial: a burgeoning supply of fermion-qubit mappings has arisen over the\\npast twenty years to address the limited resources of early quantum technology.\\nPrevious literature has presented a dichotomy between ancilla-free\\nfermion-qubit mappings, which minimise qubit count, and local encodings, which\\nminimise gate complexity.\\n  We present two computational approaches to the construction of general\\nmappings while working with a limited number of qubits, striking a balance\\nbetween the low-qubit and low-gate demands of present quantum technology. The\\nfirst method frames the order of fermionic labels as an instance of the\\nquadratic assignment problem to minimize the total and maximum Pauli weights in\\na problem Hamiltonian. We compare the order-optimized performance of several\\ncommon ancilla-free mappings on systems of size up to 225 fermionic modes. The\\nsecond method is a computational approach to incrementally add ancilla qubits\\nto Jordan--Wigner transformations and further reduce the Pauli weights. By\\nadding up to 10 ancilla qubits, we were able to reduce the total Pauli weight\\nby as much as 67% in Jordan--Wigner transformations of fermionic systems with\\nup to 64 modes, outperforming the previous state-of-the-art ancilla-free\\nmappings.\\n  Reproducibility: source code and data are available at\\nhttps://github.com/cameton/QCE_QubitAssignment\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-30T13:37:33Z\"}"}
