{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15152v1\", \"title\": \"Landmark-Free Preoperative-to-Intraoperative Registration in\\n  Laparoscopic Liver Resection\", \"summary\": \"Liver registration by overlaying preoperative 3D models onto intraoperative\\n2D frames can assist surgeons in perceiving the spatial anatomy of the liver\\nclearly for a higher surgical success rate. Existing registration methods rely\\nheavily on anatomical landmark-based workflows, which encounter two major\\nlimitations: 1) ambiguous landmark definitions fail to provide efficient\\nmarkers for registration; 2) insufficient integration of intraoperative liver\\nvisual information in shape deformation modeling. To address these challenges,\\nin this paper, we propose a landmark-free preoperative-to-intraoperative\\nregistration framework utilizing effective self-supervised learning, termed\\n\\\\ourmodel. This framework transforms the conventional 3D-2D workflow into a\\n3D-3D registration pipeline, which is then decoupled into rigid and non-rigid\\nregistration subtasks. \\\\ourmodel~first introduces a feature-disentangled\\ntransformer to learn robust correspondences for recovering rigid\\ntransformations. Further, a structure-regularized deformation network is\\ndesigned to adjust the preoperative model to align with the intraoperative\\nliver surface. This network captures structural correlations through geometry\\nsimilarity modeling in a low-rank transformer network. To facilitate the\\nvalidation of the registration performance, we also construct an in-vivo\\nregistration dataset containing liver resection videos of 21 patients, called\\n\\\\emph{P2I-LReg}, which contains 346 keyframes that provide a global view of the\\nliver together with liver mask annotations and calibrated camera intrinsic\\nparameters. Extensive experiments and user studies on both synthetic and\\nin-vivo datasets demonstrate the superiority and potential clinical\\napplicability of our method.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-21T14:55:57Z\"}"}
