{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07452v1\", \"title\": \"Laboratory Three-dimensional X-ray Micro-beam Laue Diffraction\", \"summary\": \"The development of three-dimensional (3D) non-destructive X-ray\\ncharacterization techniques in home laboratories is essential for enabling many\\nmore researchers to perform 3D characterization daily, overcoming the\\nlimitations imposed by competitive and scarce access to synchrotron facilities.\\nRecent efforts have focused on techniques such as laboratory diffraction\\ncontrast tomography (LabDCT), which allows 3D characterization of\\nrecrystallized grains with sizes larger than 15-20 $\\\\mu$m, offering a boundary\\nresolution of approximately 5$\\\\mu$m using commercial X-ray computed tomography\\n(CT) systems. To enhance the capabilities of laboratory instruments, we have\\ndeveloped a new laboratory-based 3D X-ray micro-beam diffraction\\n(Lab-3D$\\\\mu$XRD) technique. Lab-3D$\\\\mu$XRD combines the use of a focused\\npolychromatic beam with a scanning-tomographic data acquisition routine to\\nenable depth-resolved crystallographic orientation characterization. This work\\npresents the first realization of Lab-3D$\\\\mu$XRD, including hardware\\ndevelopment through the integration of a newly developed Pt-coated twin\\nparaboloidal capillary X-ray focusing optics into a conventional X-ray $\\\\mu$CT\\nsystem, as well as the development of data acquisition and processing software.\\nThe results are validated through comparisons with LabDCT and synchrotron phase\\ncontrast tomography. The findings clearly demonstrate the feasibility of\\nLab-3D$\\\\mu$XRD, particularly in detecting smaller grains and providing\\nintragranular information. Finally, we discuss future directions for developing\\nLab-3D$\\\\mu$XRD into a versatile tool for studying materials with smaller grain\\nsizes and high defect densities, including the potential of combining it with\\nLabDCT and $\\\\mu$CT for multiscale and multimodal microstructural\\ncharacterization.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-10T04:53:58Z\"}"}
