{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05863v1\", \"title\": \"Extending Parametric Model Embedding with Physical Information for\\n  Design-space Dimensionality Reduction in Shape Optimization\", \"summary\": \"In this work, an extension of the parametric model embedding (PME) approach\\nis presented, aiming to achieve more effective design-space dimensionality\\nreduction for shape optimization in vehicle design. PME, rooted in principal\\ncomponent analysis (PCA), not only identifies a reduced set of critical modes\\nbut also re-parameterizes the original design space, enabling direct and\\ninterpretable manipulations of shape modifications within the reduced space.\\nAlongside the \\\"physics-informed\\\" version (PI-PME), which enriches geometry with\\nlow-fidelity distributed and lumped physical quantities, a \\\"physics-driven\\\"\\nvariant (PD-PME) is introduced that focuses exclusively on physical parameters.\\nBoth formulations employ PCA to capture the principal modes of variability yet\\ndiffer in their balance between geometric and physical information, through the\\nad-hoc definition of a weighted inner product. Through test cases involving the\\nRAE-2822 airfoil, a bio-inspired underwater glider, a naval propeller, and the\\nDTMB-5415 destroyer-type vessel, it is shown how the resulting frameworks\\nprovide a first-level assessment of design variability, offer interpretability\\nregarding which original variables most strongly affect performance, and\\nefficiently bridge geometric and physical parameters. Furthermore, lumped\\nphysical parameters can serve as a low-fidelity foundation for multi-fidelity\\noptimization, directly leveraging the linear re-parameterization to drive the\\nreduced design variables. Meanwhile, distributed physical parameters enable the\\nconstruction of machine-learning-based reduced-order models to infer integral\\nquantities of interest. By allowing the user to embed these insights early in\\nthe design process, PI-PME and PD-PME facilitate more robust, cost-effective\\nexploration, paving the way for subsequent high-fidelity optimization.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC\", \"published\": \"2025-04-08T09:43:41Z\"}"}
