{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01852v1\", \"title\": \"Deciphering the Nature of Virgil: An Obscured AGN Lurking Within an\\n  Apparently Normal Lyman-\\u03b1 Emitter During Cosmic Reionization\", \"summary\": \"We present a comprehensive analysis of the MIRI Extremely Red Object Virgil,\\na Lyman-$\\\\alpha$ emitter at $z_{spec} = 6.6379 \\\\pm 0.0035$ with the photometric\\nproperties of a Little Red Dot. Leveraging new JWST/MIRI imaging from the MIDIS\\nand PAHSPECS programs, we confirm Virgil's extraordinary nature among galaxies\\nin JADES/GOODS-South, exhibiting a strikingly red NIRCam-to-MIRI color (F444W\\n$-$ F1500W = $2.84\\\\pm0.04$~mag). Deep NIRSpec/PRISM spectroscopy from the OASIS\\nprogram offers key insights into the host galaxy, revealing properties of an\\naverage star-forming galaxy during Cosmic Reionization, such as a subsolar\\nmetallicity, low-to-moderate dust content, and a relatively high ionization\\nparameter and electron temperature. By estimating the star formation rate of\\nVirgil from UV and H$\\\\alpha$, we find evidence that the galaxy is either\\nentering or fading out of a bursty episode. Although line-ratio diagnostics\\nemployed at high-$z$ would classify Virgil as an Active Galactic Nucleus (AGN),\\nthis classification becomes ambiguous once redshift evolution is considered.\\nNonetheless, Virgil occupies the same parameter space as recently confirmed\\nAGNs at similar redshifts. The new deep MIRI data at 15~$\\\\mu$m reinforce the\\nAGN nature of Virgil, as inferred from multiple spectral energy distribution\\n(SED) fitting codes. Virgil's rising infrared SED and UV excess resemble those\\nof Dust-Obscured Galaxies (DOGs) studied with Spitzer at Cosmic Noon,\\nparticularly blue-excess HotDOGs. Our results highlight the need for a\\nmulti-wavelength approach incorporating MIRI to uncover such extreme sources at\\n$z\\\\gtrsim6$ and to shed light on the interplay between galaxy evolution and\\nearly black hole growth during Cosmic Reionization.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.CO\", \"published\": \"2025-04-02T16:04:22Z\"}"}
