{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17710v1\", \"title\": \"Plasma State Monitoring and Disruption Characterization using Multimodal\\n  VAEs\", \"summary\": \"When a plasma disrupts in a tokamak, significant heat and electromagnetic\\nloads are deposited onto the surrounding device components. These forces scale\\nwith plasma current and magnetic field strength, making disruptions one of the\\nkey challenges for future devices. Unfortunately, disruptions are not fully\\nunderstood, with many different underlying causes that are difficult to\\nanticipate. Data-driven models have shown success in predicting them, but they\\nonly provide limited interpretability. On the other hand, large-scale\\nstatistical analyses have been a great asset to understanding disruptive\\npatterns. In this paper, we leverage data-driven methods to find an\\ninterpretable representation of the plasma state for disruption\\ncharacterization. Specifically, we use a latent variable model to represent\\ndiagnostic measurements as a low-dimensional, latent representation. We build\\nupon the Variational Autoencoder (VAE) framework, and extend it for (1)\\ncontinuous projections of plasma trajectories; (2) a multimodal structure to\\nseparate operating regimes; and (3) separation with respect to disruptive\\nregimes. Subsequently, we can identify continuous indicators for the disruption\\nrate and the disruptivity based on statistical properties of measurement data.\\nThe proposed method is demonstrated using a dataset of approximately 1600 TCV\\ndischarges, selecting for flat-top disruptions or regular terminations. We\\nevaluate the method with respect to (1) the identified disruption risk and its\\ncorrelation with other plasma properties; (2) the ability to distinguish\\ndifferent types of disruptions; and (3) downstream analyses. For the latter, we\\nconduct a demonstrative study on identifying parameters connected to\\ndisruptions using counterfactual-like analysis. Overall, the method can\\nadequately identify distinct operating regimes characterized by varying\\nproximity to disruptions in an interpretable manner.\", \"main_category\": \"physics.plasm-ph\", \"categories\": \"physics.plasm-ph,cs.CV,cs.LG\", \"published\": \"2025-04-24T16:14:16Z\"}"}
