{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17469v1\", \"title\": \"A decision support system for optimised industrial water management\", \"summary\": \"Water scarcity and the low quality of wastewater produced in industrial\\napplications present significant challenges, particularly in managing fresh\\nwater intake and reusing residual quantities. These issues affect various\\nindustries, compelling plant owners and managers to optimise water resources\\nwithin their process networks. To address this cross-sector business\\nrequirement, we propose a Decision Support System (DSS) designed to capture key\\nnetwork components, such as inlet streams, processes, and outlet streams. Data\\nprovided to the DSS are exploited by an optimisation module, which supports\\nboth network design and operational decisions. This module is coupled with a\\ngeneric mixed-integer nonlinear programming (MINLP) model, which is linearised\\ninto a compact mixed-integer linear programming (MILP) formulation capable of\\ndelivering fast optimal solutions across various network designs and input\\nparameterisations. Additionally, a Constraint Programming (CP) approach is\\nincorporated to handle nonlinear expressions through straightforward modeling.\\nThis state-of-the-art generalised framework enables broad applicability across\\na wide range of real-world scenarios, setting it apart from the conventional\\nreliance on customised solutions designed for specific use cases. The proposed\\nframework was tested on 500 synthetic data instances inspired by historical\\ndata from three case studies. The obtained results confirm the validity,\\ncomputational competence and practical impact of our approach both among their\\noperational and network design phases, demonstrating significant improvements\\nover current practices. Notably, the proposed approach achieved a 17.6%\\nreduction in freshwater intake in a chemical industry case and facilitated the\\nreuse of nearly 90% of wastewater in an oil refinery case.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC\", \"published\": \"2025-04-24T12:01:44Z\"}"}
