{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06842v1\", \"title\": \"Optimality of Gradient-MUSIC for Spectral Estimation\", \"summary\": \"The goal of spectral estimation is to estimate the frequencies and amplitudes\\nof a nonharmonic Fourier sum given noisy time samples. This paper introduces\\nthe Gradient-MUSIC algorithm, which is a novel nonconvex optimization\\nreformulation of the classical MUSIC algorithm. Under the assumption that\\n$m\\\\Delta\\\\geq 8\\\\pi$, where $\\\\pi/m$ is the Nyquist rate and $\\\\Delta$ is the\\nminimum separation of the frequencies normalized to be in $[0,2\\\\pi)$, we\\nprovide a thorough geometric analysis of the objective functions generated by\\nthe algorithm. Gradient-MUSIC thresholds the objective function on a set that\\nis as coarse as possible and locates a set of suitable initialization for\\ngradient descent. Although the objective function is nonconvex, gradient\\ndescent converges exponentially fast to the desired local minima, which are the\\nestimated frequencies of the signal. For deterministic $\\\\ell^p$ perturbations\\nand any $p\\\\in [1,\\\\infty]$, Gradient-MUSIC estimates the frequencies and\\namplitudes at the minimax optimal rate in terms of the noise level and $m$. For\\nexample, if the noise has $\\\\ell^\\\\infty$ norm at most $\\\\epsilon$, then the\\nfrequencies and amplitudes are recovered up to error at most $C\\\\epsilon/m$ and\\n$C\\\\epsilon$, respectively, which are optimal in $\\\\epsilon$ and $m$. Aside from\\nlogarithmic factors, Gradient-MUSIC is optimal for white noise and matches the\\nrate achieved by nonlinear least squares for various families of nonstationary\\nindependent Gaussian noise. Our results show that classical MUSIC is equally\\noptimal, but it requires an expensive search on a thin grid, whereas\\nGradient-MUSIC is always computationally more efficient, especially for small\\nnoise. As a consequence of this paper, for sufficiently well separated\\nfrequencies, both Gradient-MUSIC and classical MUSIC are the first provably\\noptimal and computationally tractable algorithms for deterministic $\\\\ell^p$\\nperturbations.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-04-09T13:00:49Z\"}"}
