{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05159v1\", \"title\": \"FlexSpeech: Towards Stable, Controllable and Expressive Text-to-Speech\", \"summary\": \"Current speech generation research can be categorized into two primary\\nclasses: non-autoregressive and autoregressive. The fundamental distinction\\nbetween these approaches lies in the duration prediction strategy employed for\\npredictable-length sequences. The NAR methods ensure stability in speech\\ngeneration by explicitly and independently modeling the duration of each\\nphonetic unit. Conversely, AR methods employ an autoregressive paradigm to\\npredict the compressed speech token by implicitly modeling duration with Markov\\nproperties. Although this approach improves prosody, it does not provide the\\nstructural guarantees necessary for stability. To simultaneously address the\\nissues of stability and naturalness in speech generation, we propose\\nFlexSpeech, a stable, controllable, and expressive TTS model. The motivation\\nbehind FlexSpeech is to incorporate Markov dependencies and preference\\noptimization directly on the duration predictor to boost its naturalness while\\nmaintaining explicit modeling of the phonetic units to ensure stability.\\nSpecifically, we decompose the speech generation task into two components: an\\nAR duration predictor and a NAR acoustic model. The acoustic model is trained\\non a substantial amount of data to learn to render audio more stably, given\\nreference audio prosody and phone durations. The duration predictor is\\noptimized in a lightweight manner for different stylistic variations, thereby\\nenabling rapid style transfer while maintaining a decoupled relationship with\\nthe specified speaker timbre. Experimental results demonstrate that our\\napproach achieves SOTA stability and naturalness in zero-shot TTS. More\\nimportantly, when transferring to a specific stylistic domain, we can\\naccomplish lightweight optimization of the duration module solely with about\\n100 data samples, without the need to adjust the acoustic model, thereby\\nenabling rapid and stable style transfer.\", \"main_category\": \"eess.AS\", \"categories\": \"eess.AS\", \"published\": \"2025-05-08T11:55:19Z\"}"}
