{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12267v1\", \"title\": \"New Constraints on DMS and DMDS in the Atmosphere of K2-18 b from JWST\\n  MIRI\", \"summary\": \"The sub-Neptune frontier has opened a new window into the rich diversity of\\nplanetary environments beyond the solar system. The possibility of hycean\\nworlds, with planet-wide oceans and H$_2$-rich atmospheres, significantly\\nexpands and accelerates the search for habitable environments elsewhere. Recent\\nJWST transmission spectroscopy of the candidate hycean world K2-18 b in the\\nnear-infrared led to the first detections of carbon-bearing molecules CH$_4$\\nand CO$_2$ in its atmosphere, with a composition consistent with predictions\\nfor hycean conditions. The observations also provided a tentative hint of\\ndimethyl sulfide (DMS), a possible biosignature gas, but the inference was of\\nlow statistical significance. We report a mid-infrared transmission spectrum of\\nK2-18 b obtained using the JWST MIRI LRS instrument in the ~6-12 $\\\\mu$m range.\\nThe spectrum shows distinct features and is inconsistent with a featureless\\nspectrum at 3.4-$\\\\sigma$ significance compared to our canonical model. We find\\nthat the spectrum cannot be explained by most molecules predicted for K2-18 b\\nwith the exception of DMS and dimethyl disulfide (DMDS), also a potential\\nbiosignature gas. We report new independent evidence for DMS and/or DMDS in the\\natmosphere at 3-$\\\\sigma$ significance, with high abundance ($\\\\gtrsim$10 ppmv)\\nof at least one of the two molecules. More observations are needed to increase\\nthe robustness of the findings and resolve the degeneracy between DMS and DMDS.\\nThe results also highlight the need for additional experimental and theoretical\\nwork to determine accurate cross sections of important biosignature gases and\\nidentify potential abiotic sources. We discuss the implications of the present\\nfindings for the possibility of biological activity on K2-18 b.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-16T17:28:53Z\"}"}
