{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00574v1\", \"title\": \"Transition States Energies from Machine Learning: An Application to\\n  Reverse Water-Gas Shift on Single-Atom Alloys\", \"summary\": \"Obtaining accurate transition state (TS) energies is a bottleneck in\\ncomputational screening of complex materials and reaction networks due to the\\nhigh cost of TS search methods and first-principles methods such as density\\nfunctional theory (DFT). Here we propose a machine learning (ML) model for\\npredicting TS energies based on Gaussian process regression with the\\nWasserstein Weisfeiler-Lehman graph kernel (WWL-GPR). Applying the model to\\npredict adsorption and TS energies for the reverse water-gas shift (RWGS)\\nreaction on single-atom alloy (SAA) catalysts, we show that it can\\nsignificantly improve the accuracy compared to traditional approaches based on\\nscaling relations or ML models without a graph representation. Further\\nbenefitting from the low cost of model training, we train an ensemble of\\nWWL-GPR models to obtain uncertainties through subsampling of the training data\\nand show how these uncertainties propagate to turnover frequency (TOF)\\npredictions through the construction of an ensemble of microkinetic models.\\nComparing the errors in model-based vs DFT-based TOF predictions, we show that\\nthe WWL-GPR model reduces errors by almost an order of magnitude compared to\\nscaling relations. This demonstrates the critical impact of accurate energy\\npredictions on catalytic activity estimation. Finally, we apply our model to\\nscreen new materials, identifying promising catalysts for RWGS. This work\\nhighlights the power of combining advanced ML techniques with DFT and\\nmicrokinetic modeling for screening catalysts for complex reactions like RWGS,\\nproviding a robust framework for future catalyst design.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,cs.LG\", \"published\": \"2025-05-01T15:01:02Z\"}"}
