{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19656v1\", \"title\": \"Investigating the Period-Luminosity Relations of delta Scuti Stars: A\\n  Pathway to Distance and 3-D Dust Map Inference\", \"summary\": \"While delta Scuti stars are the most numerous class of kappa-mechanism\\npulsators in the instability strip, the short periods and small peak-to-peak\\namplitudes have left them understudied and underutilized. Recently, large-scale\\ntime-domain surveys have significantly increased the number of identified delta\\nScuti stars. Notably, the Tsinghua University-Ma Huateng Telescopes for Survey\\n(TMTS), with its high-cadence observations at 1-minute intervals, has\\nidentified thousands of delta Scuti stars, greatly expanding the sample of\\nthese short-period pulsating variables. Using the delta Scuti stars from the\\nTMTS catalogs of Periodic Variable Stars, we cross-matched the dataset with\\nPan-STARRS1, 2MASS, and WISE to obtain photometric measurements across optical\\nand infrared bands. Parallax data, used as Bayesian priors, were retrieved from\\nGaia DR3, and line-of-sight dust extinction priors were estimated from a\\nthree-dimensional dust map. Using PyMC, we performed a simultaneous\\ndetermination of the 11-band P-L relations of delta Scuti stars, which not only\\nyields precise measurements of these relations, but also greatly improves\\nconstraints on the distance moduli and color excesses, as evidenced by the\\nreduced uncertainties in the posterior distributions. Furthermore, our\\nmethodology enables an independent estimation of the color excess through the\\nP-L relations, offering a potential complement to existing 3-D dust maps.\\nMoreover, by cross-matching with LAMOST DR7, we investigated the influence of\\nmetallicity on the P-L relations. Our analysis reveals that incorporating\\nmetallicity might reduce the intrinsic scatter at longer wavelengths. However,\\nthis result does not achieve 3 sigma significance, leaving open the possibility\\nthat the observed reduction is attributable to statistical fluctuations.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA\", \"published\": \"2025-04-28T10:17:23Z\"}"}
