{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21583v1\", \"title\": \"Toward Realization of Low-Altitude Economy Networks: Core Architecture,\\n  Integrated Technologies, and Future Directions\", \"summary\": \"The rise of the low-altitude economy (LAE) is propelling urban development\\nand emerging industries by integrating advanced technologies to enhance\\nefficiency, safety, and sustainability in low-altitude operations. The\\nwidespread adoption of unmanned aerial vehicles (UAVs) and electric vertical\\ntakeoff and landing (eVTOL) aircraft plays a crucial role in enabling key\\napplications within LAE, such as urban logistics, emergency rescue, and aerial\\nmobility. However, unlike traditional UAV networks, LAE networks encounter\\nincreased airspace management demands due to dense flying nodes and potential\\ninterference with ground communication systems. In addition, there are\\nheightened and extended security risks in real-time operations, particularly\\nthe vulnerability of low-altitude aircraft to cyberattacks from ground-based\\nthreats. To address these, this paper first explores related standards and core\\narchitecture that support the development of LAE networks. Subsequently, we\\nhighlight the integration of technologies such as communication, sensing,\\ncomputing, positioning, navigation, surveillance, flight control, and airspace\\nmanagement. This synergy of multi-technology drives the advancement of\\nreal-world LAE applications, particularly in improving operational efficiency,\\noptimizing airspace usage, and ensuring safety. Finally, we outline future\\nresearch directions for LAE networks, such as intelligent and adaptive\\noptimization, security and privacy protection, sustainable energy and power\\nmanagement, quantum-driven coordination, generative governance, and\\nthree-dimensional (3D) airspace coverage, which collectively underscore the\\npotential of collaborative technologies to advance LAE networks.\", \"main_category\": \"cs.NI\", \"categories\": \"cs.NI\", \"published\": \"2025-04-30T12:42:03Z\"}"}
