{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09955v1\", \"title\": \"VR MRI Training for Adolescents: A Comparative Study of Gamified VR,\\n  Passive VR, 360 Video, and Traditional Educational Video\", \"summary\": \"Magnetic Resonance Imaging (MRI) can be a stressful experience for pediatric\\npatients due to the loud acoustic environment, enclosed scanner bore, and a\\nprolonged requirement to remain still. While sedation is commonly used to\\nmanage anxiety and motion, it carries clinical risks and logistical burdens.\\nTraditional preparatory approaches, such as instructional videos and mock\\nscans, often lack engagement for older children and adolescents. In this study,\\nwe present a comparative evaluation of four MRI preparation modalities: (1) a\\ngamified virtual reality (VR) simulation that trains stillness through\\nreal-time feedback; (2) a passive VR experience replicating the MRI environment\\nwithout interactivity; (3) a 360 degree first-person video of a real MRI\\nprocedure; and (4) a standard 2D educational video. Using a within-subjects\\ndesign (N = 11, ages 10-16), we assess each method's impact on head motion\\ndata, anxiety reduction, procedural preparedness, usability, cognitive\\nworkload, and subjective preference. Results show that the gamified VR\\ncondition has significantly lower head motion (p < 0.001) and yielded the\\nhighest preparedness scores (p < 0.05). Head motion data were significantly\\ncorrelated with learning outcomes (p < 0.01), suggesting that behavioral\\nperformance in VR strongly indicates procedural readiness. While all modalities\\nreduced anxiety and were rated usable, interactive VR was preferred by most\\nparticipants and demonstrated unique advantages in promoting engagement and\\nbehavioral rehearsal. We conclude with design recommendations for designing\\nimmersive simulations and integrating VR training into pediatric imaging\\nworkflows.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-14T07:40:30Z\"}"}
