{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23932v1\", \"title\": \"The wind properties of O-type stars at sub-SMC metallicity\", \"summary\": \"Radiation-driven winds heavily influence the evolution and fate of massive\\nstars. Feedback processes from these winds impact the properties of the\\ninterstellar medium of their host galaxies. The dependence of mass loss on\\nstellar properties is poorly understood, particularly at low metallicity ($Z$).\\nWe aim to characterise stellar and wind properties of massive stars in Local\\nGroup dwarf galaxies with $Z$ below that of the Small Magellanic Cloud and\\nconfront our findings to theories of radiation-driven winds. We perform\\nquantitative optical and UV spectroscopy on a sample of 11 O-type stars in\\nnearby dwarf galaxies with $Z < 0.2\\\\,Z_\\\\odot$. The stellar atmosphere code\\nFastwind and the genetic algorithm Kiwi-GA are used to determine stellar and\\nwind parameters. Inhomogeneities in the wind are assumed to be optically thin.\\nThe winds of the sample stars are weak, with mass loss rates $\\\\sim\\n10^{-9}-10^{-7}\\\\,M_\\\\odot\\\\,{\\\\rm yr}^{-1}$. Such feeble winds can only be\\nconstrained if UV spectra are available. The modified wind momentum as a\\nfunction of luminosity ($L$) for stars in this $Z$ regime is in agreement with\\nextrapolations to lower $Z$ of a recently established empirical relation for\\nthis quantity as a function of both $L$ and $Z$. However, theoretical\\nprescriptions do not match our results or those of other recent analyses at low\\nluminosity ($L \\\\lesssim 10^{5.2}\\\\,L_{\\\\odot}$) and low $Z$; in this regime, they\\npredict winds that are stronger by an order of magnitude or more. For our\\nsample stars at $Z \\\\sim 0.14\\\\,Z_\\\\odot$, with masses $\\\\sim 30 - 50\\\\,M_{\\\\odot}$,\\nstellar winds strip little mass during main-sequence evolution. However, if the\\nsteep dependence of mass loss on luminosity found here also holds for more\\nmassive stars at these metallicities, these may suffer as severely from\\nmain-sequence mass stripping as very massive stars in the Large Magellanic\\nCloud and Milky Way.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA\", \"published\": \"2025-03-31T10:27:14Z\"}"}
