{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16524v1\", \"title\": \"Modality Reliability Guided Multimodal Recommendation\", \"summary\": \"Multimodal recommendation faces an issue of the performance degradation that\\nthe uni-modal recommendation sometimes achieves the better performance. A\\npossible reason is that the unreliable item modality data hurts the fusion\\nresult. Several existing studies have introduced weights for different\\nmodalities to reduce the contribution of the unreliable modality data in\\npredicting the final user rating. However, they fail to provide appropriate\\nsupervisions for learning the modality weights, making the learned weights\\nimprecise. Therefore, we propose a modality reliability guided multimodal\\nrecommendation framework that uniquely learns the modality weights supervised\\nby the modality reliability. Considering that there is no explicit label\\nprovided for modality reliability, we resort to automatically identify it\\nthrough the BPR recommendation objective. In particular, we define a modality\\nreliability vector as the supervision label by the difference between\\nmodality-specific user ratings to positive and negative items, where a larger\\ndifference indicates a higher reliability of the modality as the BPR objective\\nis better satisfied. Furthermore, to enhance the effectiveness of the\\nsupervision, we calculate the confidence level for the modality reliability\\nvector, which dynamically adjusts the supervision strength and eliminates the\\nharmful supervision. Extensive experiments on three real-world datasets show\\nthe effectiveness of the proposed method.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-04-23T08:46:23Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16540v1\", \"title\": \"Contact homology of contact manifolds and its applications\", \"summary\": \"This is a survey of contact homology and its applications to the study of\\ncontact manifolds. It is a small tribute to Yasha Eliashberg's huge generosity\\nwith his countless explanations of his deep mathematical insights all along his\\ncareer. It is also the author's wishful thinking that this text could be useful\\nto students and young mathematicians for learning about some of the holomorphic\\ncurves based invariants in contact geometry.\", \"main_category\": \"math.SG\", \"categories\": \"math.SG,math.DG,math.GT\", \"published\": \"2025-04-23T09:10:37Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16556v1\", \"title\": \"How Irrationality Shapes Nash Equilibria: A Prospect-Theoretic\\n  Perspective\", \"summary\": \"Noncooperative games with uncertain payoffs have been classically studied\\nunder the expected-utility theory framework, which relies on the strong\\nassumption that agents behave rationally. However, simple experiments on human\\ndecision makers found them to be not fully rational, due to their subjective\\nrisk perception. Prospect theory was proposed as an empirically-grounded model\\nto incorporate irrational behaviours into game-theoretic models. But, how\\nprospect theory shapes the set of Nash equilibria when considering irrational\\nagents, is still poorly understood. To this end, we study how prospect\\ntheoretic transformations may generate new equilibria while eliminating\\nexisting ones. Focusing on aggregative games, we show that capturing users'\\nirrationality can preserve symmetric equilibria while causing the vanishing of\\nasymmetric equilibria. Further, there exist value functions which map\\nuncountable sets of equilibria in the expected-utility maximization framework\\nto finite sets. This last result may shape some equilibrium selection theories\\nfor human-in-the-loop systems where computing a single equilibrium is\\ninsufficient and comparison of equilibria is needed.\", \"main_category\": \"cs.GT\", \"categories\": \"cs.GT\", \"published\": \"2025-04-23T09:33:07Z\"}"}
