{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15217v1\", \"title\": \"DRAGON: Distributional Rewards Optimize Diffusion Generative Models\", \"summary\": \"We present Distributional RewArds for Generative OptimizatioN (DRAGON), a\\nversatile framework for fine-tuning media generation models towards a desired\\noutcome. Compared with traditional reinforcement learning with human feedback\\n(RLHF) or pairwise preference approaches such as direct preference optimization\\n(DPO), DRAGON is more flexible. It can optimize reward functions that evaluate\\neither individual examples or distributions of them, making it compatible with\\na broad spectrum of instance-wise, instance-to-distribution, and\\ndistribution-to-distribution rewards. Leveraging this versatility, we construct\\nnovel reward functions by selecting an encoder and a set of reference examples\\nto create an exemplar distribution. When cross-modality encoders such as CLAP\\nare used, the reference examples may be of a different modality (e.g., text\\nversus audio). Then, DRAGON gathers online and on-policy generations, scores\\nthem to construct a positive demonstration set and a negative set, and\\nleverages the contrast between the two sets to maximize the reward. For\\nevaluation, we fine-tune an audio-domain text-to-music diffusion model with 20\\ndifferent reward functions, including a custom music aesthetics model, CLAP\\nscore, Vendi diversity, and Frechet audio distance (FAD). We further compare\\ninstance-wise (per-song) and full-dataset FAD settings while ablating multiple\\nFAD encoders and reference sets. Over all 20 target rewards, DRAGON achieves an\\n81.45% average win rate. Moreover, reward functions based on exemplar sets\\nindeed enhance generations and are comparable to model-based rewards. With an\\nappropriate exemplar set, DRAGON achieves a 60.95% human-voted music quality\\nwin rate without training on human preference annotations. As such, DRAGON\\nexhibits a new approach to designing and optimizing reward functions for\\nimproving human-perceived quality. Sound examples at\\nhttps://ml-dragon.github.io/web.\", \"main_category\": \"cs.SD\", \"categories\": \"cs.SD,cs.LG\", \"published\": \"2025-04-21T16:41:40Z\"}"}
