{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20730v1\", \"title\": \"Avoided-crossings, degeneracies and Berry phases in the spectrum of\\n  quantum noise through analytic Bloch-Messiah decomposition\", \"summary\": \"The Bloch-Messiah decomposition (BMD) is a fundamental tool in quantum\\noptics, enabling the analysis and tailoring of multimode Gaussian states by\\ndecomposing linear optical transformations into passive interferometers and\\nsingle-mode squeezers. Its extension to frequency-dependent matrix-valued\\nfunctions, recently introduced as the ``analytic Bloch-Messiah decomposition\\\"\\n(ABMD), provides the most general approach for characterizing the\\ndriven-dissipative dynamics of quantum optical systems governed by quadratic\\nHamiltonians. In this work, we present a detailed study of the ABMD, focusing\\non the typical behavior of parameter-dependent singular values and of their\\ncorresponding singular vectors. In particular, we analyze the hitherto\\nunexplored occurrence of avoided and genuine crossings in the spectrum of\\nquantum noise, the latter being manifested by nontrivial topological Berry\\nphases of the singular vectors. We demonstrate that avoided crossings arise\\nnaturally when a single parameter is varied, leading to hypersensitivity of the\\nsingular vectors and suggesting the presence of genuine crossings in nearby\\nsystems. We highlight the possibility of programming the spectral response of\\nphotonic systems through the deliberate design of avoided crossings. As a\\nnotable example, we show that such control can be exploited to generate broad,\\nflat-band squeezing spectra -- a desirable feature for enhancing\\ndegaussification protocols. This study provides new insights into the structure\\nof multimode quantum correlations and offers a theoretical framework for\\nexperimental exploitation of complex quantum optical systems.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cs.NA,math.NA\", \"published\": \"2025-04-29T13:14:15Z\"}"}
