{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06769v1\", \"title\": \"Evolutionary dynamics of continuous public goods games in structured\\n  populations\", \"summary\": \"Over the past few decades, many works have studied the evolutionary dynamics\\nof continuous games. However, previous works have primarily focused on\\ntwo-player games with pairwise interactions. Indeed, group interactions rather\\nthan pairwise interactions are usually found in real situations. The public\\ngoods game serves as a paradigm of multi-player interactions. Notably, various\\ntypes of benefit functions are typically considered in public goods games,\\nincluding linear, saturating, and sigmoid functions. Thus far, the evolutionary\\ndynamics of cooperation in continuous public goods games with these benefit\\nfunctions remain unknown in structured populations. In this paper, we consider\\nthe continuous public goods game in structured populations. By employing the\\npair approximation approach, we derive the analytical expressions for invasion\\nfitness. Furthermore, we explore the adaptive dynamics of cooperative\\ninvestments in the game with various benefit functions. First, for the linear\\npublic goods game, we find that there is no singular strategy, and the\\ncooperative investments evolve to either the maximum or minimum depending on\\nthe benefit-to-cost ratio. Subsequently, we examine the game with saturating\\nbenefit functions and demonstrate the potential existence of an evolutionarily\\nstable strategy (ESS). Additionally, for the game with the sigmoid benefit\\nfunction, we observe that the evolutionary outcomes are closely related to the\\nthreshold value. When the threshold is small, a unique ESS emerges. For\\nintermediate threshold values, both the ESS and repellor singular strategies\\ncan coexist. When the threshold value is large, a unique repellor displays.\\nFinally, we perform individual-based simulations to validate our theoretical\\nresults.\", \"main_category\": \"physics.soc-ph\", \"categories\": \"physics.soc-ph\", \"published\": \"2025-04-09T10:47:05Z\"}"}
