{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05435v1\", \"title\": \"Asymmetric decay of quantum many-body scars in XYZ quantum spin chains\", \"summary\": \"Quantum many-body scars are atypical energy eigenstates of chaotic quantum\\nmany-body systems that prevent certain special non-equilibrium initial\\nconditions from thermalizing. We point out that quantum many-body scars exist\\nfor any nearest-neighbor spin-$S$ XYZ quantum spin chain, and arise in the form\\nof an infinite family of highly excited yet nonentangled product-state\\neigenstates, which define periodic textures in spin space. This set of scars,\\ndiscovered originally by Granovskii and Zhedanov in 1985, encompasses both the\\nexperimentally relevant 'spin helices' for XXZ chains and more complicated\\nhelix-like states constructed from Jacobi elliptic functions for generic XYZ\\nchains. An appealing feature of Granovskii-Zhedanov scars is that they are\\nwell-defined in the semiclassical limit $S \\\\to \\\\infty$, which allows for a\\nsystematic and analytical treatment of their dynamical instability to\\nperturbations of the Hamiltonian. Using time-dependent spin-wave theory, we\\npredict that upon perturbing along certain directions in Hamiltonian space,\\nGranovskii-Zhedanov scars exhibit a dramatic asymmetry in their decay:\\ndepending on the sign of the perturbation, the decrease of their contrast is\\neither slow and linear, or fast and exponential in time. This asymmetry can be\\ntraced to the absence (presence) of imaginarity in the spectrum of the\\nBogoliubov Hamiltonian governing quantum fluctuations about the scar, which\\ncorresponds to the absence (presence) of a non-zero Lyapunov exponent for the\\nlimiting classical trajectory. Numerical simulations using matrix product\\nstates (MPS) and infinite time-evolving block decimation (iTEBD) confirm that\\nour prediction remains valid even far from the semiclassical limit. Our\\nfindings challenge existing theories of how quantum-many body scars relax.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cond-mat.quant-gas,cond-mat.stat-mech,cond-mat.str-el\", \"published\": \"2025-05-08T17:23:34Z\"}"}
