{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17655v1\", \"title\": \"Aerial Image Classification in Scarce and Unconstrained Environments via\\n  Conformal Prediction\", \"summary\": \"This paper presents a comprehensive empirical analysis of conformal\\nprediction methods on a challenging aerial image dataset featuring diverse\\nevents in unconstrained environments. Conformal prediction is a powerful\\npost-hoc technique that takes the output of any classifier and transforms it\\ninto a set of likely labels, providing a statistical guarantee on the coverage\\nof the true label. Unlike evaluations on standard benchmarks, our study\\naddresses the complexities of data-scarce and highly variable real-world\\nsettings. We investigate the effectiveness of leveraging pretrained models\\n(MobileNet, DenseNet, and ResNet), fine-tuned with limited labeled data, to\\ngenerate informative prediction sets. To further evaluate the impact of\\ncalibration, we consider two parallel pipelines (with and without temperature\\nscaling) and assess performance using two key metrics: empirical coverage and\\naverage prediction set size. This setup allows us to systematically examine how\\ncalibration choices influence the trade-off between reliability and efficiency.\\nOur findings demonstrate that even with relatively small labeled samples and\\nsimple nonconformity scores, conformal prediction can yield valuable\\nuncertainty estimates for complex tasks. Moreover, our analysis reveals that\\nwhile temperature scaling is often employed for calibration, it does not\\nconsistently lead to smaller prediction sets, underscoring the importance of\\ncareful consideration in its application. Furthermore, our results highlight\\nthe significant potential of model compression techniques within the conformal\\nprediction pipeline for deployment in resource-constrained environments. Based\\non our observations, we advocate for future research to delve into the impact\\nof noisy or ambiguous labels on conformal prediction performance and to explore\\neffective model reduction strategies.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI,cs.CV,stat.ML\", \"published\": \"2025-04-24T15:25:37Z\"}"}
