{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20763v1\", \"title\": \"Understanding Large Language Model Supply Chain: Structure, Domain, and\\n  Vulnerabilities\", \"summary\": \"Large Language Models (LLMs) have revolutionized artificial intelligence\\n(AI), driving breakthroughs in natural language understanding, text generation,\\nand autonomous systems. However, the rapid growth of LLMs presents significant\\nchallenges in the security and reliability of the Large Language Model Supply\\nChain (LLMSC), a complex network of open-source components, libraries, and\\ntools essential for LLM development and deployment. Despite its critical\\nimportance, the LLMSC remains underexplored, particularly regarding its\\nstructural characteristics, domain composition, and security vulnerabilities.\\nTo address this gap, we conduct the first empirical study of the LLMSC,\\nanalyzing a curated dataset of open-source packages from PyPI and NPM across 14\\nfunctional domains. We construct a directed dependency graph comprising 15,725\\nnodes, 10,402 edges, and 180 unique vulnerabilities to investigate the\\nstructural characteristics of the LLMSC and analyze how security risks\\npropagate through its dependency network. Our findings reveal that the LLMSC\\nexhibits a ``locally dense, globally sparse'' topology, with 79.7% of\\ndependency trees containing fewer than 5 nodes, while a few large trees\\ndominate the ecosystem, accounting for 77.66% of all nodes. The graph is\\ncharacterized by high-degree hubs, with the top 5 most connected nodes\\naveraging 1,282 dependents each. Security analysis shows that critical\\nvulnerabilities propagate to an average of 142.1 nodes at the second layer of\\ndependency trees and peak at 237.8 affected nodes at the third layer. Notably,\\ncascading risks are concentrated in critical hub nodes such as transformers,\\nwhich directly or indirectly affect over 1,300 downstream packages. These\\nfindings provide quantitative insights into the structural and security\\ndynamics of the LLMSC and emphasize the need for targeted mitigation strategies\\nto enhance ecosystem resilience.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-29T13:44:01Z\"}"}
