{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03321v1\", \"title\": \"Formation of hydroxy, cyano and ethynyl derivatives of C4H4 isomers in\\n  the interstellar medium\", \"summary\": \"The study of cyclic hydrocarbons is of utmost relevance in current\\nastrochemical research, as they are considered to be among the most significant\\nreservoirs of carbon in the interstellar medium. However, while unsaturated\\ncyclic hydrocarbons with three, five, and six carbon atoms have been widely\\ninvestigated, the highly strained antiaromatic cyclobutadiene, c-C4H4, still\\nremains uncharted. Here, we employed high-level\\nCCSD(T)-F12/cc-pVTZ-F12//B2PLYPD3/aug-cc-pVTZ theoretical calculations to\\nanalyze whether the cyano (CN), ethynyl (CCH), and hydroxy (OH) derivatives of\\nc-C4H4 and its structural isomers butatriene (H2CCCCH2) and vinylacetylene\\n(H2CCHCCH) can readily form via the gas-phase reaction: C4H4 + X -> C4H3X + H\\n(where X = CN, CCH, and OH). For each system, we thoroughly explored the\\ncorresponding potential energy surfaces, identifying their critical points to\\nenable a detailed analysis of the thermochemistry. Hence, we found various\\nexothermic pathways for the formation of CN and CCH derivatives of butatriene\\nand vinylacetylene, with no net activation barriers, while the formation of the\\nOH derivatives is in general less favorable. Prior to the mechanistic study, we\\nalso analyzed the complete conformational panorama and stability of all the\\nderivatives at the CCSD(T)-F12/cc-pVTZ-F12 level. Overall, c-C4H3CN and\\nc-C4H3CCH emerge as particularly promising candidates for interstellar\\ndetection, provided that the parental c-C4H4 is present in the gas phase. These\\nfindings highlight the potential for detecting polar derivatives of c-C4H4 as\\nindirect evidence of its presence in the ISM, as it appears to be \\\"invisible\\\"\\nto radioastronomical observations. Also, this study underscores the need for\\nfuture laboratory and theoretical efforts to characterize the spectroscopic\\nproperties of the proposed derivatives, paving the way for their eventual\\nidentification in space.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-05-06T08:49:20Z\"}"}
