{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17776v1\", \"title\": \"Fitting Tree Metrics and Ultrametrics in Data Streams\", \"summary\": \"Fitting distances to tree metrics and ultrametrics are two widely used\\nmethods in hierarchical clustering, primarily explored within the context of\\nnumerical taxonomy. Given a positive distance function\\n$D:\\\\binom{V}{2}\\\\rightarrow\\\\mathbb{R}_{>0}$, the goal is to find a tree (or\\nultrametric) $T$ including all elements of set $V$ such that the difference\\nbetween the distances among vertices in $T$ and those specified by $D$ is\\nminimized. In this paper, we initiate the study of ultrametric and tree metric\\nfitting problems in the semi-streaming model, where the distances between pairs\\nof elements from $V$ (with $|V|=n$), defined by the function $D$, can arrive in\\nan arbitrary order. We study these problems under various distance norms:\\n  For the $\\\\ell_0$ objective, we provide a single-pass polynomial-time\\n$\\\\tilde{O}(n)$-space $O(1)$ approximation algorithm for ultrametrics and prove\\nthat no single-pass exact algorithm exists, even with exponential time.\\n  Next, we show that the algorithm for $\\\\ell_0$ implies an $O(\\\\Delta/\\\\delta)$\\napproximation for the $\\\\ell_1$ objective, where $\\\\Delta$ is the maximum and\\n$\\\\delta$ is the minimum absolute difference between distances in the input.\\nThis bound matches the best-known approximation for the RAM model using a\\ncombinatorial algorithm when $\\\\Delta/\\\\delta=O(n)$.\\n  For the $\\\\ell_\\\\infty$ objective, we provide a complete characterization of\\nthe ultrametric fitting problem. We present a single-pass polynomial-time\\n$\\\\tilde{O}(n)$-space 2-approximation algorithm and show that no better than\\n2-approximation is possible, even with exponential time. We also show that,\\nwith an additional pass, it is possible to achieve a polynomial-time exact\\nalgorithm for ultrametrics.\\n  Finally, we extend the results for all these objectives to tree metrics by\\nusing only one additional pass through the stream and without asymptotically\\nincreasing the approximation factor.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS\", \"published\": \"2025-04-24T17:49:25Z\"}"}
