{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19760v1\", \"title\": \"Efficient quantum state preparation through seniority driven operator\\n  selection\", \"summary\": \"Quantum algorithms require accurate representations of electronic states on a\\nquantum device, yet the approximation of electronic wave functions for strongly\\ncorrelated systems remains a profound theoretical challenge, with existing\\nmethods struggling to balance the competing demands of chemical accuracy and\\ngate efficiency. Moreover, a critical limitation of the most of the\\nstate-of-the-art methods developed to date lies in their substantial reliance\\non extensive pre-circuit measurements, which introduce significant overheads\\nand contribute to inefficiencies in practical implementation. To address these\\ninterconnected challenges and establish a harmonious synergy between them, we\\npropose an algorithmic framework that focuses on efficiently capturing the\\nmolecular strong correlation through an ordered set of computationally less\\ndemanding rank-one and seniority-zero excitations, yielding a parameterized\\nansatz with shallow gate depth. Furthermore, to achieve minimal pre-circuit\\nmeasurement overhead, we implement a selective pruning of excitations through a\\nhybrid approach that combines intuition-based selection with shallow-depth,\\nrank-one excitations driven uni-parameter circuit optimization strategy. With\\nthe incorporation of qubit-based excitations via particle-preserving exchange\\ncircuits, we demonstrate a further reduction in quantum complexities, enhancing\\nthe overall resource efficiency of the approach. With a range of challenging\\napplications on strongly correlated systems, we demonstrate that our dynamic\\nansatz not only significantly enhances computational efficiency but also\\ndelivers exceptional accuracy, robustness, and resilience to the noisy\\nenvironments inherent in near-term quantum hardware.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-28T12:56:57Z\"}"}
