{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24039v1\", \"title\": \"TOPz: photometric redshifts using template fitting applied to GAMA\\n  survey\", \"summary\": \"Context. Accurate photometric redshift (photo-z) estimation is crucial for\\ncosmological and galaxy evolution studies, especially with the advent of\\nlarge-scale photometric surveys.\\n  Aims. We develop a photo-z estimation code called TOPz (Tartu Observatory\\nPhoto-z) and apply it to the GAMA photometric catalogue.\\n  Methods. TOPz employs a Bayesian template-fitting approach to estimate\\nphoto-z from marginalised redshift posteriors. Using nine-band photometric data\\nfrom the GAMA project, we assess the accuracy of TOPz by comparing its photo-z\\nestimates to available spectroscopic redshifts. We generate synthetic galaxy\\nspectra using the CIGALE software and run template set optimisation. We improve\\nthe photometry by applying flux and flux uncertainty corrections. An analytical\\nprior is then imposed on the resulting posteriors to refine the redshift\\nestimates.\\n  Results. The photo-z estimates produced by TOPz show good agreement with the\\nspectroscopic redshifts. We demonstrate the redshift accuracy across various\\nmagnitude bins and test how the flux corrections and posteriors reflect the\\nactual uncertainty of the estimates. We show that the TOPz results are\\nconsistent with those obtained from other photo-z codes applied to the same\\ndata set. Additionally, TOPz estimates stellar masses as a by-product,\\ncomparable to those calculated by other methods. We made the GAMA photo-z\\ncatalogue and all the codes and scripts used for the analysis and figures\\npublicly available.\\n  Conclusions. TOPz is an advanced photo-z estimation code that integrates flux\\ncorrections, physical priors, and template set optimisation to provide\\nstate-of-the-art photo-z among competing template-based redshift estimators.\\nFuture work will focus on incorporating additional photometric data and\\napplying the TOPz algorithm to J-PAS narrow-band survey, further validating and\\nenhancing its capabilities.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,astro-ph.GA\", \"published\": \"2025-03-31T13:01:59Z\"}"}
