{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17293v1\", \"title\": \"Effective field theory of coupled dark energy and dark matter\", \"summary\": \"We formulate an effective field theory (EFT) of coupled dark energy (DE) and\\ndark matter (DM) interacting through energy and momentum transfers. In the DE\\nsector, we exploit the EFT of vector-tensor theories with the presence of a\\npreferred time direction on the cosmological background. This prescription\\nallows one to accommodate shift-symmetric and non-shift-symmetric scalar-tensor\\ntheories by taking a particular weak coupling limit, with and without\\nconsistency conditions respectively. We deal with the DM sector as a\\nnon-relativistic perfect fluid, which can be described by a system of three\\nscalar fields. By choosing a unitary gauge in which the perturbations in the DE\\nand DM sectors are eaten by the metric, we incorporate the leading-order\\noperators that characterize the energy and momentum transfers besides those\\npresent in the conventional EFT of vector-tensor and scalar-tensor theories and\\nthe non-relativistic perfect fluid. We express the second-order action of\\nscalar perturbations in real space in terms of time- and scale-dependent\\ndimensionless EFT parameters and derive the linear perturbation equations of\\nmotion by taking into account additional matter (baryons, radiation). In the\\nsmall-scale limit, we obtain conditions for the absence of both ghosts and\\nLaplacian instabilities and discuss how they are affected by the DE-DM\\ninteractions. We also compute the effective DM gravitational coupling $G_{\\\\rm\\neff}$ by using a quasi-static approximation for perturbations deep inside the\\nDE sound horizon and show that the existence of momentum and energy transfers\\nallow a possibility to realize $G_{\\\\rm eff}$ smaller than in the uncoupled case\\nat low redshift.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,gr-qc,hep-ph,hep-th\", \"published\": \"2025-04-24T06:40:34Z\"}"}
