{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10294v1\", \"title\": \"Ankle Exoskeletons in Walking and Load-Carrying Tasks: Insights into\\n  Biomechanics and Human-Robot Interaction\", \"summary\": \"Background: Lower limb exoskeletons can enhance quality of life, but\\nwidespread adoption is limited by the lack of frameworks to assess their\\nbiomechanical and human-robot interaction effects, which are essential for\\ndeveloping adaptive and personalized control strategies. Understanding impacts\\non kinematics, muscle activity, and HRI dynamics is key to achieve improved\\nusability of wearable robots. Objectives: We propose a systematic methodology\\nevaluate an ankle exoskeleton's effects on human movement during walking and\\nload-carrying (10 kg front pack), focusing on joint kinematics, muscle\\nactivity, and HRI torque signals. Materials and Methods: Using Xsens MVN\\n(inertial motion capture), Delsys EMG, and a unilateral exoskeleton, three\\nexperiments were conducted: (1) isolated dorsiflexion/plantarflexion; (2) gait\\nanalysis (two subjects, passive/active modes); and (3) load-carrying under\\nassistance. Results and Conclusions: The first experiment confirmed that the\\nHRI sensor captured both voluntary and involuntary torques, providing\\ndirectional torque insights. The second experiment showed that the device\\nslightly restricted ankle range of motion (RoM) but supported normal gait\\npatterns across all assistance modes. The exoskeleton reduced muscle activity,\\nparticularly in active mode. HRI torque varied according to gait phases and\\nhighlighted reduced synchronization, suggesting a need for improved support.\\nThe third experiment revealed that load-carrying increased GM and TA muscle\\nactivity, but the device partially mitigated user effort by reducing muscle\\nactivity compared to unassisted walking. HRI increased during load-carrying,\\nproviding insights into user-device dynamics. These results demonstrate the\\nimportance of tailoring exoskeleton evaluation methods to specific devices and\\nusers, while offering a framework for future studies on exoskeleton\\nbiomechanics and HRI.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-14T15:05:02Z\"}"}
