{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20647v1\", \"title\": \"Electroactive differential growth and delayed instability in accelerated\\n  healing tissues\", \"summary\": \"Guided by experiments contrasting electrically accelerated recovery with\\nnatural healing, this study formulates a model to investigate the importance of\\nelectroactive differential growth and morphological changes in tissue repair.\\nIt underscores the clinical potential of leveraging electroactive differential\\ngrowth for improved healing outcomes. The study reveals that voltage\\nstimulation significantly enhances the healing and growth of biological\\ntissues, accelerating the regeneration process across various growth modalities\\nand steering towards isotropic growth conditions that do not favor any specific\\ngrowth pathways. Enhancing the electroelastic coupling parameters improves the\\nefficacy of bioelectric devices, initiating contraction and fortification of\\nbiological tissues in alignment with the electric field. This process\\nfacilitates swift cell migration and proliferation, as well as oriented growth\\nof tissue. In instances of strain stiffening at elevated strains, the extreme\\ncritical growth ratio aligns with the predictions of neo-Hookean models.\\nConversely, for tissues experiencing strain stiffening under moderate to very\\nlow strain conditions, the strain stiffening effect substantially delays the\\nonset of electroelastic growth instability, ultimately producing a smooth,\\nhyperelastic surface devoid of any unstable morphologies. Our investigation,\\ngrounded in nonlinear electroelastic field and perturbation theories, explores\\nhow electric fields influence differential growth and instability in biological\\ntissues. We examine the interactions among dimensionless voltage, internal\\npressure, electroelastic coupling, radius ratio, and strain stiffening,\\nrevealing their effects on promoting growth and delaying instability. This\\nframework offers insights into the mechanisms behind electroactive growth and\\nits instabilities, contributing valuable knowledge to the tissue healing.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-04-29T11:15:55Z\"}"}
