{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00530v1\", \"title\": \"Leveraging Partial SMILES Validation Scheme for Enhanced Drug Design in\\n  Reinforcement Learning Frameworks\", \"summary\": \"SMILES-based molecule generation has emerged as a powerful approach in drug\\ndiscovery. Deep reinforcement learning (RL) using large language model (LLM)\\nhas been incorporated into the molecule generation process to achieve high\\nmatching score in term of likelihood of desired molecule candidates. However, a\\ncritical challenge in this approach is catastrophic forgetting during the RL\\nphase, where knowledge such as molecule validity, which often exceeds 99\\\\%\\nduring pretraining, significantly deteriorates. Current RL algorithms applied\\nin drug discovery, such as REINVENT, use prior models as anchors to retian\\npretraining knowledge, but these methods lack robust exploration mechanisms. To\\naddress these issues, we propose Partial SMILES Validation-PPO (PSV-PPO), a\\nnovel RL algorithm that incorporates real-time partial SMILES validation to\\nprevent catastrophic forgetting while encouraging exploration. Unlike\\ntraditional RL approaches that validate molecule structures only after\\ngenerating entire sequences, PSV-PPO performs stepwise validation at each\\nauto-regressive step, evaluating not only the selected token candidate but also\\nall potential branches stemming from the prior partial sequence. This enables\\nearly detection of invalid partial SMILES across all potential paths. As a\\nresult, PSV-PPO maintains high validity rates even during aggressive\\nexploration of the vast chemical space. Our experiments on the PMO and GuacaMol\\nbenchmark datasets demonstrate that PSV-PPO significantly reduces the number of\\ninvalid generated structures while maintaining competitive exploration and\\noptimization performance. While our work primarily focuses on maintaining\\nvalidity, the framework of PSV-PPO can be extended in future research to\\nincorporate additional forms of valuable domain knowledge, further enhancing\\nreinforcement learning applications in drug discovery.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.CE,q-bio.BM\", \"published\": \"2025-05-01T13:57:20Z\"}"}
