{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10456v1\", \"title\": \"Privacy-Preserving Distributed Link Predictions Among Peers in Online\\n  Classrooms Using Federated Learning\", \"summary\": \"Social interactions among classroom peers, represented as social learning\\nnetworks (SLNs), play a crucial role in enhancing learning outcomes. While SLN\\nanalysis has recently garnered attention, most existing approaches rely on\\ncentralized training, where data is aggregated and processed on a local/cloud\\nserver with direct access to raw data. However, in real-world educational\\nsettings, such direct access across multiple classrooms is often restricted due\\nto privacy concerns. Furthermore, training models on isolated classroom data\\nprevents the identification of common interaction patterns that exist across\\nmultiple classrooms, thereby limiting model performance. To address these\\nchallenges, we propose one of the first frameworks that integrates Federated\\nLearning (FL), a distributed and collaborative machine learning (ML) paradigm,\\nwith SLNs derived from students' interactions in multiple classrooms' online\\nforums to predict future link formations (i.e., interactions) among students.\\nBy leveraging FL, our approach enables collaborative model training across\\nmultiple classrooms while preserving data privacy, as it eliminates the need\\nfor raw data centralization. Recognizing that each classroom may exhibit unique\\nstudent interaction dynamics, we further employ model personalization\\ntechniques to adapt the FL model to individual classroom characteristics. Our\\nresults demonstrate the effectiveness of our approach in capturing both shared\\nand classroom-specific representations of student interactions in SLNs.\\nAdditionally, we utilize explainable AI (XAI) techniques to interpret model\\npredictions, identifying key factors that influence link formation across\\ndifferent classrooms. These insights unveil the drivers of social learning\\ninteractions within a privacy-preserving, collaborative, and distributed ML\\nframework -- an aspect that has not been explored before.\", \"main_category\": \"cs.SI\", \"categories\": \"cs.SI\", \"published\": \"2025-04-14T17:43:11Z\"}"}
