{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16513v1\", \"title\": \"The bracket of the exceptional Lie algebra E8\", \"summary\": \"An explicit formula for the bracket of the exceptional simple Lie algebra E8\\nbased on triality and oct-octonions is obtained, following the Barton-Sudbery\\ndescription of E8.\", \"main_category\": \"math.DG\", \"categories\": \"math.DG,math.GR,math.RA\", \"published\": \"2025-04-23T08:39:19Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16530v1\", \"title\": \"Modern Computational Methods in Reinsurance Optimization: From Simulated\\n  Annealing to Quantum Branch & Bound\", \"summary\": \"We propose and implement modern computational methods to enhance catastrophe\\nexcess-of-loss reinsurance contracts in practice. The underlying optimization\\nproblem involves attachment points, limits, and reinstatement clauses, and the\\nobjective is to maximize the expected profit while considering risk measures\\nand regulatory constraints. We study the problem formulation, paving the way\\nfor practitioners, for two very different approaches: A local search optimizer\\nusing simulated annealing, which handles realistic constraints, and a branch &\\nbound approach exploring the potential of a future speedup via quantum branch &\\nbound. On the one hand, local search effectively generates contract structures\\nwithin several constraints, proving useful for complex treaties that have\\nmultiple local optima. On the other hand, although our branch & bound\\nformulation only confirms that solving the full problem with a future quantum\\ncomputer would require a stronger, less expensive bound and substantial\\nhardware improvements, we believe that the designed application-specific bound\\nis sufficiently strong to serve as a basis for further works. Concisely, we\\nprovide insurance practitioners with a robust numerical framework for contract\\noptimization that handles realistic constraints today, as well as an outlook\\nand initial steps towards an approach which could leverage quantum computers in\\nthe future.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC,q-fin.CP,quant-ph\", \"published\": \"2025-04-23T08:55:40Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16546v1\", \"title\": \"Tinkering Against Scaling\", \"summary\": \"The ascent of scaling in artificial intelligence research has revolutionized\\nthe field over the past decade, yet it presents significant challenges for\\nacademic researchers, particularly in computational social science and critical\\nalgorithm studies. The dominance of large language models, characterized by\\ntheir extensive parameters and costly training processes, creates a disparity\\nwhere only industry-affiliated researchers can access these resources. This\\nimbalance restricts academic researchers from fully understanding their tools,\\nleading to issues like reproducibility in computational social science and a\\nreliance on black-box metaphors in critical studies.\\n  To address these challenges, we propose a \\\"tinkering\\\" approach that is\\ninspired by existing works. This method involves engaging with smaller models\\nor components that are manageable for ordinary researchers, fostering hands-on\\ninteraction with algorithms. We argue that tinkering is both a way of making\\nand knowing for computational social science and a way of knowing for critical\\nstudies, and fundamentally, it is a way of caring that has broader implications\\nfor both fields.\", \"main_category\": \"cs.CY\", \"categories\": \"cs.CY,cs.HC\", \"published\": \"2025-04-23T09:21:39Z\"}"}
