{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03593v1\", \"title\": \"A Unifying Bias-aware Multidisciplinary Framework for Investigating\\n  Socio-Technical Issues\", \"summary\": \"This paper aims to bring together the disciplines of social science (SS) and\\ncomputer science (CS) in the design and implementation of a novel\\nmultidisciplinary framework for systematic, transparent, ethically-informed,\\nand bias-aware investigation of socio-technical issues. For this, various\\nanalysis approaches from social science and machine learning (ML) were applied\\nin a structured sequence to arrive at an original methodology of identifying\\nand quantifying objects of inquiry. A core feature of this framework is that it\\nhighlights where bias occurs and suggests possible steps to mitigate it. This\\nis to improve the robustness, reliability, and explainability of the framework\\nand its results. Such an approach also ensures that the investigation of\\nsocio-technical issues is transparent about its own limitations and potential\\nsources of bias. To test our framework, we utilised it in the multidisciplinary\\ninvestigation of the online harms encountered by minoritised ethnic (ME)\\ncommunities when accessing and using digitalised social housing services in the\\nUK. We draw our findings from 100 interviews with ME individuals in four cities\\nacross the UK to understand ME vulnerabilities when accessing and using\\ndigitalised social housing services. In our framework, a sub-sample of\\ninterviews focusing on ME individuals residing in social housing units were\\ninductively coded. This resulted in the identification of the topics of\\ndiscrimination, digital poverty, lack of digital literacy, and lack of English\\nproficiency as key vulnerabilities of ME communities. Further ML techniques\\nsuch as Topic Modelling and Sentiment Analysis were used within our framework\\nwhere we found that Black African communities are more likely to experience\\nthese vulnerabilities in the access, use and outcome of digitalised social\\nhousing services.\", \"main_category\": \"cs.CY\", \"categories\": \"cs.CY\", \"published\": \"2025-05-06T14:52:04Z\"}"}
