{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15687v1\", \"title\": \"Original mechanism of transformation from soft metallic (sp2/sp3) C12 to\\n  ultra-dense and ultra-hard (sp3) semi-conducting C12: Crystal chemistry and\\n  DFT characterizations\", \"summary\": \"An original mechanism is proposed for a pressure-induced transformation of\\northorhombic C12 from ground state normal pressure (NP) sp2/sp3 allotrope to\\nultra-dense and ultra-hard HP sp3 form. Upon volume decrease, the trigonal C=C\\nparallel segments characterizing glitter-like tfi topology of NP C12 change to\\ncrossing C-C segments with the loss of sp2 character accompanied by a large\\ndensification with density=3.64 g/cm3, larger than diamond, defining a novel\\northorhombic HP C12 with 44T39 topology. The crystal chemistry engineering\\nbacked with quantum density functional theory DFT-based calculations let\\ndetermine the ground state structures and energy derived physical properties.\\nFurthering on that, the E(V) equations of states (EOS) let define the\\nequilibrium NP(E0,V0) allotrope at lower energy and higher volume versus HP(E0,\\nV0) allotrope at higher energy and smaller volume. A potential pressure induced\\ntransformation NP to HP was estimated at ~100 GPa, reachable with a diamond\\nanvil cell DAC. Both allotropes were found cohesive and mechanically stable\\nwith low and large Vickers hardness magnitudes: HV(tfi C12) =24 GPa and\\nHV(44T39 C12) =90 GPa; the latter being close to diamond hardness (HV ~95 GPa).\\nBesides, both allotropes were found dynamically stable with positive phonon\\nfrequencies and a spectroscopic signature of C=C high frequency bands in tfi\\nC12. The electronic band structures show metallic behavior for NP tfi C12 and a\\nsmall band gap for HP 44T39 C12 letting assign semiconducting properties. The\\nwork is meant to open further the scope of C(sp2)and C(sp3) transformation\\nmechanisms that are fundamental in solid state physics and chemistry.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-22T08:10:24Z\"}"}
