{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11328v1\", \"title\": \"Extended source fringe flats for the JWST MIRI Medium Resolution\\n  Spectrometer\", \"summary\": \"The detectors of the JWST Mid-Infrared Instrument (MIRI) Medium Resolution\\nSpectrometer (MRS) form low-finesse resonating cavities that cause periodic\\ncount rate modulations (fringes) with peak amplitudes of up to 15% for sources\\nexternal to MIRI. To detect weak features on a strong continuum and reliably\\nmeasure line fluxes and line-flux ratios, fringe correction is crucial. This\\npaper describes the first of two steps implemented in the JWST Science\\nCalibration Pipeline, which is the division by a static fringe flat that\\nremoves the bulk of the fringes for extended sources. Fringe flats were derived\\nby fitting a numerical model to observations of spatially extended sources. The\\nmodel includes fringes that originate from two resonating cavities in the\\ndetector substrate (a third fringe component that originates from the dichroic\\nfilters is not included). The model, numerical implementation, and resulting\\nfringe flats are described, and the efficiency of the calibration was evaluated\\nfor sources of various spatial extents on the detector. Flight fringe flats are\\nobtained from observations of the planetary nebula NGC 7027. The two fringe\\ncomponents are well recovered and fitted by the model. The derived parameters\\nare used to build a fringe flat for each MRS spectral band, except for 1A and\\n1B due to the low signal-to-noise ratio of NGC 7027 in these bands. When\\napplied to extended sources, fringe amplitudes are reduced to the sub-percent\\nlevel on individual spaxels. For point sources, they are reduced to amplitudes\\nof 1 to 5% considering individual spaxels and a single dither position, and\\ndecrease to the 1 to 2% level after two-dimensional residual fringe correction.\\nThe fringe flats derived from this work are the reference files currently in\\nuse by the JWST Science Calibration Pipeline. They provide an efficient\\ncalibration for extended sources, and are less efficient for point sources.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM\", \"published\": \"2025-04-15T16:02:59Z\"}"}
