{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21695v1\", \"title\": \"Self-Supervised Monocular Visual Drone Model Identification through\\n  Improved Occlusion Handling\", \"summary\": \"Ego-motion estimation is vital for drones when flying in GPS-denied\\nenvironments. Vision-based methods struggle when flight speed increases and\\nclose-by objects lead to difficult visual conditions with considerable motion\\nblur and large occlusions. To tackle this, vision is typically complemented by\\nstate estimation filters that combine a drone model with inertial measurements.\\nHowever, these drone models are currently learned in a supervised manner with\\nground-truth data from external motion capture systems, limiting scalability to\\ndifferent environments and drones. In this work, we propose a self-supervised\\nlearning scheme to train a neural-network-based drone model using only onboard\\nmonocular video and flight controller data (IMU and motor feedback). We achieve\\nthis by first training a self-supervised relative pose estimation model, which\\nthen serves as a teacher for the drone model. To allow this to work at high\\nspeed close to obstacles, we propose an improved occlusion handling method for\\ntraining self-supervised pose estimation models. Due to this method, the root\\nmean squared error of resulting odometry estimates is reduced by an average of\\n15%. Moreover, the student neural drone model can be successfully obtained from\\nthe onboard data. It even becomes more accurate at higher speeds compared to\\nits teacher, the self-supervised vision-based model. We demonstrate the value\\nof the neural drone model by integrating it into a traditional filter-based VIO\\nsystem (ROVIO), resulting in superior odometry accuracy on aggressive 3D racing\\ntrajectories near obstacles. Self-supervised learning of ego-motion estimation\\nrepresents a significant step toward bridging the gap between flying in\\ncontrolled, expensive lab environments and real-world drone applications. The\\nfusion of vision and drone models will enable higher-speed flight and improve\\nstate estimation, on any drone in any environment.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.AI\", \"published\": \"2025-04-30T14:38:01Z\"}"}
