{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14904v1\", \"title\": \"VLM as Policy: Common-Law Content Moderation Framework for Short Video\\n  Platform\", \"summary\": \"Exponentially growing short video platforms (SVPs) face significant\\nchallenges in moderating content detrimental to users' mental health,\\nparticularly for minors. The dissemination of such content on SVPs can lead to\\ncatastrophic societal consequences. Although substantial efforts have been\\ndedicated to moderating such content, existing methods suffer from critical\\nlimitations: (1) Manual review is prone to human bias and incurs high\\noperational costs. (2) Automated methods, though efficient, lack nuanced\\ncontent understanding, resulting in lower accuracy. (3) Industrial moderation\\nregulations struggle to adapt to rapidly evolving trends due to long update\\ncycles. In this paper, we annotate the first SVP content moderation benchmark\\nwith authentic user/reviewer feedback to fill the absence of benchmark in this\\nfield. Then we evaluate various methods on the benchmark to verify the\\nexistence of the aforementioned limitations. We further propose our common-law\\ncontent moderation framework named KuaiMod to address these challenges. KuaiMod\\nconsists of three components: training data construction, offline adaptation,\\nand online deployment & refinement. Leveraging large vision language model\\n(VLM) and Chain-of-Thought (CoT) reasoning, KuaiMod adequately models video\\ntoxicity based on sparse user feedback and fosters dynamic moderation policy\\nwith rapid update speed and high accuracy. Offline experiments and large-scale\\nonline A/B test demonstrates the superiority of KuaiMod: KuaiMod achieves the\\nbest moderation performance on our benchmark. The deployment of KuaiMod reduces\\nthe user reporting rate by 20% and its application in video recommendation\\nincreases both Daily Active User (DAU) and APP Usage Time (AUT) on several\\nKuaishou scenarios. We have open-sourced our benchmark at\\nhttps://kuaimod.github.io.\", \"main_category\": \"cs.SI\", \"categories\": \"cs.SI,cs.AI,cs.CL,cs.MM\", \"published\": \"2025-04-21T07:20:19Z\"}"}
