{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10145v1\", \"title\": \"Estimating the dense gas mass of molecular clouds using spatially\\n  unresolved 3 mm line observations\", \"summary\": \"We aim to develop a new method to infer the sub-beam probability density\\nfunction (PDF) of H2 column densities and the dense gas mass within molecular\\nclouds using spatially unresolved observations of molecular emission lines in\\nthe 3 mm band. We model spatially unresolved line integrated intensity\\nmeasurements as the average of an emission function weighted by the sub-beam\\ncolumn density PDF. The emission function, which expresses the line integrated\\nintensity as a function of the gas column density, is an empirical fit to high\\nresolution (< 0.05 pc) multi-line observations of the Orion B molecular cloud.\\nThe column density PDF is assumed to be parametric, composed of a lognormal\\ndistribution at moderate column densities and a power law distribution at\\nhigher column densities. To estimate the sub-beam column density PDF, the\\nemission model is combined with a Bayesian inversion algorithm (the Beetroots\\ncode), which takes account of thermal noise and calibration errors. We validate\\nour method by demonstrating that it recovers the true column density PDF of the\\nOrion B cloud, reproducing the observed emission line integrated intensities.\\nWe apply the method to 12CO(J=1-0), 13CO(J=1-0), C18O(J=1-0), HCN(J=1-0),\\nHCO+(J=1-0) and N2H+(J=1-0) observations of a 700 x 700 pc2 field of view (FoV)\\nin the nearby galaxy M51. On average, the model reproduces the observed\\nintensities within 30%. The column density PDFs obtained for the spiral arm\\nregion within our test FoV are dominated by a power-law tail at high column\\ndensities, with slopes that are consistent with gravitational collapse. Outside\\nthe spiral arm, the column density PDFs are predominantly lognormal, consistent\\nwith supersonic isothermal turbulence. We calculate the mass associated with\\nthe powerlaw tail of the column density PDFs and observe a strong, linear\\ncorrelation between this mass and the 24$\\\\mu$m surface brightness.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.IM\", \"published\": \"2025-04-14T11:56:40Z\"}"}
