{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03171v1\", \"title\": \"CombiBench: Benchmarking LLM Capability for Combinatorial Mathematics\", \"summary\": \"Neurosymbolic approaches integrating large language models with formal\\nreasoning have recently achieved human-level performance on mathematics\\ncompetition problems in algebra, geometry and number theory. In comparison,\\ncombinatorics remains a challenging domain, characterized by a lack of\\nappropriate benchmarks and theorem libraries. To address this gap, we introduce\\nCombiBench, a comprehensive benchmark comprising 100 combinatorial problems,\\neach formalized in Lean~4 and paired with its corresponding informal statement.\\nThe problem set covers a wide spectrum of difficulty levels, ranging from\\nmiddle school to IMO and university level, and span over ten combinatorial\\ntopics. CombiBench is suitable for testing IMO solving capabilities since it\\nincludes all IMO combinatorial problems since 2000 (except IMO 2004 P3 as its\\nstatement contain an images). Furthermore, we provide a comprehensive and\\nstandardized evaluation framework, dubbed Fine-Eval (for\\n$\\\\textbf{F}$ill-in-the-blank $\\\\textbf{in}$ L$\\\\textbf{e}$an Evaluation), for\\nformal mathematics. It accommodates not only proof-based problems but also, for\\nthe first time, the evaluation of fill-in-the-blank questions. Using Fine-Eval\\nas the evaluation method and Kimina Lean Server as the backend, we benchmark\\nseveral LLMs on CombiBench and observe that their capabilities for formally\\nsolving combinatorial problems remain limited. Among all models tested (none of\\nwhich has been trained for this particular task), Kimina-Prover attains the\\nbest results, solving 7 problems (out of 100) under both ``with solution'' and\\n``without solution'' scenarios. We open source the benchmark dataset alongside\\nwith the code of the proposed evaluation method at\\nhttps://github.com/MoonshotAI/CombiBench/.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI\", \"published\": \"2025-05-06T04:32:17Z\"}"}
