{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12234v1\", \"title\": \"MOS: Towards Effective Smart Contract Vulnerability Detection through\\n  Mixture-of-Experts Tuning of Large Language Models\", \"summary\": \"Smart contract vulnerabilities pose significant security risks to blockchain\\nsystems, potentially leading to severe financial losses. Existing methods face\\nseveral limitations: (1) Program analysis-based approaches rely on predefined\\npatterns, lacking flexibility for new vulnerability types; (2) Deep\\nlearning-based methods lack explanations; (3) Large language model-based\\napproaches suffer from high false positives. We propose MOS, a smart contract\\nvulnerability detection framework based on mixture-of-experts tuning\\n(MOE-Tuning) of large language models. First, we conduct continual pre-training\\non a large-scale smart contract dataset to provide domain-enhanced\\ninitialization. Second, we construct a high-quality MOE-Tuning dataset through\\na multi-stage pipeline combining LLM generation and expert verification for\\nreliable explanations. Third, we design a vulnerability-aware routing mechanism\\nthat activates the most relevant expert networks by analyzing code features and\\ntheir matching degree with experts. Finally, we extend the feed-forward layers\\ninto multiple parallel expert networks, each specializing in specific\\nvulnerability patterns. We employ a dual-objective loss function: one for\\noptimizing detection and explanation performance, and another for ensuring\\nreasonable distribution of vulnerability types to experts through entropy\\ncalculation. Experiments show that MOS significantly outperforms existing\\nmethods with average improvements of 6.32% in F1 score and 4.80% in accuracy.\\nThe vulnerability explanations achieve positive ratings (scores of 3-4 on a\\n4-point scale) of 82.96%, 85.21% and 94.58% for correctness, completeness, and\\nconciseness through human and LLM evaluation.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-16T16:33:53Z\"}"}
