{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05814v1\", \"title\": \"The threshold for PBH formation in the type-II region and its analytical\\n  estimation\", \"summary\": \"We numerically simulate the formation of Primordial Black Holes (PBHs) in a\\nradiation-dominated Universe under the assumption of spherical symmetry, driven\\nby the collapse of adiabatic fluctuations, for different curvature profiles\\n$\\\\zeta$. Our results show that the threshold for PBH formation, defined as the\\npeak value of the critical compaction function $\\\\mathcal{C}_{c}(r_m)$ (where\\n$r_m$ is the scale at which the peak occurs), does not asymptotically saturate\\nto its maximum possible value in the type-I region for sufficiently sharp\\nprofiles. Instead, the threshold is found in the type-II region with\\n$\\\\mathcal{C}_{c}(r_m)$ being a minimum. We find, for the cases tested, that\\nthis is a general trend associated with profiles that exhibit extremely large\\ncurvatures in the linear component of the compaction function\\n$\\\\mathcal{C}_{l}(r) \\\\equiv -4r \\\\zeta'(r)/3$ shape around its peak $r_m$ (spiky\\nshapes). To measure this curvature at $r_m$, we define a dimensionless\\nparameter: $\\\\kappa \\\\equiv -r^{2}_m \\\\mathcal{C}_l''(r_m)$, and we find that the\\nthresholds observed in the type-II region occur for $\\\\kappa \\\\gtrsim 30$ for the\\nprofiles we have used. By defining the threshold in terms of\\n$\\\\mathcal{C}_{l,c}(r_m)$, we extend previous analytical estimations to the\\ntype-II region, which is shown to be accurate within a few percent when\\ncompared to the numerical simulations for the tested profiles. Our results\\nsuggest that current PBH abundance calculations for models where the threshold\\nlies in the type-II region may have been overestimated due to the general\\nassumption that it should saturate at the boundary between the type-I and\\ntype-II regions.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,gr-qc,hep-th\", \"published\": \"2025-04-08T08:53:42Z\"}"}
