{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10827v1\", \"title\": \"Large-time behavior of solutions to the Boussinesq equations with\\n  partial dissipation and influence of rotation\", \"summary\": \"This paper investigates the stability and large-time behavior of solutions to\\nthe rotating Boussinesq system under the influence of a general gravitational\\npotential $\\\\Psi$, which is widely used to model the dynamics of stratified\\ngeophysical fluids on the $f-$plane. Our main results are threefold: First, by\\nimposing physically realistic boundary conditions and viscosity constraints, we\\nprove that the solutions of the system smust necessarily take the following\\nsteady-state form $(\\\\rho,u,v,w,p)=(\\\\rho_s,0,v_s,0, p_s)$. These solutions are\\ncharacterized by both geostrophic balance, given by $fv_s-\\\\frac{\\\\partial\\np_s}{\\\\partial x}=\\\\rho_s\\\\frac{\\\\partial \\\\Psi}{\\\\partial x}$ and hydrostatic\\nbalance, expressed as $-\\\\frac{\\\\partial p_s}{\\\\partial z}=\\\\rho_s\\\\frac{\\\\partial\\n\\\\Psi}{\\\\partial z}$. Second, we establish that any steady-state solution\\nsatisfying the conditions $\\\\nabla \\\\rho_s=\\\\delta (x,z)\\\\nabla \\\\Psi$ with\\n$v_s(x,z)=a_0x+a_1$ is linearly unstable when the conditions\\n$\\\\delta(x,z)|_{(x_0,z_0)}>0$ and $(f+\\\\alpha_0)\\\\leq 0$ are simultaneously\\nsatisfied. This instability under the condition $\\\\delta(x,z)|_{(x_0,z_0)}>0$\\ncorresponds to the well-known Rayleigh-Taylor instability. Third, although the\\ninherent Rayleigh-Taylor instability could potentially amplify the velocity\\naround unstable steady-state solutions (heavier density over lighter one), we\\nrigorously demonstrate that for any sufficiently smooth initial data, the\\nsolutions of the system asymptotically converge to a neighborhood of a\\nsteady-state solution in which both the zonal and vertical velocity components\\nvanish. Finally, under a moderate additional assumption, we demonstrate that\\nthe system converges to a specific steady-state solution. In this state, the\\ndensity profile is given by $\\\\rho=-\\\\gamma \\\\Psi+\\\\beta$, where $\\\\gamma$ and\\n$\\\\beta$ are positive constants, and the meridional velocity $v$ depends solely\\nand linearly on $x$ variable.\", \"main_category\": \"math.AP\", \"categories\": \"math.AP\", \"published\": \"2025-04-15T03:10:27Z\"}"}
