{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03573v1\", \"title\": \"Troika algorithm: approximate optimization for accurate clique\\n  partitioning and clustering of weighted networks\", \"summary\": \"Clique partitioning is a fundamental network clustering task, with\\napplications in a wide range of computational sciences. It involves identifying\\nan optimal partition of the nodes for a real-valued weighted graph according to\\nthe edge weights. An optimal partition is one that maximizes the sum of\\nwithin-cluster edge weights over all possible node partitions. This paper\\nintroduces a novel approximation algorithm named Troika to solve this NP-hard\\nproblem in small to mid-sized networks for instances of theoretical and\\npractical relevance. Troika uses a branch-and-cut scheme for branching on node\\ntriples to find a partition that is within a user-specified optimality gap\\ntolerance. Troika offers advantages over alternative methods like integer\\nprogramming solvers and heuristics for clique partitioning. Unlike existing\\nheuristics, Troika returns solutions within a guaranteed proximity to global\\noptimality. And our results indicate that Troika is faster than using the\\nstate-of-the-art integer programming solver Gurobi for most benchmark\\ninstances. Besides its advantages for solving the clique partitioning problem,\\nwe demonstrate the applications of Troika in community detection and portfolio\\nanalysis. Troika returns partitions with higher proximity to optimal compared\\nto eight modularity-based community detection algorithms. When used on networks\\nof correlations among stocks, Troika reveals the dynamic changes in the\\nstructure of portfolio networks including downturns from the 2008 financial\\ncrisis and the reaction to the COVID-19 pandemic. Our comprehensive results\\nbased on benchmarks from the literature and new real and random networks point\\nto Troika as a reliable and accurate method for solving clique partitioning\\ninstances with up to 5000 edges on standard hardware.\", \"main_category\": \"cs.SI\", \"categories\": \"cs.SI,cs.DS,math.OC\", \"published\": \"2025-05-06T14:32:54Z\"}"}
