{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12948v1\", \"title\": \"Algorithms for the Shortest Vector Problem in $2$-dimensional Lattices,\\n  Revisited\", \"summary\": \"Efficiently solving the Shortest Vector Problem (SVP) in two-dimensional\\nlattices holds practical significance in cryptography and computational\\ngeometry. While simpler than its high-dimensional counterpart, two-dimensional\\nSVP motivates scalable solutions for high-dimensional lattices and benefits\\napplications like sequence cipher cryptanalysis involving large integers. In\\nthis work, we first propose a novel definition of reduced bases and develop an\\nefficient adaptive lattice reduction algorithm \\\\textbf{CrossEuc} that\\nstrategically applies the Euclidean algorithm across dimensions. Building on\\nthis framework, we introduce \\\\textbf{HVec}, a vectorized generalization of the\\nHalf-GCD algorithm originally defined for integers, which can efficiently halve\\nthe bit-length of two vectors and may have independent interest. By iteratively\\ninvoking \\\\textbf{HVec}, our optimized algorithm \\\\textbf{HVecSBP} achieves a\\nreduced basis in $O(\\\\log n M(n) )$ time for arbitrary input bases with\\nbit-length $n$, where $M(n)$ denotes the cost of multiplying two $n$-bit\\nintegers. Compared to existing algorithms, our design is applicable to general\\nforms of input lattices, eliminating the cost of pre-converting input bases to\\nHermite Normal Form (HNF). The comprehensive experimental results demonstrate\\nthat for the input lattice bases in HNF, the optimized algorithm\\n\\\\textbf{HVecSBP} achieves at least a $13.5\\\\times$ efficiency improvement\\ncompared to existing methods. For general-form input lattice bases, converting\\nthem to HNF before applying \\\\textbf{HVecSBP} offers only marginal advantages in\\nextreme cases where the two basis vectors are nearly degenerate. However, as\\nthe linear dependency between input basis vectors decreases, directly employing\\n\\\\textbf{HVecSBP} yields increasingly significant efficiency gains,\\noutperforming hybrid approaches that rely on prior \\\\textbf{HNF} conversion.\", \"main_category\": \"cs.CG\", \"categories\": \"cs.CG,cs.CR\", \"published\": \"2025-04-17T13:50:51Z\"}"}
