{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15924v1\", \"title\": \"Achieving Distributive Justice in Federated Learning via Uncertainty\\n  Quantification\", \"summary\": \"Client-level fairness metrics for federated learning are used to ensure that\\nall clients in a federation either: a) have similar final performance on their\\nlocal data distributions (i.e., client parity), or b) obtain final performance\\non their local data distributions relative to their contribution to the\\nfederated learning process (i.e., contribution fairness). While a handful of\\nworks that propose either client-parity or contribution-based fairness metrics\\nground their definitions and decisions in social theories of equality -- such\\nas distributive justice -- most works arbitrarily choose what notion of\\nfairness to align with which makes it difficult for practitioners to choose\\nwhich fairness metric aligns best with their fairness ethics. In this work, we\\npropose UDJ-FL (Uncertainty-based Distributive Justice for Federated Learning),\\na flexible federated learning framework that can achieve multiple distributive\\njustice-based client-level fairness metrics. Namely, by utilizing techniques\\ninspired by fair resource allocation, in conjunction with performing aleatoric\\nuncertainty-based client weighing, our UDJ-FL framework is able to achieve\\negalitarian, utilitarian, Rawls' difference principle, or desert-based\\nclient-level fairness. We empirically show the ability of UDJ-FL to achieve all\\nfour defined distributive justice-based client-level fairness metrics in\\naddition to providing fairness equivalent to (or surpassing) other popular fair\\nfederated learning works. Further, we provide justification for why aleatoric\\nuncertainty weighing is necessary to the construction of our UDJ-FL framework\\nas well as derive theoretical guarantees for the generalization bounds of\\nUDJ-FL. Our code is publicly available at\\nhttps://github.com/alycia-noel/UDJ-FL.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI,stat.ML,I.2.0\", \"published\": \"2025-04-22T14:07:56Z\"}"}
