{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04559v1\", \"title\": \"MuAPBEK: An Improved Analytical Kinetic Energy Density Functional for\\n  Quantum Chemistry\", \"summary\": \"Orbital-free density functional theory (OFDFT) offers a true realization of\\nthe Hohenberg-Kohn theorems, enabling full quantum-mechanical studies of\\nelectronic systems based solely on electron densities. However, OFDFT remains\\nlimited by the difficulty of formulating accurate kinetic-energy density\\nfunctionals. In this paper, we substantially enhance the accuracy of OFDFT\\nenergies and densities by tuning, during density initialization, the parameter\\n$\\\\mu$ of the APBEK functional, which arises in the second-order gradient\\nexpansion of the kinetic energy for semiclassical neutral atoms. We augment\\nthis parameterized APBEK functional with two physically-motivated,\\nnon-empirical corrections derived from Kato's cusp condition and the virial\\ntheorem. The resulting functional, which we call MuAPBEK, is benchmarked\\nagainst Kohn-Sham density functional theory (KSDFT) on atoms, organic molecules\\nfrom the QM9 dataset, and the anti-malarial drug artemisinin. MuAPBEK achieves\\nmuch lower energy errors than standard APBEK and Thomas-Fermi-von-Weizsacker\\nfunctionals, even when the latter two are evaluated on converged KSDFT\\ndensities. Its mean absolute energy errors on atoms and molecules are 161 and\\n122 kcal/mol, respectively, indicating that MuAPBEK's errors do not scale with\\nsystem size. MuAPBEK also yields accurate densities, with a mean integrated\\nabsolute density error of 1.8 electrons for molecules. Importantly, one step of\\nour density optimization scheme is at least ten times faster than a single\\nKSDFT self-consistent field cycle and exhibits a lower-order computational time\\ncomplexity of $O(N^{1.96})$ with respect to system size, $N$. Our results\\nindicate that highly-accurate OFDFT for large-scale quantum simulations beyond\\nthe practical limits of KSDFT is within reach.\", \"main_category\": \"physics.chem-ph\", \"categories\": \"physics.chem-ph,physics.comp-ph\", \"published\": \"2025-05-07T16:48:00Z\"}"}
