{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19810v1\", \"title\": \"Protoplanetary disk insights from the first ERIS/APP survey at 4 \\u03bcm\", \"summary\": \"We present high-contrast imaging observations of seven protoplanetary disks\\nat 4um using the ERIS on the VLT. This study focuses on detecting scattered\\nlight from micron-sized dust particles and assessing the potential of the vAPP\\ncoronagraph for disk and planet characterization. Observations were performed\\nin pupil-stabilized mode with the vAPP coronagraph. Data were reduced using\\nreference differential imaging and angular differential imaging techniques,\\nincorporating principal component analysis for point-source detection. Contrast\\ncurves and detection limits were computed for planetary companions and disk\\nfeatures. The infrared disk signal was resolved in all systems, with first-time\\n4um detections around AS 209 and Elias 2-24, revealing mostly axisymmetric\\nstructures extending up to 60au. Two gaps were detected in the radial profiles\\nof TW Hya (22au, 35au) and AS 209 (50au, 100au). For Elias 2-24, scattered\\nlight emission matched ALMA observations of inner disk structures, marking\\ntheir first mid-infrared detection. In the case of HD 100546, the vAPP\\nuncovered flared disk structures and faint spiral arms consistent with previous\\nobservations. HD 163296 shows a bright inner dust ring, confirming disk\\nasymmetries and features, but we did not detect any planet candidate within the\\nachieved contrast limits. The disk around PDS 70 exhibits clear features, with\\nfaint structures detected within the cavity. The observations achieved\\ncontrasts enabling the detection of planets down to 800 K, but no companions\\nwere detected, implying either low-mass planets, cooler formation scenarios, or\\na large dust extinction of Av>20 mag. The vAPP performed robustly for imaging\\nstructures in protoplanetary disks at 4um, providing critical insights into\\ndisk morphology and constraints on planet formation processes. No\\nplanetary-mass companions with temperatures >1000K are present in our sample.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-28T14:08:38Z\"}"}
