{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10200v1\", \"title\": \"Stability analysis of discrete Boltzmann simulation for supersonic\\n  flows: Influencing factors, coupling mechanisms and optimization strategies\", \"summary\": \"Supersonic flow simulations face challenges in trans-scale modeling,\\nnumerical stability, and complex field analysis due to inherent nonlinear,\\nnonequilibrium, and multiscale characteristics. The discrete Boltzmann method\\n(DBM) provides a multiscale kinetic modeling framework and analysis tool to\\ncapture complex discrete/nonequilibrium effects. While the numerical scheme\\nplays a fundamental role in DBM simulations, a comprehensive stability analysis\\nremains lacking. Similar to LBM, the complexity mainly arises from the\\nintrinsic coupling between velocity and spatiotemporal discretizations,\\ncompared with CFD. This study applies von Neumann stability analysis to\\ninvestigate key factors influencing DBM simulation stability, including\\nphase-space discretization, thermodynamic nonequilibrium (TNE) levels,\\nspatiotemporal schemes, initial conditions, and model parameters. Key findings\\ninclude: (i) the moment-matching approach outperforms expansion- and\\nweighting-based methods in the test simulations; (ii) increased TNE enhances\\nsystem nonlinearity and the intrinsic nonlinearity embedded in the model\\nequations, amplifying instabilities; (iii) additional viscous dissipation based\\non distribution functions improves stability but distorts flow fields and\\nalters constitutive relations; (iv) larger CFL numbers and relative time steps\\ndegrade stability, necessitating appropriate time-stepping strategies. To\\nassess the stability regulation capability of DBMs across TNE levels,\\nstability-phase diagrams and probability curves are constructed via\\nmorphological analysis within the moment-matching framework. These diagrams\\nidentify common stable parameter regions across model orders. This study\\nreveals key factors and coupling mechanisms affecting DBM stability and\\nproposes strategies for optimizing equilibrium distribution discretization,\\nvelocity design, and parameter selection in supersonic regimes.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-14T13:04:58Z\"}"}
