{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04475v1\", \"title\": \"Mass Modeling the Andromeda Dwarf Galaxies: Andromeda VI and Andromeda\\n  XXIII\", \"summary\": \"Accurately mapping the mass profiles of low mass dwarf spheroidal (dSph)\\ngalaxies allows us to test predictions made by dark matter (DM) models. To\\ndate, such analyses have primarily been performed on Milky Way (MW) satellites.\\nMeanwhile, the Andromeda Galaxy (M31) is home to 35 known dwarf galaxies, yet\\nonly two have been successfully mass-modeled so far. In order to better\\nunderstand the nature of dark matter, a more comprehensive study of Local Group\\ndwarfs is necessary. In this study, we have undertaken a dynamical study of two\\nhigher-luminosity Andromeda dwarf galaxies: Andromeda VI (And VI) and Andromeda\\nXXIII (And XXIII). We infer an enclosed mass for And VI of M(r < r$_{\\\\rm{h}}$)\\n= (4.9 $\\\\pm$ 1.5) $\\\\times$ 10$^{7}$ M$_{\\\\odot}$, corresponding to a\\nmass-to-light ratio of $[M/L]_{r_{\\\\rm{h}}}$ = (27.1 $\\\\pm$ 8.2)\\nM$_{\\\\odot}$/L$_{\\\\odot}$. We infer an enclosed mass for And XXIII of M(r <\\nr$_{\\\\rm{h}}$) = (3.1 $\\\\pm$ 1.9) $\\\\times$ 10$^{7}$ M$_{\\\\odot}$, corresponding to\\na mass-to-light ratio of $[M/L]_{\\\\rm{r_{h}}}$ = (90.2 $\\\\pm$ 53.9)\\nM$_{\\\\odot}$/L$_{\\\\odot}$. Using the dynamical Jeans modeling tool, GravSphere,\\nwe determine And VI and And XXIII's dark matter density at 150 pc, finding\\n$\\\\rho_{\\\\rm{DM,VI}}$(150 pc) = (1.4 $\\\\pm$ 0.5) $\\\\times$ 10$^{8}$ M$_{\\\\odot}$\\nkpc$^{-3}$ and $\\\\rho_{\\\\rm{DM,XXIII}}$(150 pc) = 0.5$\\\\substack{+0.4 \\\\\\\\ -0.3}\\n\\\\times$ 10$^{8}$ M$_{\\\\odot}$ kpc$^{-3}$. Our results make And VI the first\\nmass-modeled M31 satellite to fall into the cuspy regime, while And XXIII has a\\nlower density, implying either a more cored central dark matter density, or a\\nlowering of the density through tides. This adds And XXIII to a growing list of\\nM31 dwarfs with a central density lower than most MW dwarfs and lower than\\nexpected for isolated dwarfs in the Standard Cosmology. This could be explained\\nby the M31 dwarfs having experienced stronger tides than their Milky Way\\ncounterparts.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-05-07T14:46:22Z\"}"}
