{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16615v1\", \"title\": \"Algorithmic Mirror: Designing an Interactive Tool to Promote\\n  Self-Reflection for YouTube Recommendations\", \"summary\": \"Big Data analytics and Artificial Intelligence systems derive non-intuitive\\nand often unverifiable inferences about individuals' behaviors, preferences,\\nand private lives. Drawing on diverse, feature-rich datasets of unpredictable\\nvalue, these systems erode the intuitive connection between our actions and how\\nwe are perceived, diminishing control over our digital identities. While\\nExplainable Artificial Intelligence scholars have attempted to explain the\\ninner workings of algorithms, their visualizations frequently overwhelm\\nend-users with complexity. This research introduces 'hypothetical inference', a\\nnovel approach that uses language models to simulate how algorithms might\\ninterpret users' digital footprints and infer personal characteristics without\\nrequiring access to proprietary platform algorithms. Through empirical studies\\nwith fourteen adult participants, we identified three key design opportunities\\nto foster critical algorithmic literacy: (1) reassembling scattered digital\\nfootprints into a unified map, (2) simulating algorithmic inference through\\nLLM-generated interpretations, and (3) incorporating temporal dimensions to\\nvisualize evolving patterns. This research lays the groundwork for tools that\\ncan help users recognize the influence of data on platforms and develop greater\\nautonomy in increasingly algorithm-mediated digital environments.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-23T11:00:17Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16631v1\", \"title\": \"Density of states and non-smooth Lyapunov exponent in the localized\\n  phase\", \"summary\": \"Localization of wave functions in the disordered models can be characterized\\nby the Lyapunov exponent, which is zero in the extended phase and nonzero in\\nthe localized phase. Previous studies have shown that this exponent is a smooth\\nfunction of eigenenergy in the same phase, thus its non-smoothness can serve as\\nstrong evidence to determine the phase transition from the extended phase to\\nthe localized phase. However, logically, there is no fundamental reason that\\nprohibits this Lyapunov exponent from being non-smooth in the localized phase.\\nIn this work, we show that if the localization centers are inhomogeneous in the\\nwhole chain and if the system possesses (at least) two different localization\\nmodes, the Lyapunov exponent can become non-smooth in the localized phase at\\nthe boundaries between the different localization modes. We demonstrate these\\nresults using several slowly varying models and show that the singularities of\\ndensity of states are essential to these non-smoothness, according to the\\nThouless formula. These results can be generalized to higher-dimensional\\nmodels, suggesting the possible delicate structures in the localized phase,\\nwhich can revise our understanding of localization hence greatly advance our\\ncomprehension of Anderson localization.\", \"main_category\": \"cond-mat.dis-nn\", \"categories\": \"cond-mat.dis-nn\", \"published\": \"2025-04-23T11:44:44Z\"}"}
