{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05706v1\", \"title\": \"SEVERE++: Evaluating Benchmark Sensitivity in Generalization of Video\\n  Representation Learning\", \"summary\": \"Continued advances in self-supervised learning have led to significant\\nprogress in video representation learning, offering a scalable alternative to\\nsupervised approaches by removing the need for manual annotations. Despite\\nstrong performance on standard action recognition benchmarks, video\\nself-supervised learning methods are largely evaluated under narrow protocols,\\ntypically pretraining on Kinetics-400 and fine-tuning on similar datasets,\\nlimiting our understanding of their generalization in real world scenarios. In\\nthis work, we present a comprehensive evaluation of modern video\\nself-supervised models, focusing on generalization across four key downstream\\nfactors: domain shift, sample efficiency, action granularity, and task\\ndiversity. Building on our prior work analyzing benchmark sensitivity in\\nCNN-based contrastive learning, we extend the study to cover state-of-the-art\\ntransformer-based video-only and video-text models. Specifically, we benchmark\\n12 transformer-based methods (7 video-only, 5 video-text) and compare them to\\n10 CNN-based methods, totaling over 1100 experiments across 8 datasets and 7\\ndownstream tasks. Our analysis shows that, despite architectural advances,\\ntransformer-based models remain sensitive to downstream conditions. No method\\ngeneralizes consistently across all factors, video-only transformers perform\\nbetter under domain shifts, CNNs outperform for fine-grained tasks, and\\nvideo-text models often underperform despite large scale pretraining. We also\\nfind that recent transformer models do not consistently outperform earlier\\napproaches. Our findings provide a detailed view of the strengths and\\nlimitations of current video SSL methods and offer a unified benchmark for\\nevaluating generalization in video representation learning.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-08T06:00:28Z\"}"}
