{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11431v1\", \"title\": \"Masculine Defaults via Gendered Discourse in Podcasts and Large Language\\n  Models\", \"summary\": \"Masculine defaults are widely recognized as a significant type of gender\\nbias, but they are often unseen as they are under-researched. Masculine\\ndefaults involve three key parts: (i) the cultural context, (ii) the masculine\\ncharacteristics or behaviors, and (iii) the reward for, or simply acceptance\\nof, those masculine characteristics or behaviors. In this work, we study\\ndiscourse-based masculine defaults, and propose a twofold framework for (i) the\\nlarge-scale discovery and analysis of gendered discourse words in spoken\\ncontent via our Gendered Discourse Correlation Framework (GDCF); and (ii) the\\nmeasurement of the gender bias associated with these gendered discourse words\\nin LLMs via our Discourse Word-Embedding Association Test (D-WEAT). We focus\\nour study on podcasts, a popular and growing form of social media, analyzing\\n15,117 podcast episodes. We analyze correlations between gender and discourse\\nwords -- discovered via LDA and BERTopic -- to automatically form gendered\\ndiscourse word lists. We then study the prevalence of these gendered discourse\\nwords in domain-specific contexts, and find that gendered discourse-based\\nmasculine defaults exist in the domains of business, technology/politics, and\\nvideo games. Next, we study the representation of these gendered discourse\\nwords from a state-of-the-art LLM embedding model from OpenAI, and find that\\nthe masculine discourse words have a more stable and robust representation than\\nthe feminine discourse words, which may result in better system performance on\\ndownstream tasks for men. Hence, men are rewarded for their discourse patterns\\nwith better system performance by one of the state-of-the-art language models\\n-- and this embedding disparity is a representational harm and a masculine\\ndefault.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.AI,cs.CY,cs.LG,cs.SI\", \"published\": \"2025-04-15T17:41:54Z\"}"}
