{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05904v1\", \"title\": \"Intrinsic Saliency Guided Trunk-Collateral Network for Unsupervised\\n  Video Object Segmentation\", \"summary\": \"Recent unsupervised video object segmentation (UVOS) methods predominantly\\nadopt the motion-appearance paradigm. Mainstream motion-appearance approaches\\nuse either the two-encoder structure to separately encode motion and appearance\\nfeatures, or the single-encoder structure for joint encoding. However, these\\nmethods fail to properly balance the motion-appearance relationship.\\nConsequently, even with complex fusion modules for motion-appearance\\nintegration, the extracted suboptimal features degrade the models' overall\\nperformance. Moreover, the quality of optical flow varies across scenarios,\\nmaking it insufficient to rely solely on optical flow to achieve high-quality\\nsegmentation results. To address these challenges, we propose the Intrinsic\\nSaliency guided Trunk-Collateral Net}work (ISTC-Net), which better balances the\\nmotion-appearance relationship and incorporates model's intrinsic saliency\\ninformation to enhance segmentation performance. Specifically, considering that\\noptical flow maps are derived from RGB images, they share both commonalities\\nand differences. We propose a novel Trunk-Collateral structure. The shared\\ntrunk backbone captures the motion-appearance commonality, while the collateral\\nbranch learns the uniqueness of motion features. Furthermore, an Intrinsic\\nSaliency guided Refinement Module (ISRM) is devised to efficiently leverage the\\nmodel's intrinsic saliency information to refine high-level features, and\\nprovide pixel-level guidance for motion-appearance fusion, thereby enhancing\\nperformance without additional input. Experimental results show that ISTC-Net\\nachieved state-of-the-art performance on three UVOS datasets (89.2% J&F on\\nDAVIS-16, 76% J on YouTube-Objects, 86.4% J on FBMS) and four standard video\\nsalient object detection (VSOD) benchmarks with the notable increase,\\ndemonstrating its effectiveness and superiority over previous methods.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.LG\", \"published\": \"2025-04-08T11:02:14Z\"}"}
