{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17613v1\", \"title\": \"TarDiff: Target-Oriented Diffusion Guidance for Synthetic Electronic\\n  Health Record Time Series Generation\", \"summary\": \"Synthetic Electronic Health Record (EHR) time-series generation is crucial\\nfor advancing clinical machine learning models, as it helps address data\\nscarcity by providing more training data. However, most existing approaches\\nfocus primarily on replicating statistical distributions and temporal\\ndependencies of real-world data. We argue that fidelity to observed data alone\\ndoes not guarantee better model performance, as common patterns may dominate,\\nlimiting the representation of rare but important conditions. This highlights\\nthe need for generate synthetic samples to improve performance of specific\\nclinical models to fulfill their target outcomes. To address this, we propose\\nTarDiff, a novel target-oriented diffusion framework that integrates\\ntask-specific influence guidance into the synthetic data generation process.\\nUnlike conventional approaches that mimic training data distributions, TarDiff\\noptimizes synthetic samples by quantifying their expected contribution to\\nimproving downstream model performance through influence functions.\\nSpecifically, we measure the reduction in task-specific loss induced by\\nsynthetic samples and embed this influence gradient into the reverse diffusion\\nprocess, thereby steering the generation towards utility-optimized data.\\nEvaluated on six publicly available EHR datasets, TarDiff achieves\\nstate-of-the-art performance, outperforming existing methods by up to 20.4% in\\nAUPRC and 18.4% in AUROC. Our results demonstrate that TarDiff not only\\npreserves temporal fidelity but also enhances downstream model performance,\\noffering a robust solution to data scarcity and class imbalance in healthcare\\nanalytics.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-24T14:36:10Z\"}"}
