{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16467v1\", \"title\": \"MTSGL: Multi-Task Structure Guided Learning for Robust and Interpretable\\n  SAR Aircraft Recognition\", \"summary\": \"Aircraft recognition in synthetic aperture radar (SAR) imagery is a\\nfundamental mission in both military and civilian applications. Recently deep\\nlearning (DL) has emerged a dominant paradigm for its explosive performance on\\nextracting discriminative features. However, current classification algorithms\\nfocus primarily on learning decision hyperplane without enough comprehension on\\naircraft structural knowledge. Inspired by the fined aircraft annotation\\nmethods for optical remote sensing images (RSI), we first introduce a\\nstructure-based SAR aircraft annotations approach to provide structural and\\ncompositional supplement information. On this basis, we propose a multi-task\\nstructure guided learning (MTSGL) network for robust and interpretable SAR\\naircraft recognition. Besides the classification task, MTSGL includes a\\nstructural semantic awareness (SSA) module and a structural consistency\\nregularization (SCR) module. The SSA is designed to capture structure semantic\\ninformation, which is conducive to gain human-like comprehension of aircraft\\nknowledge. The SCR helps maintain the geometric consistency between the\\naircraft structure in SAR imagery and the proposed annotation. In this process,\\nthe structural attribute can be disentangled in a geometrically meaningful\\nmanner. In conclusion, the MTSGL is presented with the expert-level aircraft\\nprior knowledge and structure guided learning paradigm, aiming to comprehend\\nthe aircraft concept in a way analogous to the human cognitive process.\\nExtensive experiments are conducted on a self-constructed multi-task SAR\\naircraft recognition dataset (MT-SARD) and the effective results illustrate the\\nsuperiority of robustness and interpretation ability of the proposed MTSGL.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-23T07:27:08Z\"}"}
