{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00409v1\", \"title\": \"Perceptual Implications of Automatic Anonymization in Pathological\\n  Speech\", \"summary\": \"Automatic anonymization techniques are essential for ethical sharing of\\npathological speech data, yet their perceptual consequences remain\\nunderstudied. This study presents the first comprehensive human-centered\\nanalysis of anonymized pathological speech, using a structured perceptual\\nprotocol involving ten native and non-native German listeners with diverse\\nlinguistic, clinical, and technical backgrounds. Listeners evaluated\\nanonymized-original utterance pairs from 180 speakers spanning Cleft Lip and\\nPalate, Dysarthria, Dysglossia, Dysphonia, and age-matched healthy controls.\\nSpeech was anonymized using state-of-the-art automatic methods (equal error\\nrates in the range of 30-40%). Listeners completed Turing-style discrimination\\nand quality rating tasks under zero-shot (single-exposure) and few-shot\\n(repeated-exposure) conditions. Discrimination accuracy was high overall (91%\\nzero-shot; 93% few-shot), but varied by disorder (repeated-measures ANOVA:\\np=0.007), ranging from 96% (Dysarthria) to 86% (Dysphonia). Anonymization\\nconsistently reduced perceived quality (from 83% to 59%, p<0.001), with\\npathology-specific degradation patterns (one-way ANOVA: p=0.005). Native\\nlisteners rated original speech slightly higher than non-native listeners\\n(Delta=4%, p=0.199), but this difference nearly disappeared after anonymization\\n(Delta=1%, p=0.724). No significant gender-based bias was observed. Critically,\\nhuman perceptual outcomes did not correlate with automatic privacy or clinical\\nutility metrics. These results underscore the need for listener-informed,\\ndisorder- and context-specific anonymization strategies that preserve privacy\\nwhile maintaining interpretability, communicative functions, and diagnostic\\nutility, especially for vulnerable populations such as children.\", \"main_category\": \"eess.AS\", \"categories\": \"eess.AS,cs.AI,cs.LG\", \"published\": \"2025-05-01T09:03:03Z\"}"}
