{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09967v1\", \"title\": \"Enhancing Multi-task Learning Capability of Medical Generalist\\n  Foundation Model via Image-centric Multi-annotation Data\", \"summary\": \"The emergence of medical generalist foundation models has revolutionized\\nconventional task-specific model development paradigms, aiming to better handle\\nmultiple tasks through joint training on large-scale medical datasets. However,\\nrecent advances prioritize simple data scaling or architectural component\\nenhancement, while neglecting to re-examine multi-task learning from a\\ndata-centric perspective. Critically, simply aggregating existing data\\nresources leads to decentralized image-task alignment, which fails to cultivate\\ncomprehensive image understanding or align with clinical needs for\\nmulti-dimensional image interpretation. In this paper, we introduce the\\nimage-centric multi-annotation X-ray dataset (IMAX), the first attempt to\\nenhance the multi-task learning capabilities of medical multi-modal large\\nlanguage models (MLLMs) from the data construction level. To be specific, IMAX\\nis featured from the following attributes: 1) High-quality data curation. A\\ncomprehensive collection of more than 354K entries applicable to seven\\ndifferent medical tasks. 2) Image-centric dense annotation. Each X-ray image is\\nassociated with an average of 4.10 tasks and 7.46 training entries, ensuring\\nmulti-task representation richness per image. Compared to the general\\ndecentralized multi-annotation X-ray dataset (DMAX), IMAX consistently\\ndemonstrates significant multi-task average performance gains ranging from\\n3.20% to 21.05% across seven open-source state-of-the-art medical MLLMs.\\nMoreover, we investigate differences in statistical patterns exhibited by IMAX\\nand DMAX training processes, exploring potential correlations between\\noptimization dynamics and multi-task performance. Finally, leveraging the core\\nconcept of IMAX data construction, we propose an optimized DMAX-based training\\nstrategy to alleviate the dilemma of obtaining high-quality IMAX data in\\npractical scenarios.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI,cs.LG\", \"published\": \"2025-04-14T08:09:37Z\"}"}
