{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04976v1\", \"title\": \"Internal and External Field Effects upon Crystal Field Excitations in\\n  REFeO$_3$ (RE = Nd$^{3+}$, Er$^{3+}$, Yb$^{3+}$, Pr$^{3+}$, and Ho$^{3+}$)\", \"summary\": \"The crystal field (CF) excitations of Kramers (Nd$^{3+}$, Er$^{3+}$, and\\nYb$^{3+}$) and non-Kramers (Pr$^{3+}$ and Ho$^{3+}$) rare earth ions in rare\\nearth orthoferrites REFeO$_{3}$ were systematically studied by simulations. The\\noptimised CF models were used to study the internal and external field impacts\\nto the CF excitation peaks of these Kramers and non-Kramers ions. The Kramers\\nions excitations consist of doublets due to the Kramers degeneracy theorem\\nwhile the non-Kramers ions excitations are non-degenerated singlets. The\\nground-state doublets of all Kramers ions undergo peak splitting and generate\\nlow energy excitation peaks ~ 1 meV under the internal magnetic fields from the\\nFe$^{3+}$ and RE$^{3+}$ sublattices. The ground-states of non-Kramers ions may\\nform pseudo doublets due to the accidental degeneracy of two singlet states, as\\nthe case of Ho$^{3+}$ in HoFeO$_3$. Such pseudo-doublet ground states can split\\nand produce low energy excitations just like the Kramers ions. However, singlet\\nground states of non-Kramers ions without accidental degeneracy, like\\nPr$^{3+}$, has no ground state excitation and splitting at zero fields. A\\nground-state singlet excitation shows up under non-zero magnetic fields due to\\nthe symmetry breaking induced by the magnetic fields. The internal/external\\nmagnetic field effects on CF excitations in REFeO$_3$ demonstrate strong\\nanisotropies. The local symmetry was confirmed to play the critical role in the\\nCF excitation splitting and anisotropic responses to magnetic fields in\\nREFeO$_{3}$. This study provides a consistent in-depth understanding to the\\nabnormal Zeeman splitting effect of the CF ground states in REFeO$_{3}$.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el,cond-mat.other\", \"published\": \"2025-05-08T06:29:57Z\"}"}
