{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00668v1\", \"title\": \"Deep Reinforcement Learning for Urban Air Quality Management:\\n  Multi-Objective Optimization of Pollution Mitigation Booth Placement in\\n  Metropolitan Environments\", \"summary\": \"Urban air pollution remains a pressing global concern, particularly in\\ndensely populated and traffic-intensive metropolitan areas like Delhi, where\\nexposure to harmful pollutants severely impacts public health. Delhi, being one\\nof the most polluted cities globally, experiences chronic air quality issues\\ndue to vehicular emissions, industrial activities, and construction dust, which\\nexacerbate its already fragile atmospheric conditions. Traditional pollution\\nmitigation strategies, such as static air purifying installations, often fail\\nto maximize their impact due to suboptimal placement and limited adaptability\\nto dynamic urban environments. This study presents a novel deep reinforcement\\nlearning (DRL) framework to optimize the placement of air purification booths\\nto improve the air quality index (AQI) in the city of Delhi. We employ Proximal\\nPolicy Optimization (PPO), a state-of-the-art reinforcement learning algorithm,\\nto iteratively learn and identify high-impact locations based on multiple\\nspatial and environmental factors, including population density, traffic\\npatterns, industrial influence, and green space constraints. Our approach is\\nbenchmarked against conventional placement strategies, including random and\\ngreedy AQI-based methods, using multi-dimensional performance evaluation\\nmetrics such as AQI improvement, spatial coverage, population and traffic\\nimpact, and spatial entropy. Experimental results demonstrate that the RL-based\\napproach outperforms baseline methods by achieving a balanced and effective\\ndistribution of air purification infrastructure. Notably, the DRL framework\\nachieves an optimal trade-off between AQI reduction and high-coverage\\ndeployment, ensuring equitable environmental benefits across urban regions. The\\nfindings underscore the potential of AI-driven spatial optimization in\\nadvancing smart city initiatives and data-driven urban air quality management.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI,cs.LG\", \"published\": \"2025-05-01T17:19:48Z\"}"}
