{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16515v1\", \"title\": \"Federated Learning of Low-Rank One-Shot Image Detection Models in Edge\\n  Devices with Scalable Accuracy and Compute Complexity\", \"summary\": \"This paper introduces a novel federated learning framework termed LoRa-FL\\ndesigned for training low-rank one-shot image detection models deployed on edge\\ndevices. By incorporating low-rank adaptation techniques into one-shot\\ndetection architectures, our method significantly reduces both computational\\nand communication overhead while maintaining scalable accuracy. The proposed\\nframework leverages federated learning to collaboratively train lightweight\\nimage recognition models, enabling rapid adaptation and efficient deployment\\nacross heterogeneous, resource-constrained devices. Experimental evaluations on\\nthe MNIST and CIFAR10 benchmark datasets, both in an\\nindependent-and-identically-distributed (IID) and non-IID setting, demonstrate\\nthat our approach achieves competitive detection performance while\\nsignificantly reducing communication bandwidth and compute complexity. This\\nmakes it a promising solution for adaptively reducing the communication and\\ncompute power overheads, while not sacrificing model accuracy.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-23T08:40:44Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16532v1\", \"title\": \"Optimal linear response for Anosov diffeomorphisms\", \"summary\": \"It is well known that an Anosov diffeomorphism $T$ enjoys linear response of\\nits SRB measure with respect to infinitesimal perturbations $T_2$. For a fixed\\nobservation function $c$, we develop a theory to optimise the response of the\\nSRB-expectation of $c$. Our approach is based on the response of the transfer\\noperator on the anisotropic Banach spaces of Gou\\\\\\\"ezel-Liverani. For any\\nnon-constant $c$ we prove that the optimising perturbation $T_2$ exists and is\\nunique, and we provide explicit expressions for the Fourier coefficients of\\n$T_2$. We develop an efficient Fourier-based numerical scheme to approximate\\nthe optimal vector field $T_2$, along with a proof of convergence. The utility\\nof our approach is illustrated in two numerical examples, by localising SRB\\nmeasures with small, optimally selected, perturbations.\", \"main_category\": \"math.DS\", \"categories\": \"math.DS\", \"published\": \"2025-04-23T08:57:40Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16548v1\", \"title\": \"Exploring human-SAV interaction using large language models: The impact\\n  of psychological ownership and anthropomorphism on user experience\", \"summary\": \"There has been extensive prior work exploring how psychological factors such\\nas anthropomorphism affect the adoption of shared autonomous vehicles (SAVs).\\nHowever, limited research has been conducted on how prompt strategies in large\\nlanguage model (LLM)-powered SAV User Interfaces (UIs) affect users'\\nperceptions, experiences, and intentions to adopt such technology. In this\\nwork, we investigate how conversational UIs powered by LLMs drive these\\npsychological factors and psychological ownership, the sense of possession a\\nuser may come to feel towards an entity or object they may not legally own. We\\ndesigned four SAV UIs with varying levels of anthropomorphic characteristics\\nand psychological ownership triggers. Quantitative measures of psychological\\nownership, anthropomorphism, quality of service, disclosure tendency, sentiment\\nof SAV responses, and overall acceptance were collected after participants\\ninteracted with each SAV. Qualitative feedback was also gathered regarding the\\nexperience of psychological ownership during the interactions. The results\\nindicate that an SAV conversational UI designed to be more anthropomorphic and\\nto induce psychological ownership improved users' perceptions of the SAV's\\nhuman-like qualities and improved the sentiment of responses compared to a\\ncontrol condition. These findings provide practical guidance for designing\\nLLM-based conversational UIs that enhance user experience and adoption of SAVs.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC,cs.AI,cs.ET\", \"published\": \"2025-04-23T09:25:22Z\"}"}
