{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12607v1\", \"title\": \"Solving Constrained Combinatorial Optimization Problems with Variational\\n  Quantum Imaginary Time Evolution\", \"summary\": \"Solving combinatorial optimization problems using variational quantum\\nalgorithms (VQAs) has emerged as a promising research direction. Since the\\nintroduction of the Quantum Approximate Optimization Algorithm (QAOA), numerous\\nvariants have been proposed to enhance its performance. QAOA was later extended\\nto the Quantum Alternating Operator Ansatz (QAOA+), which generalizes the\\ninitial state, phase-separation operator, and mixer to address constrained\\nproblems without relying on the standard Quadratic Unconstrained Binary\\nOptimization (QUBO) formulation. However, QAOA+ often requires additional\\nancilla qubits and a large number of multi-controlled Toffoli gates to prepare\\nthe superposition of feasible states, resulting in deep circuits that are\\nchallenging for near-term quantum devices. Furthermore, VQAs are generally\\nhindered by issues such as barren plateaus and suboptimal local minima.\\nRecently, Quantum Imaginary Time Evolution (QITE), a ground-state preparation\\nalgorithm, has been explored as an alternative to QAOA and its variants. QITE\\nhas demonstrated improved performance in quantum chemistry problems and has\\nbeen applied to unconstrained combinatorial problems such as Max-Cut. In this\\nwork, we apply the variational form of QITE (VarQITE) to solve the Multiple\\nKnapsack Problem (MKP), a constrained problem, using a Max-Cut-tailored ansatz.\\nTo the best of our knowledge, this is the first attempt to address constrained\\noptimization using VarQITE. We show that VarQITE achieves significantly lower\\nmean optimality gaps compared to QAOA and other conventional methods. Moreover,\\nwe demonstrate that scaling the Hamiltonian coefficients can further reduce\\noptimization costs and accelerate convergence.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-17T03:09:37Z\"}"}
