{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15585v1\", \"title\": \"A Comprehensive Survey in LLM(-Agent) Full Stack Safety: Data, Training\\n  and Deployment\", \"summary\": \"The remarkable success of Large Language Models (LLMs) has illuminated a\\npromising pathway toward achieving Artificial General Intelligence for both\\nacademic and industrial communities, owing to their unprecedented performance\\nacross various applications. As LLMs continue to gain prominence in both\\nresearch and commercial domains, their security and safety implications have\\nbecome a growing concern, not only for researchers and corporations but also\\nfor every nation. Currently, existing surveys on LLM safety primarily focus on\\nspecific stages of the LLM lifecycle, e.g., deployment phase or fine-tuning\\nphase, lacking a comprehensive understanding of the entire \\\"lifechain\\\" of LLMs.\\nTo address this gap, this paper introduces, for the first time, the concept of\\n\\\"full-stack\\\" safety to systematically consider safety issues throughout the\\nentire process of LLM training, deployment, and eventual commercialization.\\nCompared to the off-the-shelf LLM safety surveys, our work demonstrates several\\ndistinctive advantages: (I) Comprehensive Perspective. We define the complete\\nLLM lifecycle as encompassing data preparation, pre-training, post-training,\\ndeployment and final commercialization. To our knowledge, this represents the\\nfirst safety survey to encompass the entire lifecycle of LLMs. (II) Extensive\\nLiterature Support. Our research is grounded in an exhaustive review of over\\n800+ papers, ensuring comprehensive coverage and systematic organization of\\nsecurity issues within a more holistic understanding. (III) Unique Insights.\\nThrough systematic literature analysis, we have developed reliable roadmaps and\\nperspectives for each chapter. Our work identifies promising research\\ndirections, including safety in data generation, alignment techniques, model\\nediting, and LLM-based agent systems. These insights provide valuable guidance\\nfor researchers pursuing future work in this field.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.AI,cs.CL,cs.LG\", \"published\": \"2025-04-22T05:02:49Z\"}"}
