{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16686v1\", \"title\": \"Wafer-Scale Characterization of Al/AlxOy/Al Josephson Junctions at Room\\n  Temperature\", \"summary\": \"Josephson junctions (JJs) are the key element of many devices operating at\\ncryogenic temperatures. Development of time-efficient wafer-scale JJ\\ncharacterization for process optimization and control of JJ fabrication is\\nessential. Such statistical characterization has to rely on room temperature\\ntechniques since cryogenic measurements typically used for JJs are too time\\nconsuming and unsuitable for wafer-scale characterization. In this work, we\\nshow that from room temperature capacitance and current-voltage measurements,\\nwith proper data analysis, we can independently obtain useful parameters of the\\nJJs on wafer-scale, like oxide thickness, tunnel coefficient, and interfacial\\ndefect densities. Moreover, based on detailed analysis of current vs voltage\\ncharacteristics, different charge transport mechanisms across the junctions can\\nbe distinguished. We exemplary demonstrate the worth of these methods by\\nstudying junctions fabricated on 200 mm wafers with an industrially scale-able\\nconcept based on subtractive processing using only CMOS compatible tools. From\\nthese studies, we find that our subtractive fabrication approach yields\\njunctions with quite homogeneous average oxide thickness across the full\\nwafers, with a spread of less then 3$\\\\,$%. The analysis also revealed a\\nvariation of the tunnel coefficient with oxide thickness, pointing to a\\nstoichiometry gradient across the junctions' oxide width. Moreover, we\\nestimated relatively low interfacial defect densities in the range of 70 -\\n5000$\\\\,$defects/cm$^2$ for our junctions and established that the density\\nincreased with decreasing oxide thickness, indicating that the wet etching\\nprocess applied in the JJs fabrication for oxide thickness control leads to\\nformation of interfacial trap state\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cond-mat.mtrl-sci,physics.app-ph\", \"published\": \"2025-04-23T13:15:01Z\"}"}
