{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20440v1\", \"title\": \"Consensus Recommendations for Hyperpolarized [1-13C]pyruvate MRI\\n  Multi-center Human Studies\", \"summary\": \"Magnetic resonance imaging of hyperpolarized (HP) [1-13C]pyruvate allows\\nin-vivo assessment of metabolism and has translated into human studies across\\ndiseases at 15 centers worldwide. Consensus on best practice for multi-center\\nstudies is required to develop clinical applications. This paper presents the\\nresults of a 2-round formal consensus building exercise carried out by experts\\nwith HP [1-13C]pyruvate human study experience. Twenty-nine participants from\\n13 sites brought together expertise in pharmacy methods, MR physics,\\ntranslational imaging, and data-analysis; with the goal of providing\\nrecommendations and best practice statements on conduct of multi-center human\\nstudies of HP [1-13C]pyruvate MRI.\\n  Overall, the group reached consensus on approximately two-thirds of 246\\nstatements in the questionnaire, covering 'HP 13C-Pyruvate Preparation', 'MRI\\nSystem Setup, Calibration, and Phantoms', 'Acquisition and Reconstruction', and\\n'Data Analysis and Quantification'.\\n  Consensus was present across categories, examples include that: (i) different\\nHP pyruvate preparation methods could be used in human studies, but that the\\nsame release criteria have to be followed; (ii) site qualification and quality\\nassurance must be performed with phantoms and that the same field strength must\\nbe used, but that the rest of the system setup and calibration methods could be\\ndetermined by individual sites; (iii) the same pulse sequence and\\nreconstruction methods were preferable, but the exact choice should be governed\\nby the anatomical target; (iv) normalized metabolite area-under-curve (AUC)\\nvalues and metabolite AUC were the preferred metabolism metrics.\\n  The work confirmed areas of consensus for multi-center study conduct and\\nidentified where further research is required to ascertain best practice.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph\", \"published\": \"2025-04-29T05:29:48Z\"}"}
