{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07892v1\", \"title\": \"Orbit design for mitigating interstellar scattering effects in\\n  Earth-space VLBI observations of Sgr A*\", \"summary\": \"(abridged) The black hole Sagittarius A* (Sgr A*) is a prime target for\\nnext-generation Earth-space very-long-baseline interferometry missions such as\\nthe Black Hole Explorer (BHEX), which aims to probe baselines of the order of\\n20 G$\\\\lambda$. At these baselines, Sgr A* observations will be affected by the\\ndiffractive scattering effects from the interstellar medium (ISM). Therefore,\\nwe study how different parameter choices for turbulence in the ISM affect\\nBHEX's observational capabilities to probe strong lensing features of Sgr A*.\\nBy using a simple geometric model of concentric Gaussian rings for Sgr A*'s\\nphoton ring signal and observing at 320 GHz, we find that the BHEX-ALMA\\nbaseline has the required sensitivity to observe Sgr A* for a broad range of\\nvalues of the power-law index of density fluctuations in the ISM and the inner\\nscale of turbulence. For other baselines with moderate sensitivities, a strong\\nneed for observations at shorter scales of $\\\\approx$ 13.5 G$\\\\lambda$ is\\nidentified. For this purpose, an orbit migration scheme is proposed. It is\\nmodeled using both chemical propulsion (CP)-based Hohmann transfers and\\nelectric propulsion (EP)-based orbit raising with the result that a CP-based\\ntransfer can be performed in a matter of hours, but with a significantly higher\\nfuel requirement as compared to EP, which however requires a transfer time of\\naround 6 weeks. The consequences of these orbits for probing Sgr A*'s spacetime\\nis studied by quantifying the spatial resolution, temporal resolution and the\\nangular sampling of the photon ring signal in the Fourier coverage of each of\\nthese orbits. We show that higher orbits isolate spacetime features while\\nsacrificing both, signal lost to scattering and temporal resolution, but gain\\ngreater access to the morphology of the photon ring.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.IM\", \"published\": \"2025-04-10T16:06:14Z\"}"}
