{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10872v1\", \"title\": \"Design and Fabrication of a lightweight three-lens corrector system for\\n  the 2.34-m Vainu Bappu Telescope\", \"summary\": \"The Vainu Bappu Telescope (VBT) is a 2.34-m reflector, primarily supported\\non-axis field of view, offering high-resolution and low-to-medium resolution\\nspectroscopic observations in its prime and Cassegrain configurations. This\\nstudy presents the design and fabrication of a compact, lightweight,\\nthree-element wide-field corrector (WFC) utilizing three spherical lenses to\\ncover a polychromatic wavelength range over a 30$'$ FoV at prime focus. The WFC\\ndesign was optimized using ZEMAX, ensuring precision in aberrations,\\ntolerances, and atmospheric dispersion. The fabricated lenses met stringent\\ntolerances, with a $\\\\pm$1 mm deviation in radius of curvature and 2 mm\\ndeviation in center thickness. A mechanical mount was developed to integrate\\nall the WFC lenses, and wavefront error testing for the WFC system was\\nperformed using ZYGO interferometry, yielding a Wavefront Error of 0.05\\n$\\\\lambda$. Laboratory performance tests were designed and conducted using a\\ndedicated setup with achromatic lenses and 100 $\\\\mu m$ fiber-coupled\\npolychromatic light source showed a deviation of 0.1 pixel on-axis and 0.5\\npixel at the extreme off-axis field compared to the ZEMAX design, demonstrating\\nthat the optical performance of WFC is with minimal aberrations across the\\nentire FoV. The successful integration of the WFC at the VBT prime focus will\\nincrease the FoV, enabling the multi-fiber, multi-spectrograph setup in 30\\narcmin field that will facilitate both OMR and Echelle spectrograph to be used\\non the same night along with the addition of new multi-object spectrograph and\\nan integral field unit instrument. This will mark a significant upgrade for the\\nVBT, broadening its research potential, and expanding its observational\\nversatility.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM\", \"published\": \"2025-04-15T05:03:00Z\"}"}
