{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11755v1\", \"title\": \"Asymmetric Cross-Correlation functions with delays in Sco X-1: Evidence\\n  of possible Jet triggering\", \"summary\": \"The formation and origin of Jets from Z sources are not well understood,\\nalthough an X-ray-radio correlation has been observed. We analyzed a few\\nobservations of Sco X-1 using the Rossi X-ray Timing Experiment Satellite. Out\\nof the 17 observations, 5 showed lags of a few 10s of seconds with an asymmetry\\nin the CCF between the soft and hard bands in their cross-correlation function\\n(CCF) analysis. Interestingly, during these observations, a ballistic-type\\nradio jet of Ultra-relativistic(UR) nature was reported. The observed lags and\\nassociated cross-correlation coefficients were validated using simulations. The\\nrest of the 12 observations' CCFs were symmetric, and their associated Power\\nDensity Spectrum (PDS) displayed Normal Branch(NBO)/Normal + Horizontal Branch\\nOscillations(NBO+HBO). The X-ray spectral study of 2 obs. where radio core\\nemission was seen with abrupt variation in both PDS and CCF showed a black-body\\nflux variation of 10-20%, but no spectral parameter varied. We suggest that the\\nballistic jet caused a disturbance in the inner accretion region, viz., the\\nBoundary Layer plausibly along with the Corona, that caused the lags observed\\nin the CCFs along with the absence of any oscillatory features in the PDS\\ntracing only a flat-topped noise. Whereas the regions with no lags showed a\\npersistent NBO/NBO+HBO feature, suggesting a steady accretion flow. Although\\nthe UR jet can't be related to NBO or HBO, we suggest it could be related to\\nthe phenomena that cause NBO since the majority of PDSs displayed NBO. We also\\nconstrain the inner accretion region size to 20-30 km, which is responsible for\\nthe accretion ejecta in Sco X-1.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-16T04:18:21Z\"}"}
