{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17341v1\", \"title\": \"Optimal scheduling of energy and mass flows based on networked\\n  multi-carrier hubs formulation: a general framework\", \"summary\": \"Due to increased energy demand and environmental concerns such as greenhouse\\ngas emissions and natural resources depletion, optimizing energy and raw\\nmaterials usage has recently drawn much attention. Achieving more synergy\\nbetween different energy sectors and manufacturing processes could lead to\\nsubstantial improvements. Energy hubs are already well-known solutions for\\nstudying multi-carrier energy systems. In the present study, a multi-carrier\\nhub is defined as a geographic area where different processes take place to\\nconvert energy and material flows possibly consumed locally, stored, or\\nexported. Hub boundaries correspond to an area small enough to neglect losses\\nwhen energy and materials flows are exchanged between the processes. A general\\nformulation is introduced to model such a hub. This formalism encompasses all\\nthe possible configurations without limitations or preconceptions regarding\\nused carriers or processes' architecture. For this purpose, a new hub\\nrepresentation is proposed that allows optimization while considering all\\npossible arrangements (parallel, serial, or a combination of them). It is\\nimplemented in a framework that allows the creation of several multi-carrier\\nhubs and connecting some of them to exchange flows through dedicated networks.\\nThe formalism is based on linear programming (LP). The features of the\\ndeveloped framework are illustrated by a case study consisting of a network\\nmade of three hubs and considering heat, electricity, water, and hydrogen\\nflows.The study aims to optimally schedule processes usage and materials and\\nenergy storage to minimize the cost of imported resources. The study is done in\\na short-term period. It shows the benefits of synergy between the different\\nprocesses in the hub.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC\", \"published\": \"2025-04-24T07:59:10Z\"}"}
