{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16040v1\", \"title\": \"Linking the KM3-230213A Neutrino Event to Dark Matter Decay and\\n  Gravitational Waves Signals\", \"summary\": \"The KM3NeT collaboration recently reported the detection of an\\nultra-high-energy neutrino event, dubbed KM3-230213A. This is the first\\nobserved neutrino event with energy of the order of $\\\\mathcal{O}(100)$PeV, the\\norigin of which remains unclear. We interprete this high energy neutrino event\\nresults from the Dirac fermion dark matter (DM) $\\\\chi$ decay through the\\nright-handed (RH) neutrino portal assuming the Type-I seesaw mechanism for\\nneutrino masses and mixings. Fruthermore, dark matter $\\\\chi$ is assumed to\\ncharged under $U(1)_X$ dark gauge symmetry, which is sponetaneously broken by\\nthe vacuum expectation value of the dark Higgs $\\\\Phi$. In this scenario, the DM\\ncan decay into a pair of Standard Model (SM) particles for $v_\\\\Phi \\\\gg m_\\\\chi$,\\nwhich we assume is the case. If the DM mass is around $440$ PeV with a lifetime\\n$5\\\\times 10^{29}$ sec, it can account for the KM3-230213A event. However, such\\nheavy DM cannot be produced through the thermal freeze-out mechanism due to\\noverproduction and violation of unitarity bounds. We focus on the UV freeze-in\\nproduction of DM through a dimension-5 operator, which helps in producing the\\nDM dominantly in the early Universe. We have also found a set of allowed\\nparameter values that can correctly account for the DM relic density and decay\\nlifetime required to explain the KM3NeT signal. Moreover, we have generated the\\nneutrino spectra from the two-body decay using the HDMSpectra package, which\\nrequires the dark Higgs vacuum expectations value (VEV) to be much larger than\\nthe DM mass. Finally, the large value of the dark Higgs field VEV opens up the\\npossibility of generating GW spectra from cosmic strings. We have found a\\nreasonable set of parameter values that can address the KM3NeT signal, yield\\nthe correct value of the DM relic density through freeze-in mechanism, and\\nallow for possible detection of GW at future detectors.\", \"main_category\": \"hep-ph\", \"categories\": \"hep-ph,astro-ph.HE\", \"published\": \"2025-04-22T17:07:39Z\"}"}
