{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06254v1\", \"title\": \"Fixing non-blocking data structures for better compatibility with memory\\n  reclamation schemes\", \"summary\": \"We present a new technique, Safe Concurrent Optimistic Traversals (SCOT), to\\naddress a well-known problem with Hazard Pointers (HP) related to optimistic\\ntraversals. Unlike Epoch-Based Reclamation (EBR), HP enables strong robustness\\nproperties but lacks support for some data structures such as Harris' original\\nlist and Natarajan-Mittal tree, which can slow down operations substantially\\n(e.g., when replacing with Harris-Michael list) or make correct implementations\\nimpossible altogether (e.g., Natarajan-Mittal tree).\\n  Recent works propose replacing HP with another robust memory reclamation\\nschemes that support optimistic traversals such as HP++. However, HP++ is\\ngenerally slower than HP, has undesirable applicability trade-offs, and more\\ncomplex implementation, among other issues. We propose a different method which\\nkeeps HP intact but instead relies on data structure adaptations. Moreover, our\\nmethod applies to other recent (and faster) robust reclamation schemes such as\\nHazard Eras (HE) and Interval-Based Reclamation (IBR), which are HP-like and\\nhave similar problems related to optimistic traversals.\\n  We implement two fundamentally different data structures: Harris' list and\\nNatarajan-Mittal tree. Our method enables their first correct implementations\\nwith optimistic traversals with HP and IBR. Our method is also directly\\napplicable to other data structures which extend Harris' list, e.g., skip lists\\nand hash maps. We observe similar performance benefits of Harris' original list\\n(vs. Harris-Michael list) that were previously only available to EBR users. As\\nwe discuss in the paper, our Natarajan-Mittal tree is the first bug-free\\nimplementation for HP and IBR; it achieves very high throughput, comparable to\\nthat of EBR.\", \"main_category\": \"cs.DC\", \"categories\": \"cs.DC\", \"published\": \"2025-04-08T17:57:14Z\"}"}
