{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05045v1\", \"title\": \"Statistical CSI Acquisition for Multi-frequency Massive MIMO Systems\", \"summary\": \"Multi-frequency massive multi-input multi-output (MIMO) communication is a\\npromising strategy for both 5G and future 6G systems, ensuring reliable\\ntransmission while enhancing frequency resource utilization. Statistical\\nchannel state information (CSI) has been widely adopted in multi-frequency\\nmassive MIMO transmissions to reduce overhead and improve transmission\\nperformance. In this paper, we propose efficient and accurate methods for\\nobtaining statistical CSI in multi-frequency massive MIMO systems. First, we\\nintroduce a multi-frequency massive MIMO channel model and analyze the mapping\\nrelationship between two types of statistical CSI, namely the angular power\\nspectrum (APS) and the spatial covariance matrix, along with their correlation\\nacross different frequency bands. Next, we propose an autoregressive (AR)\\nmethod to predict the spatial covariance matrix of any frequency band based on\\nthat of another frequency band. Furthermore, we emphasize that channels across\\ndifferent frequency bands share similar APS characteristics. Leveraging the\\nmaximum entropy (ME) criterion, we develop a low-complexity algorithm for\\nhigh-resolution APS estimation. Simulation results validate the effectiveness\\nof the AR-based covariance prediction method and demonstrate the\\nhigh-resolution estimation capability of the ME-based approach. Furthermore, we\\ndemonstrate the effectiveness of multi-frequency cooperative transmission by\\napplying the proposed methods to obtain statistical CSI from low-frequency\\nbands and utilizing it for high-frequency channel transmission. This approach\\nsignificantly enhances high-frequency transmission performance while\\neffectively reducing system overhead.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP,cs.IT,math.IT\", \"published\": \"2025-05-08T08:30:25Z\"}"}
