{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21854v1\", \"title\": \"SPARO: Surface-code Pauli-based Architectural Resource Optimization for\\n  Fault-tolerant Quantum Computing\", \"summary\": \"Surface codes represent a leading approach for quantum error correction\\n(QEC), offering a path towards universal fault-tolerant quantum computing\\n(FTQC). However, efficiently implementing algorithms, particularly using\\nPauli-based computation (PBC) with lattice surgery, necessitates careful\\nresource optimization. Prior work often employs static layouts and simplified\\nerror models. These typically fail to capture the full costs and dynamic nature\\nof active computation, leading to resource bottlenecks and suboptimal\\narchitectural designs. To address this, we introduce SPARO. SPARO features a\\ncomprehensive logical error model based on a large corpus of numerical\\nsimulations encompassing active Pauli-based computation (PBC)\\noperations-including Pauli product measurements (PPMs), idling qubits, and\\npatch rotations. Our numerical models are integrated within an end-to-end\\ncompilation pipeline. SPARO analyzes algorithm-specific bottlenecks arising\\nfrom constraints such as limited routing areas or magic-state factory\\nthroughput. SPARO then dynamically allocates available hardware resources,\\nbalancing compute, routing, and magic-state distillation, to minimize\\nspace-time overhead and logical error rates for specific workloads. Our\\nsimulations demonstrate that SPARO effectively identifies critical resource\\ntrade-offs. When evaluated on benchmark circuits, SPARO identifies resource\\nconfigurations achieving up to 41.96% logical error rate reductions for\\n433-qubit ADDER circuits when compared to state-of-the-art static layouts using\\nan identical total resource budget. This dynamic approach enables effective\\nco-optimization of PBC execution and surface-code architectures, significantly\\nimproving overall resource efficiency. SPARO will be open sourced.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-30T17:59:53Z\"}"}
