{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07728v1\", \"title\": \"The Scaling Behaviors in Achieving High Reliability via\\n  Chance-Constrained Optimization\", \"summary\": \"We study the problem of resource provisioning under stringent reliability or\\nservice level requirements, which arise in applications such as power\\ndistribution, emergency response, cloud server provisioning, and regulatory\\nrisk management. With chance-constrained optimization serving as a natural\\nstarting point for modeling this class of problems, our primary contribution is\\nto characterize how the optimal costs and decisions scale for a generic joint\\nchance-constrained model as the target probability of satisfying the\\nservice/reliability constraints approaches its maximal level. Beyond providing\\ninsights into the behavior of optimal solutions, our scaling framework has\\nthree key algorithmic implications. First, in distributionally robust\\noptimization (DRO) modeling of chance constraints, we show that widely used\\napproaches based on KL-divergences, Wasserstein distances, and moments heavily\\ndistort the scaling properties of optimal decisions, leading to exponentially\\nhigher costs. In contrast, incorporating marginal distributions or using\\nappropriately chosen f-divergence balls preserves the correct scaling, ensuring\\ndecisions remain conservative by at most a constant or logarithmic factor.\\nSecond, we leverage the scaling framework to quantify the conservativeness of\\ncommon inner approximations and propose a simple line search to refine their\\nsolutions, yielding near-optimal decisions. Finally, given N data samples, we\\ndemonstrate how the scaling framework enables the estimation of approximately\\nPareto-optimal decisions with constraint violation probabilities significantly\\nsmaller than the Omega(1/N)-barrier that arises in the absence of parametric\\nassumptions\", \"main_category\": \"math.OC\", \"categories\": \"math.OC,math.PR,q-fin.RM\", \"published\": \"2025-04-10T13:21:49Z\"}"}
