{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19716v1\", \"title\": \"QuickGrasp: Lightweight Antipodal Grasp Planning with Point Clouds\", \"summary\": \"Grasping has been a long-standing challenge in facilitating the final\\ninterface between a robot and the environment. As environments and tasks become\\ncomplicated, the need to embed higher intelligence to infer from the\\nsurroundings and act on them has become necessary. Although most methods\\nutilize techniques to estimate grasp pose by treating the problem via pure\\nsampling-based approaches in the six-degree-of-freedom space or as a learning\\nproblem, they usually fail in real-life settings owing to poor generalization\\nacross domains. In addition, the time taken to generate the grasp plan and the\\nlack of repeatability, owing to sampling inefficiency and the probabilistic\\nnature of existing grasp planning approaches, severely limits their application\\nin real-world tasks. This paper presents a lightweight analytical approach\\ntowards robotic grasp planning, particularly antipodal grasps, with little to\\nno sampling in the six-degree-of-freedom space. The proposed grasp planning\\nalgorithm is formulated as an optimization problem towards estimating grasp\\npoints on the object surface instead of directly estimating the end-effector\\npose. To this extent, a soft-region-growing algorithm is presented for\\neffective plane segmentation, even in the case of curved surfaces. An\\noptimization-based quality metric is then used for the evaluation of grasp\\npoints to ensure indirect force closure. The proposed grasp framework is\\ncompared with the existing state-of-the-art grasp planning approach, Grasp pose\\ndetection (GPD), as a baseline over multiple simulated objects. The\\neffectiveness of the proposed approach in comparison to GPD is also evaluated\\nin a real-world setting using image and point-cloud data, with the planned\\ngrasps being executed using a ROBOTIQ gripper and UR5 manipulator.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-28T12:09:10Z\"}"}
