{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16059v1\", \"title\": \"Sub-Horizon Amplification of Curvature Perturbations: A New Route to\\n  Primordial Black Holes and Gravitational Waves\", \"summary\": \"The enhanced primordial scalar power spectrum is a widely studied mechanism\\nfor generating primordial gravitational waves (PGWs), also referred to as\\nscalar-induced gravitational waves (SIGWs). This process also plays a pivotal\\nrole in facilitating the formation of primordial black holes (PBHs).\\nTraditionally, the ultra slow-roll (USR) mechanism has been the predominant\\napproach used in the early universe. In this framework, the second slow-roll\\nparameter $\\\\epsilon_2$, is typically set to $-6$ or lower for a brief period --\\nmarking a significant departure from the standard slow-roll condition where\\n$\\\\epsilon_2 \\\\simeq 0$. Such conditions often emerge in models with inflection\\npoints or localized features, such as bumps in the potential. In this paper, we\\nchallenge the conventional assumption that $\\\\epsilon_2 \\\\lesssim -6$ is a\\nprerequisite for substantial amplification of the scalar power spectrum. We\\ndemonstrate that any negative value of the second slow-roll parameter can\\nindeed enhance the scalar power spectrum through sub-horizon growth,\\nestablishing this as a necessary and sufficient condition for amplification.\\nConsequently, this mechanism facilitates the generation of both PGWs and PBHs.\\nTo illustrate this, we examine a standard scenario where a brief USR phase is\\nembedded between two slow-roll (SR) phases. By systematically varying\\n$\\\\epsilon_{2}$ values from $-1$ to $-10$ in the USR region, we investigate the\\namplification of the power spectrum and its implications for PGWs and PBHs\\nproduction, particularly in the context of ongoing and future cosmological\\nmissions.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,gr-qc,hep-ph,hep-th\", \"published\": \"2025-04-22T17:36:01Z\"}"}
