{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19753v1\", \"title\": \"A New Decision- Making Method Based on Shannon Entropy Analysis\", \"summary\": \"Because the appropriate combination of existing elements and establishing\\ncoordination between them as a consequence of making the right decision to\\naccomplish the intended objective is achieved, management is now one of the\\nmain pillars of community management. Decisions are made in the majority of\\nsituations when the decision maker is pleased with the conclusion based on\\nnumerous factors. Several criteria are used instead of one measure of\\noptimality in multi-criteria decision making, which has been studied by\\nnumerous academics in recent decades. The importance of the indicators in this\\ntype of decision making is clearly not equal, and it is necessary to understand\\nthe coefficient of importance or weight of each of these indicators in decision\\nmaking. In this work, a novel technique termed scattering axis Dispersion-based\\nWeighting Method (D.W.M) is suggested to address weighing issues, with the\\nclosest method in terms of computational logic being their entropy. After\\nconstructing the option's criterion matrix, the mean, standard deviation, and\\ncoefficient of variation are determined, and then the weight of each criterion\\nis calculated, according to the proposed D.W.M technique. Several numerical\\nexamples have been utilized to demonstrate and assess the suggested technique.\\nIn addition, the Shannon entropy approach, which is a commonly used weighting\\nmethod, was chosen to compare the findings. The statistical results demonstrate\\nthat these two weighing techniques have a strong connection. In compared to the\\nShannon entropy technique, the suggested method has the following advantages:\\nMinimal computational burden The data does not need to be normalized. Its use\\nin the case of negative data.\", \"main_category\": \"math.MG\", \"categories\": \"math.MG\", \"published\": \"2025-04-28T12:51:52Z\"}"}
