{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20740v1\", \"title\": \"Formal and Empirical Study of Metadata-Based Profiling for Resource\\n  Management in the Computing Continuum\", \"summary\": \"We present and formalize a general approach for profiling workload by\\nleveraging only a priori available static metadata to supply appropriate\\nresource needs. Understanding the requirements and characteristics of a\\nworkload's runtime is essential. Profiles are essential for the platform (or\\ninfrastructure) provider because they want to ensure that Service Level\\nAgreements and their objectives (SLOs) are fulfilled and, at the same time,\\navoid allocating too many resources to the workload. When the infrastructure to\\nmanage is the computing continuum (i.e., from IoT to Edge to Cloud nodes),\\nthere is a big problem of placement and tradeoff or distribution and\\nperformance. Still, existing techniques either rely on static predictions or\\nruntime profiling, which are proven to deliver poor performance in runtime\\nenvironments or require laborious mechanisms to produce fast and reliable\\nevaluations. We want to propose a new approach for it. Our profile combines the\\ninformation from past execution traces with the related workload metadata,\\nequipping an infrastructure orchestrator with a fast and precise association of\\nnewly submitted workloads. We differentiate from previous works because we\\nextract the profile group metadata saliency from the groups generated by\\ngrouping similar runtime behavior. We first formalize its functioning and its\\nmain components. Subsequently, we implement and empirically analyze our\\nproposed technique on two public data sources: Alibaba cloud machine learning\\nworkloads and Google cluster data. Despite relying on partially anonymized or\\nobscured information, the approach provides accurate estimates of workload\\nruntime behavior in real-time.\", \"main_category\": \"cs.DC\", \"categories\": \"cs.DC\", \"published\": \"2025-04-29T13:22:03Z\"}"}
