{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13063v1\", \"title\": \"An exact approach for the multi-depot electric vehicle scheduling\\n  problem\", \"summary\": \"The \\\"avoid - shift - improve\\\" framework and the European Clean Vehicles\\nDirective set the path for improving the efficiency and ultimately\\ndecarbonizing the transport sector. While electric buses have already been\\nadopted in several cities, regional bus lines may pose additional challenges\\ndue to the potentially longer distances they have to travel. In this work, we\\nmodel and solve the electric bus scheduling problem, lexicographically\\nminimizing the size of the bus fleet, the number of charging stops, and the\\ntotal energy consumed, to provide decision support for bus operators planning\\nto replace their diesel-powered fleet with zero emission vehicles. We propose a\\ngraph representation which allows partial charging without explicitly relying\\non time variables and derive 3-index and 2-index mixed-integer linear\\nprogramming formulations for the multi-depot electric vehicle scheduling\\nproblem. While the 3-index model can be solved by an off-the-shelf solver\\ndirectly, the 2-index model relies on an exponential number of constraints to\\nensure the correct depot pairing. These are separated in a cutting plane\\nfashion. We propose a set of instances with up to 80 service trips to compare\\nthe two approaches, showing that, with a small number of depots, the compact\\n3-index model performs very well. However, as the number of depots increases\\nthe developed branch-and-cut algorithm proves to be of value. These findings\\nnot only offer algorithmic insights but the developed approaches also provide\\nactionable guidance for transit agencies and operators, allowing to quantify\\ntrade-offs between fleet size, energy efficiency, and infrastructure needs\\nunder realistic operational conditions.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC,cs.DM\", \"published\": \"2025-04-17T16:18:56Z\"}"}
