{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15601v1\", \"title\": \"[PK2008] HalphaJ115927 and IGR J14091-6108: Two new intermediate polars\\n  above the period gap\", \"summary\": \"This study presents a detailed timing analyses of two cataclysmic variables\\n(CVs), [PK2008] HalphaJ115927 and IGR J14091-610, utilizing the optical data\\nfrom the Transiting Exoplanet Survey Satellite (TESS). Periods of 7.20$\\\\pm$0.02\\nh, 1161.49$\\\\pm$0.14 s, and 1215.99$\\\\pm$0.15 s are presented for [PK2008]\\nHalphaJ115927, and are interpreted as the probable orbital, spin, and beat\\nperiods of the system, respectively. The presence of multiple periodic\\nvariations suggests that it likely belongs to the intermediate polar (IP)\\ncategory of magnetic CVs. Interestingly, [PK2008] HalphaJ115927 exhibits a\\nunique and strong periodic modulation at 5.66$\\\\pm$0.29 d, which may result from\\nthe precession of an accretion disc, similar to the IP TV Col. The detection of\\na spin signal of 576.63$\\\\pm$0.03 s and inferred orbital signal of $\\\\sim$ 15.84\\nh supports the classification of IGR J14091-610 as an IP. The identification of\\nsuch a long orbital period adds a new example to the limited population of\\nlong-period IPs. The observed dominant signal at the second harmonic of the\\norbital frequency also suggests ellipsoidal modulation of the secondary in this\\nsystem. The observed double-peaked spin pulse profile in [PK2008] HalphaJ115927\\nlikely results from two-pole accretion, where both poles contribute to the spin\\nmodulation, and their geometry allows equal visibility of both accreting poles.\\nIn contrast, IGR J14091-610 exhibits a single-peaked sinusoidal like spin\\npulse, attributed to the changing visibility of the accretion curtains due to a\\nrelatively low dipole inclination. The present observations indicate that\\naccretion in both systems occurs predominantly through a disc.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-22T05:42:12Z\"}"}
