{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19965v1\", \"title\": \"Feelbert: A Feedback Linearization-based Embedded Real-Time Quadrupedal\\n  Locomotion Framework\", \"summary\": \"Quadruped robots have become quite popular for their ability to adapt their\\nlocomotion to generic uneven terrains. For this reason, over time, several\\nframeworks for quadrupedal locomotion have been proposed, but with little\\nattention to ensuring a predictable timing behavior of the controller.\\n  To address this issue, this work presents \\\\NAME, a modular control framework\\nfor quadrupedal locomotion suitable for execution on an embedded system under\\nhard real-time execution constraints. It leverages the feedback linearization\\ncontrol technique to obtain a closed-form control law for the body, valid for\\nall configurations of the robot. The control law was derived after defining an\\nappropriate rigid body model that uses the accelerations of the feet as control\\nvariables, instead of the estimated contact forces. This work also provides a\\nnovel algorithm to compute footholds and gait temporal parameters using the\\nconcept of imaginary wheels, and a heuristic algorithm to select the best gait\\nschedule for the current velocity commands.\\n  The proposed framework is developed entirely in C++, with no dependencies on\\nthird-party libraries and no dynamic memory allocation, to ensure\\npredictability and real-time performance. Its implementation allows \\\\NAME\\\\ to\\nbe both compiled and executed on an embedded system for critical applications,\\nas well as integrated into larger systems such as Robot Operating System 2 (ROS\\n2). For this reason, \\\\NAME\\\\ has been tested in both scenarios, demonstrating\\nsatisfactory results both in terms of reference tracking and temporal\\npredictability, whether integrated into ROS 2 or compiled as a standalone\\napplication on a Raspberry Pi 5.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.SY,eess.SY\", \"published\": \"2025-04-28T16:36:28Z\"}"}
