{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07571v1\", \"title\": \"The birth of Be star disks I. From localized ejection to circularization\", \"summary\": \"Classical Be stars are well known to eject mass, but the details governing\\nthe initial distribution and evolution of this matter into a disk are poorly\\nconstrained by observations. By combining high-cadence spectroscopy with\\ncontemporaneous space photometry from TESS, we have sampled about 30 mass\\nejection events in 13 Be stars. Our goal is to constrain the geometrical and\\nkinematic properties of the ejecta, facilitating the investigation into the\\ninitial conditions and evolution, and understanding its interactions with\\npreexisting material. The photometric variability is analyzed together with\\nmeasurements of the rapidly changing emission features to identify the onset of\\noutburst events and obtain information about the geometry of the ejecta and its\\nevolution. All Be stars observed with sufficiently high cadence exhibit rapid\\noscillations of line asymmetry with a single frequency in the days following\\nthe start of the event. The emission asymmetry cycles break down after roughly\\n5 - 10 cycles, with the emission line profile converging toward approximate\\nsymmetry. In photometry, several frequencies typically emerge at relatively\\nhigh amplitude at some point during the mass ejection process. In all observed\\ncases, freshly ejected material was initially within a narrow azimuthal range,\\nindicating it was launched from a localized region on the star. The material\\norbits the star with a frequency consistent with the near-surface Keplerian\\norbital frequency. This material circularizes into a disk configuration after\\nseveral orbital timescales. This is true whether or not there was a preexisting\\ndisk. We find no evidence for precursor phases prior to the ejection of mass in\\nour sample. The several photometric frequencies that emerge during outburst are\\nat least partially stellar in origin. (Abstract abridged)\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-10T09:13:41Z\"}"}
