{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13029v1\", \"title\": \"Three-dimensional canonical quantum plasmonics for finite media: exact\\n  solution in terms of the classical Green tensor\", \"summary\": \"This article presents a comprehensive three-dimensional canonical\\nquantization to treat quantum plasmonics for finite metallic or dielectric\\nmedia of arbitrary shape. We use a microscopic model for the dissipative and\\ndispersive medium coupled with the electromagnetic field, which is justified by\\nthe fact that if one integrates the degrees of freedom of the medium, one\\nobtains the macroscopic Maxwell equations. Its quantization features a\\nHamiltonian formulation having the form of two infinite harmonic oscillators\\ncharacterized by a double continuum. The diagonalized Hamiltonian is quantized\\nby the correspondence principle, introducing creation-annihilation operators in\\na bosonic Fock space. The diagonal quantum Hamiltonian is the sum of two terms\\ncorresponding to the two continua. The physical observables, like, e.g., the\\nelectric field, are also the sum of two terms corresponding to the two\\ncontinua, one of which had been omitted in the literature geared for an\\ninfinite bulk medium. In a second step, we show that the electric field\\noperator can by written as linear combinations of the creation-annihilation\\noperators with coefficients that satisfy integral equations of Fredholm type.\\nWe show that the solution of these equations can be expressed in terms of the\\nclassical Green tensor of the medium satisfying the Sommerfeld radiation\\ncondition. Finally, we consider the Purcell effect for the spontaneous emission\\nof an atom close to the medium. We show that through an exact compensation of\\nsome terms, the Purcell factor for the system with the double continuum is\\nproportional to the imaginary part of the Green tensor, which defines the local\\ndensity of states. This result has the same form as the one obtained in the\\nliterature for bulk systems that involve a single continuum and a small\\ndissipative background extending to infinity, and can be seen as a\\njustification of this approach.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-17T15:39:29Z\"}"}
