{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20886v1\", \"title\": \"Mapping a Movement: Exploring a Proposed Police Training Facility in\\n  Atlanta and the Stop Cop City Movement through Online Maps\", \"summary\": \"In 2021, the City of Atlanta and Atlanta Police Foundation launched plans to\\nbuild a large police training facility in the South River Forest in\\nunincorporated DeKalb County, GA. Residents of Atlanta and DeKalb County,\\nenvironmental activists, police and prison abolitionists, and other activists\\nand concerned individuals formed the movement in opposition to the facility,\\nknown as the Stop Cop City / Defend the Atlanta Forest movement. Social media\\nand digital maps became common tools for communicating information about the\\nfacility and the movement. Here, we examine online maps about the facility and\\nthe opposition movement, originating from grassroots organizations, the City of\\nAtlanta, news media outlets, the Atlanta Police Foundation, and individuals. We\\ngather and examine 32 publicly available maps collected through the Google\\nSearch API, Twitter (now X), Instagram and reddit. Using a framework of\\ncritical cartography, we conduct a content analysis of these maps to identify\\nthe mapping technologies and techniques (data, cartographic elements, styles)\\nused by different stakeholders and roles that maps and mapping technologies can\\nplay in social movements. We examine the extent to which these maps provide\\ndata to confirm or contradict concerns raised by grassroots organizations and\\nlocal residents about the facility. We find that stakeholders and mapmakers use\\ngeospatial tools in different ways and likely have varied access to mapping\\ntechnologies. We argue that documenting the use of maps to communicate\\ninformation about a contentious project can help enumerate community positions\\nand perspectives, and we advocate for accessible mapmaking tools. We conclude\\nby discussing the implications of accessibility of mapping technology and\\nposting maps to social media, and share example map images that extend the\\ngeographic information systems (GIS) techniques seen in the retrieved maps.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-29T16:01:51Z\"}"}
