{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01489v1\", \"title\": \"Test-Time Alignment for Tracking User Interest Shifts in Sequential\\n  Recommendation\", \"summary\": \"Sequential recommendation is essential in modern recommender systems, aiming\\nto predict the next item a user may interact with based on their historical\\nbehaviors. However, real-world scenarios are often dynamic and subject to\\nshifts in user interests. Conventional sequential recommendation models are\\ntypically trained on static historical data, limiting their ability to adapt to\\nsuch shifts and resulting in significant performance degradation during\\ntesting. Recently, Test-Time Training (TTT) has emerged as a promising\\nparadigm, enabling pre-trained models to dynamically adapt to test data by\\nleveraging unlabeled examples during testing. However, applying TTT to\\neffectively track and address user interest shifts in recommender systems\\nremains an open and challenging problem. Key challenges include how to capture\\ntemporal information effectively and explicitly identifying shifts in user\\ninterests during the testing phase. To address these issues, we propose\\nT$^2$ARec, a novel model leveraging state space model for TTT by introducing\\ntwo Test-Time Alignment modules tailored for sequential recommendation,\\neffectively capturing the distribution shifts in user interest patterns over\\ntime. Specifically, T$^2$ARec aligns absolute time intervals with\\nmodel-adaptive learning intervals to capture temporal dynamics and introduce an\\ninterest state alignment mechanism to effectively and explicitly identify the\\nuser interest shifts with theoretical guarantees. These two alignment modules\\nenable efficient and incremental updates to model parameters in a\\nself-supervised manner during testing, enhancing predictions for online\\nrecommendation. Extensive evaluations on three benchmark datasets demonstrate\\nthat T$^2$ARec achieves state-of-the-art performance and robustly mitigates the\\nchallenges posed by user interest shifts.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-04-02T08:42:30Z\"}"}
