{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21738v1\", \"title\": \"Galaxy Morphologies at Cosmic Noon with JWST : A Foundation for\\n  Exploring Gas Transport with Bars and Spiral Arms\", \"summary\": \"How radial flows shape galaxy structure and evolution remains an open\\nquestion. Internal drivers of such flows, such as bars and spiral arms, known\\nto mediate gas flows in the local Universe, are now observable at high redshift\\nthanks to JWST's unobscured view. We investigate the morphology of massive\\nstar-forming galaxies at 0.8 < z < 1.3 and 2.0 < z < 2.5, epochs marking the\\npeak and decline of cosmic star formation, both well-covered by kinematic\\nsurveys. Using JWST/NIRCam imaging, we visually classify 1,451 galaxies,\\nidentify non-axisymmetric features, count the number of spiral arms, analyze\\nnon-parametric morphological indicators and study the dynamical support of the\\nsample covered by kinematics (10% of the sample) as measured via v/{\\\\sigma}.\\nDisk galaxies dominate the sample (82%), with 48% exhibiting spiral structure\\nand 11% hosting bars. Both fractions decline with redshift, consistent with\\nprevious studies. The proportion of two- and three-armed spirals remains\\nlargely unchanged across redshift, with roughly two-thirds showing two arms and\\none-third showing three arms in both bins. Notably, we find a higher incidence\\nof three-armed spirals than reported in the local Universe, suggesting a mild\\nevolution in spiral arm multiplicity. Non-parametric morphological metrics\\nstrongly correlate with stellar mass but show no significant redshift\\nevolution. Finally, kinematic analysis reveals a strong correlation between\\ndisk morphology and rotational support, with most disks exhibiting v/{\\\\sigma} >\\n3 and median values of v/{\\\\sigma} > 7 for spirals and v/{\\\\sigma} > 5 for barred\\ngalaxies. This study establishes a population-wide framework for linking galaxy\\nmorphology and dynamics at cosmic noon, providing a key reference for future\\nstudies on the role of detailed structural features in galaxy evolution.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-03-27T17:50:32Z\"}"}
