{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11276v1\", \"title\": \"Invention, Innovation, and Commercialisation in British Biophysics\", \"summary\": \"British biophysics has a rich tradition of scientific invention and\\ninnovation, on several occasions resulting in new technologies which have\\ntransformed biological insight, such as rapid DNA sequencing, high-precision\\nsuper-resolution and label-free microscopy hardware, new approaches for\\nhigh-throughput and single-molecule bio-sensing, and the development of a range\\nof de novo bio-inspired synthetic materials. Some of these advances have been\\nestablished through democratised, open-source platforms and many have\\nbiomedical success, a key example involving the SARS-CoV-2 spike protein during\\nthe COVID-19 pandemic. Here, three UK labs made crucial contributions in\\nrevealing how the spike protein targets human cells, and how therapies such as\\nvaccines and neutralizing nanobodies likely work, enabled in large part through\\nthe biophysical technological innovations of cryo-electron microscopy. In this\\nreview, we discuss leading-edge technological and methodological innovations\\nwhich resulted from initial outcomes of discovery-led 'Physics of Life' (PoL)\\nresearch (capturing biophysics, biological physics and multiple blends of\\nphysical-life sciences interdisciplinary research in the UK) and which have\\nmatured into wider-reaching sustainable commercial ventures enabling\\nsignificant translational impact. We describe the fundamental biophysical\\nscience which led to a diverse range of academic spinouts, presenting the\\nscientific questions that were first asked and addressed through innovating new\\ntechniques and approaches, and highlighting the key publications which\\nultimately led to commercialisation. We consider these example companies\\nthrough the lens of opportunities and challenges for academic biophysics\\nresearch in partnership with British industry. Finally, we propose\\nrecommendations concerning future resourcing and structuring of UK biophysics\\nresearch and the training and support of...\", \"main_category\": \"physics.bio-ph\", \"categories\": \"physics.bio-ph\", \"published\": \"2025-04-15T15:16:42Z\"}"}
