{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04758v1\", \"title\": \"Feature Importance-Aware Deep Joint Source-Channel Coding for\\n  Computationally Efficient and Adjustable Image Transmission\", \"summary\": \"Recent advancements in deep learning-based joint source-channel coding\\n(deepJSCC) have significantly improved communication performance, but their\\nhigh computational demands restrict practical deployment. Furthermore, some\\napplications require the adaptive adjustment of computational complexity. To\\naddress these challenges, we propose a computationally efficient and adjustable\\ndeepJSCC model for image transmission, which we call feature importance-aware\\ndeepJSCC (FAJSCC). Unlike existing deepJSCC models that equally process all\\nneural features of images, FAJSCC first classifies features into important and\\nless important features and then processes them differently. Specifically,\\ncomputationally-intensive self-attention is applied to the important features\\nand computationally-efficient spatial attention to the less important ones. The\\nfeature classification is based on the available computational budget and\\nimportance scores predicted by an importance predictor, which estimates each\\nfeature's contribution to performance. It also allows independent adjustment of\\nencoder and decoder complexity within a single trained model. With these\\nproperties, our FAJSCC is the first deepJSCC that is computationally efficient\\nand adjustable while maintaining high performance. Experiments demonstrate that\\nour FAJSCC achieves higher image transmission performance across various\\nchannel conditions while using less computational complexity than the recent\\nstate-of-the-art models. Adding to this, by separately varying the\\ncomputational resources of the encoder and decoder, it is concluded that the\\ndecoder's error correction function requires the largest computational\\ncomplexity in FAJSCC, which is the first observation in deepJSCC literature.\\nThe FAJSCC code is publicly available at\\nhttps://github.com/hansung-choi/FAJSCC.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-04-07T06:11:39Z\"}"}
