{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03159v1\", \"title\": \"Systematic Evaluation of Initial States and Exploration-Exploitation\\n  Strategies in PID Auto-Tuning: A Framework-Driven Approach Applied on Mobile\\n  Robots\", \"summary\": \"PID controllers are widely used in control systems because of their\\nsimplicity and effectiveness. Although advanced optimization techniques such as\\nBayesian Optimization and Differential Evolution have been applied to address\\nthe challenges of automatic tuning of PID controllers, the influence of initial\\nsystem states on convergence and the balance between exploration and\\nexploitation remains underexplored. Moreover, experimenting the influence\\ndirectly on real cyber-physical systems such as mobile robots is crucial for\\nderiving realistic insights. In the present paper, a novel framework is\\nintroduced to evaluate the impact of systematically varying these factors on\\nthe PID auto-tuning processes that utilize Bayesian Optimization and\\nDifferential Evolution. Testing was conducted on two distinct PID-controlled\\nrobotic platforms, an omnidirectional robot and a differential drive mobile\\nrobot, to assess the effects on convergence rate, settling time, rise time, and\\novershoot percentage. As a result, the experimental outcomes yield evidence on\\nthe effects of the systematic variations, thereby providing an empirical basis\\nfor future research studies in the field.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.LG\", \"published\": \"2025-05-06T04:12:09Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03175v1\", \"title\": \"Multiuser Communications Aided by Cross-Linked Movable Antenna Array:\\n  Architecture and Optimization\", \"summary\": \"Movable antenna (MA) has been regarded as a promising technology to enhance\\nwireless communication performance by enabling flexible antenna movement.\\nHowever, the hardware cost of conventional MA systems scales with the number of\\nmovable elements due to the need for independently controllable driving\\ncomponents. To reduce hardware cost, we propose in this paper a novel\\narchitecture named cross-linked MA (CL-MA) array, which enables the collective\\nmovement of multiple antennas in both horizontal and vertical directions. To\\nevaluate the performance benefits of the CL-MA array, we consider an uplink\\nmultiuser communication scenario. Specifically, we aim to minimize the total\\ntransmit power while satisfying a given minimum rate requirement for each user\\nby jointly optimizing the horizontal and vertical antenna position vectors\\n(APVs), the receive combining at the base station (BS), and the transmit power\\nof users. A globally lower bound on the total transmit power is derived, with\\nclosed-form solutions for the APVs obtained under the condition of a single\\nchannel path for each user. For the more general case of multiple channel\\npaths, we develop a low-complexity algorithm based on discrete antenna position\\noptimization. Additionally, to further reduce antenna movement overhead, a\\nstatistical channel-based antenna position optimization approach is proposed,\\nallowing for unchanged APVs over a long time period. Simulation results\\ndemonstrate that the proposed CL-MA schemes significantly outperform\\nconventional fixed-position antenna (FPA) systems and closely approach the\\ntheoretical lower bound on the total transmit power. Compared to the\\ninstantaneous channel-based CL-MA optimization, the statistical channel-based\\napproach incurs a slight performance loss but achieves significantly lower\\nmovement overhead, making it an appealing solution for practical wireless\\nsystems.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-05-06T04:39:05Z\"}"}
