{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11114v1\", \"title\": \"Continuous Aperture Array (CAPA)-Based Secure Wireless Communications\", \"summary\": \"A continuous aperture array (CAPA)-based secure communication system is\\ninvestigated, where a base station equipped with a CAPA transmits signals to a\\nlegitimate user under the existence of an eavesdropper. For improving the\\nsecrecy performance, the artificial noise (AN) is employed at the BS for the\\njamming purpose. We aim at maximizing the secrecy rate by jointly optimizing\\nthe information-bearing and AN source current patterns, subject to the maximum\\ntransmit power constraint. To solve the resultant non-convex integral-based\\nfunctional programming problem, a channel subspace-based approach is first\\nproposed via exploiting the result that the optimal current patterns always lie\\nwithin the subspace spanned by all users' channel responses. Then, the\\nintractable CAPA continuous source current pattern design problem with an\\ninfinite number of optimization variables is equivalently transformed into the\\nchannel-subspace weighting factor optimization problem with a finite number of\\noptimization variables. A penalty-based successive convex approximation method\\nis developed for iteratively optimizing the finite-size weighting vectors. To\\nfurther reduce the computational complexity, we propose a two-stage source\\ncurrent patterns design scheme. Specifically, the information-bearing and AN\\npatterns are first designed using the maximal ration transmission and\\nzero-forcing transmission, respectively. Then, the remaining power allocation\\nis addressed via the one-dimensional search method. Numerical results unveil\\nthat 1) the CAPA brings in significant secrecy rate gain compared to the\\nconventional discrete multiple-input multiple-output; 2) the proposed channel\\nsubspace-based algorithm outperforms the conventional Fourier-based approach,\\nwhile sustaining much lower computational complexity; and 3) the two-stage\\nZF-MRT approach has negligible performance loss for the large transmit power\\nregime.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-15T12:02:03Z\"}"}
