{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02782v1\", \"title\": \"GPT-ImgEval: A Comprehensive Benchmark for Diagnosing GPT4o in Image\\n  Generation\", \"summary\": \"The recent breakthroughs in OpenAI's GPT4o model have demonstrated\\nsurprisingly good capabilities in image generation and editing, resulting in\\nsignificant excitement in the community. This technical report presents the\\nfirst-look evaluation benchmark (named GPT-ImgEval), quantitatively and\\nqualitatively diagnosing GPT-4o's performance across three critical dimensions:\\n(1) generation quality, (2) editing proficiency, and (3) world\\nknowledge-informed semantic synthesis. Across all three tasks, GPT-4o\\ndemonstrates strong performance, significantly surpassing existing methods in\\nboth image generation control and output quality, while also showcasing\\nexceptional knowledge reasoning capabilities. Furthermore, based on the\\nGPT-4o's generated data, we propose a classification-model-based approach to\\ninvestigate the underlying architecture of GPT-4o, where our empirical results\\nsuggest the model consists of an auto-regressive (AR) combined with a\\ndiffusion-based head for image decoding, rather than the VAR-like\\narchitectures. We also provide a complete speculation on GPT-4o's overall\\narchitecture. In addition, we conduct a series of analyses to identify and\\nvisualize GPT-4o's specific limitations and the synthetic artifacts commonly\\nobserved in its image generation. We also present a comparative study of\\nmulti-round image editing between GPT-4o and Gemini 2.0 Flash, and discuss the\\nsafety implications of GPT-4o's outputs, particularly their detectability by\\nexisting image forensic models. We hope that our work can offer valuable\\ninsight and provide a reliable benchmark to guide future research, foster\\nreproducibility, and accelerate innovation in the field of image generation and\\nbeyond. The codes and datasets used for evaluating GPT-4o can be found at\\nhttps://github.com/PicoTrex/GPT-ImgEval.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-03T17:23:16Z\"}"}
