{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20826v1\", \"title\": \"AI-enhanced High Resolution Functional Imaging Reveals Trap States and\\n  Charge Carrier Recombination Pathways in Perovskite\", \"summary\": \"Understanding and controlling charge carrier recombination dynamics is\\nessential for enhancing the performance of metal halide perovskite\\noptoelectronic devices. In this study, we present a machine learning-assisted\\nintensity-modulated two-photon photoluminescence microscopy (ML-IM2PM) method\\nto quantitatively map recombination processes in MAPbBr3 perovskite\\nmicrocrystalline films at micrometer-scale resolution. To improve model\\naccuracy, we implemented a balanced classification sampling strategy during the\\nmachine learning optimization phase. The resulting regression chain model\\neffectively predicts key physical parameters across a 576-pixel spatial map,\\nincluding exciton generation rate (G), initial trap concentration (N_TR), and\\ntrap energy barrier (E_a).\\n  These extracted parameters were subsequently used to solve a system of\\ncoupled ordinary differential equations, enabling spatially resolved\\nsimulations of carrier populations and recombination dynamics under\\nsteady-state photoexcitation. The simulations reveal significant spatial\\nheterogeneity in exciton, electron, hole, and trap populations, along with\\nphotoluminescence and nonradiative losses. Correlation analysis delineates\\nthree distinct recombination regimes: (i) a trap-filling regime dominated by\\nnonradiative recombination, (ii) a transitional crossover regime, and (iii) a\\nband-filling regime characterized by markedly enhanced radiative efficiency. A\\ncritical trap density threshold of approximately 10^17 cm^-3 marks the\\ntransition between these regimes. Overall, this work establishes ML-IM2PM as a\\nrobust framework for probing carrier dynamics and informing defect passivation\\nstrategies in perovskite materials.\", \"main_category\": \"physics.chem-ph\", \"categories\": \"physics.chem-ph\", \"published\": \"2025-04-29T14:46:44Z\"}"}
