{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03733v1\", \"title\": \"WebGen-Bench: Evaluating LLMs on Generating Interactive and Functional\\n  Websites from Scratch\", \"summary\": \"LLM-based agents have demonstrated great potential in generating and managing\\ncode within complex codebases. In this paper, we introduce WebGen-Bench, a\\nnovel benchmark designed to measure an LLM-based agent's ability to create\\nmulti-file website codebases from scratch. It contains diverse instructions for\\nwebsite generation, created through the combined efforts of human annotators\\nand GPT-4o. These instructions span three major categories and thirteen minor\\ncategories, encompassing nearly all important types of web applications. To\\nassess the quality of the generated websites, we use GPT-4o to generate test\\ncases targeting each functionality described in the instructions, and then\\nmanually filter, adjust, and organize them to ensure accuracy, resulting in 647\\ntest cases. Each test case specifies an operation to be performed on the\\nwebsite and the expected result after the operation. To automate testing and\\nimprove reproducibility, we employ a powerful web-navigation agent to execute\\ntests on the generated websites and determine whether the observed responses\\nalign with the expected results. We evaluate three high-performance code-agent\\nframeworks, Bolt.diy, OpenHands, and Aider, using multiple proprietary and\\nopen-source LLMs as engines. The best-performing combination, Bolt.diy powered\\nby DeepSeek-R1, achieves only 27.8\\\\% accuracy on the test cases, highlighting\\nthe challenging nature of our benchmark. Additionally, we construct\\nWebGen-Instruct, a training set consisting of 6,667 website-generation\\ninstructions. Training Qwen2.5-Coder-32B-Instruct on Bolt.diy trajectories\\ngenerated from a subset of this training set achieves an accuracy of 38.2\\\\%,\\nsurpassing the performance of the best proprietary model.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-05-06T17:59:15Z\"}"}
