{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20454v1\", \"title\": \"LymphAtlas- A Unified Multimodal Lymphoma Imaging Repository Delivering\\n  AI-Enhanced Diagnostic Insight\", \"summary\": \"This study integrates PET metabolic information with CT anatomical structures\\nto establish a 3D multimodal segmentation dataset for lymphoma based on\\nwhole-body FDG PET/CT examinations, which bridges the gap of the lack of\\nstandardised multimodal segmentation datasets in the field of haematological\\nmalignancies. We retrospectively collected 483 examination datasets acquired\\nbetween March 2011 and May 2024, involving 220 patients (106 non-Hodgkin\\nlymphoma, 42 Hodgkin lymphoma); all data underwent ethical review and were\\nrigorously de-identified. Complete 3D structural information was preserved\\nduring data acquisition, preprocessing and annotation, and a high-quality\\ndataset was constructed based on the nnUNet format. By systematic technical\\nvalidation and evaluation of the preprocessing process, annotation quality and\\nautomatic segmentation algorithm, the deep learning model trained based on this\\ndataset is verified to achieve accurate segmentation of lymphoma lesions in\\nPET/CT images with high accuracy, good robustness and reproducibility, which\\nproves the applicability and stability of this dataset in accurate segmentation\\nand quantitative analysis. The deep fusion of PET/CT images achieved with this\\ndataset not only significantly improves the accurate portrayal of the\\nmorphology, location and metabolic features of tumour lesions, but also\\nprovides solid data support for early diagnosis, clinical staging and\\npersonalized treatment, and promotes the development of automated image\\nsegmentation and precision medicine based on deep learning. The dataset and\\nrelated resources are available at https://github.com/SuperD0122/LymphAtlas-.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.CV\", \"published\": \"2025-04-29T06:10:12Z\"}"}
