{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10217v1\", \"title\": \"Dissimilar magnetically driven accretion on the components of V4046\\n  Sagittarii\", \"summary\": \"Accretion of pre-main sequence stars (PMS) is a key process in stellar\\nformation, governing mass assembly, influencing angular momentum conservation\\nand stellar internal structure, and shaping disc evolution, which serves as the\\nbirthplace of exoplanets. Classical T Tauri stars (cTTSs), low-mass PMS stars\\nactively accreting from a disc, hold a well-described magnetospheric accretion\\nmodel. Their strong, inclined dipole magnetic fields truncate the disc at a few\\nstellar radii, channelling material along magnetic field lines to fall onto the\\nstellar surface near the dipole pole. However, this paradigm assumes the\\npresence of a single star, and a complete description of the accretion process\\nin multiple systems remains to be achieved. Building on our previous work on DQ\\nTau and AK Sco, we aim to describe the accretion processes in cTTS binaries,\\naccounting for the influence of stellar magnetic fields. Specifically, we\\nsought to explore how the magnetospheric accretion model of cTTSs can be\\napplied to V4046 Sgr, a spectroscopic binary composed of equal-mass and coeval\\ncTTSs in a circular orbit with synchronous rotation, surrounded by a\\ncircumbinary disc. We analysed a time series of ESPaDOnS spectra covering\\nseveral orbital cycles. A variability analysis was performed on the radial\\nvelocities and on the Balmer, He I D3, and Ca II emission lines, which are\\nassociated with the accretion process. We identified the secondary as the\\nsystem's main accretor, operating in an unstable regime. Additionally, we\\ndetected an accretion funnel flow connecting the dipole pole of the primary\\nstar with a nearby bulk of gas. We concluded that the two components exhibit\\ndissimilar accretion patterns. The primary operates in an \\\"ordered chaotic\\\"\\nregime, where accretion funnel flows and accretion tongues coexist. Conversely,\\nthe secondary appears to be in a chaotic regime, with accretion tongues\\ndominating.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-14T13:33:44Z\"}"}
