{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21757v1\", \"title\": \"A generic dynamical system formulation for Bianchi-I cosmology with\\n  isotropic fluid in $f(Q)$ gravity\", \"summary\": \"In this article, we present for the first time a generic dynamical system\\nformulation for Bianchi-I cosmology with an isotropic fluid in $f(Q)$ gravity\\ntheory. This generalizes the earlier works in the literature on the Bianchi-I\\ndynamical system in $f(Q)$ gravity that started with writing the Bianchi-I\\ncosmological field equations specific to a chosen $f(Q)$ form and then\\nconstructing suitable dimensionless variables. Instead, we start from the\\ngeneric Bianchi-I cosmological field equations in $f(Q)$ and present a\\nprescription of how one can construct an autonomous dynamical system in terms\\nof the standard Hubble-normalized dimensionless dynamical variables once an\\n$f(Q)$ theory is provided. We discuss its application in late-time and early\\ntime cosmology. In the context of late-time cosmology, we implement our\\nformulation in four examples, computing and analyzing the critical points,\\ndetermining their existence conditions, examining their stability, and plotting\\nthe phase portraits to illustrate their behavior. Particular care has been\\ntaken to single out the physically viable regions in the phase space for each\\nmodel. Our findings indicate that the quadratic model is not suitable for\\nstudying the late-time anisotropic scenarios, while the other three models\\nyield the same evolution as in GR without providing insights into the\\ncosmological evolution of anisotropic critical points. In the early time\\ncosmology scenario, the isotropization dynamics in vacuum is model independent;\\ninflating cosmology always isotropizes, whereas a contracting cosmology is\\nalways unstable, making it impossible to obtain a classically stable\\nnonsingular bouncing solution.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc\", \"published\": \"2025-04-30T15:57:37Z\"}"}
