{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16474v1\", \"title\": \"Seeking Flat Minima over Diverse Surrogates for Improved Adversarial\\n  Transferability: A Theoretical Framework and Algorithmic Instantiation\", \"summary\": \"The transfer-based black-box adversarial attack setting poses the challenge\\nof crafting an adversarial example (AE) on known surrogate models that remain\\neffective against unseen target models. Due to the practical importance of this\\ntask, numerous methods have been proposed to address this challenge. However,\\nmost previous methods are heuristically designed and intuitively justified,\\nlacking a theoretical foundation. To bridge this gap, we derive a novel\\ntransferability bound that offers provable guarantees for adversarial\\ntransferability. Our theoretical analysis has the advantages of \\\\textit{(i)}\\ndeepening our understanding of previous methods by building a general attack\\nframework and \\\\textit{(ii)} providing guidance for designing an effective\\nattack algorithm. Our theoretical results demonstrate that optimizing AEs\\ntoward flat minima over the surrogate model set, while controlling the\\nsurrogate-target model shift measured by the adversarial model discrepancy,\\nyields a comprehensive guarantee for AE transferability. The results further\\nlead to a general transfer-based attack framework, within which we observe that\\nprevious methods consider only partial factors contributing to the\\ntransferability. Algorithmically, inspired by our theoretical results, we first\\nelaborately construct the surrogate model set in which models exhibit diverse\\nadversarial vulnerabilities with respect to AEs to narrow an instantiated\\nadversarial model discrepancy. Then, a \\\\textit{model-Diversity-compatible\\nReverse Adversarial Perturbation} (DRAP) is generated to effectively promote\\nthe flatness of AEs over diverse surrogate models to improve transferability.\\nExtensive experiments on NIPS2017 and CIFAR-10 datasets against various target\\nmodels demonstrate the effectiveness of our proposed attack.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.LG\", \"published\": \"2025-04-23T07:33:45Z\"}"}
