{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04133v1\", \"title\": \"Beyond Morphology: Challenges in Decomposing Massive Stellar Halos in\\n  Sombrero-like, Halo-Embedded Disk Galaxies\", \"summary\": \"Sombrero-like galaxies exhibit unique structural properties that challenge\\ntraditional photometric decomposition methods. In this study, we investigate\\ntheir structural differences using both photometric and kinematic approaches to\\nassess the extent to which photometric decomposition may misidentify key\\ncomponents, particularly the stellar halo. We select 270 Sombrero-like galaxies\\nat redshift z=0 from the TNG50 simulation, applying filters to include only\\nthose with stellar mass $M_{\\\\ast} > 10^{10}M_{\\\\odot}$ and stellar halo mass\\nfraction $0.3 < f_{\\\\rm halo} < 0.6$. Synthetic images are generated using the\\nGALAXEV population synthesis code, and photometric decomposition is carried out\\non both face-on and edge-on views using GALFIT. We then compare these results\\nwith kinematic decomposition based on the auto-GMM method, focusing on\\ndifferences in recovered structural parameters such as mass fractions and\\nS'ersic indices.Sombrero-like galaxies typically consist of disks embedded in\\nmassive stellar halos and may account for 30-60% of galaxies in TNG50. However,\\ntheir identification is complicated by structural degeneracies and the presence\\nof disk features (e.g., bars, spirals, star formation) at low or moderate\\ninclinations. In face-on projections, photometric decomposition systematically\\noverestimates disk fractions as stellar halos are almost absent, while edge-on\\nanalysis provides only approximate halo fractions. Radial profiles show\\ndiscrepancies between photometric and kinematic decomposition, particularly in\\ncentral regions. Additionally, no conclusive link exists between the S'ersic\\nindex n and the presence of large stellar halos, challenging the use of n as a\\nmerger history proxy. These findings underscore the need for improved\\ndecomposition methods to better understand the complex structures of\\nSombrero-like galaxies.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-05-07T05:08:07Z\"}"}
