{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12705v1\", \"title\": \"7-Methylquinolinium Iodobismuthate Memristor: Exploring Plasticity and\\n  Memristive Properties for Digit Classification in Physical Reservoir\\n  Computing\", \"summary\": \"This study investigates 7-methylquinolinium halobismuthates (I, Br, and Cl)\\nin two aspects: (1) their structural and semiconducting properties influenced\\nby anionic composition, and (2) their memristive and plasticity characteristics\\nfor neuromorphic and reservoir computing applications. Structural changes\\ninduced by halides form low-dimensional halobismuthate fragments, confirmed by\\ncrystallographic analysis. Optical band gaps were studied using diffuse\\nreflectance spectroscopy, aligning with density functional theory results. Due\\nto solubility limitations, only bismuth iodide complexes were explored in\\nelectronic devices. Current-voltage scans showed pinched hysteresis loops,\\ncharacteristic of memristors. Conductivity versus temperature study indicates\\ncombined ionic and electronic contributions to conductivity of the devices.\\nGiven that a memristor can function as a single synapse without the need for\\nprogramming, aligning with the requirements of neuromorphic computing, the\\nstudy investigated long-term depression, potentiation, and spike-time-dependent\\nplasticity. As the potentiation-depression plots showed non-linearity with\\nfading memory, these materials can be a good candidate for application in\\nphysical reservoir computing. To further assess this material, an electronic\\ndevice with sixteen gold electrodes was applied, featuring one input and 15\\noutput electrodes deposited on silicon substrate and covered with a layer of\\nstudied compound. Basic test to assess the complexity and non-linearity of the\\ndevices were conducted through a series of benchmark tasks, including waveform\\ngeneration, NARMA-2, memory capacity assessment, and noise study under both DC\\nand AC current. The ability of device in MNIST digit classification with 82.26%\\naccuracy and voice classification for digit 2 for six different people with 82\\n% accuracy has been demonstrated.\", \"main_category\": \"cond-mat.dis-nn\", \"categories\": \"cond-mat.dis-nn\", \"published\": \"2025-04-17T07:19:04Z\"}"}
