{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17603v1\", \"title\": \"SAPO-RL: Sequential Actuator Placement Optimization for Fuselage\\n  Assembly via Reinforcement Learning\", \"summary\": \"Precise assembly of composite fuselages is critical for aircraft assembly to\\nmeet the ultra-high precision requirements. Due to dimensional variations,\\nthere is a gap when two fuselage assemble. In practice, actuators are required\\nto adjust fuselage dimensions by applying forces to specific points on fuselage\\nedge through pulling or pushing force actions. The positioning and force\\nsettings of these actuators significantly influence the efficiency of the shape\\nadjustments. The current literature usually predetermines the fixed number of\\nactuators, which is not optimal in terms of overall quality and corresponding\\nactuator costs. However, optimal placement of actuators in terms of both\\nlocations and number is challenging due to compliant structures, complex\\nmaterial properties, and dimensional variabilities of incoming fuselages. To\\naddress these challenges, this paper introduces a reinforcement learning (RL)\\nframework that enables sequential decision-making for actuator placement\\nselection and optimal force computation. Specifically, our methodology employs\\nthe Dueling Double Deep Q-Learning (D3QN) algorithm to refine the\\ndecision-making capabilities of sequential actuator placements. The environment\\nis meticulously crafted to enable sequential and incremental selection of an\\nactuator based on system states. We formulate the actuator selection problem as\\na submodular function optimization problem, where the sub-modularity properties\\ncan be adopted to efficiently achieve near-optimal solutions. The proposed\\nmethodology has been comprehensively evaluated through numerical studies and\\ncomparison studies, demonstrating its effectiveness and outstanding performance\\nin enhancing assembly precision with limited actuator numbers.\", \"main_category\": \"eess.SY\", \"categories\": \"eess.SY,cs.SY\", \"published\": \"2025-04-24T14:28:42Z\"}"}
