{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10037v1\", \"title\": \"A census of galactic spider binary millisecond pulsars with the\\n  Nan\\u00e7ay Radio Telescope\", \"summary\": \"Spider pulsars are systems in which a millisecond pulsar (MSP) tightly orbits\\n(Pb $\\\\lesssim$ 1 day) a low mass (mc $\\\\lesssim$ 0.5 M$_\\\\odot$) semi-degenerate\\nstar. Spider often display eclipses around superior conjunction. This eclipse\\nphenomenon is currently poorly understood. We analyzed eclipses via pulsar\\ntiming. The eclipses were fit with a phenomenological model which gives a\\nmeasurement of the duration and asymmetry of the eclipses. These parameters\\nwere then compared to other eclipse and system measurements to discuss the\\npotential link between the presence of eclipses and orbital inclination,\\neclipsing systems being known to have higher mass functions than non-eclipsing\\nones. We present here a comprehensive review of the NRT NUPPI backend spider\\npulsars dataset. We also present the first review and systematic analysis of a\\nlarge sample of eclipsers, monitored with the NRT over several years. The\\nphenomenological fit allowed us to compare the eclipsers with each other, which\\nled to the categorization of eclipsers depending on the shape of their\\neclipses. We present the polarimetric properties of the 19 spiders in the\\nsample alongside their profiles, which were previously unpublished in some\\ncases. For the eclipsing systems, we found evidence for a positive correlation\\nbetween eclipse duration and mass function, as expected if more eclipsing\\nmaterial crosses the line-of-sight in higher inclination systems. For the\\nentire sample, we found marginal evidence for increasing pulse profile width\\nwith decreasing mass function. We finally conducted a comprehensive literature\\nreview of the published inclination measurements for the pulsars in the sample\\nand compared the inclinations to eclipse parameters. Nevertheless, the small\\nnumber of available orbital inclination constraints, contradicting each other\\nin some cases, hinders such searches for correlations\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-14T09:39:59Z\"}"}
