{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19898v1\", \"title\": \"GenCLS++: Pushing the Boundaries of Generative Classification in LLMs\\n  Through Comprehensive SFT and RL Studies Across Diverse Datasets\", \"summary\": \"As a fundamental task in machine learning, text classification plays a\\ncrucial role in many areas. With the rapid scaling of Large Language Models\\n(LLMs), particularly through reinforcement learning (RL), there is a growing\\nneed for more capable discriminators. Consequently, advances in classification\\nare becoming increasingly vital for enhancing the overall capabilities of LLMs.\\nTraditional discriminative methods map text to labels but overlook LLMs'\\nintrinsic generative strengths. Generative classification addresses this by\\nprompting the model to directly output labels. However, existing studies still\\nrely on simple SFT alone, seldom probing the interplay between training and\\ninference prompts, and no work has systematically leveraged RL for generative\\ntext classifiers and unified SFT, RL, and inference-time prompting in one\\nframework. We bridge this gap with GenCLS++, a framework that jointly optimizes\\nSFT and RL while systematically exploring five high-level strategy\\ndimensions-in-context learning variants, category definitions, explicit\\nuncertainty labels, semantically irrelevant numeric labels, and\\nperplexity-based decoding-during both training and inference. After an SFT\\n\\\"policy warm-up,\\\" we apply RL with a simple rule-based reward, yielding sizable\\nextra gains. Across seven datasets, GenCLS++ achieves an average accuracy\\nimprovement of 3.46% relative to the naive SFT baseline; on public datasets,\\nthis improvement rises to 4.00%. Notably, unlike reasoning-intensive tasks that\\nbenefit from explicit thinking processes, we find that classification tasks\\nperform better without such reasoning steps. These insights into the role of\\nexplicit reasoning provide valuable guidance for future LLM applications.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-04-28T15:30:58Z\"}"}
