{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11128v1\", \"title\": \"K-means Enhanced Density Gradient Analysis for Urban and Transport\\n  Metrics Using Multi-Modal Satellite Imagery\", \"summary\": \"This paper presents a novel computational approach for evaluating urban\\nmetrics through density gradient analysis using multi-modal satellite imagery,\\nwith applications including public transport and other urban systems. By\\ncombining optical and Synthetic Aperture Radar (SAR) data, we develop a method\\nto segment urban areas, identify urban centers, and quantify density gradients.\\nOur approach calculates two key metrics: the density gradient coefficient\\n($\\\\alpha$) and the minimum effective distance (LD) at which density reaches a\\ntarget threshold. We further employ machine learning techniques, specifically\\nK-means clustering, to objectively identify uniform and high-variability\\nregions within density gradient plots. We demonstrate that these metrics\\nprovide an effective screening tool for public transport analyses by revealing\\nthe underlying urban structure. Through comparative analysis of two\\nrepresentative cities with contrasting urban morphologies (monocentric vs\\npolycentric), we establish relationships between density gradient\\ncharacteristics and public transport network topologies. Cities with clear\\ndensity peaks in their gradient plots indicate distinct urban centers requiring\\ndifferent transport strategies than those with more uniform density\\ndistributions. This methodology offers urban planners a cost-effective,\\nglobally applicable approach to preliminary public transport assessment using\\nfreely available satellite data. The complete implementation, with additional\\nexamples and documentation, is available in an open-source repository under the\\nMIT license at https://github.com/nexri/Satellite-Imagery-Urban-Analysis.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.LG,eess.IV\", \"published\": \"2025-04-15T12:25:42Z\"}"}
