{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10898v1\", \"title\": \"Xpose: Bi-directional Engineering for Hidden Query Extraction\", \"summary\": \"Query reverse engineering (QRE) aims to synthesize a SQL query to connect a\\ngiven database and result instance. A recent variation of QRE is where an\\nadditional input, an opaque executable containing a ground-truth query, is\\nprovided, and the goal is to non-invasively extract this specific query through\\nonly input-output examples. This variant, called Hidden Query Extraction (HQE),\\nhas a spectrum of industrial use-cases including query recovery, database\\nsecurity, and vendor migration. The reverse engineering (RE) tools developed\\nfor HQE, which are based on database mutation and generation techniques, can\\nonly extract flat queries with key-based equi joins and conjunctive arithmetic\\nfilter predicates, making them limited wrt both query structure and query\\noperators. In this paper, we present Xpose, a HQE solution that elevates the\\nextraction scope to realistic complex queries, such as those found in the TPCH\\nbenchmark. A two-pronged approach is taken: (1) The existing RE scope is\\nsubstantially extended to incorporate union connectors, algebraic filter\\npredicates, and disjunctions for both values and predicates. (2) The predictive\\npower of LLMs is leveraged to convert business descriptions of the opaque\\napplication into extraction guidance, representing ``forward engineering\\\" (FE).\\nThe FE module recognizes common constructs, such as nesting of sub-queries,\\nouter joins, and scalar functions. In essence, FE establishes the broad query\\ncontours, while RE fleshes out the fine-grained details. We have evaluated\\nXpose on (a) E-TPCH, a query suite comprising the complete TPCH benchmark\\nextended with queries featuring unions, diverse join types, and sub-queries;\\nand (b) the real-world STACK benchmark. The experimental results demonstrate\\nthat its bi-directional engineering approach accurately extracts these complex\\nqueries, representing a significant step forward with regard to HQE coverage.\", \"main_category\": \"cs.DB\", \"categories\": \"cs.DB,cs.AI,H.2.8\", \"published\": \"2025-04-15T06:17:58Z\"}"}
