{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24267v1\", \"title\": \"FakeScope: Large Multimodal Expert Model for Transparent AI-Generated\\n  Image Forensics\", \"summary\": \"The rapid and unrestrained advancement of generative artificial intelligence\\n(AI) presents a double-edged sword: while enabling unprecedented creativity, it\\nalso facilitates the generation of highly convincing deceptive content,\\nundermining societal trust. As image generation techniques become increasingly\\nsophisticated, detecting synthetic images is no longer just a binary task: it\\nnecessitates interpretable, context-aware methodologies that enhance\\ntrustworthiness and transparency. However, existing detection models primarily\\nfocus on classification, offering limited explanatory insights into image\\nauthenticity. In this work, we propose FakeScope, an expert multimodal model\\n(LMM) tailored for AI-generated image forensics, which not only identifies\\nAI-synthetic images with high accuracy but also provides rich, interpretable,\\nand query-driven forensic insights. We first construct FakeChain dataset that\\ncontains linguistic authenticity reasoning based on visual trace evidence,\\ndeveloped through a novel human-machine collaborative framework. Building upon\\nit, we further present FakeInstruct, the largest multimodal instruction tuning\\ndataset containing 2 million visual instructions tailored to enhance forensic\\nawareness in LMMs. FakeScope achieves state-of-the-art performance in both\\nclosed-ended and open-ended forensic scenarios. It can distinguish synthetic\\nimages with high accuracy while offering coherent and insightful explanations,\\nfree-form discussions on fine-grained forgery attributes, and actionable\\nenhancement strategies. Notably, despite being trained exclusively on\\nqualitative hard labels, FakeScope demonstrates remarkable zero-shot\\nquantitative capability on detection, enabled by our proposed token-based\\nprobability estimation strategy. Furthermore, FakeScope exhibits strong\\ngeneralization and in-the-wild ability, ensuring its applicability in\\nreal-world scenarios.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-03-31T16:12:48Z\"}"}
