{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10278v1\", \"title\": \"DiffMOD: Progressive Diffusion Point Denoising for Moving Object\\n  Detection in Remote Sensing\", \"summary\": \"Moving object detection (MOD) in remote sensing is significantly challenged\\nby low resolution, extremely small object sizes, and complex noise\\ninterference. Current deep learning-based MOD methods rely on probability\\ndensity estimation, which restricts flexible information interaction between\\nobjects and across temporal frames. To flexibly capture high-order inter-object\\nand temporal relationships, we propose a point-based MOD in remote sensing.\\nInspired by diffusion models, the network optimization is formulated as a\\nprogressive denoising process that iteratively recovers moving object centers\\nfrom sparse noisy points. Specifically, we sample scattered features from the\\nbackbone outputs as atomic units for subsequent processing, while global\\nfeature embeddings are aggregated to compensate for the limited coverage of\\nsparse point features. By modeling spatial relative positions and semantic\\naffinities, Spatial Relation Aggregation Attention is designed to enable\\nhigh-order interactions among point-level features for enhanced object\\nrepresentation. To enhance temporal consistency, the Temporal Propagation and\\nGlobal Fusion module is designed, which leverages an implicit memory reasoning\\nmechanism for robust cross-frame feature integration. To align with the\\nprogressive denoising process, we propose a progressive MinK optimal transport\\nassignment strategy that establishes specialized learning objectives at each\\ndenoising level. Additionally, we introduce a missing loss function to\\ncounteract the clustering tendency of denoised points around salient objects.\\nExperiments on the RsData remote sensing MOD dataset show that our MOD method\\nbased on scattered point denoising can more effectively explore potential\\nrelationships between sparse moving objects and improve the detection\\ncapability and temporal consistency.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,I.4.8\", \"published\": \"2025-04-14T14:44:52Z\"}"}
