{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03597v1\", \"title\": \"Fixed-Length Dense Fingerprint Representation\", \"summary\": \"Fixed-length fingerprint representations, which map each fingerprint to a\\ncompact and fixed-size feature vector, are computationally efficient and\\nwell-suited for large-scale matching. However, designing a robust\\nrepresentation that effectively handles diverse fingerprint modalities, pose\\nvariations, and noise interference remains a significant challenge. In this\\nwork, we propose a fixed-length dense descriptor of fingerprints, and introduce\\nFLARE-a fingerprint matching framework that integrates the Fixed-Length dense\\ndescriptor with pose-based Alignment and Robust Enhancement. This fixed-length\\nrepresentation employs a three-dimensional dense descriptor to effectively\\ncapture spatial relationships among fingerprint ridge structures, enabling\\nrobust and locally discriminative representations. To ensure consistency within\\nthis dense feature space, FLARE incorporates pose-based alignment using\\ncomplementary estimation methods, along with dual enhancement strategies that\\nrefine ridge clarity while preserving the original fingerprint modality. The\\nproposed dense descriptor supports fixed-length representation while\\nmaintaining spatial correspondence, enabling fast and accurate similarity\\ncomputation. Extensive experiments demonstrate that FLARE achieves superior\\nperformance across rolled, plain, latent, and contactless fingerprints,\\nsignificantly outperforming existing methods in cross-modality and low-quality\\nscenarios. Further analysis validates the effectiveness of the dense descriptor\\ndesign, as well as the impact of alignment and enhancement modules on the\\naccuracy of dense descriptor matching. Experimental results highlight the\\neffectiveness and generalizability of FLARE as a unified and scalable solution\\nfor robust fingerprint representation and matching. The implementation and code\\nwill be publicly available at https://github.com/Yu-Yy/FLARE.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-06T14:59:25Z\"}"}
