{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20674v1\", \"title\": \"DiffLiB: High-fidelity differentiable modeling of lithium-ion batteries\\n  and efficient gradient-based parameter identification\", \"summary\": \"The physics-based Doyle-Fuller-Newman (DFN) model, widely adopted for its\\nprecise electrochemical modeling, stands out among various simulation models of\\nlithium-ion batteries (LIBs). Although the DFN model is powerful in forward\\npredictive analysis, the inverse identification of its model parameters has\\nremained a long-standing challenge. The numerous unknown parameters associated\\nwith the nonlinear, time-dependent, and multi-scale DFN model are extremely\\ndifficult to be determined accurately and efficiently, hindering the practical\\nuse of such battery simulation models in industrial applications. To tackle\\nthis challenge, we introduce DiffLiB, a high-fidelity finite-element-based LIB\\nsimulation framework, equipped with advanced differentiable programming\\ntechniques so that efficient gradient-based inverse parameter identification is\\nenabled. Customized automatic differentiation rules are defined by identifying\\nthe VJP (vector-Jacobian product) structure in the chain rule and implemented\\nusing adjoint-based implicit differentiation methods. Four numerical examples,\\nincluding both 2D and 3D forward predictions and inverse parameter\\nidentification, are presented to validate the accuracy and computational\\nefficiency of DiffLiB. Benchmarking against COMSOL demonstrates excellent\\nagreement in forward predictions, with terminal voltage discrepancies\\nmaintaining a root-mean-square error (RMSE) below 2 mV across all test\\nconditions. In parameter identification tasks using experimentally measured\\nvoltage data, the proposed gradient-based optimization scheme achieves superior\\ncomputational performance, with 96% fewer forward predictions and 72% less\\ncomputational time compared with gradient-free approaches. These results\\ndemonstrate that DiffLiB is a versatile and powerful computational framework\\nfor the development of advanced LIBs.\", \"main_category\": \"cs.CE\", \"categories\": \"cs.CE\", \"published\": \"2025-04-29T11:57:51Z\"}"}
