{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10846v1\", \"title\": \"Mosaic: Client-driven Account Allocation Framework in Sharded\\n  Blockchains\", \"summary\": \"Recent account allocation studies in sharded blockchains are typically\\nminer-driven, requiring miners to perform global optimizations for all accounts\\nto enhance system-wide performance. This forces each miner to maintain a\\ncomplete copy of the entire ledger, resulting in significant storage,\\ncommunication, and computation overhead.\\n  In this work, we explore an alternative research direction by proposing\\nMosaic, the first client-driven framework for distributed, lightweight local\\noptimization. Rather than relying on miners to allocate all accounts, Mosaic\\nenables clients to independently execute a local algorithm to determine their\\nresiding shards. Clients can submit migration requests to a beacon chain when\\nrelocation is necessary. Mosaic naturally addresses key limitations of\\nminer-driven approaches, including the lack of miner incentives and the\\nsignificant overhead. While clients are flexible to adopt any algorithm for\\nshard allocation, we design and implement a reference algorithm, Pilot, to\\nguide them. Clients execute Pilot to maximize their own benefits, such as\\nreduced transaction fees and confirmation latency.\\n  On a real-world Ethereum dataset, we implement and evaluate Pilot against\\nstate-of-the-art miner-driven global optimization solutions. The results\\ndemonstrate that Mosaic significantly enhances computational efficiency,\\nachieving a four-order-of-magnitude reduction in computation time, with the\\nreduced input data size from 1.44 GB to an average of 228.66 bytes per account.\\nDespite these efficiency gains, Pilot introduces only about a 5% increase in\\nthe cross-shard ratio and maintains approximately 98% of the system throughput,\\ndemonstrating a minimal trade-off in overall effectiveness.\", \"main_category\": \"cs.DC\", \"categories\": \"cs.DC,cs.DB,cs.GT\", \"published\": \"2025-04-15T04:07:09Z\"}"}
