{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03403v1\", \"title\": \"MAP Format for Representing Chemical Modifications, Annotations, and\\n  Mutations in Protein Sequences: An Extension of the FASTA Format\", \"summary\": \"Several formats, including FASTA, PIR, GenBank, EMBL, and GCG, have been\\ndeveloped for representing protein sequences composed of natural amino acids.\\nAmong these, FASTA remains the most widely used due to its simplicity and human\\nreadability. However, FASTA lacks the capability to represent chemically\\nmodified or non-natural residues, as well as structural annotations and\\nmutations in protein variants. To address some of these limitations, the PEFF\\nformat was recently introduced as an extension of FASTA. Additionally, formats\\nsuch as HELM and BILN have been proposed to represent amino acids and their\\nmodifications at the atomic level. Despite their advancements, these formats\\nhave not achieved widespread adoption within the bioinformatics community due\\nto their complexity. To complement existing formats and overcome current\\nchallenges, we propose a new format called MAP (Modification and Annotation in\\nProteins), which enables comprehensive annotation of protein sequences. MAP\\nintroduces meta tags in the header for protein-level annotations and inline\\ntags within the sequence for residue-level modifications. In this format,\\nstandard one-letter amino acid codes are augmented with curly-brace tags to\\ndenote various modifications, including phosphorylation, acetylation,\\nnon-natural residues, cyclization, and other residue-specific features. The\\nheader metadata also captures information such as organism, function, and\\nsequence variants. We describe the structure, objectives, and capabilities of\\nthe MAP format and demonstrate its application in bioinformatics, particularly\\nin the domain of protein therapeutics. To facilitate community adoption, we are\\ndeveloping a comprehensive suite of MAP-format resources, including a detailed\\nmanual, annotated datasets, and conversion tools, available at\\nhttp://webs.iiitd.edu.in/raghava/maprepo/.\", \"main_category\": \"q-bio.BM\", \"categories\": \"q-bio.BM\", \"published\": \"2025-05-06T10:29:56Z\"}"}
