{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03701v1\", \"title\": \"Young Planets around Young Accreting Stars: I. Migration and Inner\\n  Stalling Orbits\", \"summary\": \"Planet migration within inner protoplanetary disks significantly influences\\nexoplanet architectures. We investigate various migration mechanisms for young\\nplanets close to young stars. To quantify the stochastic migration driven by\\nturbulent disks, we incorporate planets into existing 3-D MHD disk simulations\\nof magnetospheric accretion. Besides the stochastic torque, we identify\\nperiodic torques from slowly evolving disk substructures farther out. We\\nquantify these turbulent torques analytically using a modified Gaussian\\nprocess. Then, using the disk structure in our simulation, we calculate\\nmigration timescales of various processes, including the smooth Type I/II\\nmigration, planet-star tidal interaction, magnetic dipole-dipole interaction,\\nunipolar induction, and aerodynamical drag with the magnetosphere. Since our\\ninner MHD turbulent disk reveals a very low surface density ($\\\\sim 0.01$\\ng/cm$^{2}$), the resulting disk migration is significantly slower than\\npreviously estimated. Earth-mass planets have the migration timescale in the\\ninner MHD turbulent disk exceeding the Hubble time, effectively stalling at the\\ndeadzone inner boundary ($R_{\\\\mathrm{DZIB}}$). Only giant planets could migrate\\ninward within the turbulent disk, and may stall at the magnetospheric\\ntruncation radius ($R_T$). A simplified planet population synthesis\\ndemonstrates that, at the end of the disk phase, all planets around solar-mass\\nstars typically stall at $\\\\lesssim$0.1 au since $R_T\\\\sim R_{\\\\mathrm{DZIB}}$.\\nHowever, around 2 $M_{\\\\odot}$ stars, higher-mass planets stall significantly\\ncloser to the star compared to low-mass planets, due to $R_T\\\\ll\\nR_{\\\\mathrm{DZIB}}$. These results are consistent with recent observations on\\nexoplanet demographics around different types of stars. Finally, turbulence in\\nthe low-density disk is unable to break the resonant planets, and thus young\\nplanets in resonances may be abundant.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-05-06T17:21:16Z\"}"}
