{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19866v1\", \"title\": \"DUETS: Setting expectations for asteroseismic binaries and binary\\n  products with synthetic populations\", \"summary\": \"Asteroseismology gives us the opportunity to better characterize binaries and\\ntheir products, and shed light on their role in Galactic populations. We\\nestimate occurrence rates, mass distributions, and evolutionary states of\\nasteroseismic binaries, exhibiting solar-like oscillations from both\\ncomponents, and of products of binary interactions with detectable solar-like\\noscillations. Additionally, we explore the effects of mass accretion or loss on\\napparent age-metallicity relations. Using the TRILEGAL code, we simulate\\nKepler's field of view adopting the Eggleton and Moe & Di Stefano distributions\\nof initial binary parameters, and run an additional simulation with\\nnon-interacting binaries for comparison. We find that asteroseismic binaries\\nrequire an initial mass ratio close to one, and even small mass transfer events\\ncan prevent the detection of oscillations from both components. The fraction of\\nasteroseismic binaries for red giant stars with detectable oscillations ranges\\nfrom 0.5\\\\% for non-interacting binaries to a minimum of 0.06% when taking\\ninteractions into account. Moreover, asteroseismic binaries composed of two red\\nclump stars are not expected at separations $\\\\leq 500~\\\\text{R}_\\\\odot$ due to\\nthe interplay of stellar evolution and binary interactions. Finally, we\\nestimate that at least ~1% of the Kepler red giants with detectable\\noscillations have undergone significant mass accretion or loss, potentially\\naffecting Galactic age-metallicity relations, although there is a strong\\ndependence on the assumed initial binary parameters. Comparing predicted and\\nobserved asteroseismic binaries, as well as over- and under-massive stars,\\noffers a way to constrain key binary evolution assumptions, and to reduce\\nuncertainties in mass-transfer modeling.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA\", \"published\": \"2025-04-28T14:59:43Z\"}"}
