{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20038v1\", \"title\": \"Unified and consistent structure growth measurements from joint ACT, SPT\\n  and \\\\textit{Planck} CMB lensing\", \"summary\": \"We present the tightest cosmic microwave background (CMB) lensing constraints\\nto date on the growth of structure by combining CMB lensing measurements from\\nthe Atacama Cosmology Telescope (ACT), the South Pole Telescope (SPT) and\\n\\\\textit{Planck}. Each of these surveys individually provides lensing\\nmeasurements with similarly high statistical power, achieving signal-to-noise\\nratios of approximately 40. The combined lensing bandpowers represent the most\\nprecise CMB lensing power spectrum measurement to date with a signal-to-noise\\nratio of 61 and an amplitude of $A_\\\\mathrm{lens}^\\\\mathrm{recon} = 1.025 \\\\pm\\n0.017$ with respect to the theory prediction from the best-fit CMB\\n\\\\textit{Planck}-ACT cosmology. The bandpowers from all three lensing datasets,\\nanalyzed jointly, yield a $1.6\\\\%$ measurement of the parameter combination\\n$S_8^\\\\mathrm{CMBL} \\\\equiv \\\\sigma_8\\\\,(\\\\Omega_m/0.3)^{0.25} =\\n0.825^{+0.015}_{-0.013}$. Including Dark Energy Spectroscopic Instrument (DESI)\\nBaryon Acoustic Oscillation (BAO) data improves the constraint on the amplitude\\nof matter fluctuations to $\\\\sigma_8 = 0.829 \\\\pm 0.009$ (a $1.1\\\\%$\\ndetermination). When combining with uncalibrated supernovae from\\n\\\\texttt{Pantheon+}, we present a $4\\\\%$ sound-horizon-independent estimate of\\n$H_0=66.4\\\\pm2.5\\\\,\\\\mathrm{km\\\\,s^{-1}\\\\,Mpc^{-1}} $. The joint lensing constraints\\non structure growth and present-day Hubble rate are fully consistent with a\\n$\\\\Lambda$CDM model fit to the primary CMB data from \\\\textit{Planck} and ACT.\\nWhile the precise upper limit is sensitive to the choice of data and underlying\\nmodel assumptions, when varying the neutrino mass sum within the\\n$\\\\Lambda\\\\mathrm{CDM}$ cosmological model, the combination of primary CMB, BAO\\nand CMB lensing drives the probable upper limit for the mass sum towards lower\\nvalues, comparable to the minimum mass prior required by neutrino oscillation\\nexperiments.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-04-28T17:58:27Z\"}"}
