{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17516v1\", \"title\": \"EP250108a/SN 2025kg: A Broad-Line Type Ic Supernova Associated with a\\n  Fast X-ray Transient Showing Evidence of Extended CSM Interaction\", \"summary\": \"We present optical, radio, and X-ray observations of EP250108a/SN 2025kg, a\\nbroad-line Type Ic supernova (SN Ic-BL) accompanying an Einstein Probe (EP)\\nfast X-ray transient (FXT) at $z=0.176$. EP250108a/SN 2025kg possesses a\\ndouble-peaked optical light curve and its spectrum transitions from a blue\\nunderlying continuum to a typical SN Ic-BL spectrum over time. We fit a\\nradioactive decay model to the second peak of the optical light curve and find\\nSN parameters that are consistent with the SNe Ic-BL population, while its\\nX-ray and radio properties are consistent with those of low-luminosity GRB\\n(LLGRB) 060218/SN 2006aj. We explore three scenarios to understand the system's\\nmulti-wavelength emission -- (a) SN ejecta interacting with an extended\\ncircumstellar medium (CSM), (b) the shocked cocoon of a collapsar-driven jet\\nchoked in its stellar envelope, and (c) the shocked cocoon of a\\ncollapsar-driven jet choked in an extended CSM. All three models can explain\\nthe optical light curve and are also consistent with the radio and X-ray\\nobservations. We favor models (a) and (c) because they self-consistently\\nexplain both the X-ray prompt emission and first optical peak, but we do not\\nrule out model (b). From the properties of the first peak in models (a) and\\n(c), we find evidence that EP250108a/SN 2025kg interacts with an extended CSM,\\nand infer an envelope mass $M_{\\\\rm e} \\\\sim 0.1\\\\,\\\\rm M_\\\\odot$ and radius $R_{\\\\rm\\ne} \\\\sim 4 \\\\times 10^{13}$ cm. EP250108a/SN 2025kg's multi-wavelength properties\\nmake it a close analog to LLGRB 060218/SN 2006aj, and highlight the power of\\nearly follow-up observations in mapping the environments of massive stars prior\\nto core collapse.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-24T12:58:41Z\"}"}
