{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03488v1\", \"title\": \"Gamow-Teller strength and lepton captures rates on 66-71Ni in stellar\\n  matter\", \"summary\": \"Charge-changing transitions play a significant role in stellar weak-decay\\nprocesses. The fate of the massive stars is decided by these weak-decay rates\\nincluding lepton (positron and electron) captures rates, which play a\\nconsequential role in the dynamics of core collapse. As per previous simulation\\nresults, weak interaction rates on nickel isotopes have significant influence\\non the stellar core vis-$\\\\grave{a}$-vis controlling the lepton content of\\nstellar matter throughout the silicon shell burning phases of high mass stars\\nup to the presupernova stages. In this paper we perform a microscopic\\ncalculation of Gamow-Teller charge-changing transitions, in the $\\\\beta$-decay\\nand electron capture directions, for neutron-rich nickel isotopes\\n($^{66-71}$Ni). We further compute the associated weak-decay rates for these\\nselected nickel isotopes in stellar environment. The computations are\\naccomplished by employing the deformed proton-neutron quasiparticle random\\nphase approximation (pn-QRPA) model. A recent study showed that the deformed\\npn-QRPA theory is well suited for the estimation of Gamow-Teller transitions.\\nThe astral weak-decay rates are determined over densities in the range of 10 --\\n10$^{11}$g/cm$^{3}$ and temperatures in the range of 0.01$\\\\times$10$^{9}$ --\\n30$\\\\times$10$^{9}$K. The calculated lepton capture rates are compared with the\\nprevious calculation of Pruet and Fuller. The overall comparison demonstrates\\nthat, at low stellar densities and high temperatures, our electron captures\\nrates are bigger by as much as two orders of magnitude. Our results show that,\\nat higher temperatures, the lepton capture rates are the dominant mode for the\\nstellar weak rates and the corresponding lepton emission rates may be\\nneglected.\", \"main_category\": \"nucl-th\", \"categories\": \"nucl-th\", \"published\": \"2025-05-06T12:45:10Z\"}"}
