{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20872v1\", \"title\": \"FLIM-based Salient Object Detection Networks with Adaptive Decoders\", \"summary\": \"Salient Object Detection (SOD) methods can locate objects that stand out in\\nan image, assign higher values to their pixels in a saliency map, and binarize\\nthe map outputting a predicted segmentation mask. A recent tendency is to\\ninvestigate pre-trained lightweight models rather than deep neural networks in\\nSOD tasks, coping with applications under limited computational resources. In\\nthis context, we have investigated lightweight networks using a methodology\\nnamed Feature Learning from Image Markers (FLIM), which assumes that the\\nencoder's kernels can be estimated from marker pixels on discriminative regions\\nof a few representative images. This work proposes flyweight networks, hundreds\\nof times lighter than lightweight models, for SOD by combining a FLIM encoder\\nwith an adaptive decoder, whose weights are estimated for each input image by a\\ngiven heuristic function. Such FLIM networks are trained from three to four\\nrepresentative images only and without backpropagation, making the models\\nsuitable for applications under labeled data constraints as well. We study five\\nadaptive decoders; two of them are introduced here. Differently from the\\nprevious ones that rely on one neuron per pixel with shared weights, the\\nheuristic functions of the new adaptive decoders estimate the weights of each\\nneuron per pixel. We compare FLIM models with adaptive decoders for two\\nchallenging SOD tasks with three lightweight networks from the\\nstate-of-the-art, two FLIM networks with decoders trained by backpropagation,\\nand one FLIM network whose labeled markers define the decoder's weights. The\\nexperiments demonstrate the advantages of the proposed networks over the\\nbaselines, revealing the importance of further investigating such methods in\\nnew applications.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-29T15:44:02Z\"}"}
