{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03333v1\", \"title\": \"Janus bound states in the continuum in structurally symmetric photonic\\n  crystals\", \"summary\": \"We propose a sigma_z-symmetry-preserving approach to achieve Janus bound\\nstates in the continuum (Janus BICs) exhibiting asymmetric topological charges\\nin the upward and downward radiation channels. While prior approaches typically\\ninvolve explicit structural perturbations to break vertical symmetry, our\\ndesign leverages a bilayer photonic crystal slab (PCS) system with\\nindependently tunable refractive indices, introducing an optical asymmetry\\nwithout altering the geometric symmetry. In the optical symmetry case, the\\nsystem supports symmetry-protected BICs at Gamma point with topological charge\\nq = -1, and Friedrich-Wintgen BICs (FW-BICs) at off-Gamma point with q = +1.\\nUpon introducing refractive index detuning, the polarization vortex splits into\\ntwo circularly polarized states (C points) with half-integer topological charge\\n(q = 1/2), shifting oppositely in momentum space for upward and downward\\nradiation, while the symmetry-protected BICs remain unaffected. Janus BICs are\\nestablished through the shift of upward-radiating C points shift towards the\\nGamma point, accumulating a total topological charge of q = -1, while the\\ndownward-radiating counterpart contributes q = +1, leading to a net topological\\ncharge reversal between the two radiation channels. This purely optical\\nmechanism allows for the realization of Janus BICs without any structural\\ndeformation. Their asymmetric topological nature makes them ideally suited for\\napplications in unidirectional light sources, chiral photonic interfaces, and\\ntopological photonic circuits, offering a promising platform for on-chip\\noptical communication, sensing, and quantum information processing.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics,physics.comp-ph\", \"published\": \"2025-05-06T09:07:11Z\"}"}
