{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03183v1\", \"title\": \"The Physical Nature of the Off-centered Extended Emission Associated\\n  with the Little Red Dots\", \"summary\": \"A significant fraction of little red dots (LRDs) exhibit nearby extended\\nemission of unknown origin. If physically associated with the LRD, this\\ncomponent may trace stellar emission from an off-centered host galaxy,\\nneighboring companions, or nebular gas illuminated by the active nucleus. We\\ninvestigate the detailed spectral energy distribution of the extended emission\\nnear four LRDs in the JWST UNCOVER and MegaScience surveys. We accurately\\ndecompose the extended emission from the dominant point source by\\nsimultaneously fitting the images in eight broad-band and nine medium-band\\nfilters. After considering both the results from photometric redshift fitting\\nand the probability of galaxies at different redshift overlapping, we confirm\\nthat the off-centered blobs in three sources are physically associated with the\\nLRDs, with two of them showing strong [\\\\ion{O}{3}] $\\\\lambda\\\\lambda 4959,\\\\,5007$\\nemission captured by the medium-band filters. While the spectral energy\\ndistributions of all three blobs can be modeled assuming star-forming galaxies\\nwith stellar mass $\\\\sim 10^8\\\\,M_{\\\\odot}$, the exceptionally strong [\\\\ion{O}{3}]\\nemission of two sources is best interpreted as pure nebular emission from\\nlow-density ($n<10\\\\, {\\\\rm cm}^{-3}$), low-metallicity ($Z\\\\approx\\n0.05\\\\,Z_{\\\\odot}$) gas photoionized by the ultraviolet radiation from the nearby\\nLRD. Adopting LRD halo masses constrained by clustering measurements and\\ntheoretical considerations, we estimate a typical baryonic halo mass accretion\\nrate of $\\\\sim 2-9\\\\, M_{\\\\odot}\\\\,{\\\\rm yr}^{-1}$. If the halo accretion rate is\\nsustained to $z=4$ and stars form with an efficiency of 10\\\\%, the accreted gas\\nwould form a galaxy with stellar mass $\\\\sim 10^9\\\\,M_{\\\\odot}$, potentially\\nrendering them spatially resolved at lower redshift.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-05-06T04:59:23Z\"}"}
