{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04411v1\", \"title\": \"Turbulence spreading and anomalous diffusion on combs\", \"summary\": \"This paper presents a simple model for such processes as chaos spreading or\\nturbulence spillover into stable regions. In this simple model the essential\\ntransport occurs via inelastic resonant interactions of waves on a lattice. The\\nprocess is shown to result universally in a subdiffusive spreading of the wave\\nfield. The dispersion of this spreading process is found to depend exclusively\\non the type of the interaction process (three- or four-wave), but not on a\\nparticular instability behind. The asymptotic transport equations for field\\nspreading are derived with the aid of a specific geometric construction in the\\nform of a comb. The results can be summarized by stating that the asymptotic\\nspreading pursues as a continuous-time random walk (CTRW) and corresponds to a\\nkinetic description in terms of fractional-derivative equations. The fractional\\nindexes pertaining to these equations are obtained exactly using the comb\\nmodel. A special case of the above theory is a situation when two waves with\\noppositely directed wave vectors couple together to form a bound state with\\nzero momentum. This situation is considered separately and associated with the\\nself-organization of wave-like turbulence into banded flows or staircases.\\nOverall, we find that turbulence spreading and staircasing could be described\\nbased on the same mathematical formalism, using the Hamiltonian of inelastic\\nwave-wave interactions and a mapping procedure into the comb space.\\nTheoretically, the comb approach is regarded as a substitute for a more common\\ndescription based on quasilinear theory. Some implications of the present\\ntheory for the fusion plasma studies are discussed and a comparison with the\\navailable observational and numerical evidence is given.\", \"main_category\": \"nlin.CD\", \"categories\": \"nlin.CD\", \"published\": \"2025-05-07T13:47:03Z\"}"}
