{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13039v1\", \"title\": \"Evidence for sulfur chemistry in the atmosphere of the warm sub-Neptune\\n  TOI-270 d\", \"summary\": \"Context: Recent JWST measurements allow access to the near-infrared spectrum\\nof the sub-Neptune TOI-270 d, for which two different interpretations, a\\nhigh-metallicity miscible envelope and a lower metallicity hycean world, are\\ncurrently in conflict. Aims: Here, we reanalyze the published data and\\nreproduce previously retrieved molecular abundances based on an independent\\ndata reduction and a different retrieval framework. The aim of this study is to\\nrefine the understanding of TOI-270 d and highlight considerations for JWST\\ndata analysis. Additionally, we test the impact of data resolution on\\natmospheric retrieval calculations. Methods: We reduce one JWST NIRSpec G395H\\nand one NIRISS SOSS GR700XD transit dataset using the Eureka! pipeline and a\\ncustom MCMC-based light curve fitting algorithm at the instruments' native\\nresolutions. The atmospheric composition is estimated with the updated BeAR\\nretrieval code across a grid of retrieval setups and spectral resolutions.\\nResults: Our transit spectrum is consistent with previous studies, except at\\nthe red end of the NIRISS data. Our retrievals support a higher mean molecular\\nweight atmosphere for TOI-270 d. We provide refined abundance constraints and\\nfind statistically favored model extensions indicating either sulfur-rich\\nchemistry with species such as CS2, CS, and H2CS, or the possible presence of\\nCH3Cl or CH3F. However, Bayesian inference cannot distinguish between these\\nscenarios due to similar opacities below 4 microns. Conclusions: Our analysis\\nreinforces TOI-270 d as a highly interesting warm sub-Neptune for atmospheric\\nstudies, with a complex chemistry in a cloud-free upper atmosphere. However,\\nits exact nature remains uncertain and warrants further detailed photochemical\\nmodeling and observations.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-17T15:52:23Z\"}"}
