{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12009v1\", \"title\": \"Network-Centric Countermeasures Against Integrated Sensing Enabled\\n  Jamming Adversaries\", \"summary\": \"Recent developments in Integrated Sensing and Communication have led to new\\nadversarial models in wireless security through Integrated Sensing and Jamming\\n(ISAJ) adversaries. ISAJ adversaries, owing to their sensing capabilities, are\\nknown to inject jamming energy over the victim's frequency band, and also use\\ngeneralized energy measurements on various network frequencies to detect the\\npresence of countermeasures. Existing countermeasures against such ISAJ\\nadversaries are laid under the assumption that the adversary does not have the\\nknowledge of the countermeasure. However, according to Kerchoffs' principle in\\ncryptography, security of a countermeasure should only rely on the secret-keys,\\nnot on the obfuscation of the countermeasure. On testing the security of\\nexisting countermeasures, we observe that they violate Kerchoffs' principle,\\nthus motivating the need for new countermeasures. In this regard, we propose a\\nnovel network-centric countermeasure against ISAJ adversaries, wherein a group\\nof users in the network assist the victim to reliably communicate her messages\\nin a covert manner. Firstly, we analyse the error performance of the proposed\\ncountermeasure, and study its behavior on the number of assisting users in the\\nnetwork. Subsequently, to validate its security against Kerchoffs' principle,\\nwe study the Shannon's entropy associated with the presence of the victim's\\nmessages in the network and analyse its behaviour as a function of the number\\nof assisting users. Finally, to study the interplay between reliability and\\ncovertness, we pose interesting optimization problems and solve them to choose\\nthe underlying parameters of the countermeasure and the number of assisting\\nusers.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-04-16T12:05:30Z\"}"}
