{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10948v1\", \"title\": \"BEACON: A Benchmark for Efficient and Accurate Counting of Subgraphs\", \"summary\": \"Subgraph counting the task of determining the number of instances of a query\\npattern within a large graph lies at the heart of many critical applications,\\nfrom analyzing financial networks and transportation systems to understanding\\nbiological interactions. Despite decades of work yielding efficient algorithmic\\n(AL) solutions and, more recently, machine learning (ML) approaches, a clear\\ncomparative understanding is elusive. This gap stems from the absence of a\\nunified evaluation framework, standardized datasets, and accessible ground\\ntruths, all of which hinder systematic analysis and fair benchmarking. To\\novercome these barriers, we introduce BEACON: a comprehensive benchmark\\ndesigned to rigorously evaluate both AL and ML-based subgraph counting methods.\\nBEACON provides a standardized dataset with verified ground truths, an\\nintegrated evaluation environment, and a public leaderboard, enabling\\nreproducible and transparent comparisons across diverse approaches. Our\\nextensive experiments reveal that while AL methods excel in efficiently\\ncounting subgraphs on very large graphs, they struggle with complex patterns\\n(e.g., those exceeding six nodes). In contrast, ML methods are capable of\\nhandling larger patterns but demand massive graph data inputs and often yield\\nsuboptimal accuracy on small, dense graphs. These insights not only highlight\\nthe unique strengths and limitations of each approach but also pave the way for\\nfuture advancements in subgraph counting techniques. Overall, BEACON represents\\na significant step towards unifying and accelerating research in subgraph\\ncounting, encouraging innovative solutions and fostering a deeper understanding\\nof the trade-offs between algorithmic and machine learning paradigms.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS,cs.AI,cs.DB,cs.SI\", \"published\": \"2025-04-15T07:53:47Z\"}"}
