{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17234v1\", \"title\": \"Scene Perceived Image Perceptual Score (SPIPS): combining global and\\n  local perception for image quality assessment\", \"summary\": \"The rapid advancement of artificial intelligence and widespread use of\\nsmartphones have resulted in an exponential growth of image data, both real\\n(camera-captured) and virtual (AI-generated). This surge underscores the\\ncritical need for robust image quality assessment (IQA) methods that accurately\\nreflect human visual perception. Traditional IQA techniques primarily rely on\\nspatial features - such as signal-to-noise ratio, local structural distortions,\\nand texture inconsistencies - to identify artifacts. While effective for\\nunprocessed or conventionally altered images, these methods fall short in the\\ncontext of modern image post-processing powered by deep neural networks (DNNs).\\nThe rise of DNN-based models for image generation, enhancement, and restoration\\nhas significantly improved visual quality, yet made accurate assessment\\nincreasingly complex. To address this, we propose a novel IQA approach that\\nbridges the gap between deep learning methods and human perception. Our model\\ndisentangles deep features into high-level semantic information and low-level\\nperceptual details, treating each stream separately. These features are then\\ncombined with conventional IQA metrics to provide a more comprehensive\\nevaluation framework. This hybrid design enables the model to assess both\\nglobal context and intricate image details, better reflecting the human visual\\nprocess, which first interprets overall structure before attending to\\nfine-grained elements. The final stage employs a multilayer perceptron (MLP) to\\nmap the integrated features into a concise quality score. Experimental results\\ndemonstrate that our method achieves improved consistency with human perceptual\\njudgments compared to existing IQA models.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-24T04:06:07Z\"}"}
