{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11218v1\", \"title\": \"3DAffordSplat: Efficient Affordance Reasoning with 3D Gaussians\", \"summary\": \"3D affordance reasoning is essential in associating human instructions with\\nthe functional regions of 3D objects, facilitating precise, task-oriented\\nmanipulations in embodied AI. However, current methods, which predominantly\\ndepend on sparse 3D point clouds, exhibit limited generalizability and\\nrobustness due to their sensitivity to coordinate variations and the inherent\\nsparsity of the data. By contrast, 3D Gaussian Splatting (3DGS) delivers\\nhigh-fidelity, real-time rendering with minimal computational overhead by\\nrepresenting scenes as dense, continuous distributions. This positions 3DGS as\\na highly effective approach for capturing fine-grained affordance details and\\nimproving recognition accuracy. Nevertheless, its full potential remains\\nlargely untapped due to the absence of large-scale, 3DGS-specific affordance\\ndatasets. To overcome these limitations, we present 3DAffordSplat, the first\\nlarge-scale, multi-modal dataset tailored for 3DGS-based affordance reasoning.\\nThis dataset includes 23,677 Gaussian instances, 8,354 point cloud instances,\\nand 6,631 manually annotated affordance labels, encompassing 21 object\\ncategories and 18 affordance types. Building upon this dataset, we introduce\\nAffordSplatNet, a novel model specifically designed for affordance reasoning\\nusing 3DGS representations. AffordSplatNet features an innovative cross-modal\\nstructure alignment module that exploits structural consistency priors to align\\n3D point cloud and 3DGS representations, resulting in enhanced affordance\\nrecognition accuracy. Extensive experiments demonstrate that the 3DAffordSplat\\ndataset significantly advances affordance learning within the 3DGS domain,\\nwhile AffordSplatNet consistently outperforms existing methods across both seen\\nand unseen settings, highlighting its robust generalization capabilities.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-15T14:21:47Z\"}"}
