{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02596v1\", \"title\": \"Cosmic ray ionisation of a post-impact early Earth atmosphere: Solar\\n  cosmic ray ionisation must be considered in origin-of-life scenarios\", \"summary\": \"Cosmic rays (CR), both solar and Galactic, have an ionising effect on the\\nEarth's atmosphere and are thought to be important for prebiotic molecule\\nproduction. In particular, the $\\\\rm{H_2}$-dominated atmosphere following an\\nocean-vaporising impact is considered favourable to prebiotic molecule\\nformation. We model solar and Galactic CR transport through a post-impact early\\nEarth atmosphere at 200Myr. We aim to identify the differences in the resulting\\nionisation rates, $\\\\zeta$, particularly at the Earth's surface during a period\\nwhen the Sun was very active. We use a Monte Carlo model to describe CR\\ntransport through the early Earth atmosphere, giving the CR spectra as a\\nfunction of altitude. We calculate $\\\\zeta$ and the ion-pair production rate,\\n$Q$, as a function of altitude due to Galactic and solar CR. The Galactic and\\nsolar CR spectra are both affected by the Sun's rotation rate, $\\\\Omega$,\\nbecause the solar wind velocity and magnetic field strength both depend on\\n$\\\\Omega$ and influence CR transport. We consider a range of input spectra\\nresulting from the range of possible $\\\\Omega$, from $3.5-15\\\\,\\n\\\\Omega_{\\\\rm{\\\\odot}}$. To account for the possibility that the Galactic CR\\nspectrum outside the Solar System varies over Gyr timescales, we compare\\ntop-of-atmosphere $\\\\zeta$ resulting from two different scenarios. We also\\nconsider the suppression of the CR spectra by a planetary magnetic field. We\\nfind that $\\\\zeta$ and $Q$ due to CR are dominated by solar CR in the early\\nEarth atmosphere for most cases. The corresponding $\\\\zeta$ at the early Earth's\\nsurface ranges from $5 \\\\times 10^{-21}\\\\rm{s^{-1}}$ for $\\\\Omega =\\n3.5\\\\,\\\\Omega_{\\\\rm{\\\\odot}}$ to $1 \\\\times 10^{-16}\\\\rm{s^{-1}}$ for $\\\\Omega =\\n15\\\\,\\\\Omega_{\\\\rm{\\\\odot}}$. Thus if the young Sun was a fast rotator, it is\\nlikely that solar CR had a significant effect on the chemistry at the Earth's\\nsurface at the time when life is likely to have formed.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,astro-ph.SR,physics.space-ph\", \"published\": \"2025-04-03T13:59:09Z\"}"}
