{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00522v1\", \"title\": \"Discovery of a physically interpretable data-driven wind-turbine wake\\n  model\", \"summary\": \"This study presents a compact data-driven Reynolds-averaged Navier-Stokes\\n(RANS) model for wind turbine wake prediction, built as an enhancement of the\\nstandard $k$-$\\\\varepsilon$ formulation. Several candidate models were\\ndiscovered using the symbolic regression framework Sparse Regression of\\nTurbulent Stress Anisotropy (SpaRTA), trained on a single Large Eddy Simulation\\n(LES) dataset of a standalone wind turbine. The leading model was selected by\\nprioritizing simplicity while maintaining reasonable accuracy, resulting in a\\nnovel linear eddy viscosity model. This selected leading model reduces eddy\\nviscosity in high-shear regions$\\\\unicode{x2014}$particularly in the\\nwake$\\\\unicode{x2014}$to limit turbulence mixing and delay wake recovery. This\\naddresses a common shortcoming of the standard $k$-$\\\\varepsilon$ model, which\\ntends to overpredict mixing, leading to unrealistically fast wake recovery.\\nMoreover, the formulation of the leading model closely resembles that of the\\nestablished $k$-$\\\\varepsilon$-$f_P$ model. Consistent with this resemblance,\\nthe leading and $k$-$\\\\varepsilon$-$f_P$ models show nearly identical\\nperformance in predicting velocity fields and power output, but they differ in\\ntheir predictions of turbulent kinetic energy. In addition, the generalization\\ncapability of the leading model was assessed using three unseen six-turbine\\nconfigurations with varying spacing and alignment. Despite being trained solely\\non a standalone turbine case, the model produced results comparable to LES\\ndata. These findings demonstrate that data-driven methods can yield\\ninterpretable, physically consistent RANS models that are competitive with\\ntraditional modeling approaches while maintaining simplicity and achieving\\ngeneralizability.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-05-01T13:44:38Z\"}"}
