{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01676v1\", \"title\": \"Satellite Edge Artificial Intelligence with Large Models: Architectures\\n  and Technologies\", \"summary\": \"Driven by the growing demand for intelligent remote sensing applications,\\nlarge artificial intelligence (AI) models pre-trained on large-scale unlabeled\\ndatasets and fine-tuned for downstream tasks have significantly improved\\nlearning performance for various downstream tasks due to their generalization\\ncapabilities. However, many specific downstream tasks, such as extreme weather\\nnowcasting (e.g., downburst and tornado), disaster monitoring, and battlefield\\nsurveillance, require real-time data processing. Traditional methods via\\ntransferring raw data to ground stations for processing often cause significant\\nissues in terms of latency and trustworthiness. To address these challenges,\\nsatellite edge AI provides a paradigm shift from ground-based to on-board data\\nprocessing by leveraging the integrated communication-and-computation\\ncapabilities in space computing power networks (Space-CPN), thereby enhancing\\nthe timeliness, effectiveness, and trustworthiness for remote sensing\\ndownstream tasks. Moreover, satellite edge large AI model (LAM) involves both\\nthe training (i.e., fine-tuning) and inference phases, where a key challenge\\nlies in developing computation task decomposition principles to support\\nscalable LAM deployment in resource-constrained space networks with\\ntime-varying topologies. In this article, we first propose a satellite\\nfederated fine-tuning architecture to split and deploy the modules of LAM over\\nspace and ground networks for efficient LAM fine-tuning. We then introduce a\\nmicroservice-empowered satellite edge LAM inference architecture that\\nvirtualizes LAM components into lightweight microservices tailored for\\nmulti-task multimodal inference. Finally, we discuss the future directions for\\nenhancing the efficiency and scalability of satellite edge LAM, including\\ntask-oriented communication, brain-inspired computing, and satellite edge AI\\nnetwork optimization.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.DC,cs.NI,eess.SP\", \"published\": \"2025-04-02T12:25:57Z\"}"}
