{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10153v1\", \"title\": \"Searching for quasi-periodicities in short transients: the curious case\\n  of GRB 230307A\", \"summary\": \"Gamma-ray bursts (GRBs) are the most powerful explosions in the Universe;\\ntheir energy release reache s us from the end of the re-ionization era, making\\nthem invaluable cosmological probes. GRB 230307A i s the second-brightest GRB\\never observed in the 56 years of observations since the discovery of the\\nphenomenon in 1967. Follow-up observations of the event at longer wavelengths\\nrevealed a lanthanide-ri ch kilonova with long-lasting X-ray emission\\nimmediately following the prompt gamma-rays. Moreover, t he gamma-ray light\\ncurve of GRB 230307A collected with INTEGRAL's SPectrometer of INTEGRAL\\nAntiCoincidence Shield (SPI-ACS) and Fermi's Gamma-Ray Burst Monitor (GBM). We\\nuse Fourier analysis, wavelets and Gaussian Processes to search for periodic\\nand quasi-periodic oscillations (QPOs) in the prompt gamma-ray emission of GRB\\n230307A. We critically assess all three methods in terms of their robustness\\nfor detections of QPOs in fast transients such as GRBs. Our analyses reveal\\nQPOs at a frequency of $\\\\sim 1.2$ Hz (0.82s period) near the burst's peak\\nemission phase, consistent across instruments and detection methods. We also\\nidentify a second, less significant QPO at $\\\\sim 2.9$ Hz (0.34s) nearly\\nsimultaneously. We hypothesise that the two QPOs originate from the transition\\nepoch at the end of the jet acceleration phase. These QPOs re present plasma\\ncirculation periods in vorticity about the jet axis carried outwards to the\\nprompt radiation zone at much larger radii. They are sampled by colliding\\nstructures (e.g., shocks) in the spinning jet, possibly marking the evolution\\nof plasma rotation during the final stages of the progenitor neutron star\\ncoalescence event.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-14T12:07:18Z\"}"}
