{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16898v1\", \"title\": \"Texture: Structured Exploration of Text Datasets\", \"summary\": \"Exploratory analysis of a text corpus is essential for assessing data quality\\nand developing meaningful hypotheses. Text analysis relies on understanding\\ndocuments through structured attributes spanning various granularities of the\\ndocuments such as words, phrases, sentences, topics, or clusters. However,\\ncurrent text visualization tools typically adopt a fixed representation\\ntailored to specific tasks or domains, requiring users to switch tools as their\\nanalytical goals change. To address this limitation, we present Texture, a\\ngeneral-purpose interactive text exploration tool. Texture introduces a\\nconfigurable data schema for representing text documents enriched with\\ndescriptive attributes. These attributes can appear at arbitrary levels of\\ngranularity in the text and possibly have multiple values, including\\ndocument-level attributes, multi-valued attributes (e.g., topics), fine-grained\\nspan-level attributes (e.g., words), and vector embeddings. The system then\\ncombines existing interactive methods for text exploration into a single\\ninterface that provides attribute overview visualizations, supports\\ncross-filtering attribute charts to explore subsets, uses embeddings for a\\ndataset overview and similar instance search, and contextualizes filters in the\\nactual documents. We evaluated Texture through a two-part user study with 10\\nparticipants from varied domains who each analyzed their own dataset in a\\nbaseline session and then with Texture. Texture was able to represent all of\\nthe previously derived dataset attributes, enabled participants to more quickly\\niterate during their exploratory analysis, and discover new insights about\\ntheir data. Our findings contribute to the design of scalable, interactive, and\\nflexible exploration systems that improve users' ability to make sense of text\\ndata.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-23T17:26:25Z\"}"}
