{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05928v1\", \"title\": \"Evaluation of the impact of expert knowledge: How decision support\\n  scores impact the effectiveness of automatic knowledge-driven feature\\n  engineering (aKDFE)\", \"summary\": \"Adverse Drug Events (ADEs), harmful medication effects, pose significant\\nhealthcare challenges, impacting patient safety and costs. This study evaluates\\nautomatic Knowledge-Driven Feature Engineering (aKDFE) for improved ADE\\nprediction from Electronic Health Record (EHR) data, comparing it with\\nautomated event-based Knowledge Discovery in Databases (KDD). We investigated\\nhow incorporating domain-specific ADE risk scores for prolonged heart QT\\ninterval, extracted from the Janusmed Riskprofile (Janusmed) Clinical Decision\\nSupport System (CDSS), affects prediction performance using EHR data and\\nmedication handling events. Results indicate that, while aKDFE step 1\\n(event-based feature generation) alone did not significantly improve ADE\\nprediction performance, aKDFE step 2 (patient-centric transformation) enhances\\nthe prediction performance. High Area Under the Receiver Operating\\nCharacteristic curve (AUROC) values suggest strong feature correlations to the\\noutcome, aligning with the predictive power of patients' prior healthcare\\nhistory for ADEs. Statistical analysis did not confirm that incorporating the\\nJanusmed information (i) risk scores and (ii) medication route of\\nadministration into the model's feature set enhanced predictive performance.\\nHowever, the patient-centric transformation applied by aKDFE proved to be a\\nhighly effective feature engineering approach. Limitations include a\\nsingle-project focus, potential bias from machine learning pipeline methods,\\nand reliance on AUROC. In conclusion, aKDFE, particularly with patient-centric\\ntransformation, improves ADE prediction from EHR data. Future work will explore\\nattention-based models, event feature sequences, and automatic methods for\\nincorporating domain knowledge into the aKDFE framework.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,I.2.6\", \"published\": \"2025-04-08T11:34:38Z\"}"}
