{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15848v1\", \"title\": \"Exploring Cognitive and Aesthetic Causality for Multimodal Aspect-Based\\n  Sentiment Analysis\", \"summary\": \"Multimodal aspect-based sentiment classification (MASC) is an emerging task\\ndue to an increase in user-generated multimodal content on social platforms,\\naimed at predicting sentiment polarity toward specific aspect targets (i.e.,\\nentities or attributes explicitly mentioned in text-image pairs). Despite\\nextensive efforts and significant achievements in existing MASC, substantial\\ngaps remain in understanding fine-grained visual content and the cognitive\\nrationales derived from semantic content and impressions (cognitive\\ninterpretations of emotions evoked by image content). In this study, we present\\nChimera: a cognitive and aesthetic sentiment causality understanding framework\\nto derive fine-grained holistic features of aspects and infer the fundamental\\ndrivers of sentiment expression from both semantic perspectives and\\naffective-cognitive resonance (the synergistic effect between emotional\\nresponses and cognitive interpretations). Specifically, this framework first\\nincorporates visual patch features for patch-word alignment. Meanwhile, it\\nextracts coarse-grained visual features (e.g., overall image representation)\\nand fine-grained visual regions (e.g., aspect-related regions) and translates\\nthem into corresponding textual descriptions (e.g., facial, aesthetic).\\nFinally, we leverage the sentimental causes and impressions generated by a\\nlarge language model (LLM) to enhance the model's awareness of sentimental cues\\nevoked by semantic content and affective-cognitive resonance. Experimental\\nresults on standard MASC datasets demonstrate the effectiveness of the proposed\\nmodel, which also exhibits greater flexibility to MASC compared to LLMs such as\\nGPT-4o. We have publicly released the complete implementation and dataset at\\nhttps://github.com/Xillv/Chimera\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-04-22T12:43:37Z\"}"}
