{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21676v1\", \"title\": \"Superstring amplitudes meet surfaceology\", \"summary\": \"We reformulate tree-level amplitudes in open superstring theory (type-I) in\\nterms of stringy Tr$(\\\\phi^3)$ amplitudes with various kinematical shifts in the\\n\\\"curve-integral\\\" formulation: while the bosonic-string amplitude with $n$ pairs\\nof \\\"scaffolding\\\" scalars comes from a particularly simple shift of the\\nTr$(\\\\phi^3)$ one (corresponding to $n$ length-$2$ cycles), the analogous\\nsuperstring amplitude requires \\\"correction\\\" terms given by bosonic-string\\namplitudes with longer, even-length \\\"cycles\\\", which are also Tr$(\\\\phi^3)$ ones\\nat shifted kinematics dictated by the cycles; in total it is expressed as a sum\\nof $(2n{-}3)!!$ shifted amplitudes originated from the expansion of a reduced\\nPfaffian. Upon taking $n$ scaffolding residues, this leads to a new formula of\\nthe $n$-gluon superstring amplitude, which is manifestly symmetric in $n{-}1$\\nlegs, as a gauge-invariant combination of mixed bosonic string amplitudes with\\ngluons and scalars, which come from length-$2$ cycles and longer ones\\nrespectively (the total sum is associated with the expansion a $n\\\\times n$\\nsymmetrical determinant); the corresponding prefactors are nested commutators\\nof $2n$-gon kinematical variables, which nicely become traces of\\nfield-strengths for those legs corresponding to scalars in the mixed\\namplitudes. These interesting linear combinations of bosonic string amplitudes\\nmust guarantee the cancellation of tachyon poles and $F^3$ vertices ${\\\\it\\netc.}$, and they give new relations between the superstring amplitude and its\\nbosonic-string building blocks to all orders in the $\\\\alpha'$ expansion (the\\nfirst order gives a new formula for gluon amplitudes with a single $F^3$\\ninsertion in terms of Yang-Mills-scalar amplitudes). We provide both the\\nworldsheet and \\\"curve-integral\\\" derivations, and discuss applications to\\nheterotic and type II cases.\", \"main_category\": \"hep-th\", \"categories\": \"hep-th\", \"published\": \"2025-04-30T14:16:01Z\"}"}
