{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19879v1\", \"title\": \"Warming demands extensive tropical but minimal temperate management in\\n  plant-pollinator networks\", \"summary\": \"Anthropogenic warming impacts ecological communities and disturbs species\\ninteractions, particularly in temperature sensitive plant pollinator networks.\\nWhile previous assessments indicate that rising mean temperatures and shifting\\ntemporal variability universally elevate pollinator extinction risk, many\\nstudies often overlook how plant-pollinator networks of different ecoregions\\nrequire distinct management approaches. Here, we integrate monthly near-surface\\ntemperature projections from various Shared Socioeconomic Pathways of CMIP6\\nEarth System Models with region-specific thermal performance parameters to\\nsimulate population dynamics in 11 plant pollinator networks across tropical,\\ntemperate, and Mediterranean ecosystems. Our results show that tropical\\nnetworks, already near their thermal limits, face pronounced (50 percent)\\npollinator declines under high-emissions scenarios (SSP5-8.5). Multi-species\\nmanagement targeting keystone plants emerges as a critical strategy for\\nstabilizing these high risk tropical systems, boosting both pollinator\\nabundance and evenness. In contrast, temperate networks remain well below\\ncritical temperature thresholds, with minimal (5 percent) pollinator declines\\nand negligible gains from any intensive management strategy. These findings\\nchallenge single-species models and uniform-parameter frameworks, which\\nconsistently underestimate tropical vulnerability while overestimating\\ntemperate risk. We demonstrate that explicitly incorporating complex network\\ninteractions, region-specific thermal tolerances, and targeted multi species\\ninterventions is vital for maintaining pollination services. By revealing when\\nand where limited interventions suffice versus extensive management becomes\\nindispensable, our study provides a clear blueprint for adaptive, ecosystem\\nspecific management under accelerating climate change.\", \"main_category\": \"q-bio.PE\", \"categories\": \"q-bio.PE\", \"published\": \"2025-04-28T15:09:30Z\"}"}
