{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20861v1\", \"title\": \"Simulating Heterogeneity within Elastic and Inelastic Discrete\\n  Mechanical Models\", \"summary\": \"The study investigates the elastic and fracture behaviors of discrete,\\nelastically homogeneous models of heterogeneous media. The homogeneity is\\naccomplished either by volumetric-deviatoric decomposition of constitutive\\nfunction or by an auxiliary stress homogenization method. The elastic\\nparameters of the homogenized material models are randomly varied in space to\\nintroduce heterogeneity independently of the geometric properties of the\\ndiscrete model. Several forms of randomization are investigated using\\nstatistical properties of nodal stress oscillations in periodic representative\\nvolume elements (RVEs). It is found that the stress oscillations present in\\ndiscrete models built on heterogeneous geometric structures with standard\\nconstitutive models cannot be replicated by randomization of the elastically\\nhomogeneous discrete system. The marginal distributions as well as dependencies\\nbetween stress tensor components cannot be adequately matched.\\n  With respect to quasi-brittle fracture behavior, the macroscopic response of\\nthe different models is studied for the load case of uniaxial tension. The\\nelastically homogenized material provides higher peak stress occurring at lower\\nstrain levels and a steeper softening phase, compared to the standard material.\\nRandomization of the elastic material parameters, as well as adjustment of\\ninelastic material parameters, brings the macroscopic response of the\\nhomogenized material close to that of the standard material, although the\\ndamage distribution prior to the strain localization differs. These findings\\nprovide insight into the potential for controlled, random assignment of\\nheterogeneity in homogeneous models, using physically-based discretizations of\\nmaterial structure with standard constitutive models for comparison.\", \"main_category\": \"cs.CE\", \"categories\": \"cs.CE,cond-mat.dis-nn,cond-mat.mtrl-sci\", \"published\": \"2025-04-29T15:37:27Z\"}"}
