{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05255v1\", \"title\": \"A new paradigm for computing hydrodynamic forces on particles in\\n  Euler-Lagrange point-particle simulations\", \"summary\": \"Accurate prediction of the hydrodynamic forces on particles is central to the\\nfidelity of Euler-Lagrange (EL) simulations of particle-laden flows.\\nTraditional EL methods typically rely on determining the hydrodynamic forces at\\nthe positions of the individual particles from the interpolated fluid velocity\\nfield, and feed these hydrodynamic forces back to the location of the\\nparticles. This approach can introduce significant errors in two-way coupled\\nsimulations, especially when the particle diameter is not much smaller than the\\ncomputational grid spacing. In this study, we propose a novel force correlation\\nframework that circumvents the need for undisturbed velocity estimation by\\nleveraging volume-filtered quantities available directly from EL simulations.\\nThrough a rigorous analytical derivation in the Stokes regime and extensive\\nparticle-resolved direct numerical simulations (PR-DNS) at finite Reynolds\\nnumbers, we formulate force correlations that depend solely on the\\nvolume-filtered fluid velocity and local volume fraction, parametrized by the\\nfilter width. These correlations are shown to recover known drag laws in the\\nappropriate asymptotic limits and exhibit a good agreement with analytical and\\nhigh-fidelity numerical benchmarks for single particle cases, and, compared to\\nexisting correlations, an improved agreement for the drag force on particles in\\nparticle assemblies. The proposed framework significantly enhances the accuracy\\nof hydrodynamic force predictions for both isolated particles and dense\\nsuspensions, without incurring the prohibitive computational costs associated\\nwith reconstructing undisturbed flow fields. This advancement lays the\\nfoundation for robust, scalable, and high-fidelity EL simulations of complex\\nparticulate flows across a wide range of industrial and environmental\\napplications.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn,physics.comp-ph\", \"published\": \"2025-05-08T14:03:58Z\"}"}
