{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06613v1\", \"title\": \"Deep Extragalactic VIsible Legacy Survey (DEVILS): New robust merger\\n  rates at intermediate redshifts\", \"summary\": \"Mergers are fundamental to our understanding of the processes driving the\\nevolution of the structure and morphology of galaxies, star formation, AGN\\nactivity, and the redistribution of stellar mass in the Universe. Determining\\nthe fraction and properties of mergers across cosmic time is critical to\\nunderstanding the formation of the Universe we observe today. This fraction and\\nits evolution also provide inputs and constraints for cosmological simulations,\\ncrucial for theoretical models of galaxy evolution. We present robust estimates\\nof major close-pair fractions and merger rates at $0.2 < z < 0.9$ in the Deep\\nExtragalactic VIsible Legacy Survey (DEVILS). We identify major mergers by\\nselecting close-pairs with a projected spatial separation $r_{\\\\mathrm{sep}} <\\n20$ h$^{-1}$ kpc and a radial velocity separation $v_{\\\\mathrm{sep}} < 500$ km\\ns$^{-1}$. For galaxies with stellar masses of log$_{10}$($M_\\\\star$/$M_\\\\odot$) =\\n10.66 $\\\\pm$ 0.25 dex, we find a major close-pair fraction of $\\\\approx 0.021$ at\\n$0.2 < z < 0.34$ using a highly complete, unbiased spectroscopic sample. We\\nextend these estimates to $0.2 < z < 0.9$ by combining the full probability\\ndistribution of redshifts for galaxies with high-quality spectroscopic,\\nphotometric, or grism measurements. Fitting a power-law $\\\\gamma_{m} = A(1 +\\nz)^m$, we find $A = 0.024 \\\\pm 0.001$ and $m = 0.55 \\\\pm 0.22$. Consistent with\\nprevious results, the shallow slope suggests weak redshift evolution in the\\nmerger fraction. When comparing with large hydrodynamical simulations, we also\\nfind consistent results. We convert close-pair fractions to merger rates using\\nseveral literature prescriptions for merger timescales and provide all\\nmeasurements for future studies.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-09T06:18:19Z\"}"}
