{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14824v1\", \"title\": \"An Enhanced Dual-Currency VCG Auction Mechanism for Resource Allocation\\n  in IoV: A Value of Information Perspective\", \"summary\": \"The Internet of Vehicles (IoV) is undergoing a transformative evolution,\\nenabled by advancements in future 6G network technologies, to support\\nintelligent, highly reliable, and low-latency vehicular services. However, the\\nenhanced capabilities of loV have heightened the demands for efficient network\\nresource allocation while simultaneously giving rise to diverse vehicular\\nservice requirements. For network service providers (NSPs), meeting the\\ncustomized resource-slicing requirements of vehicle service providers (VSPs)\\nwhile maximizing social welfare has become a significant challenge. This paper\\nproposes an innovative solution by integrating a mean-field multi-agent\\nreinforcement learning (MFMARL) framework with an enhanced\\nVickrey-Clarke-Groves (VCG) auction mechanism to address the problem of social\\nwelfare maximization under the condition of unknown VSP utility functions. The\\ncore of this solution is introducing the ``value of information\\\" as a novel\\nmonetary metric to estimate the expected benefits of VSPs, thereby ensuring the\\neffective execution of the VCG auction mechanism. MFMARL is employed to\\noptimize resource allocation for social welfare maximization while adapting to\\nthe intelligent and dynamic requirements of IoV. The proposed enhanced VCG\\nauction mechanism not only protects the privacy of VSPs but also reduces the\\nlikelihood of collusion among VSPs, and it is theoretically proven to be\\ndominant-strategy incentive compatible (DSIC). The simulation results\\ndemonstrate that, compared to the VCG mechanism implemented using quantization\\nmethods, the proposed mechanism exhibits significant advantages in convergence\\nspeed, social welfare maximization, and resistance to collusion, providing new\\ninsights into resource allocation in intelligent 6G networks.\", \"main_category\": \"cs.GT\", \"categories\": \"cs.GT\", \"published\": \"2025-04-21T03:00:04Z\"}"}
