{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21354v1\", \"title\": \"Three-Stage Composite Outlier Identification of Wind Power Data:\\n  Integrating Physical Rules with Regression Learning and Mathematical\\n  Morphology\", \"summary\": \"Existing studies on identifying outliers in wind speed-power datasets are\\noften challenged by the complicated and irregular distributions of outliers,\\nespecially those being densely stacked yet staying close to normal data. This\\ncould degrade their identification reliability and robustness in practice. To\\naddress this defect, this paper develops a three-stage composite outlier\\nidentification method by systematically integrating three complementary\\ntechniques, i.e., physical rule-based preprocessing, regression\\nlearning-enabled detection, and mathematical morphology-based refinement.\\nFirstly, the raw wind speed-power data are preprocessed via a set of simple yet\\nefficient physical rules to filter out some outliers obviously going against\\nthe physical operating laws of practical wind turbines. Secondly, a robust wind\\nspeed-power regression learning model is built upon the random sample consensus\\nalgorithm. This model is able to reliably detect most outliers with the help of\\nan adaptive threshold automatically set by the interquartile range method.\\nThirdly, by representing the wind speed-power data distribution with a\\ntwo-dimensional image, mathematical morphology operations are applied to\\nperform refined outlier identification from a data distribution perspective.\\nThis technique can identify outliers that are not effectively detected in the\\nfirst two stages, including those densely stacked ones near normal data points.\\nBy integrating the above three techniques, the whole method is capable of\\nidentifying various types of outliers in a reliable and adaptive manner.\\nNumerical test results with wind power datasets acquired from distinct wind\\nturbines in practice and from simulation environments extensively demonstrate\\nthe superiority of the proposed method as well as its potential in enhancing\\nwind power prediction.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-30T06:19:38Z\"}"}
