{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10084v1\", \"title\": \"UP-Person: Unified Parameter-Efficient Transfer Learning for Text-based\\n  Person Retrieval\", \"summary\": \"Text-based Person Retrieval (TPR) as a multi-modal task, which aims to\\nretrieve the target person from a pool of candidate images given a text\\ndescription, has recently garnered considerable attention due to the progress\\nof contrastive visual-language pre-trained model. Prior works leverage\\npre-trained CLIP to extract person visual and textual features and fully\\nfine-tune the entire network, which have shown notable performance improvements\\ncompared to uni-modal pre-training models. However, full-tuning a large model\\nis prone to overfitting and hinders the generalization ability. In this paper,\\nwe propose a novel Unified Parameter-Efficient Transfer Learning (PETL) method\\nfor Text-based Person Retrieval (UP-Person) to thoroughly transfer the\\nmulti-modal knowledge from CLIP. Specifically, UP-Person simultaneously\\nintegrates three lightweight PETL components including Prefix, LoRA and\\nAdapter, where Prefix and LoRA are devised together to mine local information\\nwith task-specific information prompts, and Adapter is designed to adjust\\nglobal feature representations. Additionally, two vanilla submodules are\\noptimized to adapt to the unified architecture of TPR. For one thing, S-Prefix\\nis proposed to boost attention of prefix and enhance the gradient propagation\\nof prefix tokens, which improves the flexibility and performance of the vanilla\\nprefix. For another thing, L-Adapter is designed in parallel with layer\\nnormalization to adjust the overall distribution, which can resolve conflicts\\ncaused by overlap and interaction among multiple submodules. Extensive\\nexperimental results demonstrate that our UP-Person achieves state-of-the-art\\nresults across various person retrieval datasets, including CUHK-PEDES,\\nICFG-PEDES and RSTPReid while merely fine-tuning 4.7\\\\% parameters. Code is\\navailable at https://github.com/Liu-Yating/UP-Person.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-14T10:40:54Z\"}"}
