{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02577v1\", \"title\": \"Reasoning Inconsistencies and How to Mitigate Them in Deep Learning\", \"summary\": \"The recent advancements in Deep Learning models and techniques have led to\\nsignificant strides in performance across diverse tasks and modalities.\\nHowever, while the overall capabilities of models show promising growth, our\\nunderstanding of their internal reasoning processes remains limited,\\nparticularly concerning systematic inconsistencies or errors patterns of\\nlogical or inferential flaws. These inconsistencies may manifest as\\ncontradictory outputs, failure to generalize across similar tasks, or erroneous\\nconclusions in specific contexts. Even detecting and measuring such reasoning\\ndiscrepancies is challenging, as they may arise from opaque internal\\nprocedures, biases and imbalances in training data, or the inherent complexity\\nof the task. Without effective methods to detect, measure, and mitigate these\\nerrors, there is a risk of deploying models that are biased, exploitable, or\\nlogically unreliable. This thesis aims to address these issues by producing\\nnovel methods for deep learning models that reason over knowledge graphs,\\nnatural language, and images. The thesis contributes two techniques for\\ndetecting and quantifying predictive inconsistencies originating from opaque\\ninternal procedures in natural language and image processing models. To\\nmitigate inconsistencies from biases in training data, this thesis presents a\\ndata efficient sampling method to improve fairness and performance and a\\nsynthetic dataset generation approach in low resource scenarios. Finally, the\\nthesis offers two techniques to optimize the models for complex reasoning\\ntasks. These methods enhance model performance while allowing for more faithful\\nand interpretable exploration and exploitation during inference. Critically,\\nthis thesis provides a comprehensive framework to improve the robustness,\\nfairness, and interpretability of deep learning models across diverse tasks and\\nmodalities.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.CL,cs.LG,cs.LO\", \"published\": \"2025-04-03T13:40:55Z\"}"}
