{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12917v1\", \"title\": \"Arrayed waveguide gratings in lithium tantalate integrated photonics\", \"summary\": \"Arrayed Waveguide Gratings (AWGs) are widely used photonic components for\\nsplitting and combining different wavelengths of light. They play a key role in\\nwavelength division multiplexing (WDM) systems by enabling efficient routing of\\nmultiple data channels over a single optical fiber and as a building block for\\nvarious optical signal processing, computing, imaging, and spectroscopic\\napplications. Recently, there has been growing interest in integrating AWGs in\\nferroelectric material platforms, as the platform simultaneously provide\\nefficient electro-optic modulation capability and thus hold the promise for\\nfully integrated WDM transmitters. To date, several demonstrations have been\\nmade in the X-cut thin-film lithium niobate ($\\\\mathrm{LiNbO}_3$) platform, yet,\\nthe large anisotropy of $\\\\mathrm{LiNbO}_3$ complicates the design and degrades\\nthe performance of the AWGs. To address this limitation, we use the recently\\ndeveloped photonic integrated circuits (PICs) based on thin-film lithium\\ntantalate ($\\\\mathrm{LiTaO}_3$), a material with a similar Pockels coefficient\\nas $\\\\mathrm{LiNbO}_3$ but significantly reduced optical anisotropy, as an\\nalternative viable platform. In this work, we manufacture $\\\\mathrm{LiTaO}_3$\\nAWGs using deep ultraviolet lithography on a wafer-scale. The fabricated AWGs\\nfeature a channel spacing of 100 GHz, an insertion loss of < 4 dB and crosstalk\\nof < -14 dB. In addition, we demonstrate a cyclic AWG, as well as a\\nmultiplexing and demultiplexing AWG pair for the first time on\\n$\\\\mathrm{LiTaO}_3$ platform. The wafer-scale fabrication of these AWGs not only\\nensures uniformity and reproducibility, but also paves the way for realizing\\nvolume-manufactured integrated WDM transmitters in ferroelectric photonic\\nintegrated platforms.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics,physics.app-ph\", \"published\": \"2025-04-17T13:06:02Z\"}"}
