{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21357v1\", \"title\": \"Mining and Intervention of Social Networks Information Cocoon Based on\\n  Multi-Layer Network Community Detection\", \"summary\": \"With the rapid development of information technology and the widespread\\nutilization of recommendation algorithms, users are able to access information\\nmore conveniently, while the content they receive tends to be homogeneous.\\nHomogeneous viewpoints and preferences tend to cluster users into sub-networks,\\nleading to group polarization and increasing the likelihood of forming\\ninformation cocoons. This paper aims to handle information cocoon phenomena in\\ndebates on social media. In order to investigate potential user connections, we\\nconstruct a double-layer network that incorporates two dimensions: relational\\nties and feature-based similarity between users. Based on the structure of the\\nmulti-layer network, we promote two graph auto-encoder (GAE) based community\\ndetection algorithms, which can be applied to the partition and determination\\nof information cocoons. This paper tests these two algorithms on Cora,\\nCiteseer, and synthetic datasets, comparing them with existing multi-layer\\nnetwork unsupervised community detection algorithms. Numerical experiments\\nillustrate that the algorithms proposed in this paper significantly improve\\nprediction accuracy indicator NMI (normalized mutual information) and network\\ntopology indicator Q. Additionally, an influence-based intervention measure on\\nwhich algorithms can operate is proposed. Through the Markov states transition\\nmodel, we simulate the intervention effects, which illustrate that our\\ncommunity detection algorithms play a vital role in partitioning and\\ndetermining information cocoons. Simultaneously, our intervention strategy\\nalleviates the polarization of viewpoints and the formation of information\\ncocoons with minimal intervention effort.\", \"main_category\": \"cs.SI\", \"categories\": \"cs.SI,math.ST,stat.TH,62-11,F.2.2\", \"published\": \"2025-04-30T06:31:05Z\"}"}
