{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20428v1\", \"title\": \"Escaping Helium and a Highly Muted Spectrum Suggest a Metal-Enriched\\n  Atmosphere on Sub-Neptune GJ3090b from JWST Transit Spectroscopy\", \"summary\": \"Sub-Neptunes, the most common planet type, remain poorly understood. Their\\natmospheres are expected to be diverse, but their compositions are challenging\\nto determine, even with JWST. Here, we present the first JWST spectroscopic\\nstudy of the warm sub-Neptune GJ3090b (2.13R$_\\\\oplus$, Teq~700 K) which orbits\\nan M2V star, making it a favourable target for atmosphere characterization. We\\nobserved four transits of GJ3090b; two each using JWST NIRISS/SOSS and\\nNIRSpec/G395H, yielding wavelength coverage from 0.6-5.2 $\\\\mu$m. We detect the\\nsignature of the 10833 \\\\r{A} metastable Helium triplet at a statistical\\nsignificance of 5.5$\\\\sigma$ with an amplitude of 434$\\\\pm$79 ppm, marking the\\nfirst such detection in a sub-Neptune with JWST. This amplitude is\\nsignificantly smaller than predicted by solar-metallicity forward models,\\nsuggesting a metal-enriched atmosphere which decreases the mass-loss rate and\\nattenuates the Helium feature amplitude. Moreover, we find that stellar\\ncontamination, in the form of the transit light source effect, dominates the\\nNIRISS transmission spectra, with unocculted spot and faculae properties\\nvarying across the two visits separated in time by approximately six months.\\nFree retrieval analyses on the NIRSpec/G395H spectrum find tentative evidence\\nfor highly muted features and a lack of CH4. These findings are best explained\\nby a high metallicity atmosphere (>100x solar at 3$\\\\sigma$ confidence, for\\nclouds at $\\\\sim \\\\mu$bar pressures) using chemically-consistent retrievals and\\nself-consistent model grids. Further observations of GJ3090b are needed for\\ntighter constraints on the atmospheric abundances, and to gain a deeper\\nunderstanding of the processes that led to its potential metal enrichment.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-29T04:48:16Z\"}"}
