{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19614v1\", \"title\": \"DiVE: Efficient Multi-View Driving Scenes Generation Based on Video\\n  Diffusion Transformer\", \"summary\": \"Collecting multi-view driving scenario videos to enhance the performance of\\n3D visual perception tasks presents significant challenges and incurs\\nsubstantial costs, making generative models for realistic data an appealing\\nalternative. Yet, the videos generated by recent works suffer from poor quality\\nand spatiotemporal consistency, undermining their utility in advancing\\nperception tasks under driving scenarios. To address this gap, we propose DiVE,\\na diffusion transformer-based generative framework meticulously engineered to\\nproduce high-fidelity, temporally coherent, and cross-view consistent\\nmulti-view videos, aligning seamlessly with bird's-eye view layouts and textual\\ndescriptions. DiVE leverages a unified cross-attention and a SketchFormer to\\nexert precise control over multimodal data, while incorporating a view-inflated\\nattention mechanism that adds no extra parameters, thereby guaranteeing\\nconsistency across views. Despite these advancements, synthesizing\\nhigh-resolution videos under multimodal constraints introduces dual challenges:\\ninvestigating the optimal classifier-free guidance coniguration under intricate\\nmulti-condition inputs and mitigating excessive computational latency in\\nhigh-resolution rendering--both of which remain underexplored in prior\\nresearches. To resolve these limitations, we introduce two innovations:\\nMulti-Control Auxiliary Branch Distillation, which streamlines multi-condition\\nCFG selection while circumventing high computational overhead, and Resolution\\nProgressive Sampling, a training-free acceleration strategy that staggers\\nresolution scaling to reduce high latency due to high resolution. These\\ninnovations collectively achieve a 2.62x speedup with minimal quality\\ndegradation. Evaluated on the nuScenes dataset, DiVE achieves SOTA performance\\nin multi-view video generation, yielding photorealistic outputs with\\nexceptional temporal and cross-view coherence.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-28T09:20:50Z\"}"}
