{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07856v1\", \"title\": \"2D-Curri-DPO: Two-Dimensional Curriculum Learning for Direct Preference\\n  Optimization\", \"summary\": \"Aligning large language models with human preferences is crucial for their\\nsafe deployment. While Direct Preference Optimization (DPO) offers an efficient\\nalternative to reinforcement learning from human feedback, traditional DPO\\nmethods are limited by their reliance on single preference pairs. Recent work\\nlike Curriculum-DPO integrates multiple pairs using a one-dimensional\\ndifficulty curriculum based on pairwise distinguishability (PD), but overlooks\\nthe complexity of the input prompt itself. To address this, we propose\\n2D-Curri-DPO, a novel framework employing a two-dimensional curriculum that\\njointly models Prompt Complexity (PC) and Pairwise Distinguishability. This\\nframework introduces dual difficulty metrics to quantify prompt semantic\\ncomplexity and response preference clarity, defines a curriculum strategy space\\nencompassing multiple selectable strategies for task adaptation, and\\nincorporates a KL-divergence-based adaptive mechanism for dynamic reference\\nmodel updates to enhance training stability. Comprehensive experiments\\ndemonstrate that 2D-Curri-DPO significantly outperforms standard DPO and prior\\ncurriculum methods across multiple benchmarks, including MT-Bench, Vicuna\\nBench, and WizardLM. Our approach achieves state-of-the-art performance on\\nchallenging test sets like UltraFeedback. Ablation studies confirm the benefits\\nof the 2D structure and adaptive mechanisms, while analysis provides guidance\\nfor strategy selection. These findings demonstrate that effective alignment\\nrequires modeling both prompt complexity and pairwise distinguishability,\\nestablishing adaptive, multi-dimensional curriculum learning as a powerful and\\ninterpretable new paradigm for preference-based language model optimization.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI\", \"published\": \"2025-04-10T15:32:00Z\"}"}
