{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01386v1\", \"title\": \"DALIP: Distribution Alignment-based Language-Image Pre-Training for\\n  Domain-Specific Data\", \"summary\": \"Recently, Contrastive Language-Image Pre-training (CLIP) has shown promising\\nperformance in domain-specific data (e.g., biology), and has attracted\\nincreasing research attention. Existing works generally focus on collecting\\nextensive domain-specific data and directly tuning the original CLIP models.\\nIntuitively, such a paradigm takes no full consideration of the characteristics\\nlying in domain-specific data (e.g., fine-grained nature of biological data)\\nand so limits model capability, while mostly losing the original ability of\\nCLIP in the general domain. In this paper, we propose a Distribution\\nAlignment-based Language-Image Pre-Training (DALIP) method for biological data.\\nSpecifically, DALIP optimizes CLIP models by matching the similarity between\\nfeature distribution of image-text pairs instead of the original [cls] token,\\nwhich can capture rich yet effective information inherent in image-text pairs\\nas powerful representations, and so better cope with fine-grained nature of\\nbiological data. Particularly, our DALIP efficiently approximates feature\\ndistribution via its first- and second-order statistics, while presenting a\\nMulti-head Brownian Distance Covariance (MBDC) module to acquire second-order\\nstatistics of token features efficiently. Furthermore, we collect a new dataset\\nfor plant domain (e.g., specific data in biological domain) comprising 10M\\nplant data with 3M general-domain data (namely PlantMix-13M) according to data\\nmixing laws. Extensive experiments show that DALIP clearly outperforms existing\\nCLIP counterparts in biological domain, while well generalizing to remote\\nsensing and medical imaging domains. Besides, our PlantMix-13M dataset further\\nboosts performance of DALIP in plant domain, while preserving model ability in\\ngeneral domain.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-02T05:56:57Z\"}"}
