{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04990v1\", \"title\": \"On the polarimetric response of the Nan\\u00e7ay Radio Telescope and its\\n  impact on precision pulsar timing\", \"summary\": \"In \\\\citet{Guillemot2023} we presented a new method for calibrating pulsar\\nobservations conducted with the Nan\\\\c{c}ay decimetric Radio Telescope (NRT),\\nwhich significantly improved NRT polarimetric measurements and pulsar timing\\nquality for data taken after this method was developed, in November 2019.\\nResults hinted at a dependence of the polarimetric response of the NRT on the\\nobserved direction. We investigated this potential dependence, since\\nunaccounted variations of the instrumental response could degrade polarimetric\\nmeasurements. Additionally, we aimed to develop a method for properly\\ncalibrating NRT pulsar observations conducted before November 2019. We\\nconducted three series of observations of bright pulsars over wide declination\\nranges, in a special observation mode in which the feed horn rotates by $\\\\sim$\\n180$^\\\\circ$ degrees across the observation, enabling us to determine the full\\npolarimetric response of the NRT while modeling potential variations of\\ncalibration parameters with hour angle and declination. In addition, we used\\nthe METM technique to improve the calibration of pre-November 2019 data. From\\nthe analysis of the series of observations of bright pulsars with horn\\nrotation, we found that the polarimetric response of the NRT does not appear to\\nvary with hour angle or declination. On the other hand, the new METM-based\\ncalibration method appears to significantly improve the calibration of\\npre-November 2019 data. By analyzing NRT data on a selection of millisecond\\npulsars we found that the new polarimetric profiles are more homogeneous, they\\ngenerally have larger signal-to-noise ratios, and found that the TOA data for\\nthese MSPs are more accurate and contain lower levels of noise, especially when\\ncombining the new calibration method with the \\\\textit{Matrix Template Matching}\\n(MTM) method for extracting TOAs from pulsar observations.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.IM\", \"published\": \"2025-05-08T06:53:20Z\"}"}
