{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11956v1\", \"title\": \"The Conserved Effective Stress Tensor of Gravitational Wave\", \"summary\": \"We present a detailed study of the effective stress tensor of gravitational\\nwave (GW) as the source for the background Einstein equation and examine three\\ncandidates in literature. The second order perturbed Einstein tensor\\n$G^{(2)}_{\\\\mu\\\\nu}$, up to a coefficient, proposed by Brill, Hartle, and\\nIsaacson, has long been known to be covariantly nonconserved with respect to\\nthe background spacetime. We observe that $G^{(2)}_{\\\\mu\\\\nu}$ is not a true\\ntensor on the background spacetime. More importantly, we find that, by\\nexpressing $G^{(2)}_{\\\\mu\\\\nu}$ in terms of the perturbed Hilbert-Einstein\\nactions,\\n  the nonconserved part of $G^{(2)}_{\\\\mu\\\\nu}$ is actually canceled out by the\\nperturbed fluid stress tensors in the back-reaction equation, or is vanishing\\nin absence of fluid. The remaining part of $G^{(2)}_{\\\\mu\\\\nu}$ is just the\\nconserved effective stress tensor $\\\\tau_{\\\\mu\\\\nu}$ proposed by Ford and Parker.\\nAs the main result, we derive $\\\\tau_{\\\\mu\\\\nu}$ for a general curved spacetime by\\nvarying the GW action and show its conservation using the equation of GW. The\\nstress tensor $T_{\\\\text{MT}}^{\\\\mu\\\\nu}$ proposed by MacCallum and Taub was based\\non an action $J_2$. We derive $T_{\\\\text{MT}}^{\\\\mu\\\\nu}$ and find that it is\\nnonconserved, and that $J_2$ does not give the correct GW equation in presence\\nof matter. The difficulty with $J_2$ is due to a background Ricci tensor term,\\nwhich should be also canceled out by the fluid term or vanishing in absence of\\nfluid. We also demonstrate these three candidates in a flat Robertson-Walker\\nspacetime. The conserved $\\\\tau_{\\\\mu\\\\nu}$ has a positive energy density\\nspectrum, and is adequate for the back-reaction in a perturbation scheme, while\\nthe two nonconserved stress tensors have a negative spectrum at long\\nwavelengths and are unphysical.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc\", \"published\": \"2025-04-16T10:38:43Z\"}"}
