{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16539v1\", \"title\": \"Self-organized fractal architectures driven by motility-dependent\\n  chemotactic feedback\", \"summary\": \"Complex spatial patterns in biological systems often arise through\\nself-organization without a central coordination, guided by local interactions\\nand chemical signaling. In this study, we explore how motility-dependent\\nchemical deposition and concentration-sensitive feedback can give rise to\\nfractal-like networks, using a minimal agent-based model. Agents deposit\\nchemicals only while moving, and their future motion is biased by local\\nchemical gradients. This interaction generates a rich variety of self-organized\\nstructures resembling those seen in processes like early vasculogenesis and\\nepithelial cell dispersal. We identify a diverse phase diagram governed by the\\nrates of chemical deposition and decay, revealing transitions from uniform\\ndistributions to sparse and dense networks, and ultimately to full phase\\nseparation. At low chemical decay rates, agents form stable, system-spanning\\nnetworks; further reduction leads to re-entry into a uniform state. A continuum\\nmodel capturing the co-evolution of agent density and chemical fields confirms\\nthese transitions and reveals how linear stability criteria determine the\\nobserved phases. At low chemical concentrations, diffusion dominates and\\npromotes fractal growth, while higher concentrations favor nucleation and\\ncompact clustering. These findings unify a range of biological phenomena - such\\nas chemotaxis, tissue remodeling, and self-generated gradient navigation -\\nwithin a simple, physically grounded framework. Our results also offer insights\\ninto designing artificial systems with emergent collective behavior, including\\nrobotic swarms or synthetic active matter.\", \"main_category\": \"physics.bio-ph\", \"categories\": \"physics.bio-ph,cond-mat.soft,cond-mat.stat-mech\", \"published\": \"2025-04-23T09:09:29Z\"}"}
