{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12286v1\", \"title\": \"Long-time soliton dynamics via a coarse-grained space-time method\", \"summary\": \"We investigate the long-time dynamics of the Sine-Gordon (SG) model under a\\nclass of perturbations whose quantum field theoretic analog - via bosonization\\n- corresponds to the massive Schwinger model describing 1+1D relativistic QED\\nof Dirac fermions. Classical SG solutions offer critical insight into\\nnon-perturbative effects in this quantum theory, but capturing their long-time\\nbehavior poses significant numerical challenges. To address this, we extend a\\ncoarse-graining method to spacetime using a dual-mesh construction based on the\\nMinkowski-metric. We first validate the approach against the well-studied\\nvariant of the SG model describing magnetic fluxon dynamics in Josephson\\ntransmission lines (JTLs), where analytical and numerical benchmarks exist. We\\nthen apply the method to the Schwinger-inspired SG model and uncover long-lived\\nbound states - \\\"Schwinger atoms\\\" - in which a soliton is trapped by a fixed\\ncentral charge. In certain regimes, the system exhibits limit cycles that give\\nrise to positronium-like states of oppositely charged solitons, while in others\\nsuch formation is suppressed. Accessing such long-time solutions requires a\\nrigorous implementation of outgoing boundary conditions on a finite\\ncomputational domain that provide radiative dissipation to allow relaxation\\ntoward states that exist only in an infinite domain. Here we provide such a\\nconstruction. Our results also suggest the possibility of analog quantum\\nsimulation of relativistic quantum field theories with JTLs. These results\\ndemonstrate the utility of spatio-temporal coarse-graining methodology for\\nprobing non-perturbative structure formation in non-linear field theories.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,hep-ph,physics.optics\", \"published\": \"2025-04-16T17:51:51Z\"}"}
