{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20844v1\", \"title\": \"Effect of Avatar Head Movement on Communication Behaviour, Experience of\\n  Presence and Conversation Success in Triadic Conversations\", \"summary\": \"Interactive communication in virtual reality can be used in experimental\\nparadigms to increase the ecological validity of hearing device evaluations.\\nThis requires the virtual environment to elicit natural communication behaviour\\nin listeners. This study evaluates the effect of virtual animated characters'\\nhead movements on participants' communication behaviour and experience.\\n  Triadic conversations were conducted between a test participant and two\\nconfederates. To facilitate the manipulation of head movements, the\\nconversation was conducted in telepresence using a system that transmitted\\naudio, head movement data and video with low delay. The confederates were\\nrepresented by virtual animated characters (avatars) with different levels of\\nanimation: Static heads, automated head movement animations based on speech\\nlevel onsets, and animated head movements based on the transmitted head\\nmovements of the interlocutors. A condition was also included in which the\\nvideos of the interlocutors' heads were embedded in the visual scene.\\n  The results show significant effects of animation level on the participants'\\nspeech and head movement behaviour as recorded by physical sensors, as well as\\non the subjective sense of presence and the success of the conversation. The\\nlargest effects were found for the range of head orientation during speech and\\nthe perceived realism of avatars. Participants reported that they were spoken\\nto in a more helpful way when the avatars showed head movements transmitted\\nfrom the interlocutors than when the avatars' heads were static.\\n  We therefore conclude that the representation of interlocutors must include\\nsufficiently realistic head movements in order to elicit natural communication\\nbehaviour.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC,cs.SD\", \"published\": \"2025-04-29T15:17:23Z\"}"}
