{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19892v1\", \"title\": \"Thin-wall Single-crystal Gold Nanoelectrodes towards Advanced Chemical\\n  Probing and Imaging\", \"summary\": \"Thin-wall metal ultramicro- and nanoelectrodes (UMEs/NEs), especially gold\\nNEs, are indispensable for high-resolution electrochemical microscopy,\\nbiosensing, and fundamental research. However, their damage susceptibility and\\nthe lack of scalable fabrication methods hinder broader adoption. We present a\\nversatile wet-chemical approach for high-throughput fabrication of thin-wall Au\\nNEs/UMEs and multifunctional NEs with ~80% reproducibility. This method is\\nbased on a unique template-assisted 1D growth of single-crystalline Au in\\nborosilicate nanopipettes followed by electrochemical contacting with tungsten\\nmicrowires, and focused ion beam milling, ensuring precise control over NEs\\ndimensions. Adaptable to various metals and integrable in multifunctional\\nprobes, the method facilitates batch production of high-quality NEs with\\nstandardized electrical connections. Structural and electrochemical\\ncharacterization reveals a twinned single-crystalline Au core, a seamless\\nAu/glass interface, and highly stable electrochemical performance. Notably,\\nsmaller electrodes exhibit higher current densities, enhancing chemical\\ndetection sensitivity. Specifically, we demonstrate outstanding spatial (< 200\\nnm) and current (< 1 pA) resolutions, low limit of detection (~11.0 {\\\\mu}M) and\\nhigh stability (7 h) in scanning photoelectrochemical microscopy (photo-SECM),\\nby detecting photo-oxidation reaction on atomically smooth Au micro-flakes. We\\nalso demonstrate growth in double-barrel pipettes for SECM/SICM probes as well\\nas Pt NEs. Overall, this scalable method addresses longstanding challenges in\\nNEs, paving the way for advanced electrochemical and spectro-electrochemical\\nmicroscopy, including SERS/TERS integration. With single-crystalline surfaces,\\nthese electrodes open new frontiers in catalysis, interfacial electrochemistry,\\nbiosensing, and molecular-scale investigations.\", \"main_category\": \"physics.chem-ph\", \"categories\": \"physics.chem-ph,cond-mat.mes-hall,cond-mat.mtrl-sci\", \"published\": \"2025-04-28T15:27:06Z\"}"}
