{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07756v1\", \"title\": \"\\\"i am a stochastic parrot, and so r u\\\": Is AI-based framing of human\\n  behaviour and cognition a conceptual metaphor or conceptual engineering?\", \"summary\": \"Given the massive integration of AI technologies into our daily lives,\\nAI-related concepts are being used to metaphorically compare AI systems with\\nhuman behaviour and/or cognitive abilities like language acquisition.\\nRightfully, the epistemic success of these metaphorical comparisons should be\\ndebated. Against the backdrop of the conflicting positions of the\\n'computational' and 'meat' chauvinisms, we ask: can the conceptual\\nconstellation of the computational and AI be applied to the human domain and\\nwhat does it mean to do so? What is one doing when the conceptual\\nconstellations of AI in particular are used in this fashion? Rooted in a\\nWittgensteinian view of concepts and language-use, we consider two possible\\nanswers and pit them against each other: either these examples are conceptual\\nmetaphors, or they are attempts at conceptual engineering. We argue that they\\nare conceptual metaphors, but that (1) this position is unaware of its own\\nepistemological contingency, and (2) it risks committing the ''map-territory\\nfallacy''. Down at the conceptual foundations of computation, (3) it most\\nimportantly is a misleading 'double metaphor' because of the metaphorical\\nconnection between human psychology and computation. In response to the\\nshortcomings of this projected conceptual organisation of AI onto the human\\ndomain, we argue that there is a semantic catch. The perspective of the\\nconceptual metaphors shows avenues for forms of conceptual engineering. If this\\nmethodology's criteria are met, the fallacies and epistemic shortcomings\\nrelated to the conceptual metaphor view can be bypassed. At its best, the\\ncross-pollution of the human and AI conceptual domains is one that prompts us\\nto reflect anew on how the boundaries of our current concepts serve us and how\\nthey could be approved.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.CY,K.4\", \"published\": \"2025-04-10T13:55:32Z\"}"}
