{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11450v1\", \"title\": \"Optimal Hardness of Online Algorithms for Large Independent Sets\", \"summary\": \"We study the algorithmic problem of finding a large independent set in an\\nErd\\\\\\\"{o}s-R\\\\'{e}nyi random graph $\\\\mathbb{G}(n,p)$. For constant $p$ and\\n$b=1/(1-p)$, the largest independent set has size $2\\\\log_b n$, while a simple\\ngreedy algorithm revealing vertices sequentially and making decisions based\\nonly on previously seen vertices finds an independent set of size $\\\\log_b n$.\\nIn his seminal 1976 paper, Karp challenged to either improve this guarantee or\\nestablish its hardness. Decades later, this problem remains open, one of the\\nmost prominent algorithmic problems in the theory of random graphs.\\n  In this paper, we establish that a broad class of online algorithms fails to\\nfind an independent set of size $(1+\\\\epsilon)\\\\log_b n$ any constant\\n$\\\\epsilon>0$ w.h.p. This class includes Karp's algorithm as a special case, and\\nextends it by allowing the algorithm to query exceptional edges not yet 'seen'\\nby the algorithm. Our lower bound holds for all $p\\\\in [d/n,1-n^{-1/d}]$, where\\n$d$ is a large constant. In the dense regime (constant $p$), we further prove\\nthat our result is asymptotically tight with respect to the number of\\nexceptional edges queried, by designing an online algorithm which beats the\\nhalf-optimality threshold when the number of exceptional edges slightly exceeds\\nour bound.\\n  Our result provides evidence for the algorithmic hardness of Karp's problem\\nby supporting the conjectured optimality of the aforementioned greedy algorithm\\nand establishing it within the class of online algorithms. Our proof relies on\\na refined analysis of the geometric structure of tuples of large independent\\nsets, establishing a variant of the Overlap Gap Property (OGP) commonly used as\\na barrier for classes of algorithms. While OGP has predominantly served as a\\nbarrier to stable algorithms, online algorithms are not stable and our\\napplication of OGP-based techniques to online setting is novel.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS,cs.CC,cs.DM,math.CO,math.PR\", \"published\": \"2025-04-15T17:58:08Z\"}"}
