{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03165v1\", \"title\": \"Improving the Reproducibility of Deep Learning Software: An Initial\\n  Investigation through a Case Study Analysis\", \"summary\": \"The field of deep learning has witnessed significant breakthroughs, spanning\\nvarious applications, and fundamentally transforming current software\\ncapabilities. However, alongside these advancements, there have been increasing\\nconcerns about reproducing the results of these deep learning methods. This is\\nsignificant because reproducibility is the foundation of reliability and\\nvalidity in software development, particularly in the rapidly evolving domain\\nof deep learning. The difficulty of reproducibility may arise due to several\\nreasons, including having differences from the original execution environment,\\nincompatible software libraries, proprietary data and source code, lack of\\ntransparency, and the stochastic nature in some software. A study conducted by\\nthe Nature journal reveals that more than 70% of researchers failed to\\nreproduce other researchers experiments and over 50% failed to reproduce their\\nown experiments. Irreproducibility of deep learning poses significant\\nchallenges for researchers and practitioners. To address these concerns, this\\npaper presents a systematic approach at analyzing and improving the\\nreproducibility of deep learning models by demonstrating these guidelines using\\na case study. We illustrate the patterns and anti-patterns involved with these\\nguidelines for improving the reproducibility of deep learning models. These\\nguidelines encompass establishing a methodology to replicate the original\\nsoftware environment, implementing end-to-end training and testing algorithms,\\ndisclosing architectural designs, and enhancing transparency in data processing\\nand training pipelines. We also conduct a sensitivity analysis to understand\\nthe model performance across diverse conditions. By implementing these\\nstrategies, we aim to bridge the gap between research and practice, so that\\ninnovations in deep learning can be effectively reproduced and deployed within\\nsoftware.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.SE\", \"published\": \"2025-05-06T04:20:15Z\"}"}
