{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12122v1\", \"title\": \"Origin of the Moon's Earth-like isotopic composition from giant impact\\n  on a differential rotating proto-Earth\", \"summary\": \"According to the giant impact theory, the Moon formed by accreting the\\ncircum-terrestrial debris disk produced by Theia colliding with the\\nproto-Earth. The giant impact theory can explain most of the properties of the\\nEarth-Moon system, however, simulations of giant impact between a planetary\\nembryo and the growing proto-Earth indicate that the materials in the\\ncircum-terrestrial debris disk produced by the impact originate mainly from the\\nimpactor, contradicting with the fact that different Solar System bodies have\\ndistinct compositions. Thus, the giant impact theory has difficulty explaining\\nthe Moon's Earth-like isotopic compositions. More materials from the\\nproto-Earth could be delivered to the circum-terrestrial debris disk when a\\nslightly sub-Mars-sized body collides with a fast rotating planet of rigid\\nrotation but the resulting angular momentum is too large compared with that of\\nthe current Earth-Moon system. Since planetesimals accreted by the proto-Earth\\nhit the surface of the proto-Earth, enhancing the rotation rate of the surface\\nof the proto-Earth. The surface's fast rotation rate relative to the slow\\nrotation rate of the inner region of the proto-Earth leads to transfer of\\nangular momentum from surface to inner, resulting in the differential rotation.\\nHere, we show that the giant impact of a sub-Mars-sized body on a differential\\nrotating proto-Earth with a fast rotating outer region and a relative slow\\nrotating inner region could result in a circum-terrestrial debris disk with\\nmaterials predominately from the proto-Earth without violating the angular\\nmomentum constraint. The theory proposed here may provide a viable way of\\nexplaining the similarity in the isotopic compositions of the Earth and Moon.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,astro-ph.HE\", \"published\": \"2025-04-16T14:34:51Z\"}"}
