{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04939v1\", \"title\": \"Structural Alignment in Link Prediction\", \"summary\": \"While Knowledge Graphs (KGs) have become increasingly popular across various\\nscientific disciplines for their ability to model and interlink huge quantities\\nof data, essentially all real-world KGs are known to be incomplete. As such,\\nwith the growth of KG use has been a concurrent development of machine learning\\ntools designed to predict missing information in KGs, which is referred to as\\nthe Link Prediction Task. The majority of state-of-the-art link predictors to\\ndate have followed an embedding-based paradigm. In this paradigm, it is assumed\\nthat the information content of a KG is best represented by the (individual)\\nvector representations of its nodes and edges, and that therefore node and edge\\nembeddings are particularly well-suited to performing link prediction.\\n  This thesis proposes an alternative perspective on the field's approach to\\nlink prediction and KG data modelling. Specifically, this work re-analyses KGs\\nand state-of-the-art link predictors from a graph-structure-first perspective\\nthat models the information content of a KG in terms of whole triples, rather\\nthan individual nodes and edges.\\n  Following a literature review and two core sets of experiments, this thesis\\nconcludes that a structure-first perspective on KGs and link prediction is both\\nviable and useful for understanding KG learning and for enabling cross-KG\\ntransfer learning for the link prediction task. This observation is used to\\ncreate and propose the Structural Alignment Hypothesis, which postulates that\\nlink prediction can be understood and modelled as a structural task.\\n  All code and data used for this thesis are open-sourced. This thesis was\\nwritten bilingually, with the main document in English and an informal extended\\nsummary in Irish. An Irish-language translation dictionary of machine learning\\nterms (the Focl\\\\'oir Tr\\\\'achtais) created for this work is open-sourced as\\nwell.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-05-08T04:27:15Z\"}"}
