{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11100v1\", \"title\": \"Uncertainty modeling method for wind and solar power output in building\\n  integrated energy systems under continuous anomalous weather\", \"summary\": \"The increasing occurrence of continuous anomalous weather events has\\nintensified the uncertainty in wind and photovoltaic power generation, posing\\nsignificant challenges to the operation and optimization of building integrated\\nenergy systems. Existing studies often neglect the interdependence between\\nsuccessive anomalous weather events and their collective impact on wind and\\nsolar power output. Additionally, conventional modeling approaches struggle to\\naccurately capture the nonlinear fluctuations induced by these weather\\nconditions. To address this gap, this study proposes an uncertainty modeling\\nmethod based on stochastic optimization and scenario generation. The Weibull\\nand Beta distributions characterize the probabilistic properties of wind speed\\nand solar irradiance, respectively, while the Copula function captures the\\ndependence between wind speed and precipitation, enabling the construction of a\\nwind-solar power uncertainty model that incorporates the joint distribution of\\nconsecutive anomalous weather events. A Monte Carlo-based scenario generation\\napproach is employed to construct a dataset representing anomalous weather\\ncharacteristics, followed by a probabilistic distance-based scenario reduction\\ntechnique to enhance modeling efficiency. Furthermore, the unscented\\ntransformation method is introduced to mitigate nonlinear propagation errors in\\nwind and solar power state estimation. Case studies demonstrate that the\\nproposed method effectively characterizes the fluctuation patterns of wind and\\nsolar power under continuous anomalous weather conditions while preserving the\\nstatistical properties of the original data. These findings provide a reliable\\nbasis for improving the operational resilience of building integrated energy\\nsystems under extreme weather scenarios.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC\", \"published\": \"2025-04-15T11:48:55Z\"}"}
