{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16483v1\", \"title\": \"Exploring turnover, retention and growth in an OSS Ecosystem\", \"summary\": \"The Gentoo ecosystem has evolved significantly over 23 years, highlighting\\nthe critical impact of developer sentiment on workforce dynamics such as\\nturnover, retention, and growth. While prior research has explored sentiment at\\nthe project level, sentiment-driven dynamics at the component level remain\\nunderexplored, particularly in their implications for software stability.\\n  This study investigates the interplay between developer sentiment and\\nworkforce dynamics in Gentoo. The primary objectives are to (1) compare\\nworkforce metrics (turnover, retention, and growth rates) between\\nsentiment-positive (SP) and sentiment-negative (SN) components, (2) examine\\ntemporal trends across three time phases, and (3) analyze the impact of these\\ndynamics on software stability.\\n  A mixed-method approach was employed, integrating sentiment analysis of\\nmailing lists and commit histories using the SentiStrength-SE tool. Workforce\\nmetrics were statistically analyzed using Pearson Correlation Matrix and\\nMann-Whitney U tests. The analysis focused on the most SP and SN components in\\nthe ecosystem.\\n  SN components exhibited higher retention rates but slower growth and turnover\\ncompared to SP components, which showed dynamic contributor behavior but\\nreduced long-term stability. Temporal analysis revealed significant variations\\nin workforce dynamics over three phases, with developer retention correlating\\npositively with modifications in both sentiment groups.\\n  Tailored strategies are necessary for managing sentiment-driven dynamics in\\nOSS projects. Improving \\\\textit{adaptability} in SN components, and\\n\\\\textit{continuity} in SP components, could improve project sustainability and\\ninnovation. This study contributes to a nuanced understanding of sentiment's\\nrole in workforce behavior and software stability within OSS ecosystems.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-23T07:52:12Z\"}"}
