{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19523v1\", \"title\": \"Observational constraints in late time for an axially symmetric\\n  transitioning model with bulk viscous fluid\", \"summary\": \"In this paper, we explore an axially symmetric Bianchi type-I model of the\\nuniverse with bulk viscous fluid as a source of gravitational field under the\\nframework of Einstein's field equations by assuming barotropic bulk viscous\\npressure as $-3\\\\zeta H^2$.\\n  The model parameters have been estimated with the help of four data sets: The\\nHubble 46 data set describes Hubble parameter values at various redshifts,\\nUnion 2.1 compilation data sets comprise a distance modulus of 580 SNIa\\nsupernovae at different redshifts, the Pantheon data set contains Apparent\\nmagnitudes of 1048 SNIa supernovae at various redshifts and finally BAO data\\nset of volume averaged distances at 5 redshifts.\\n  The observational data is analyzed using the traditional Bayesian\\nmethodology, and the posterior distributions of the parameters are obtained\\nusing the Markov Chain Monte Carlo (MCMC) technique. To get the best-fit values\\nfor the model parameters for MCMC analysis, we use the $ emcee $ package. For\\nparameter estimation, we have also employed the minimizing $\\\\chi^{2}$ function.\\nWe also tried to achieve these values statistically using combined data sets\\nfrom the four described earlier. The OHD+BAO~and~OHD+Pan+BAO+Union combined\\ndata sets provide the best fit Hubble parameter value $H_0$ as $66.912\\n^{+0.497}_{-0.501})$ Km/s/Mpc and $74.216 ^{+0.150}_{-0.148}$ Km/s/Mpc\\nrespectively. We have performed state finder diagnostics to discuss the nature\\nof dark energy. Some other geometrical parameters like the Jerk parameter and\\nthe Om diagnostic are also being discussed to clarify the nature of the dark\\nenergy model. The study reveals that the model behaves like a quintessence in\\nlate time and approaches the $\\\\Lambda$ CDM model.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc\", \"published\": \"2025-04-28T06:41:32Z\"}"}
