{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03631v1\", \"title\": \"Breaking Annotation Barriers: Generalized Video Quality Assessment via\\n  Ranking-based Self-Supervision\", \"summary\": \"Video quality assessment (VQA) is essential for quantifying perceptual\\nquality in various video processing workflows, spanning from camera capture\\nsystems to over-the-top streaming platforms. While recent supervised VQA models\\nhave made substantial progress, the reliance on manually annotated datasets --\\na process that is labor-intensive, costly, and difficult to scale up -- has\\nhindered further optimization of their generalization to unseen video content\\nand distortions. To bridge this gap, we introduce a self-supervised learning\\nframework for VQA to learn quality assessment capabilities from large-scale,\\nunlabeled web videos. Our approach leverages a \\\\textbf{learning-to-rank}\\nparadigm to train a large multimodal model (LMM) on video pairs automatically\\nlabeled via two manners, including quality pseudo-labeling by existing VQA\\nmodels and relative quality ranking based on synthetic distortion simulations.\\nFurthermore, we introduce a novel \\\\textbf{iterative self-improvement training\\nstrategy}, where the trained model acts an improved annotator to iteratively\\nrefine the annotation quality of training data. By training on a dataset\\n$10\\\\times$ larger than the existing VQA benchmarks, our model: (1) achieves\\nzero-shot performance on in-domain VQA benchmarks that matches or surpasses\\nsupervised models; (2) demonstrates superior out-of-distribution (OOD)\\ngeneralization across diverse video content and distortions; and (3) sets a new\\nstate-of-the-art when fine-tuned on human-labeled datasets. Extensive\\nexperimental results validate the effectiveness of our self-supervised approach\\nin training generalized VQA models. The datasets and code will be publicly\\nreleased to facilitate future research.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-06T15:29:32Z\"}"}
