{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10480v1\", \"title\": \"Probing Long-Range Forces in Neutrino Oscillations at the ESSnuSB\\n  Experiment\", \"summary\": \"Neutrino oscillations constitute an excellent tool to probe physics beyond\\nthe Standard Model. In this paper, we investigate the potential of the \\\\ess\\nexperiment to constrain the effects of flavour-dependent long-range forces\\n(LRFs) in neutrino oscillations, which may arise due to the extension of the\\nStandard Model gauge group by introducing new $U(1)$ symmetries. Focusing on\\nthree specific $U(1)$ symmetries -- $L_e - L_\\\\mu$, $L_e - L_\\\\tau$, and $L_\\\\mu -\\nL_\\\\tau$, we demonstrate that \\\\ess offers a favourable environment to search for\\nLRF effects. Our analyses reveal that \\\\ess can set 90\\\\% confidence level bounds\\nof $V_{e\\\\mu} < 2.99 \\\\times 10^{-14} \\\\, \\\\text{eV}$, $V_{e\\\\tau} < 2.05 \\\\times\\n10^{-14} \\\\, \\\\text{eV}$, and $V_{\\\\mu\\\\tau} < 1.81 \\\\times 10^{-14} \\\\, \\\\text{eV}$,\\nwhich are competitive to the upcoming Deep Underground Neutrino Experiment\\n(DUNE). It is also observed that reducing the systematic uncertainties from\\n$5\\\\%$ to $2\\\\%$ improves the \\\\ess limits on $V_{\\\\alpha\\\\beta}$. Interestingly, we\\nfind limited correlations between LRF parameters and the less constrained\\nlepton mixing parameters $\\\\theta_{23}$ and $\\\\delta_{\\\\text{CP}}$, preserving the\\nrobustness of ESSnuSB's sensitivity to CP violation. Even under extreme LRF\\npotentials ($V_{\\\\alpha\\\\beta} \\\\gg 10^{-13} \\\\, \\\\text{eV}$), the CP-violation\\nsensitivity and $\\\\delta_{\\\\text{CP}}$ precision remain largely unaffected. These\\nresults establish ESSnuSB as a competitive experimental setup for probing LRF\\neffects, complementing constraints from other neutrino sources and offering\\ncritical insights into the physics of long-range forces.\", \"main_category\": \"hep-ph\", \"categories\": \"hep-ph,hep-ex\", \"published\": \"2025-04-14T17:59:25Z\"}"}
