{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00644v1\", \"title\": \"Predatory dynamics in susceptible and resistant $\\\\textit{Eriopis\\n  connexa}$ populations\", \"summary\": \"The ladybird $\\\\textit{Eriopis connexa}$ (Germar, 1824), a voracious aphid\\npredator, faces challenges from insecticide applications, compromising\\nbiological control. As a result, there has been an increase in the number of\\nstudies analysing the resistance and susceptibility of ladybirds. Some studies\\nhave found that resistant populations exhibit distinct predation and foraging\\nbehaviour compared to susceptible ones. This study models the population\\ndynamics of resistant and susceptible $\\\\textit{E. connexa}$ preying on\\n$\\\\textit{Aphis gossypii}$ Glover, 1877 and $\\\\textit{Myzus persicae}$ (Sulzer,\\n1776). We constructed a logistic model with density dependence and type-II\\nfunctional response to analyse predation dynamics, incorporating bifurcation\\nanalysis on predation parameters (attack rate and handling time) and the\\nmortality rate of susceptible ladybirds. We simulated scenarios with/without\\ninsecticide application and with/without aphid resistance. To simulate the\\neffects of insecticide applications, the parameters related to aphids'\\nintrinsic growth rate ($r_1$ and $r_2$) change to reflect the responses of\\nsusceptible and resistant populations. The same approach is used concerning the\\nmortality rate of ladybirds ($d_2$ and $d_3$). Our results demonstrate that\\nmortality, attack rate, and handling time are critical in shaping predator-prey\\ninteractions. Temporal simulations revealed fluctuating abundances,\\nhighlighting the fragility of these interactions under insecticide stress.\\nTherefore, this study contributes to understanding the ecological implications\\nof insecticides, which disrupt natural predation dynamics, and shows how\\nvariations in behavioural rates can impact prey control. This research\\ndemonstrated the importance of integrated strategies that balance insecticide\\napplications with preserving natural enemies and promoting sustainable\\nagricultural practices.\", \"main_category\": \"q-bio.PE\", \"categories\": \"q-bio.PE,q-bio.QM\", \"published\": \"2025-05-01T16:33:24Z\"}"}
