{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04871v1\", \"title\": \"Characteristics of Ge-doped Multi-Mode Fibers in Total Ionizing Dose\", \"summary\": \"Purpose: The fiber optical links in 850 nm band with Ge-doped multi-mode (MM)\\nfibers are well developed for data transmission at 10 Gbps and higher. The\\napplications in nuclear environments require radiation resistance. The\\ncharacteristics of Ge-doped MM fibers are investigated for Radiation Induced\\nAttenuation (RIA) in Total Ionizing Dose (TID).\\n  Methods: Commercial samples of Ge-doped MM fibers were irradiated in Go-60\\ngamma rays at dose rates of 5 to 1.4k Gy(SiO2)/hr. The fiber samples were\\npackaged in water tanks maintained at constant temperatures in the range of -15\\nto 45 degC. The optical power transmitted through the fibers were recorded in\\nirradiation, and in annealing when the source was shielded. The measurements of\\nRIA in time are analyzed for dose rate and temperature dependences.\\n  Results: Ge-doped fiber samples of OM2 to OM4 grades were investigated for\\nattenuation of optical power in radiation ionizing dose. Depending on the\\nfabrication technology, two of the fiber types show radiation resistance with\\nthe RIAs of 0.2 dB/m and 0.05 dB/m, respectively, for the TID of 300 kGy(SiO2).\\nAt low dose rate of 5 Gy/hr, the RIA increases steadily and the annealing of\\nlow density ionizing defects does not cause notable deviation. At 1.4 kGy/hr\\nthe accumulated defects result to twice higher RIA during irradiation, and is\\nworsen to a factor three in cold temperature. However, once the source is\\nshielded the recovery is effective in a few hours.\\n  Conclusion: The telecom products of 850 nm Ge-doped MM fibers provide high\\nspeed communication in distances of a few hundred meters. The industrial\\nfabrication methods provide fibers that can endure radiation ionizing dose for\\napplications in nuclear instrumentation.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph,hep-ex\", \"published\": \"2025-04-07T09:26:05Z\"}"}
