{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17288v1\", \"title\": \"A Search for Planet Nine with IRAS and AKARI Data\", \"summary\": \"The outer solar system is theoretically predicted to harbour an undiscovered\\nplanet, often referred to as P9. Simulations suggest that its gravitational\\ninfluence could explain the unusual clustering of minor bodies in the Kuiper\\nBelt. However, no observational evidence for P9 has been found so far, as its\\npredicted orbit lies far beyond Neptune, where it reflects only a faint amount\\nof Sunlight. This work aims to find P9 candidates by taking advantage of two\\nfar-infrared all-sky surveys, which are IRAS and AKARI. The epochs of these two\\nsurveys were separated by 23 years, which is large enough to detect the\\n~3'/year orbital motion of P9. We use a dedicated AKARI Far-Infrared point\\nsource list for our P9 search - AKARI Monthly Unconfirmed Source List, which\\nincludes sources detected repeatedly only in hours timescale, but not after\\nmonths. We search for objects that moved slowly between IRAS and AKARI\\ndetections given in the catalogues. First, we estimated the expected flux and\\norbital motion of P9 by assuming its mass, distance, and effective temperature\\nto ensure it can be detected by IRAS and AKARI, then applied the positional and\\nflux selection criteria to narrow down the number of sources from the\\ncatalogues. Next, we produced all possible candidate pairs whose angular\\nseparations were limited between 42' and 69.6', corresponding to the\\nheliocentric distance range of 500 - 700 AU and the mass range of 7 - 17 Earth\\nmasses. There are 13 pairs obtained after the selection criteria. After image\\ninspection, we found one good candidate, of which the IRAS source is absent\\nfrom the same coordinate in the AKARI image after 23 years and vice versa.\\nHowever, AKARI and IRAS detections are not enough to determine the full orbit\\nof this candidate. This issue leads to the need for follow-up observations,\\nwhich will determine the Keplerian motion of our candidate.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,astro-ph.IM,astro-ph.SR\", \"published\": \"2025-04-24T06:28:28Z\"}"}
