{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15930v1\", \"title\": \"StreamRL: Scalable, Heterogeneous, and Elastic RL for LLMs with\\n  Disaggregated Stream Generation\", \"summary\": \"Reinforcement learning (RL) has become the core post-training technique for\\nlarge language models (LLMs). RL for LLMs involves two stages: generation and\\ntraining. The LLM first generates samples online, which are then used to derive\\nrewards for training. The conventional view holds that the colocated\\narchitecture, where the two stages share resources via temporal multiplexing,\\noutperforms the disaggregated architecture, in which dedicated resources are\\nassigned to each stage. However, in real-world deployments, we observe that the\\ncolocated architecture suffers from resource coupling, where the two stages are\\nconstrained to use the same resources. This coupling compromises the\\nscalability and cost-efficiency of colocated RL in large-scale training. In\\ncontrast, the disaggregated architecture allows for flexible resource\\nallocation, supports heterogeneous training setups, and facilitates\\ncross-datacenter deployment.\\n  StreamRL is designed with disaggregation from first principles and fully\\nunlocks its potential by addressing two types of performance bottlenecks in\\nexisting disaggregated RL frameworks: pipeline bubbles, caused by stage\\ndependencies, and skewness bubbles, resulting from long-tail output length\\ndistributions. To address pipeline bubbles, StreamRL breaks the traditional\\nstage boundary in synchronous RL algorithms through stream generation and\\nachieves full overlapping in asynchronous RL. To address skewness bubbles,\\nStreamRL employs an output-length ranker model to identify long-tail samples\\nand reduces generation time via skewness-aware dispatching and scheduling.\\nExperiments show that StreamRL improves throughput by up to 2.66x compared to\\nexisting state-of-the-art systems, and improves cost-effectiveness by up to\\n1.33x in a heterogeneous, cross-datacenter setting.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.DC\", \"published\": \"2025-04-22T14:19:06Z\"}"}
