{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16464v1\", \"title\": \"ManipDreamer: Boosting Robotic Manipulation World Model with Action Tree\\n  and Visual Guidance\", \"summary\": \"While recent advancements in robotic manipulation video synthesis have shown\\npromise, significant challenges persist in ensuring effective\\ninstruction-following and achieving high visual quality. Recent methods, like\\nRoboDreamer, utilize linguistic decomposition to divide instructions into\\nseparate lower-level primitives, conditioning the world model on these\\nprimitives to achieve compositional instruction-following. However, these\\nseparate primitives do not consider the relationships that exist between them.\\nFurthermore, recent methods neglect valuable visual guidance, including depth\\nand semantic guidance, both crucial for enhancing visual quality. This paper\\nintroduces ManipDreamer, an advanced world model based on the action tree and\\nvisual guidance. To better learn the relationships between instruction\\nprimitives, we represent the instruction as the action tree and assign\\nembeddings to tree nodes, each instruction can acquire its embeddings by\\nnavigating through the action tree. The instruction embeddings can be used to\\nguide the world model. To enhance visual quality, we combine depth and semantic\\nguidance by introducing a visual guidance adapter compatible with the world\\nmodel. This visual adapter enhances both the temporal and physical consistency\\nof video generation. Based on the action tree and visual guidance, ManipDreamer\\nsignificantly boosts the instruction-following ability and visual quality.\\nComprehensive evaluations on robotic manipulation benchmarks reveal that\\nManipDreamer achieves large improvements in video quality metrics in both seen\\nand unseen tasks, with PSNR improved from 19.55 to 21.05, SSIM improved from\\n0.7474 to 0.7982 and reduced Flow Error from 3.506 to 3.201 in unseen tasks,\\ncompared to the recent RoboDreamer model. Additionally, our method increases\\nthe success rate of robotic manipulation tasks by 2.5% in 6 RLbench tasks on\\naverage.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.AI\", \"published\": \"2025-04-23T07:23:41Z\"}"}
