{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23695v1\", \"title\": \"United States Muon Collider Community White Paper for the European\\n  Strategy for Particle Physics Update\", \"summary\": \"This document is being submitted to the 2024-2026 European Strategy for\\nParticle Physics Update (ESPPU) process on behalf of the US Muon Collider\\ncommunity, with its preparation coordinated by the interim US Muon Collider\\nCoordination Group. The US Muon Collider Community comprises a few hundred\\nAmerican scientists. The purpose of the document is to inform ESPPU about the\\nUS plans for Muon Collider research and development (R&D), explain how these\\nefforts align with the broader international R&D initiatives, and present the\\nUS community vision for the future realization of this transformative project.\", \"main_category\": \"hep-ex\", \"categories\": \"hep-ex,hep-ph\", \"published\": \"2025-03-31T03:48:33Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23713v1\", \"title\": \"GNN-Based Candidate Node Predictor for Influence Maximization in\\n  Temporal Graphs\", \"summary\": \"In an age where information spreads rapidly across social media, effectively\\nidentifying influential nodes in dynamic networks is critical. Traditional\\ninfluence maximization strategies often fail to keep up with rapidly evolving\\nrelationships and structures, leading to missed opportunities and\\ninefficiencies. To address this, we propose a novel learning-based approach\\nintegrating Graph Neural Networks (GNNs) with Bidirectional Long Short-Term\\nMemory (BiLSTM) models. This hybrid framework captures both structural and\\ntemporal dynamics, enabling accurate prediction of candidate nodes for seed set\\nselection. The bidirectional nature of BiLSTM allows our model to analyze\\npatterns from both past and future network states, ensuring adaptability to\\nchanges over time. By dynamically adapting to graph evolution at each time\\nsnapshot, our approach improves seed set calculation efficiency, achieving an\\naverage of 90% accuracy in predicting potential seed nodes across diverse\\nnetworks. This significantly reduces computational overhead by optimizing the\\nnumber of nodes evaluated for seed selection. Our method is particularly\\neffective in fields like viral marketing and social network analysis, where\\nunderstanding temporal dynamics is crucial.\", \"main_category\": \"cs.SI\", \"categories\": \"cs.SI,cs.AI\", \"published\": \"2025-03-31T04:28:37Z\"}"}
