{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03526v1\", \"title\": \"Using causal diagrams to assess parallel trends in\\n  difference-in-differences studies\", \"summary\": \"Difference-in-differences (DID) is popular because it can allow for\\nunmeasured confounding when the key assumption of parallel trends holds.\\nHowever, there exists little guidance on how to decide a priori whether this\\nassumption is reasonable. We attempt to develop such guidance by considering\\nthe relationship between a causal diagram and the parallel trends assumption.\\nThis is challenging because parallel trends is scale-dependent and causal\\ndiagrams are generally scale-independent. We develop conditions under which,\\ngiven a nonparametric causal diagram, one can reject or fail to reject parallel\\ntrends. In particular, we adopt a linear faithfulness assumption, which states\\nthat all graphically connected variables are correlated, and which is often\\nreasonable in practice. We show that parallel trends can be rejected if either\\n(i) the treatment is affected by pre-treatment outcomes, or (ii) there exist\\nunmeasured confounders for the effect of treatment on pre-treatment outcomes\\nthat are not confounders for the post-treatment outcome, or vice versa (more\\nprecisely, the two outcomes possess distinct minimally sufficient sets). We\\nalso argue that parallel trends should be strongly questioned if (iii) the\\npre-treatment outcomes affect the post-treatment outcomes (though the two can\\nbe correlated) since there exist reasonable semiparametric models in which such\\nan effect violates parallel trends. When (i-iii) are absent, a necessary and\\nsufficient condition for parallel trends is that the association between the\\ncommon set of confounders and the potential outcomes is constant on an additive\\nscale, pre- and post-treatment. These conditions are similar to, but more\\ngeneral than, those previously derived in linear structural equations models.\\nWe discuss our approach in the context of the effect of Medicaid expansion\\nunder the U.S. Affordable Care Act on health insurance coverage rates.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME\", \"published\": \"2025-05-06T13:37:11Z\"}"}
