{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15031v1\", \"title\": \"Energy-Efficient Irregular RIS-aided UAV-Assisted Optimization: A Deep\\n  Reinforcement Learning Approach\", \"summary\": \"Reconfigurable intelligent surfaces (RISs) enhance unmanned aerial vehicles\\n(UAV)-assisted communication by extending coverage, improving efficiency, and\\nenabling adaptive beamforming. This paper investigates a multiple-input\\nsingle-output system where a base station (BS) communicates with multiple\\nsingle-antenna users through a UAV-assisted RIS, dynamically adapting to user\\nmobility to maintain seamless connectivity. To extend UAV-RIS operational time,\\nwe propose a hybrid energy-harvesting resource allocation (HERA) strategy that\\nleverages the irregular RIS ON/OFF capability while adapting to BS-RIS and\\nRIS-user channels. The HERA strategy dynamically allocates resources by\\nintegrating non-linear radio frequency energy harvesting (EH) based on the\\ntime-switching (TS) approach and renewable energy as a complementary source. A\\nnon-convex mixed-integer nonlinear programming problem is formulated to\\nmaximize EH efficiency while satisfying quality-of-service, power, and energy\\nconstraints under channel state information and hardware impairments. The\\noptimization jointly considers BS transmit power, RIS phase shifts, TS factor,\\nand RIS element selection as decision variables. To solve this problem, we\\nintroduce the energy-efficient deep deterministic policy gradient (EE-DDPG)\\nalgorithm. This deep reinforcement learning (DRL)-based approach integrates\\naction clipping and softmax-weighted Q-value estimation to mitigate estimation\\nerrors. Simulation results demonstrate that the proposed HERA method\\nsignificantly improves EH efficiency, reaching up to 81.5\\\\% and 73.2\\\\% in\\nsingle-user and multi-user scenarios, respectively, contributing to extended\\nUAV operational time. Additionally, the proposed EE-DDPG model outperforms\\nexisting DRL algorithms while maintaining practical computational complexity.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-04-21T11:40:33Z\"}"}
