{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12632v1\", \"title\": \"Transferring linearly fixed QAOA angles: performance and real device\\n  results\", \"summary\": \"Quantum Approximate Optimization Algorithm (QAOA) enables solving\\ncombinatorial optimization problems on quantum computers by optimizing\\nvariational parameters for quantum circuits. We investigate a simplified\\napproach that combines linear parameterization with parameter transferring,\\nreducing the parameter space to just 4 dimensions regardless of the number of\\nlayers. This simplification draws inspiration from quantum annealing schedules\\nproviding both theoretical grounding and practical advantages. We compare this\\ncombined approach with standard QAOA and other parameter setting strategies\\nsuch as INTERP and FOURIER, which require computationally demanding incremental\\nlayer-by-layer optimization. Notably, previously known methods like INTERP and\\nFOURIER yield parameters that can be well fitted by linear functions, which\\nsupports our linearization strategy. Our analysis reveals that for the random\\nIsing model, cost landscapes in this reduced parameter space demonstrate\\nconsistent structural patterns across different problem instances. Our\\nexperiments extend from classical simulation to actual quantum hardware\\nimplementation on IBM's Eagle processor, demonstrating the approach's viability\\non current NISQ devices. Furthermore, the numerical results indicate that\\nparameter transferability primarily depends on the energy scale of problem\\ninstances, with normalization techniques improving transfer quality. Most of\\nour numerical experiments are conducted on the random Ising model, while\\nproblem-dependence is also investigated across other models. A key advantage of\\nparameter transferring is the complete elimination of instance-specific\\nclassical optimization overhead, as pre-trained parameters can be directly\\napplied to other problem instances, reducing classical optimization costs by\\norders of magnitude for deeper circuits.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-17T04:17:51Z\"}"}
