{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15817v1\", \"title\": \"EFFACT: A Highly Efficient Full-Stack FHE Acceleration Platform\", \"summary\": \"Fully Homomorphic Encryption (FHE) is a set of powerful cryptographic schemes\\nthat allows computation to be performed directly on encrypted data with an\\nunlimited depth. Despite FHE's promising in privacy-preserving computing, yet\\nin most FHE schemes, ciphertext generally blows up thousands of times compared\\nto the original message, and the massive amount of data load from off-chip\\nmemory for bootstrapping and privacy-preserving machine learning applications\\n(such as HELR, ResNet-20), both degrade the performance of FHE-based\\ncomputation. Several hardware designs have been proposed to address this issue,\\nhowever, most of them require enormous resources and power. An acceleration\\nplatform with easy programmability, high efficiency, and low overhead is a\\nprerequisite for practical application.\\n  This paper proposes EFFACT, a highly efficient full-stack FHE acceleration\\nplatform with a compiler that provides comprehensive optimizations and\\nvector-friendly hardware. We start by examining the computational overhead\\nacross different real-world benchmarks to highlight the potential benefits of\\nreallocating computing resources for efficiency enhancement. Then we make a\\ndesign space exploration to find an optimal SRAM size with high utilization and\\nlow cost. On the other hand, EFFACT features a novel optimization named\\nstreaming memory access which is proposed to enable high throughput with\\nlimited SRAMs. Regarding the software-side optimization, we also propose a\\ncircuit-level function unit reuse scheme, to substantially reduce the computing\\nresources without performance degradation. Moreover, we design novel NTT and\\nautomorphism units that are suitable for a cost-sensitive and highly efficient\\narchitecture, leading to low area. For generality, EFFACT is also equipped with\\nan ISA and a compiler backend that can support several FHE schemes like CKKS,\\nBGV, and BFV.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.AR\", \"published\": \"2025-04-22T12:01:20Z\"}"}
