{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21441v1\", \"title\": \"Diffusion of intruders in a granular gas thermostatted by a bath of\\n  elastic hard spheres\", \"summary\": \"The Boltzmann kinetic equation is considered to compute the transport\\ncoefficients associated with the mass flux of intruders in a granular gas.\\nIntruders and granular gas are immersed in a gas of elastic hard spheres\\n(molecular gas). We assume that the granular particles are sufficiently\\nrarefied so that the state of the molecular gas is not affected by the presence\\nof the granular gas. Thus, the gas of elastic hard spheres can be considered as\\na thermostat (or bath) at a fixed temperature $T_g$. In the absence of spatial\\ngradients, the system achieves a steady state where the temperature of the\\ngranular gas $T$ differs from that of the intruders $T_0$ (energy\\nnonequipartition). Approximate theoretical predictions for the temperature\\nratios $T/T_g$ and $T_0/T_g$ and the kurtosis $c$ and $c_0$ associated with the\\ngranular gas and the intruders compare very well with Monte Carlo simulations\\nfor conditions of practical interest. For states close to the steady\\nhomogeneous state, the Boltzmann equation for the intruders is solved by means\\nof the Chapman--Enskog method to first order in the spatial gradients. As\\nexpected, the diffusion transport coefficients are given in terms of the\\nsolutions of a set of coupled linear integral equations which are approximately\\nsolved by considering the first-Sonine approximation. In dimensionless form,\\nthe transport coefficients are nonlinear functions of the mass and diameter\\nratios, the coefficients of restitution, and the (reduced) bath temperature.\\nInterestingly, previous results derived from a suspension model based on an\\neffective fluid-solid interaction force are recovered when $m/m_g\\\\to \\\\infty$\\nand $m_0/m_g\\\\to \\\\infty$, where $m$, $m_0$, and $m_g$ are the masses of the\\ngranular, intruder, and molecular gas particle, respectively. Finally, as an\\napplication of our results, thermal diffusion segregation is exhaustively\\nanalysed.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-04-30T08:56:18Z\"}"}
