{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06130v1\", \"title\": \"Ultrafast Coherent Bandgap Modulation Probed by Parametric Nonlinear\\n  Optics\", \"summary\": \"Light-matter interactions in crystals are powerful tools that seamlessly\\nallow both functionalities of sizeable bandgap modulation and non-invasive\\nspectroscopy. While we often assume that the border between the two regimes of\\nmodulation and detection is sharp and well-defined, there are experiments where\\nthe boundaries fade. The study of these transition regions allows us to\\nidentify the real potentials and inherent limitations of the most commonly used\\noptical spectroscopy techniques. Here, we measure and explain the co-existence\\nbetween bandgap modulation and non-invasive spectroscopy in the case of\\nresonant perturbative nonlinear optics in an atomically thin direct gap\\nsemiconductor. We report a clear deviation from the typical quadratic power\\nscaling of second-harmonic generation near an exciton resonance, and we explain\\nthis unusual result based on all-optical modulation driven by the\\nintensity-dependent optical Stark and Bloch-Siegert shifts in the $\\\\pm$K\\nvalleys of the Brillouin zone. Our experimental results are corroborated by\\nanalytical and numerical analysis based on the semiconductor Bloch equations,\\nfrom which we extract the resonant transition dipole moments and dephasing\\ntimes of the used sample. These findings redefine the meaning of perturbative\\nnonlinear optics by revealing how coherent light-matter interactions can modify\\nthe band structure of a crystal, even in the weak-field regime. Furthermore,\\nour results strengthen the understanding of ultrafast all-optical control of\\nelectronic states in two-dimensional materials, with potential applications in\\nvalleytronics, Floquet engineering, and light-wave electronics.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics,cond-mat.mes-hall\", \"published\": \"2025-04-08T15:22:34Z\"}"}
