{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13142v1\", \"title\": \"Transfer Learning via Auxiliary Labels with Application to\\n  Cold-Hardiness Prediction\", \"summary\": \"Cold temperatures can cause significant frost damage to fruit crops depending\\non their resilience, or cold hardiness, which changes throughout the dormancy\\nseason. This has led to the development of predictive cold-hardiness models,\\nwhich help farmers decide when to deploy expensive frost-mitigation measures.\\nUnfortunately, cold-hardiness data for model training is only available for\\nsome fruit cultivars due to the need for specialized equipment and expertise.\\nRather, farmers often do have years of phenological data (e.g. date of\\nbudbreak) that they regularly collect for their crops. In this work, we\\nintroduce a new transfer-learning framework, Transfer via Auxiliary Labels\\n(TAL), that allows farmers to leverage the phenological data to produce more\\naccurate cold-hardiness predictions, even when no cold-hardiness data is\\navailable for their specific crop. The framework assumes a set of source tasks\\n(cultivars) where each has associated primary labels (cold hardiness) and\\nauxiliary labels (phenology). However, the target task (new cultivar) is\\nassumed to only have the auxiliary labels. The goal of TAL is to predict\\nprimary labels for the target task via transfer from the source tasks.\\nSurprisingly, despite the vast literature on transfer learning, to our\\nknowledge, the TAL formulation has not been previously addressed. Thus, we\\npropose several new TAL approaches based on model selection and averaging that\\ncan leverage recent deep multi-task models for cold-hardiness prediction. Our\\nresults on real-world cold-hardiness and phenological data for multiple grape\\ncultivars demonstrate that TAL can leverage the phenological data to improve\\ncold-hardiness predictions in the absence of cold-hardiness data.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-17T17:51:38Z\"}"}
