{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05018v1\", \"title\": \"Diffusion-enabled Secure Semantic Communication Against Eavesdropping\", \"summary\": \"In this paper, AN is introduced into semantic communication systems for the\\nfirst time to prevent semantic eavesdropping. However, the introduction of AN\\nalso poses challenges for the legitimate receiver in extracting semantic\\ninformation. Recently, denoising diffusion probabilistic models (DDPM) have\\ndemonstrated their powerful capabilities in generating multimedia content.\\nHere, the paired pluggable modules are carefully designed using DDPM.\\nSpecifically, the pluggable encryption module generates AN and adds it to the\\noutput of the semantic transmitter, while the pluggable decryption module\\nbefore semantic receiver uses DDPM to generate the detailed semantic\\ninformation by removing both AN and the channel noise. In the scenario where\\nthe transmitter lacks eavesdropper's knowledge, the artificial Gaussian noise\\n(AGN) is used as AN. We first model a power allocation optimization problem to\\ndetermine the power of AGN, in which the objective is to minimize the weighted\\nsum of data reconstruction error of legal link, the mutual information of\\nillegal link, and the channel input distortion. Then, a deep reinforcement\\nlearning framework using deep deterministic policy gradient is proposed to\\nsolve the optimization problem. In the scenario where the transmitter is aware\\nof the eavesdropper's knowledge, we propose an AN generation method based on\\nadversarial residual networks (ARN). Unlike the previous scenario, the mutual\\ninformation term in the objective function is replaced by the confidence of\\neavesdropper correctly\\n  retrieving private information. The adversarial residual network is then\\ntrained to minimize the modified objective function. The simulation results\\nshow that the diffusion-enabled pluggable encryption module prevents semantic\\neavesdropping while the pluggable decryption module achieves the high-quality\\nsemantic communication.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-05-08T07:47:52Z\"}"}
