{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21409v1\", \"title\": \"Towards Intelligent Edge Sensing for ISCC Network: Joint Multi-Tier DNN\\n  Partitioning and Beamforming Design\", \"summary\": \"The combination of Integrated Sensing and Communication (ISAC) and Mobile\\nEdge Computing (MEC) enables devices to simultaneously sense the environment\\nand offload data to the base stations (BS) for intelligent processing, thereby\\nreducing local computational burdens. However, transmitting raw sensing data\\nfrom ISAC devices to the BS often incurs substantial fronthaul overhead and\\nlatency. This paper investigates a three-tier collaborative inference framework\\nenabled by Integrated Sensing, Communication, and Computing (ISCC), where cloud\\nservers, MEC servers, and ISAC devices cooperatively execute different segments\\nof a pre-trained deep neural network (DNN) for intelligent sensing. By\\noffloading intermediate DNN features, the proposed framework can significantly\\nreduce fronthaul transmission load. Furthermore, multiple-input multiple-output\\n(MIMO) technology is employed to enhance both sensing quality and offloading\\nefficiency. To minimize the overall sensing task inference latency across all\\nISAC devices, we jointly optimize the DNN partitioning strategy, ISAC\\nbeamforming, and computational resource allocation at the MEC servers and\\ndevices, subject to sensing beampattern constraints. We also propose an\\nefficient two-layer optimization algorithm. In the inner layer, we derive\\nclosed-form solutions for computational resource allocation using the\\nKarush-Kuhn-Tucker conditions. Moreover, we design the ISAC beamforming vectors\\nvia an iterative method based on the majorization-minimization and weighted\\nminimum mean square error techniques. In the outer layer, we develop a\\ncross-entropy based probabilistic learning algorithm to determine an optimal\\nDNN partitioning strategy. Simulation results demonstrate that the proposed\\nframework substantially outperforms existing two-tier schemes in inference\\nlatency.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-30T08:09:59Z\"}"}
