{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04959v1\", \"title\": \"MoRe-3DGSMR: Motion-resolved reconstruction framework for free-breathing\\n  pulmonary MRI based on 3D Gaussian representation\", \"summary\": \"This study presents an unsupervised, motion-resolved reconstruction framework\\nfor high-resolution, free-breathing pulmonary magnetic resonance imaging (MRI),\\nutilizing a three-dimensional Gaussian representation (3DGS). The proposed\\nmethod leverages 3DGS to address the challenges of motion-resolved 3D isotropic\\npulmonary MRI reconstruction by enabling data smoothing between voxels for\\ncontinuous spatial representation. Pulmonary MRI data acquisition is performed\\nusing a golden-angle radial sampling trajectory, with respiratory motion\\nsignals extracted from the center of k-space in each radial spoke. Based on the\\nestimated motion signal, the k-space data is sorted into multiple respiratory\\nphases. A 3DGS framework is then applied to reconstruct a reference image\\nvolume from the first motion state. Subsequently, a patient-specific\\nconvolutional neural network is trained to estimate the deformation vector\\nfields (DVFs), which are used to generate the remaining motion states through\\nspatial transformation of the reference volume. The proposed reconstruction\\npipeline is evaluated on six datasets from six subjects and bench-marked\\nagainst three state-of-the-art reconstruction methods. The experimental\\nfindings demonstrate that the proposed reconstruction framework effectively\\nreconstructs high-resolution, motion-resolved pulmonary MR images. Compared\\nwith existing approaches, it achieves superior image quality, reflected by\\nhigher signal-to-noise ratio and contrast-to-noise ratio. The proposed\\nunsupervised 3DGS-based reconstruction method enables accurate motion-resolved\\npulmonary MRI with isotropic spatial resolution. Its superior performance in\\nimage quality metrics over state-of-the-art methods highlights its potential as\\na robust solution for clinical pulmonary MR imaging.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.CV\", \"published\": \"2025-05-08T05:41:46Z\"}"}
