{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15923v1\", \"title\": \"Bayesian sample size calculations for external validation studies of\\n  risk prediction models\", \"summary\": \"Summary: Contemporary sample size calculations for external validation of\\nrisk prediction models require users to specify fixed values of assumed model\\nperformance metrics alongside target precision levels (e.g., 95% CI widths).\\nHowever, due to the finite samples of previous studies, our knowledge of true\\nmodel performance in the target population is uncertain, and so choosing fixed\\nvalues represents an incomplete picture. As well, for net benefit (NB) as a\\nmeasure of clinical utility, the relevance of conventional precision-based\\ninference is doubtful. In this work, we propose a general Bayesian algorithm\\nfor constructing the joint distribution of predicted risks and response values\\nbased on summary statistics of model performance in previous studies. For\\nstatistical metrics of performance, we propose sample size determination rules\\nthat either target desired expected precision, or a desired assurance\\nprobability that the precision criteria will be satisfied. For NB, we propose\\nrules based on optimality assurance (the probability that the planned study\\ncorrectly identifies the most beneficial strategy) and the Expected Value of\\nSample Information (EVSI), the expected gain in NB from the planned validation\\nstudy. We showcase these developments in a case study on the validation of a\\nrisk prediction model for deterioration of hospitalized COVID-19 patients.\\nCompared to the conventional sample size calculation methods, a Bayesian\\napproach requires explicit quantification of uncertainty around model\\nperformance, but thereby enables various sample size rules based on expected\\nprecision, assurance probabilities, and value of information.\", \"main_category\": \"stat.AP\", \"categories\": \"stat.AP,stat.CO,stat.ME\", \"published\": \"2025-04-22T14:07:05Z\"}"}
