{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04963v1\", \"title\": \"ViCTr: Vital Consistency Transfer for Pathology Aware Image Synthesis\", \"summary\": \"Synthesizing medical images remains challenging due to limited annotated\\npathological data, modality domain gaps, and the complexity of representing\\ndiffuse pathologies such as liver cirrhosis. Existing methods often struggle to\\nmaintain anatomical fidelity while accurately modeling pathological features,\\nfrequently relying on priors derived from natural images or inefficient\\nmulti-step sampling. In this work, we introduce ViCTr (Vital Consistency\\nTransfer), a novel two-stage framework that combines a rectified flow\\ntrajectory with a Tweedie-corrected diffusion process to achieve high-fidelity,\\npathology-aware image synthesis. First, we pretrain ViCTr on the ATLAS-8k\\ndataset using Elastic Weight Consolidation (EWC) to preserve critical\\nanatomical structures. We then fine-tune the model adversarially with Low-Rank\\nAdaptation (LoRA) modules for precise control over pathology severity. By\\nreformulating Tweedie's formula within a linear trajectory framework, ViCTr\\nsupports one-step sampling, reducing inference from 50 steps to just 4, without\\nsacrificing anatomical realism. We evaluate ViCTr on BTCV (CT), AMOS (MRI), and\\nCirrMRI600+ (cirrhosis) datasets. Results demonstrate state-of-the-art\\nperformance, achieving a Medical Frechet Inception Distance (MFID) of 17.01 for\\ncirrhosis synthesis 28% lower than existing approaches and improving nnUNet\\nsegmentation by +3.8% mDSC when used for data augmentation. Radiologist reviews\\nindicate that ViCTr-generated liver cirrhosis MRIs are clinically\\nindistinguishable from real scans. To our knowledge, ViCTr is the first method\\nto provide fine-grained, pathology-aware MRI synthesis with graded severity\\ncontrol, closing a critical gap in AI-driven medical imaging research.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-08T05:44:16Z\"}"}
