{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19709v1\", \"title\": \"SHINS, the SHARK-NIR Instrument Control Software\", \"summary\": \"SHARK-NIR is a new compact instrument for coronagraphic imaging, direct\\nimaging, and coronagraphic spectroscopy in the near-infrared wavelengths\\nmounted at LBT. Taking advantage of the telescope's adaptive optics system, it\\nprovides high contrast imaging with coronagraphic and spectroscopic\\ncapabilities and is focused on the direct imaging of exoplanets and\\ncircumstellar discs. We present SHINS, the SHARK-NIR instrument control\\nsoftware, mainly realized with the TwiceAsNice framework from MPIA - Heidelberg\\nand the ICE framework using the C++ programming language. We describe how we\\nimplemented the software components controlling several instrument subsystems,\\nthrough the adaptation of already tested libraries from other instruments at\\nLBT, such as LINC-NIRVANA. The scientific detector comes with its own readout\\nelectronic and control software interfaced with our software through INDI. We\\ndescribe the C++ core software Observation Control Software, responsible for\\ndispatching commands to the subsystems, also implementing a software solution\\nto avoid a potential collision between motorized components, fully transparent\\nto final users. It exposes an ICE interface and can be controlled by clients\\ndeveloped in different languages. Observation, calibration, and maintenance\\nprocedures are implemented by means of template scripts, written in python\\nlanguage, controlling Observation Control Software through its ICE interface.\\nThese templates and their parameters are configured using \\\"ESO-style\\\", XML\\nObservation Blocks prepared by observers, or in general SHARK-NIR users. The\\nhigh-level control is carried out by REST HTTP APIs implemented in a python\\nback-end, also acting as a web server for the several browser-based front-end\\nGUIs. Finally, we present the first scientific results obtained by SHARK-NIR\\nusing coronagraphic mode.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM,astro-ph.EP\", \"published\": \"2025-04-28T12:03:49Z\"}"}
