{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16857v1\", \"title\": \"Physical ageing from generalised time-translation-invariance\", \"summary\": \"A generalised form of time-translation-invariance permits to re-derive the\\nknown generic phenomenology of ageing, which arises in many-body systems after\\na quench from an initially disordered system to a temperature $T\\\\leq T_c$, at\\nor below the critical temperature $T_c$. Generalised\\ntime-translation-invariance is obtained, out of equilibrium, from a change of\\nrepresentation of the Lie algebra generators of the dynamical symmetries of\\nscale-invariance and time-translation-invariance. Observable consequences\\ninclude the algebraic form of the scaling functions for large arguments of the\\ntwo-time auto-correlators and auto-responses, the equality of the\\nauto-correlation and the auto-response exponents $\\\\lambda_C=\\\\lambda_R$, the\\ncross-over scaling form for an initially magnetised critical system and the\\nexplanation of a novel finite-size scaling if the auto-correlator or\\nauto-response converge for large arguments $y=t/s\\\\gg 1$ to a plateau. For\\nglobal two-time correlators, the time-dependence involving the initial critical\\nslip exponent $\\\\Theta$ is confirmed and is generalised to all temperatures\\nbelow criticality and to the global two-time response function, and their\\nfinite-size scaling is derived as well. This also includes the time-dependence\\nof the squared global order-parameter. The celebrate Janssen-Schaub-Schmittmann\\nscaling relation with the auto-correlation exponent is thereby extended to all\\ntemperatures below the critical temperature. A simple criterion on the\\nrelevance of non-linear terms in the stochastic equation of motion is derived,\\ntaking the dimensionality of couplings into account. Its applicability in a\\nwide class of models is confirmed, for temperatures $T\\\\leq T_c$. Relevance to\\nexperiments is also discussed.\", \"main_category\": \"cond-mat.stat-mech\", \"categories\": \"cond-mat.stat-mech,hep-th,math-ph,math.MP\", \"published\": \"2025-04-23T16:26:47Z\"}"}
