{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02385v1\", \"title\": \"Quantum singular value transformation without block encodings:\\n  Near-optimal complexity with minimal ancilla\", \"summary\": \"We develop new algorithms for Quantum Singular Value Transformation (QSVT), a\\nunifying framework underlying a wide range of quantum algorithms. Existing\\nimplementations of QSVT rely on block encoding, incurring $O(\\\\log L)$ ancilla\\noverhead and circuit depth $\\\\widetilde{O}(d\\\\lambda L)$ for polynomial\\ntransformations of a Hamiltonian $H=\\\\sum_{k=1}^L \\\\lambda_k H_k$, where $d$ is\\npolynomial degree, and $\\\\lambda=\\\\sum_k |\\\\lambda_k|$. We introduce a new\\napproach that eliminates block encoding, needs only a single ancilla qubit, and\\nmaintains near-optimal complexity, using only basic Hamiltonian simulation\\nmethods such as Trotterization. Our method achieves a circuit depth of\\n$\\\\widetilde{O}(L(d\\\\lambda_{\\\\mathrm{comm}})^{1+o(1)})$, without any multi-qubit\\ncontrolled gates. Here, $\\\\lambda_{\\\\mathrm{comm}}$ depends on the nested\\ncommutators of the $H_k$'s and can be much smaller than $\\\\lambda$. Central to\\nour technique is a novel use of Richardson extrapolation, enabling systematic\\nerror cancellation in interleaved sequences of arbitrary unitaries and\\nHamiltonian evolution operators, establishing a broadly applicable framework\\nbeyond QSVT. Additionally, we propose two randomized QSVT algorithms for cases\\nwith only sampling access to Hamiltonian terms. The first uses qDRIFT, while\\nthe second replaces block encodings in QSVT with randomly sampled unitaries.\\nBoth achieve quadratic complexity in $d$, which we establish as a lower bound\\nfor any randomized method implementing polynomial transformations in this\\nmodel. Finally, as applications, we develop end-to-end quantum algorithms for\\nquantum linear systems and ground state property estimation, achieving\\nnear-optimal complexity without oracular access. Our results provide a new\\nframework for quantum algorithms, reducing hardware overhead while maintaining\\nnear-optimal performance, with implications for both near-term and\\nfault-tolerant quantum computing.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cs.DS\", \"published\": \"2025-04-03T08:24:15Z\"}"}
