{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15967v1\", \"title\": \"A UAV-Aided Digital Twin Framework for IoT Networks with High Accuracy\\n  and Synchronization\", \"summary\": \"With the continued growth of its core technologies, including the Internet of\\nThings (IoT), artificial intelligence (AI), Big Data and data analytics, and\\nedge computing, digital twin (DT) technology has witnessed a significant\\nincrease in industrial applications, helping the industry become more\\nsustainable, smart, and adaptable. Hence, DT technology has emerged as a\\npromising link between the physical and virtual worlds, enabling simulation,\\nprediction, and real-time performance optimization. This work aims to explore\\nthe development of a high-fidelity digital twin framework, focusing on\\nsynchronization and accuracy between physical and digital systems to enhance\\ndata-driven decision making. To achieve this, we deploy several stationary UAVs\\nin optimized locations to collect data from industrial IoT devices, which were\\nused to monitor multiple physical entities and perform computations to evaluate\\ntheir status. We consider a practical setup in which multiple IoT devices may\\nmonitor a single physical entity, and as a result, the measurements are\\ncombined and processed together to determine the status of the physical entity.\\nThe resulting status updates are subsequently uploaded from the UAVs to the\\nbase station, where the DT resides. In this work, we consider a novel metric\\nbased on the Age of Information (AoI), coined as the Age of Digital Twin\\n(AoDT), to reflect the status freshness of the digital twin. Factoring AoDT in\\nthe problem formulation ensures that the DT reliably mirrors the physical\\nsystem with high accuracy and synchronization. We formulate a mixed-integer\\nnon-convex program to maximize the total amount of data collected from all IoT\\ndevices while ensuring a constrained AoDT. Using successive convex\\napproximations, we solve the problem, conduct extensive simulations and compare\\nthe results with baseline approaches to demonstrate the effectiveness of the\\nproposed solution.\", \"main_category\": \"cs.ET\", \"categories\": \"cs.ET,eess.SP\", \"published\": \"2025-04-22T15:07:07Z\"}"}
