{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14976v1\", \"title\": \"Effects of angular scattering and H+p, H+H collisions on the properties\\n  of interstellar atoms in the heliosphere\", \"summary\": \"Interstellar hydrogen atoms (H atoms) penetrate into the heliosphere through\\nthe region of the solar wind interaction with the interstellar plasma due to\\ntheir large mean free path. Resonant charge exchange of H atoms with protons\\nhas been considered as the main interaction process between the components. In\\nthe majority of models, other processes like elastic H-H and H-p collisions are\\nnot included. Moreover, it has been assumed that the velocities of the\\ncolliding particles remain unchanged during charge exchange. This corresponds\\nto the scattering on the angle of $\\\\pi$ in the centre mass rest frame.\\n  The goal of this paper is to explore effects of the elastic H-H and H-p\\ncollisions as well as the angular scattering during charge exchange on the\\ndistribution of the interstellar atoms in the heliosphere and at its boundary.\\n  We present results of simple (and therefore, easily repeatable) kinetic model\\nof the interstellar atom penetration through the region of the solar and\\ninterstellar winds interaction into the heliosphere. As a result of the model\\nwe compute the distribution function of the interstellar atoms at different\\nheliospheric distances. Further, this distribution function is used to compute\\nits moments and potentially observable features such as absorption and\\nbackscattered spectra in the Lyman-alpha line.\\n  Results show that there are differences in the behavior of the distribution\\nfunction when considering elastic collisions and the changes in the moments of\\nthe distribution achieve 10%. Therefore, in cases where precise calculation of\\nH atom parameters is essential, such as in the modeling of backscattered\\nLyman-$\\\\alpha$ emission, elastic collisions must be considered.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA\", \"published\": \"2025-04-21T09:07:39Z\"}"}
