{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17342v1\", \"title\": \"Fr\\u00e9chet Distance in Unweighted Planar Graphs\", \"summary\": \"The Fr\\\\'echet distance is a distance measure between trajectories in the\\nplane or walks in a graph G. Given constant-time shortest path queries in a\\ngraph G, the Discrete Fr\\\\'echet distance $F_G(P, Q)$ between two walks P and Q\\ncan be computed in $O(|P| \\\\cdot |Q|)$ time using a dynamic program. Driemel,\\nvan der Hoog, and Rotenberg [SoCG'22] show that for weighted planar graphs this\\napproach is likely tight, as there can be no strongly subquadratic algorithm to\\ncompute a $1.01$-approximation of $F_G(P, Q)$ unless the Orthogonal Vector\\nHypothesis (OVH) fails.\\n  Such quadratic-time conditional lower bounds are common to many Fr\\\\'echet\\ndistance variants. However, they can be circumvented by assuming that the input\\ncomes from some well-behaved class: There exist\\n$(1+\\\\varepsilon)$-approximations, both in weighted graphs and in Rd, that take\\nnear-linear time for $c$-packed or $\\\\kappa$-straight walks in the graph. In Rd,\\nthere also exists a near-linear time algorithm to compute the Fr\\\\'echet\\ndistance whenever all input edges are long compared to the distance.\\n  We consider computing the Fr\\\\'echet distance in unweighted planar graphs. We\\nshow that there exist no 1.25-approximations of the discrete Fr\\\\'echet distance\\nbetween two disjoint simple paths in an unweighted planar graph in strongly\\nsubquadratic time, unless OVH fails. This improves the previous lower bound,\\nboth in terms of generality and approximation factor. We subsequently show that\\nadding graph structure circumvents this lower bound: If the graph is a regular\\ntiling with unit-weighted edges, then there exists an $\\\\tilde{O}( (|P| +\\n|Q|)^{1.5})$-time algorithm to compute $D_F(P, Q)$. Our result has natural\\nimplications in the plane, as it allows us to define a new class of\\nwell-behaved curves that facilitate $(1+\\\\varepsilon)$-approximations of their\\ndiscrete Fr\\\\'echet distance in subquadratic time.\", \"main_category\": \"cs.CG\", \"categories\": \"cs.CG\", \"published\": \"2025-04-24T07:59:39Z\"}"}
