{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03358v1\", \"title\": \"Parametrically amplified Josephson plasma waves in YBa_2Cu_3O_(6+x):\\n  evidence for local superconducting fluctuations up to the pseudogap\\n  temperature $T^*$\", \"summary\": \"A number of experiments have reported evidence for the existence of the lower\\nJosephson plasmon mode in underdoped YBCO up to the pseudogap temperature scale\\nwhen the sample is subject to intense terahertz pulses. Evidences include the\\nobservation of a reflectivity edge that resembles that of the superconducting\\nstate, and the second harmonic generation of a probe optical pulse that is\\nmodulated at a frequency similar the reflectivity feature. Since the lower\\nJosephson plasmon mode is often associated with coherent oscillations between\\nbilayers in the YBCO structure, these experiments have led to the suggestion\\nthat the intense pump has created pair coherence up to 350K. In this paper, we\\npropose an alternative explanation of these experiments based on the model of\\nshort ranged superconducting correlations in the equilibrium state and using\\nthe Floquet perspective to analyze optical responses of the photoexcited state.\\nOur model only requires local pairing with phase correlations that can be very\\nshort ranged when the system is at equilibrium at a temperature above Tc but\\nbelow the pseudo-gap temperature T*. Within this assumption there is no phase\\ncoherence between bilayers. On the other hand the relative phase between\\nmembers of the bilayer has a longer in-plane correlation which leads locally to\\na finite Josephson current. We show that the nonlinearity afforded by the local\\nintra-bilayer Josephson current is sufficient to explain both the reflectivity\\nand second harmonic generation data. The key point is that in the lower\\nJosephson plasmon, the coupling between bilayers is mainly capacitive: the\\nJosepson current between bilayers can be set to zero without affecting the\\nparametric amplification process. The implication is that while superconducting\\ncoherence may not be created by the pump, the pseudogap phase must possess a\\nlocal pairing amplitude at equilibrium.\", \"main_category\": \"cond-mat.supr-con\", \"categories\": \"cond-mat.supr-con,cond-mat.str-el,physics.optics\", \"published\": \"2025-05-06T09:28:40Z\"}"}
