{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21459v1\", \"title\": \"A Unified Variational Framework for Quantum Excited States\", \"summary\": \"Determining quantum excited states is crucial across physics and chemistry\\nbut presents significant challenges for variational methods, primarily due to\\nthe need to enforce orthogonality to lower-energy states, often requiring\\nstate-specific optimization, penalty terms, or specialized ansatz\\nconstructions. We introduce a novel variational principle that overcomes these\\nlimitations, enabling the \\\\textit{simultaneous} determination of multiple\\nlow-energy excited states. The principle is based on minimizing the trace of\\nthe inverse overlap matrix multiplied by the Hamiltonian matrix,\\n$\\\\mathrm{Tr}(\\\\mathbf{S}^{-1}\\\\mathbf{H})$, constructed from a set of\\n\\\\textit{non-orthogonal} variational states $\\\\{|\\\\psi_i\\\\rangle\\\\}$. Here,\\n$\\\\mathbf{H}_{ij} = \\\\langle\\\\psi_i | H | \\\\psi_j\\\\rangle$ and $\\\\mathbf{S}_{ij} =\\n\\\\langle\\\\psi_i | \\\\psi_j\\\\rangle$ are the elements of the Hamiltonian and overlap\\nmatrices, respectively. This approach variationally optimizes the entire\\nlow-energy subspace spanned by $\\\\{|\\\\psi_i\\\\rangle\\\\}$ without explicit\\northogonality constraints or penalty functions. We demonstrate the power and\\ngenerality of this method across diverse physical systems and variational\\nansatzes: calculating the low-energy spectrum of 1D Heisenberg spin chains\\nusing matrix product states, finding vibrational spectrum of Morse potential\\nusing quantics tensor trains for real-space wavefunctions, and determining\\nexcited states for 2D fermionic Hubbard model with variational quantum\\ncircuits. In all applications, the method accurately and simultaneously obtains\\nmultiple lowest-lying energy levels and their corresponding states, showcasing\\nits potential as a unified and flexible framework for calculating excited\\nstates on both classical and quantum computational platforms.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cond-mat.str-el\", \"published\": \"2025-04-30T09:28:04Z\"}"}
