{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17438v1\", \"title\": \"Storing and Querying Evolving Graphs in NoSQL Storage Models\", \"summary\": \"This paper investigates advanced storage models for evolving graphs, focusing\\non the efficient management of historical data and the optimization of global\\nquery performance. Evolving graphs, which represent dynamic relationships\\nbetween entities over time, present unique challenges in preserving their\\ncomplete history while supporting complex analytical queries. We first do a\\nfast review of the current state of the art focusing mainly on distributed\\nhistorical graph databases to provide the context of our proposals. We\\ninvestigate the im- plementation of an enhanced vertex-centric storage model in\\nMongoDB that prioritizes space efficiency by leveraging in-database query\\nmechanisms to minimize redundant data and reduce storage costs. To ensure broad\\napplicability, we employ datasets, some of which are generated with the LDBC\\nSNB generator, appropriately post-processed to utilize both snapshot- and\\ninterval-based representations. Our experimental results both in centralized\\nand distributed infrastructures, demonstrate significant improvements in query\\nperformance, particularly for resource-intensive global queries that\\ntraditionally suffer from inefficiencies in entity-centric frameworks. The\\nproposed model achieves these gains by optimizing memory usage, reducing client\\ninvolvement, and exploiting the computational capabilities of MongoDB. By\\naddressing key bottlenecks in the storage and processing of evolving graphs,\\nthis study demonstrates a step toward a robust and scalable framework for\\nmanaging dynamic graph data. This work contributes to the growing field of\\ntemporal graph analytics by enabling more efficient ex- ploration of historical\\ndata and facilitating real-time insights into the evolution of complex\\nnetworks.\", \"main_category\": \"cs.DB\", \"categories\": \"cs.DB\", \"published\": \"2025-04-24T10:57:27Z\"}"}
