{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03317v1\", \"title\": \"Identification of BHB stars using Synthetic SkyMapper colors from Gaia\\n  XP spectra\", \"summary\": \"Blue horizontal-branch (BHB) stars are ideal tracers for mapping the\\nstructure of Galactic stellar halo. Traditionally, BHB sample stars are built\\nfrom large-scale spectroscopic surveys utilizing their spectral features,\\nhowever, the resulting sample sizes have been quite limited. In this paper, we\\nconstruct a catalog of BHB stars based on synthetic colors $(u-v)_{0}$ and\\n$(g-i)_{0}$ in SkyMapper photometric systems, which are convolved from Gaia XP\\nspectra. A total of 49,733 BHB stars are selected from nearly the entire sky\\n(excluding regions of low Galactic latitudes $|b| \\\\le 8^{\\\\circ}$ with heavy\\nreddening), with a completeness and purity exceeding 90\\\\%. Using member stars\\nof globular clusters with precise distance determinations, we carefully\\ncalibrate the relationship between the $g$-band absolute magnitude and\\n$(g-i)_{0}$, achieving a precision of 0.11\\\\,mag, which corresponds to a 5\\\\%\\nuncertainty in distance. This relation is applied to derive distances for all\\nBHB stars in the constructed sample. Given current capabilities of Gaia XP\\nobservations, the constructed BHB sample is primarily located within 20 kpc,\\nenabling detailed mapping of the inner stellar halo. To extend this depth to\\nthe outer halo or even the edge of our Galaxy, we explore the potential of the\\nChinese Space Station Telescope (CSST) and its broad-band photometry for\\ndetecting BHB stars. Using mock data from synthetic spectra, we find that it is\\nfeasible to distinguish BHB stars from blue stragglers (BS) stars using CSST\\nnear-ultraviolet bands ($NUV, u$) photometry. Thanks to the deep limiting\\nmagnitude of CSST, its data will provide a groundbreaking perspective on our\\nGalaxy, particularly regarding the outer halo, in an unprecedented volume.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.SR\", \"published\": \"2025-05-06T08:46:10Z\"}"}
