{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05762v1\", \"title\": \"Statistics of velocity gradient and vortex sheet structures in polymeric\\n  turbulent von K{\\u00e1}rm{\\u00e1}n swirling flow\", \"summary\": \"Investigations into the effects of polymers on small-scale statistics and\\nflow patterns were conducted in a turbulent von Karman swirling (VKS) flow. We\\nemployed the tomographic particle image velocimetry (Tomo-PIV) technique to\\nobtain full information on three-dimensional velocity data, allowing us to\\neffectively resolve dissipation scales. Under varying Reynolds numbers\\n($R_\\\\lambda=168 - 235$) and polymer concentrations ($\\\\phi=0 -25~\\\\rm ppm$), we\\nmeasured the velocity gradient tensor (VGT) and related quantities. Our\\nfindings reveal that the ensemble average and probability density function\\n(PDF) of VGT invariants, which represent turbulent dissipation and enstrophy\\nalong with their generation terms, are suppressed as polymer concentration\\nincreases. Notably, the joint PDFs of the invariants of VGT, which characterize\\nlocal flow patterns, exhibited significant changes. Specifically, the\\nthird-order invariants, especially the local vortex stretching, are greatly\\nsuppressed, and strong events of dissipation and enstrophy coexist in space.\\nThe local flow pattern tends to be two-dimensional, where the eigenvalues of\\nthe rate-of-strain tensor satisfy a ratio $1:0:-1$, and the vorticity aligns\\nwith the intermediate eigenvector of the rate-of-strain tensor while is\\nperpendicular to the other two. We find that these statistics observations can\\nbe well described by the vortex sheet model. Moreover, we find that these\\nvortex sheet structures align with the symmetry axis of the VKS system and\\norient randomly in the horizontal plane. Further investigation, including flow\\nvisualization and conditional statistics on vorticity, confirms the presence of\\nvortex sheet structures in turbulent flows with polymer additions. Our results\\nestablish a link between single-point statistics and small-scale flow topology,\\nshedding light on the previously overlooked small-scale structures in polymeric\\nturbulence.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-08T07:43:17Z\"}"}
