{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06618v1\", \"title\": \"Human-like compositional learning of visually-grounded concepts using\\n  synthetic environments\", \"summary\": \"The compositional structure of language enables humans to decompose complex\\nphrases and map them to novel visual concepts, showcasing flexible\\nintelligence. While several algorithms exhibit compositionality, they fail to\\nelucidate how humans learn to compose concept classes and ground visual cues\\nthrough trial and error. To investigate this multi-modal learning challenge, we\\ndesigned a 3D synthetic environment in which an agent learns, via\\nreinforcement, to navigate to a target specified by a natural language\\ninstruction. These instructions comprise nouns, attributes, and critically,\\ndeterminers, prepositions, or both. The vast array of word combinations\\nheightens the compositional complexity of the visual grounding task, as\\nnavigating to a blue cube above red spheres is not rewarded when the\\ninstruction specifies navigating to \\\"some blue cubes below the red sphere\\\". We\\nfirst demonstrate that reinforcement learning agents can ground determiner\\nconcepts to visual targets but struggle with more complex prepositional\\nconcepts. Second, we show that curriculum learning, a strategy humans employ,\\nenhances concept learning efficiency, reducing the required training episodes\\nby 15% in determiner environments and enabling agents to easily learn\\nprepositional concepts. Finally, we establish that agents trained on determiner\\nor prepositional concepts can decompose held-out test instructions and rapidly\\nadapt their navigation policies to unseen visual object combinations.\\nLeveraging synthetic environments, our findings demonstrate that multi-modal\\nreinforcement learning agents can achieve compositional understanding of\\ncomplex concept classes and highlight the efficacy of human-like learning\\nstrategies in improving artificial systems' learning efficiency.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-09T06:33:28Z\"}"}
