{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11273v1\", \"title\": \"Hybrid Compton-PET Imaging for ion-range verification:A Preclinical\\n  Study for Proton-, Helium-, and Carbon-Therapy at HIT\", \"summary\": \"Enhanced-accuracy ion-range verification in real time shall enable a\\nsignificant step forward in the use of therapeutic ion beams. Positron-emission\\ntomography (PET) and prompt-gamma imaging (PGI) are two of the most promising\\nand researched methodologies, both of them with their own advantages and\\nchallenges. Thus far, both of them have been explored for ion-range\\nverification in an independent way. However, the simultaneous combination of\\nPET and PGI within the same imaging framework may open-up the possibility to\\nexploit more efficiently all radiative emissions excited in the tissue by the\\nion beam. Here we report on the first pre-clinical implementation of an hybrid\\nPET-PGI imaging system, hereby exploring its performance over several ion-beam\\nspecies (H, He and C), energies (55 MeV to 275 MeV) and intensities\\n(10$^7$-10$^9$ ions/spot), which are representative of clinical conditions. The\\nmeasurements were carried out using the pencil-beam scanning technique at the\\nsynchrotron accelerator of the Heavy Ion Therapy centre in Heidelberg utilizing\\nan array of four Compton cameras in a twofold front-to-front configuration. The\\nresults demonstrate that the hybrid PET-PGI technique can be well suited for\\nrelatively low energies (55-155 MeV) and beams of protons. On the other hand,\\nfor heavier beams of helium and carbon ions at higher energies (155-275 MeV),\\nrange monitoring becomes more challenging owing to large backgrounds from\\nadditional nuclear processes. The experimental results are well understood on\\nthe basis of realistic Monte Carlo (MC) calculations, which show a satisfactory\\nagreement with the measured data. This work can guide further upgrades of the\\nhybrid PET-PGI system towards a clinical implementation of this innovative\\ntechnique.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph,physics.ins-det\", \"published\": \"2025-04-15T15:14:28Z\"}"}
