{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15758v1\", \"title\": \"Observability conditions for neural state-space models with eigenvalues\\n  and their roots of unity\", \"summary\": \"We operate through the lens of ordinary differential equations and control\\ntheory to study the concept of observability in the context of neural\\nstate-space models and the Mamba architecture. We develop strategies to enforce\\nobservability, which are tailored to a learning context, specifically where the\\nhidden states are learnable at initial time, in conjunction to over its\\ncontinuum, and high-dimensional. We also highlight our methods emphasize\\neigenvalues, roots of unity, or both. Our methods effectuate computational\\nefficiency when enforcing observability, sometimes at great scale. We formulate\\nobservability conditions in machine learning based on classical control theory\\nand discuss their computational complexity. Our nontrivial results are\\nfivefold. We discuss observability through the use of permutations in neural\\napplications with learnable matrices without high precision. We present two\\nresults built upon the Fourier transform that effect observability with high\\nprobability up to the randomness in the learning. These results are worked with\\nthe interplay of representations in Fourier space and their eigenstructure,\\nnonlinear mappings, and the observability matrix. We present a result for Mamba\\nthat is similar to a Hautus-type condition, but instead employs an argument\\nusing a Vandermonde matrix instead of eigenvectors. Our final result is a\\nshared-parameter construction of the Mamba system, which is computationally\\nefficient in high exponentiation. We develop a training algorithm with this\\ncoupling, showing it satisfies a Robbins-Monro condition under certain\\northogonality, while a more classical training procedure fails to satisfy a\\ncontraction with high Lipschitz constant.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.SY,eess.SY,math.DS,math.OC\", \"published\": \"2025-04-22T10:10:52Z\"}"}
