{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16387v1\", \"title\": \"Impact of Fuel Injection Temperature Dynamics on the Stability of Liquid\\n  Oxygen-Methane Supercritical Combustion\", \"summary\": \"A crucial factor in the stability of high-pressure rocket-scale combustors is\\nthe temperature at which fuel is injected. This study investigates its effect\\non the stability of supercritical liquid oxygen (LOx)-methane combustion and\\nhighlights the impact of shear layer dynamics in cases with lower injection\\ntemperatures. The stability features of a rocket-scale combustor operating with\\nmultiple injector elements are investigated using a high-fidelity large eddy\\nsimulation (LES) framework. The numerical framework combines a\\nflamelet-generated manifold (FGM) combustion model with complex real gas\\nthermodynamics in a scale-resolving simulation setup. It reproduces the\\nnon-equilibrium transcritical injection and supercritical combustion\\ncharacteristics of supercritical methane-oxygen flames. To ascertain the effect\\nof injection temperature on flame and combustor stability, we perform several\\nLES simulations at various methane injection temperatures and produce a\\nstability map. Our analysis shows extremely unstable flame characteristics at\\nlower fuel injection temperatures that are not seen under typical fuel\\ninjection circumstances. Below a specific methane injection temperature, LES\\ncaptures a high-amplitude, self-sustaining instability. It is determined that\\nthe combustor becomes unstable below a specific stability boundary temperature.\\nDetailed spectral and dynamic mode decomposition (DMD) analysis of the stable\\nand unstable cases reveals the onset of longitudinal acoustic waves in the\\ncombustor. Our thorough investigation pinpoints the instability mechanism,\\nemphasizing that the leading causes of this self-sustaining instability in the\\ncombustor are a reduced velocity ratio, fuel buildup, and fuel cut-off\\noccurrences.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-23T03:30:00Z\"}"}
