{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14994v1\", \"title\": \"Learning Compositional Transferability of Time Series for Source-Free\\n  Domain Adaptation\", \"summary\": \"Domain adaptation is challenging for time series classification due to the\\nhighly dynamic nature. This study tackles the most difficult subtask when both\\ntarget labels and source data are inaccessible, namely, source-free domain\\nadaptation. To reuse the classification backbone pre-trained on source data,\\ntime series reconstruction is a sound solution that aligns target and source\\ntime series by minimizing the reconstruction errors of both. However, simply\\nfine-tuning the source pre-trained reconstruction model on target data may lose\\nthe learnt priori, and it struggles to accommodate domain varying temporal\\npatterns in a single encoder-decoder. Therefore, this paper tries to\\ndisentangle the composition of domain transferability by using a compositional\\narchitecture for time series reconstruction. Here, the preceding component is a\\nU-net frozen since pre-trained, the output of which during adaptation is the\\ninitial reconstruction of a given target time series, acting as a coarse step\\nto prompt the subsequent finer adaptation. The following pipeline for finer\\nadaptation includes two parallel branches: The source replay branch using a\\nresidual link to preserve the output of U-net, and the offset compensation\\nbranch that applies an additional autoencoder (AE) to further warp U-net's\\noutput. By deploying a learnable factor on either branch to scale their\\ncomposition in the final output of reconstruction, the data transferability is\\ndisentangled and the learnt reconstructive capability from source data is\\nretained. During inference, aside from the batch-level optimization in the\\ntraining, we search at test time stability-aware rescaling of source replay\\nbranch to tolerate instance-wise variation. The experimental results show that\\nsuch compositional architecture of time series reconstruction leads to SOTA\\nperformance on 3 widely used benchmarks.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-21T09:51:24Z\"}"}
