{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11196v1\", \"title\": \"The Lifetime of the Covid Memorial Wall: Modelling with Collections\\n  Demography, Social Media Data and Citizen Science\", \"summary\": \"The National Covid Memorial Wall in London, featuring over 240,000\\nhand-painted red hearts, faces significant conservation challenges due to the\\nrapid fading of the paint. This study evaluates the transition to a\\nbetter-quality paint and its implications for the wall's long-term\\npreservation. The rapid fading of the initial materials required an\\nunsustainable repainting rate, burdening volunteers. Lifetime simulations based\\non a collections demography framework suggest that repainting efforts must\\ncontinue at a rate of some hundreds of hearts per week to maintain a stable\\npercentage of hearts in good condition. This finding highlights the need for a\\nsustainable management strategy that includes regular maintenance or further\\nreduction of the fading rate.\\n  Methodologically, this study demonstrates the feasibility of using a\\ncollections demography approach, supported by citizen science and social media\\ndata, to inform heritage management decisions. An agent-based simulation is\\nused to propagate the multiple uncertainties measured. The methodology provides\\na robust basis for modeling and decision-making, even in a case like this,\\nwhere reliance on publicly available images and volunteer-collected data\\nintroduces variability. Future studies could improve data within a citizen\\nscience framework by inviting public submissions, using on-site calibration\\ncharts, and increasing volunteer involvement for longitudinal data collection.\\nThis research illustrates the flexibility of the collections demography\\nframework, firstly by showing its applicability to an outdoor monument, which\\nis very different from the published case studies, and secondly by\\ndemonstrating how it can work even with low-quality data.\", \"main_category\": \"cs.CY\", \"categories\": \"cs.CY\", \"published\": \"2025-04-15T13:51:14Z\"}"}
