{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16081v1\", \"title\": \"Survey of Video Diffusion Models: Foundations, Implementations, and\\n  Applications\", \"summary\": \"Recent advances in diffusion models have revolutionized video generation,\\noffering superior temporal consistency and visual quality compared to\\ntraditional generative adversarial networks-based approaches. While this\\nemerging field shows tremendous promise in applications, it faces significant\\nchallenges in motion consistency, computational efficiency, and ethical\\nconsiderations. This survey provides a comprehensive review of diffusion-based\\nvideo generation, examining its evolution, technical foundations, and practical\\napplications. We present a systematic taxonomy of current methodologies,\\nanalyze architectural innovations and optimization strategies, and investigate\\napplications across low-level vision tasks such as denoising and\\nsuper-resolution. Additionally, we explore the synergies between diffusionbased\\nvideo generation and related domains, including video representation learning,\\nquestion answering, and retrieval. Compared to the existing surveys (Lei et\\nal., 2024a;b; Melnik et al., 2024; Cao et al., 2023; Xing et al., 2024c) which\\nfocus on specific aspects of video generation, such as human video synthesis\\n(Lei et al., 2024a) or long-form content generation (Lei et al., 2024b), our\\nwork provides a broader, more updated, and more fine-grained perspective on\\ndiffusion-based approaches with a special section for evaluation metrics,\\nindustry solutions, and training engineering techniques in video generation.\\nThis survey serves as a foundational resource for researchers and practitioners\\nworking at the intersection of diffusion models and video generation, providing\\ninsights into both the theoretical frameworks and practical implementations\\nthat drive this rapidly evolving field. A structured list of related works\\ninvolved in this survey is also available on\\nhttps://github.com/Eyeline-Research/Survey-Video-Diffusion.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.CL\", \"published\": \"2025-04-22T17:59:17Z\"}"}
