{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03424v1\", \"title\": \"Framework GNN-AID: Graph Neural Network Analysis Interpretation and\\n  Defense\", \"summary\": \"The growing need for Trusted AI (TAI) highlights the importance of\\ninterpretability and robustness in machine learning models. However, many\\nexisting tools overlook graph data and rarely combine these two aspects into a\\nsingle solution. Graph Neural Networks (GNNs) have become a popular approach,\\nachieving top results across various tasks. We introduce GNN-AID (Graph Neural\\nNetwork Analysis, Interpretation, and Defense), an open-source framework\\ndesigned for graph data to address this gap. Built as a Python library, GNN-AID\\nsupports advanced trust methods and architectural layers, allowing users to\\nanalyze graph datasets and GNN behavior using attacks, defenses, and\\ninterpretability methods.\\n  GNN-AID is built on PyTorch-Geometric, offering preloaded datasets, models,\\nand support for any GNNs through customizable interfaces. It also includes a\\nweb interface with tools for graph visualization and no-code features like an\\ninteractive model builder, simplifying the exploration and analysis of GNNs.\\nThe framework also supports MLOps techniques, ensuring reproducibility and\\nresult versioning to track and revisit analyses efficiently.\\n  GNN-AID is a flexible tool for developers and researchers. It helps\\ndevelopers create, analyze, and customize graph models, while also providing\\naccess to prebuilt datasets and models for quick experimentation. Researchers\\ncan use the framework to explore advanced topics on the relationship between\\ninterpretability and robustness, test defense strategies, and combine methods\\nto protect against different types of attacks.\\n  We also show how defenses against evasion and poisoning attacks can conflict\\nwhen applied to graph data, highlighting the complex connections between\\ndefense strategies.\\n  GNN-AID is available at\\n\\\\href{https://github.com/ispras/GNN-AID}{github.com/ispras/GNN-AID}\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-05-06T11:03:19Z\"}"}
