{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16077v1\", \"title\": \"Intent-aware Diffusion with Contrastive Learning for Sequential\\n  Recommendation\", \"summary\": \"Contrastive learning has proven effective in training sequential\\nrecommendation models by incorporating self-supervised signals from augmented\\nviews. Most existing methods generate multiple views from the same interaction\\nsequence through stochastic data augmentation, aiming to align their\\nrepresentations in the embedding space. However, users typically have specific\\nintents when purchasing items (e.g., buying clothes as gifts or cosmetics for\\nbeauty). Random data augmentation used in existing methods may introduce noise,\\ndisrupting the latent intent information implicit in the original interaction\\nsequence. Moreover, using noisy augmented sequences in contrastive learning may\\nmislead the model to focus on irrelevant features, distorting the embedding\\nspace and failing to capture users' true behavior patterns and intents. To\\naddress these issues, we propose Intent-aware Diffusion with contrastive\\nlearning for sequential Recommendation (InDiRec). The core idea is to generate\\nitem sequences aligned with users' purchasing intents, thus providing more\\nreliable augmented views for contrastive learning. Specifically, InDiRec first\\nperforms intent clustering on sequence representations using K-means to build\\nintent-guided signals. Next, it retrieves the intent representation of the\\ntarget interaction sequence to guide a conditional diffusion model, generating\\npositive views that share the same underlying intent. Finally, contrastive\\nlearning is applied to maximize representation consistency between these\\nintent-aligned views and the original sequence. Extensive experiments on five\\npublic datasets demonstrate that InDiRec achieves superior performance compared\\nto existing baselines, learning more robust representations even under noisy\\nand sparse data conditions.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-04-22T17:55:56Z\"}"}
