{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03723v1\", \"title\": \"Effects of transient stellar emissions on planetary climates of\\n  tidally-locked exo-earths\", \"summary\": \"Space weather events in planetary environments sourced from transient host\\nstar emissions, including stellar flares, coronal mass ejections, and stellar\\nproton events, can substantially influence an exoplanet's climate and\\natmospheric evolution history. These time-dependent events may also affect our\\nability to measure and interpret its properties by modulating reservoirs of key\\nchemical compounds and changing the atmosphere's brightness temperature. The\\nmajority of previous work focusing on photochemical effects used single-column\\nmodels. Here, using three-dimensional (3D) general circulation models with\\ninteractive photochemistry, we simulate the climate and chemical impacts of\\nstellar flare-sourced energetic particle precipitation. We examine their\\neffects on synchronously rotating TRAPPIST-1e-like planets on a range of\\nspatiotemporal scales. We find that sudden thermospheric cooling is associated\\nwith radiative cooling of NO and CO$_2$, and middle-to-lower atmospheric\\nwarming is associated with transient increases in infrared absorbers such as\\nN$_2$O and H$_2$O. In certain regimes, these temperature changes are strongly\\naffected by O$_3$ variability depending on the flare's spectral shape and\\nenergy. However, the role of O$_3$ in temperature change is reduced in the most\\nextreme flaring scenarios explored in our simulations. In addition to effects\\non planetary climate and atmospheric chemistry, we also find that intense\\nflares can energize the middle atmosphere, causing enhancements in wind\\nvelocities up to 40 m s$^{-1}$ in sub-stellar night-sides between 30 and 50 km\\nin altitude. Our results suggest that successive, energetic eruptive events\\nfrom younger stars may be pivotal factors in determining the atmosphere\\ndynamics of their planets.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-05-06T17:51:42Z\"}"}
