{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06115v1\", \"title\": \"In search of almost generic Calabi-Yau 3-folds\", \"summary\": \"We call a projective Calabi-Yau (CY) 3-fold almost generic if it has only\\nisolated nodes as singularities and the homology classes of all of the\\nexceptional curves in an analytic small resolution are non-trivial but torsion.\\nSuch a Calabi-Yau supports a topologically non-trivial flat B-field and the\\ncorresponding A-model topological string partition function encodes a torsion\\nrefinement of the Gopakumar-Vafa invariants of the smooth deformation. Our goal\\nin this paper is to find new examples of almost generic CY 3-folds, using both\\nconifold transitions as well as the integral structure of the periods of the\\nmirrors. In this way we explicitly construct two quintic CY 3-folds with\\n$\\\\mathbb{Z}_2$-torsion, two octics with $\\\\mathbb{Z}_3$-torsion and deduce the\\nexistence of a complete intersection\\n$X_{(6,6)}\\\\subset\\\\mathbb{P}^5_{1,1,2,2,3,3}$ with $\\\\mathbb{Z}_5$-torsion. Via\\nmirror symmetry, the examples give new geometric interpretations to several\\nAESZ Calabi-Yau operators. The mirror periods of the almost generic $X_{(6,6)}$\\nwith non-trivial B-field topology are annihilated by an irrational Picard-Fuchs\\noperator. We describe how the usual integral structure of the periods has to be\\nmodified and in all of the cases we calculate the monodromies around the\\nsingular points to verify integrality. Additional points of maximally unipotent\\nmonodromy in the moduli spaces lead us to find several more examples of smooth\\nor almost generic CY 3-folds and to conjecture new twisted derived\\nequivalences. We integrate the holomorphic anomaly equations and extract the\\ntorsion refined Gopakumar-Vafa invariants up to varying genus. For our\\nconstruction of the almost generic octic CY 3-folds, we also give a short\\nintroduction to the subject of hypermatrices and hyperdeterminants.\", \"main_category\": \"hep-th\", \"categories\": \"hep-th,math.AG\", \"published\": \"2025-04-08T15:07:42Z\"}"}
