{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24196v1\", \"title\": \"Fermilab's Transition to Token Authentication\", \"summary\": \"Fermilab is the first High Energy Physics institution to transition from\\nX.509 user certificates to authentication tokens in production systems. All the\\nexperiments that Fermilab hosts are now using JSON Web Token (JWT) access\\ntokens in their grid jobs. Many software components have been either updated or\\ncreated for this transition, and most of the software is available to others as\\nopen source. The tokens are defined using the WLCG Common JWT Profile. Token\\nattributes for all the tokens are stored in the Fermilab FERRY system which\\ngenerates the configuration for the CILogon token issuer. High security-value\\nrefresh tokens are stored in Hashicorp Vault configured by htvault-config, and\\nJWT access tokens are requested by the htgettoken client through its\\nintegration with HTCondor. The Fermilab job submission system jobsub was\\nredesigned to be a lightweight wrapper around HTCondor. The grid workload\\nmanagement system GlideinWMS which is also based on HTCondor was updated to use\\ntokens for pilot job submission. For automated job submissions a managed tokens\\nservice was created to reduce duplication of effort and knowledge of how to\\nsecurely keep tokens active. The existing Fermilab file transfer tool ifdh was\\nupdated to work seamlessly with tokens, as well as the Fermilab POMS\\n(Production Operations Management System) which is used to manage automatic job\\nsubmission and the RCDS (Rapid Code Distribution System) which is used to\\ndistribute analysis code via the CernVM FileSystem. The dCache storage system\\nwas reconfigured to accept tokens for authentication in place of X.509 proxy\\ncertificates. As some services and sites have not yet implemented token\\nsupport, proxy certificates are still sent with jobs for backwards\\ncompatibility, but some experiments are beginning to transition to stop using\\nthem.\", \"main_category\": \"cs.DC\", \"categories\": \"cs.DC\", \"published\": \"2025-03-31T15:14:29Z\"}"}
