{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17769v1\", \"title\": \"Bringing light into the Landau-Lifshitz-Gilbert equation: Consequences\\n  of its fractal non-Markovian memory kernel for optically induced magnetic\\n  inertia and magnons\", \"summary\": \"The Landau-Lisfhitz-Gilbert (LLG) equation has been the cornerstone of\\nmodeling the dynamics of localized spins, viewed as classical vectors of fixed\\nlength, within nonequilibrium magnets. When light is employed as the\\nnonequilibrium drive, the LLG equation must be supplemented with additional\\nterms that are usually conjectured using phenomenological arguments for direct\\nopto-magnetic coupling between localized spins and (real or effective) magnetic\\nfield of light. However, direct coupling of magnetic field to spins is 1/c\\nsmaller than coupling of light and electrons; or both magnetic and electric\\nfields are too fast for slow classical spins to be able to follow them. Here,\\nwe displace the need for phenomenological arguments by rigorously deriving an\\nextended LLG equation via Schwinger-Keldysh field theory (SKFT). Within such a\\ntheory, light interacts with itinerant electrons, and then spin current carried\\nby them exerts spin-transfer torque onto localized spins, so that when\\nphotoexcited electrons are integrated out we arrive at a spin-only equation.\\nUnlike the standard phenomenological LLG equation with local-in-time Gilbert\\ndamping, our extended one contains a non-Markovian memory kernel whose plot\\nwithin the plane of its two times variables exhibits fractal properties. By\\napplying SKFT-derived extended LLG equation, as our central result, to a\\nlight-driven ferromagnet as an example, we predict an optically induced\\nmagnetic inertia term. Its magnitude is governed by spatially nonlocal and\\ntime-dependent prefactor, leading to excitation of coherent magnons at sharp\\nfrequencies in and outside of the band of incoherent (or thermal) magnons.\", \"main_category\": \"cond-mat.mes-hall\", \"categories\": \"cond-mat.mes-hall\", \"published\": \"2025-04-24T17:41:17Z\"}"}
