{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17251v1\", \"title\": \"Ultrafast ultrasound coded vector Doppler imaging of blood flow velocity\\n  and resistivity\", \"summary\": \"Dynamic and precise measurement of cerebral blood flow velocity is crucial in\\nneuroscience and the diagnosis of cerebrovascular diseases. Traditional color\\nDoppler ultrasound can only measure the velocity component along the ultrasound\\nbeam, which restricts its ability to accurately capture the complete blood flow\\nvector in complex environments. To overcome these limitations, we propose an\\nultrafast pulse-coded vector Doppler (PC-UVD) imaging method, utilizing\\nHadamard matrix-based pulse encoding to improve velocity estimation accuracy\\nunder low signal-to-noise ratio (SNR) conditions. Our study encompasses spiral\\nflow simulations and in vivo rat brain experiments, showing significantly\\nenhanced measurement precision compared to conventional ultrafast vector\\nDoppler (UVD). This innovative approach enables the measurement of dynamic\\ncerebral blood flow velocity within a single cardiac cycle, offering insights\\ninto the characteristics of cerebrovascular resistivity. The proposed PC-UVD\\nmethod employs Hadamard matrix encoding of plane waves, boosting SNR without\\ncompromising temporal or spatial resolution. Velocity vectors are subsequently\\nestimated using a weighted least squares (WLS) approach, with iterative\\nresidual-based weight optimization improving robustness to noise and minimizing\\nthe impact of outliers. The effectiveness of this technique is confirmed\\nthrough simulations with a spiral blood flow phantom, demonstrating a marked\\nimprovement in velocity estimation accuracy, particularly in deep imaging\\nregions with significant signal attenuation. In vivo experiments on rat brains\\nfurther confirm that the proposed method offers greater accuracy than existing\\nUVD approaches, particularly for small vessels. Notably, our method can\\nprecisely differentiate arterial from venous flow by analyzing pulsatility and\\nresistivity within the cerebral vascular network.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph\", \"published\": \"2025-04-24T05:01:06Z\"}"}
