{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20937v1\", \"title\": \"M\\u00ecmir: A real-time interactive visualization library for CUDA programs\", \"summary\": \"Real-time visualization of computational simulations running over graphics\\nprocessing units (GPU) is a valuable feature in modern science and\\ntechnological research, as it allows researchers to visually assess the quality\\nand correctness of their computational models during the simulation. Due to the\\nhigh throughput involved in GPU-based simulations, classical visualization\\napproaches such as ones based on copying to RAM or storage are not feasible\\nanymore, as they imply large memory transfers between GPU and CPU at each\\nmoment, reducing both computational performance and interactivity. Implementing\\nreal-time visualizers for GPU simulation codes is a challenging task as it\\ninvolves dealing with i) low-level integration of graphics APIs (e.g, OpenGL\\nand Vulkan) into the general-purpose GPU code, ii) a careful and efficient\\nhandling of memory spaces and iii) finding a balance between rendering and\\ncomputing as both need the GPU resources. In this work we present M\\\\`imir, a\\nCUDA/Vulkan interoperability C++ library that allows users to add real-time\\n2D/3D visualization to CUDA codes with low programming effort. With M\\\\`imir,\\nresearchers can leverage state-of-the-art CUDA/Vulkan interoperability features\\nwithout needing to invest time in learning the complex low-level technical\\naspects involved. Internally, M\\\\`imir streamlines the interoperability mapping\\nbetween CUDA device memory containing simulation data and Vulkan graphics\\nresources, so that changes on the data are instantly reflected in the\\nvisualization. This abstraction scheme allows generating visualizations with\\nminimal alteration over the original source code, needing only to replace the\\nGPU memory allocation lines of the data to be visualized by the API calls\\nprovided by M\\\\`imir among other optional changes.\", \"main_category\": \"cs.GR\", \"categories\": \"cs.GR\", \"published\": \"2025-04-29T17:02:57Z\"}"}
