{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16488v1\", \"title\": \"A strategy for the enhancement of barocaloric performance in plastic\\n  crystal solid solutions\", \"summary\": \"The drive for solid-state heating and cooling technologies is fuelled by\\ntheir potential for enhanced sustainability and environmental impact compared\\nto traditional vapour compression devices. The recent discovery of colossal\\nbarocaloric (BC) effects in the plastic crystal (PC) neopentyl glycol (NPG) has\\nhighlighted PCs as promising candidates for future solid-state thermal\\nmanagement. However, achieving optimal operational temperatures, low-pressure\\nrequirements, and substantial entropy changes in a single material remains\\nchallenging. Here, we demonstrate a strategy to address these constraints by\\nforming a ternary solid solution of neopentyl PCs: NPG, pentaglycerine (PG) and\\npentaerythritol (PE). Notably, by including only a small quantity (2%) of the\\nthird component, we observe a seven-fold increase in reversible isothermal\\nentropy change (|{\\\\Delta}Sit,rev| = 13.4 J kg-1 K-1) and twenty-fold increase\\nin operational temperature span ({\\\\Delta}Tspan = 18 K) at pressures of 1 kbar,\\ncompared to pure NPG. The origin of these enhancements is revealed by\\nquasielastic neutron scattering and synchrotron powder x-ray diffraction. We\\nfind a reduction in the activation energies of the rotational modes associated\\nwith the main entropic component of the BC effect, linked to a weakening of the\\nintermolecular hydrogen bond network. This is proposed to improve the phase\\ntransition reversibility and operational temperature span by facilitating a\\nbroadened first-order phase transition, characterised by a significant phase\\nco-existence region. These findings suggest an effective strategy for\\npracticable molecular BCs, which is to design solid solutions that exploit the\\nlarge compositional phase space of multi-component molecular systems.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,cond-mat.soft\", \"published\": \"2025-04-23T08:00:14Z\"}"}
