{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20607v1\", \"title\": \"EfficientHuman: Efficient Training and Reconstruction of Moving Human\\n  using Articulated 2D Gaussian\", \"summary\": \"3D Gaussian Splatting (3DGS) has been recognized as a pioneering technique in\\nscene reconstruction and novel view synthesis. Recent work on reconstructing\\nthe 3D human body using 3DGS attempts to leverage prior information on human\\npose to enhance rendering quality and improve training speed. However, it\\nstruggles to effectively fit dynamic surface planes due to multi-view\\ninconsistency and redundant Gaussians. This inconsistency arises because\\nGaussian ellipsoids cannot accurately represent the surfaces of dynamic\\nobjects, which hinders the rapid reconstruction of the dynamic human body.\\nMeanwhile, the prevalence of redundant Gaussians means that the training time\\nof these works is still not ideal for quickly fitting a dynamic human body. To\\naddress these, we propose EfficientHuman, a model that quickly accomplishes the\\ndynamic reconstruction of the human body using Articulated 2D Gaussian while\\nensuring high rendering quality. The key innovation involves encoding Gaussian\\nsplats as Articulated 2D Gaussian surfels in canonical space and then\\ntransforming them to pose space via Linear Blend Skinning (LBS) to achieve\\nefficient pose transformations. Unlike 3D Gaussians, Articulated 2D Gaussian\\nsurfels can quickly conform to the dynamic human body while ensuring\\nview-consistent geometries. Additionally, we introduce a pose calibration\\nmodule and an LBS optimization module to achieve precise fitting of dynamic\\nhuman poses, enhancing the model's performance. Extensive experiments on the\\nZJU-MoCap dataset demonstrate that EfficientHuman achieves rapid 3D dynamic\\nhuman reconstruction in less than a minute on average, which is 20 seconds\\nfaster than the current state-of-the-art method, while also reducing the number\\nof redundant Gaussians.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-29T10:15:43Z\"}"}
