{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20934v1\", \"title\": \"DejaVuzz: Disclosing Transient Execution Bugs with Dynamic Swappable\\n  Memory and Differential Information Flow Tracking assisted Processor Fuzzing\", \"summary\": \"Transient execution vulnerabilities have emerged as a critical threat to\\nmodern processors. Hardware fuzzing testing techniques have recently shown\\npromising results in discovering transient execution bugs in large-scale\\nout-of-order processor designs. However, their poor microarchitectural\\ncontrollability and observability prevent them from effectively and efficiently\\ndetecting transient execution vulnerabilities.\\n  This paper proposes DejaVuzz, a novel pre-silicon stage processor transient\\nexecution bug fuzzer. DejaVuzz utilizes two innovative operating primitives:\\ndynamic swappable memory and differential information flow tracking, enabling\\nmore effective and efficient transient execution vulnerability detection. The\\ndynamic swappable memory enables the isolation of different instruction streams\\nwithin the same address space. Leveraging this capability, DejaVuzz generates\\ntargeted training for arbitrary transient windows and eliminates ineffective\\ntraining, enabling efficient triggering of diverse transient windows. The\\ndifferential information flow tracking aids in observing the propagation of\\nsensitive data across the microarchitecture. Based on taints, DejaVuzz designs\\nthe taint coverage matrix to guide mutation and uses taint liveness annotations\\nto identify exploitable leakages. Our evaluation shows that DejaVuzz\\noutperforms the state-of-the-art fuzzer SpecDoctor, triggering more\\ncomprehensive transient windows with lower training overhead and achieving a\\n4.7x coverage improvement. And DejaVuzz also mitigates control flow\\nover-tainting with acceptable overhead and identifies 5 previously undiscovered\\ntransient execution vulnerabilities (with 6 CVEs assigned) on BOOM and\\nXiangShan.\", \"main_category\": \"cs.AR\", \"categories\": \"cs.AR,cs.CR\", \"published\": \"2025-04-29T16:51:55Z\"}"}
