{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00630v1\", \"title\": \"Vision Mamba in Remote Sensing: A Comprehensive Survey of Techniques,\\n  Applications and Outlook\", \"summary\": \"Deep learning has profoundly transformed remote sensing, yet prevailing\\narchitectures like Convolutional Neural Networks (CNNs) and Vision Transformers\\n(ViTs) remain constrained by critical trade-offs: CNNs suffer from limited\\nreceptive fields, while ViTs grapple with quadratic computational complexity,\\nhindering their scalability for high-resolution remote sensing data. State\\nSpace Models (SSMs), particularly the recently proposed Mamba architecture,\\nhave emerged as a paradigm-shifting solution, combining linear computational\\nscaling with global context modeling. This survey presents a comprehensive\\nreview of Mamba-based methodologies in remote sensing, systematically analyzing\\nabout 120 studies to construct a holistic taxonomy of innovations and\\napplications. Our contributions are structured across five dimensions: (i)\\nfoundational principles of vision Mamba architectures, (ii) micro-architectural\\nadvancements such as adaptive scan strategies and hybrid SSM formulations,\\n(iii) macro-architectural integrations, including CNN-Transformer-Mamba hybrids\\nand frequency-domain adaptations, (iv) rigorous benchmarking against\\nstate-of-the-art methods in multiple application tasks, such as object\\ndetection, semantic segmentation, change detection, etc. and (v) critical\\nanalysis of unresolved challenges with actionable future directions. By\\nbridging the gap between SSM theory and remote sensing practice, this survey\\nestablishes Mamba as a transformative framework for remote sensing analysis. To\\nour knowledge, this paper is the first systematic review of Mamba architectures\\nin remote sensing. Our work provides a structured foundation for advancing\\nresearch in remote sensing systems through SSM-based methods. We curate an\\nopen-source repository\\n(https://github.com/BaoBao0926/Awesome-Mamba-in-Remote-Sensing) to foster\\ncommunity-driven advancements.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-01T16:07:51Z\"}"}
