{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12760v1\", \"title\": \"Analyzing multi-center randomized trials with covariate adjustment while\\n  accounting for clustering\", \"summary\": \"Augmented inverse probability weighting (AIPW) and G-computation with\\ncanonical generalized linear models have become increasingly popular for\\nestimating the average treatment effect in randomized experiments. These\\nestimators leverage outcome prediction models to adjust for imbalances in\\nbaseline covariates across treatment arms, improving statistical power compared\\nto unadjusted analyses, while maintaining control over Type I error rates, even\\nwhen the models are misspecified. Practical application of such estimators\\noften overlooks the clustering present in multi-center clinical trials. Even\\nwhen prediction models account for center effects, this neglect can degrade the\\ncoverage of confidence intervals, reduce the efficiency of the estimators, and\\ncomplicate the interpretation of the corresponding estimands. These issues are\\nparticularly pronounced for estimators of counterfactual means, though less\\nsevere for those of the average treatment effect, as demonstrated through Monte\\nCarlo simulations and supported by theoretical insights. To address these\\nchallenges, we develop efficient estimators of counterfactual means and the\\naverage treatment effect in a random center. These extract information from\\nbaseline covariates by relying on outcome prediction models, but remain\\nunbiased in large samples when these models are misspecified. We also introduce\\nan accompanying inference framework inspired by random-effects meta-analysis\\nand relevant for settings where data from many small centers are being\\nanalyzed. Adjusting for center effects yields substantial gains in efficiency,\\nespecially when treatment effect heterogeneity across centers is large. Monte\\nCarlo simulations and application to the WASH Benefits Bangladesh study\\ndemonstrate adequate performance of the proposed methods.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME\", \"published\": \"2025-04-17T08:56:01Z\"}"}
