{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03161v1\", \"title\": \"An LLM-based Self-Evolving Security Framework for 6G Space-Air-Ground\\n  Integrated Networks\", \"summary\": \"Recently emerged 6G space-air-ground integrated networks (SAGINs), which\\nintegrate satellites, aerial networks, and terrestrial communications, offer\\nubiquitous coverage for various mobile applications. However, the highly\\ndynamic, open, and heterogeneous nature of SAGINs poses severe security issues.\\nForming a defense line of SAGINs suffers from two preliminary challenges: 1)\\naccurately understanding massive unstructured multi-dimensional threat\\ninformation to generate defense strategies against various malicious attacks,\\n2) rapidly adapting to potential unknown threats to yield more effective\\nsecurity strategies. To tackle the above two challenges, we propose a novel\\nsecurity framework for SAGINs based on Large Language Models (LLMs), which\\nconsists of two key ingredients LLM-6GNG and 6G-INST. Our proposed LLM-6GNG\\nleverages refined chain-of-thought (CoT) reasoning and dynamic multi-agent\\nmechanisms to analyze massive unstructured multi-dimensional threat data and\\ngenerate comprehensive security strategies, thus addressing the first\\nchallenge. Our proposed 6G-INST relies on a novel self-evolving method to\\nautomatically update LLM-6GNG, enabling it to accommodate unknown threats under\\ndynamic communication environments, thereby addressing the second challenge.\\nAdditionally, we prototype the proposed framework with ns-3, OpenAirInterface\\n(OAI), and software-defined radio (SDR). Experiments on three benchmarks\\ndemonstrate the effectiveness of our framework. The results show that our\\nframework produces highly accurate security strategies that remain robust\\nagainst a variety of unknown attacks. We will release our code to contribute to\\nthe community.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR\", \"published\": \"2025-05-06T04:14:13Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03177v1\", \"title\": \"A Symbolic and Statistical Learning Framework to Discover Bioprocessing\\n  Regulatory Mechanism: Cell Culture Example\", \"summary\": \"Bioprocess mechanistic modeling is essential for advancing intelligent\\ndigital twin representation of biomanufacturing, yet challenges persist due to\\ncomplex intracellular regulation, stochastic system behavior, and limited\\nexperimental data. This paper introduces a symbolic and statistical learning\\nframework to identify key regulatory mechanisms and quantify model uncertainty.\\nBioprocess dynamics is formulated with stochastic differential equations\\ncharacterizing intrinsic process variability, with a predefined set of\\ncandidate regulatory mechanisms constructed from biological knowledge. A\\nBayesian learning approach is developed, which is based on a joint learning of\\nkinetic parameters and regulatory structure through a formulation of the\\nmixture model. To enhance computational efficiency, a Metropolis-adjusted\\nLangevin algorithm with adjoint sensitivity analysis is developed for posterior\\nexploration. Compared to state-of-the-art Bayesian inference approaches, the\\nproposed framework achieves improved sample efficiency and robust model\\nselection. An empirical study demonstrates its ability to recover missing\\nregulatory mechanisms and improve model fidelity under data-limited conditions.\", \"main_category\": \"stat.ML\", \"categories\": \"stat.ML,cs.LG,q-bio.QM\", \"published\": \"2025-05-06T04:39:34Z\"}"}
