{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21769v1\", \"title\": \"LLM-based Interactive Imitation Learning for Robotic Manipulation\", \"summary\": \"Recent advancements in machine learning provide methods to train autonomous\\nagents capable of handling the increasing complexity of sequential\\ndecision-making in robotics. Imitation Learning (IL) is a prominent approach,\\nwhere agents learn to control robots based on human demonstrations. However, IL\\ncommonly suffers from violating the independent and identically distributed\\n(i.i.d) assumption in robotic tasks. Interactive Imitation Learning (IIL)\\nachieves improved performance by allowing agents to learn from interactive\\nfeedback from human teachers. Despite these improvements, both approaches come\\nwith significant costs due to the necessity of human involvement. Leveraging\\nthe emergent capabilities of Large Language Models (LLMs) in reasoning and\\ngenerating human-like responses, we introduce LLM-iTeach -- a novel IIL\\nframework that utilizes an LLM as an interactive teacher to enhance agent\\nperformance while alleviating the dependence on human resources. Firstly,\\nLLM-iTeach uses a hierarchical prompting strategy that guides the LLM in\\ngenerating a policy in Python code. Then, with a designed similarity-based\\nfeedback mechanism, LLM-iTeach provides corrective and evaluative feedback\\ninteractively during the agent's training. We evaluate LLM-iTeach against\\nbaseline methods such as Behavior Cloning (BC), an IL method, and CEILing, a\\nstate-of-the-art IIL method using a human teacher, on various robotic\\nmanipulation tasks. Our results demonstrate that LLM-iTeach surpasses BC in the\\nsuccess rate and achieves or even outscores that of CEILing, highlighting the\\npotential of LLMs as cost-effective, human-like teachers in interactive\\nlearning environments. We further demonstrate the method's potential for\\ngeneralization by evaluating it on additional tasks. The code and prompts are\\nprovided at: https://github.com/Tubicor/LLM-iTeach.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-30T16:14:25Z\"}"}
