{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03496v1\", \"title\": \"Detecting Urban Earthquakes with the San Fernando Valley Nodal Array and\\n  Machine Learning\", \"summary\": \"The San Fernando Valley, part of the Los Angeles metropolitan area, is a\\nseismically active urban environment. Large-magnitude earthquakes, such as the\\n1994 Mw 6.7 Northridge event that occurred on a blind fault beneath the valley,\\ncaused significant infrastructure damage in the region, underscoring the need\\nfor enhanced seismic monitoring to improve the identification of buried faults\\nand hazard evaluation. Currently, the Southern California Earthquake Data\\nCenter operates four broadband instruments within the valley; however, the\\nnetworks ability to capture small earthquakes beneath the region may be\\nlimited. To demonstrate how this data gap can be filled, we use recordings from\\nthe San Fernando Valley array comprised of 140 nodal instruments with\\ninterstation distances ranging from 0.3 to 2.5 km that recorded for one month.\\nHigh anthropogenic noise levels in urbanized areas tend to conceal earthquake\\nsignals, therefore we applied a previously developed machine learning model\\nfinetuned on similar waveforms to detect events and pick seismic phases. In a\\ntwo-step event association workflow, isolated phase picks were first culled,\\nwhich eliminated false positive detections and reduced computational runtime.\\nWe located 62 events within a 209 km radius of our array, including 36 new\\nevents that were undetected by the regional network, with magnitudes ranging\\nfrom ML 0.13 to 4. One event cluster reveals a previously unidentified (5.3 km\\nby 4 km) blind fault zone located ~5 km beneath the southern part of the\\nvalley. Seismicity from this zone is rare in the regional catalog (<3 events\\nper year), despite producing a Mb 4.4 event in 2014. Our results highlight the\\nbenefits of detecting small-magnitude seismicity for hazard estimation.\\nTemporary nodal arrays can identify critical gaps in regional monitoring and\\nguide site selection for permanent stations.\", \"main_category\": \"physics.geo-ph\", \"categories\": \"physics.geo-ph\", \"published\": \"2025-05-06T12:58:36Z\"}"}
