{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12638v1\", \"title\": \"Spatial Age Distribution of Classical Cepheids in Spiral Galaxies: The\\n  Cases of M31 and M33\", \"summary\": \"Classical Cepheids can be used as age indicators due to well-established\\nperiod-age and period-age-color relations. \\\\citet{Desomma2021} refined these\\nrelations by including a metallicity term and different Mass-Luminosity\\nassumptions.\\n  In this study, we apply the period-age-metallicity relation for the first\\ntime to samples of Classical Cepheids in M31 and M33. For both galaxies, we\\nconsider Cepheid coordinates and spatial distributions, along with the\\nmetallicity gradients by \\\\citet{Zaritsky1994} and \\\\citet{Magrini2007}, to\\nprovide a metallicity estimate for each pulsator. By applying the\\nperiod-age-metallicity relation, we derive individual ages for each Cepheid.\\n  Combining these ages and spatial distributions, we construct detailed age\\nmaps for both galaxies. Our analysis confirms a radial age gradient, with\\nyounger Cepheids preferentially found toward the galactic centers. In M31, we\\nconfirm an outer ring at $\\\\sim 11$ kpc, consistent with previous studies, and\\nidentify for the first time an inner ring at $\\\\sim 7$ kpc, possibly associated\\nwith star formation episodes.\\n  Comparing age gradients at different angles, we find a consistent general\\ntrend of ages increasing monotonically with radius. At the same time, we\\nobserve smaller-scale differences, particularly in the $90^\\\\circ$-$180^\\\\circ$\\nquadrant, suggesting asymmetric star formation and possible dynamical\\ninfluences. In contrast, M33 displays a steeper global age gradient, indicating\\na higher concentration of young stars toward its center.\\n  This study highlights the utility of Cepheids as stellar population tracers,\\nproviding insights into the star formation and dynamical evolution of spiral\\ngalaxies. Future works will extend this methodology to additional galaxies.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.SR\", \"published\": \"2025-04-17T04:49:11Z\"}"}
