{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15922v1\", \"title\": \"Language Models to Support Multi-Label Classification of Industrial Data\", \"summary\": \"Multi-label requirements classification is a challenging task, especially\\nwhen dealing with numerous classes at varying levels of abstraction. The\\ndifficulties increases when a limited number of requirements is available to\\ntrain a supervised classifier. Zero-shot learning (ZSL) does not require\\ntraining data and can potentially address this problem. This paper investigates\\nthe performance of zero-shot classifiers (ZSCs) on a multi-label industrial\\ndataset. We focuse on classifying requirements according to a taxonomy designed\\nto support requirements tracing. We compare multiple variants of ZSCs using\\ndifferent embeddings, including 9 language models (LMs) with a reduced number\\nof parameters (up to 3B), e.g., BERT, and 5 large LMs (LLMs) with a large\\nnumber of parameters (up to 70B), e.g., Llama. Our ground truth includes 377\\nrequirements and 1968 labels from 6 output spaces. For the evaluation, we adopt\\ntraditional metrics, i.e., precision, recall, F1, and $F_\\\\beta$, as well as a\\nnovel label distance metric Dn. This aims to better capture the\\nclassification's hierarchical nature and provides a more nuanced evaluation of\\nhow far the results are from the ground truth. 1) The top-performing model on 5\\nout of 6 output spaces is T5-xl, with maximum $F_\\\\beta$ = 0.78 and Dn = 0.04,\\nwhile BERT base outperformed the other models in one case, with maximum\\n$F_\\\\beta$ = 0.83 and Dn = 0.04. 2) LMs with smaller parameter size produce the\\nbest classification results compared to LLMs. Thus, addressing the problem in\\npractice is feasible as limited computing power is needed. 3) The model\\narchitecture (autoencoding, autoregression, and sentence-to-sentence)\\nsignificantly affects the classifier's performance. We conclude that using ZSL\\nfor multi-label requirements classification offers promising results. We also\\npresent a novel metric that can be used to select the top-performing model for\\nthis problem\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-22T14:06:02Z\"}"}
