{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16455v1\", \"title\": \"Cross Paradigm Representation and Alignment Transformer for Image\\n  Deraining\", \"summary\": \"Transformer-based networks have achieved strong performance in low-level\\nvision tasks like image deraining by utilizing spatial or channel-wise\\nself-attention. However, irregular rain patterns and complex geometric overlaps\\nchallenge single-paradigm architectures, necessitating a unified framework to\\nintegrate complementary global-local and spatial-channel representations. To\\naddress this, we propose a novel Cross Paradigm Representation and Alignment\\nTransformer (CPRAformer). Its core idea is the hierarchical representation and\\nalignment, leveraging the strengths of both paradigms (spatial-channel and\\nglobal-local) to aid image reconstruction. It bridges the gap within and\\nbetween paradigms, aligning and coordinating them to enable deep interaction\\nand fusion of features. Specifically, we use two types of self-attention in the\\nTransformer blocks: sparse prompt channel self-attention (SPC-SA) and spatial\\npixel refinement self-attention (SPR-SA). SPC-SA enhances global channel\\ndependencies through dynamic sparsity, while SPR-SA focuses on spatial rain\\ndistribution and fine-grained texture recovery. To address the feature\\nmisalignment and knowledge differences between them, we introduce the Adaptive\\nAlignment Frequency Module (AAFM), which aligns and interacts with features in\\na two-stage progressive manner, enabling adaptive guidance and complementarity.\\nThis reduces the information gap within and between paradigms. Through this\\nunified cross-paradigm dynamic interaction framework, we achieve the extraction\\nof the most valuable interactive fusion information from the two paradigms.\\nExtensive experiments demonstrate that our model achieves state-of-the-art\\nperformance on eight benchmark datasets and further validates CPRAformer's\\nrobustness in other image restoration tasks and downstream applications.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-23T06:44:46Z\"}"}
