{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15155v1\", \"title\": \"Dynamic 3D KAN Convolution with Adaptive Grid Optimization for\\n  Hyperspectral Image Classification\", \"summary\": \"Deep neural networks face several challenges in hyperspectral image\\nclassification, including high-dimensional data, sparse distribution of ground\\nobjects, and spectral redundancy, which often lead to classification\\noverfitting and limited generalization capability. To more efficiently adapt to\\nground object distributions while extracting image features without introducing\\nexcessive parameters and skipping redundant information, this paper proposes\\nKANet based on an improved 3D-DenseNet model, consisting of 3D KAN Conv and an\\nadaptive grid update mechanism. By introducing learnable univariate B-spline\\nfunctions on network edges, specifically by flattening three-dimensional\\nneighborhoods into vectors and applying B-spline-parameterized nonlinear\\nactivation functions to replace the fixed linear weights of traditional 3D\\nconvolutional kernels, we precisely capture complex spectral-spatial nonlinear\\nrelationships in hyperspectral data. Simultaneously, through a dynamic grid\\nadjustment mechanism, we adaptively update the grid point positions of\\nB-splines based on the statistical characteristics of input data, optimizing\\nthe resolution of spline functions to match the non-uniform distribution of\\nspectral features, significantly improving the model's accuracy in\\nhigh-dimensional data modeling and parameter efficiency, effectively\\nalleviating the curse of dimensionality. This characteristic demonstrates\\nsuperior neural scaling laws compared to traditional convolutional neural\\nnetworks and reduces overfitting risks in small-sample and high-noise\\nscenarios. KANet enhances model representation capability through a 3D dynamic\\nexpert convolution system without increasing network depth or width. The\\nproposed method demonstrates superior performance on IN, UP, and KSC datasets,\\noutperforming mainstream hyperspectral image classification approaches.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-21T14:57:48Z\"}"}
