{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05176v1\", \"title\": \"Superconducting susceptibility signal captured in a record wide pressure\\n  range\", \"summary\": \"In recent years, the resistance signature of the high temperature\\nsuperconductivity above 250 K in highly compressed hydrides (more than 100 GPa)\\nhas garnered significant attention within the condensed matter physics\\ncommunity. This has sparked renewed optimism for achieving superconductivity\\nunder room-temperature conditions. However, the superconducting diamagnetism,\\nanother crucial property for confirming the superconductivity, has yet to be\\nconclusively observed. The primary challenge arises from the weak diamagnetic\\nsignals detected from the small samples compressed in diamond anvil cells.\\nTherefore, the reported results of superconducting diamagnetism in hydrides\\nhave sparked intense debate, highlighting the urgent need for workable\\nmethodology to assess the validity of the experimental results. Here, we are\\nthe first to report the ultrahigh pressure measurements of the superconducting\\ndiamagnetism on Nb0.44Ti0.56, a commercial superconducting alloy, in a\\nrecord-wide pressure range from 5 GPa to 160 GPa. We present detailed results\\non factors such as sample size, the diamagnetic signal intensity, the\\nsignal-to-noise ratio and the superconducting transition temperature across\\nvarious pressures and different pressure transmitting media. These\\ncomprehensive results clearly demonstrate that this alloy is an ideal reference\\nsample for evaluating superconductivity in compressed hydrides,validating the\\ncredibility of the experimental systems and superconducting diamagnetic\\nresults, as well as determining the nature of the superconductivity of the\\ninvestigated sample. In addition, these results also provide a valuable\\nbenchmark for studying the pressure-induced superconductivity in other material\\nfamilies.\", \"main_category\": \"cond-mat.supr-con\", \"categories\": \"cond-mat.supr-con\", \"published\": \"2025-05-08T12:26:24Z\"}"}
