{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17541v1\", \"title\": \"A negative stellar mass$-$gaseous metallicity gradient relation of dwarf\\n  galaxies modulated by stellar feedback\", \"summary\": \"Baryonic cycling is reflected in the spatial distribution of metallicity\\nwithin galaxies, yet gas-phase metallicity distribution and its connection with\\nother properties of dwarf galaxies are largely unexplored. We present the first\\nsystematic study of radial gradients of gas-phase metallicities for a sample of\\n55 normal nearby star-forming dwarf galaxies (stellar mass $M_\\\\star$ ranging\\nfrom $10^7$ to $10^{9.5}\\\\ M_\\\\odot$), based on MUSE spectroscopic observations.\\nWe find that metallicity gradient shows a significant negative correlation\\n(correlation coefficient $r \\\\approx -0.56$) with $\\\\log M_\\\\star$, in contrast to\\nthe flat or even positive correlation observed for higher-mass galaxies. This\\nnegative correlation is accompanied by a stronger central suppression of\\nmetallicity compared to the outskirts in lower-mass galaxies. Among the other\\nexplored galaxy properties-including baryonic mass, star formation\\ndistribution, galaxy environment, regularity of the gaseous velocity field, and\\neffective yield of metals $y_{\\\\rm eff}$-only the velocity field regularity and\\n$y_{\\\\rm eff}$ show residual correlation with the metallicity gradient after\\ncontrolling for $M_\\\\star$, in the sense that galaxies with irregular velocity\\nfields or lower $y_{\\\\rm eff}$ tend to have less negative or more positive\\ngradients. Particularly, a linear combination of $\\\\log M_\\\\star$ and $\\\\log\\ny_{\\\\rm eff}$ significantly improves the correlation with metallicity gradient\\n($r \\\\approx -0.68$) compared to $\\\\log M_\\\\star$ alone. The lack of correlation\\nwith environment disfavors gas accretion as a dominant factor. Our findings\\nimply that metal mixing and transport processes, including but not limited to\\nfeedback-driven outflows, are more important than in-situ metal production in\\nshaping the metallicity distribution of dwarf galaxies.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.CO,astro-ph.SR\", \"published\": \"2025-04-24T13:32:18Z\"}"}
