{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15132v1\", \"title\": \"Investigating Youth's Technical and Ethical Understanding of Generative\\n  Language Models When Engaging in Construction and Deconstruction Activities\", \"summary\": \"The widespread adoption of generative artificial intelligence/machine\\nlearning (AI/ML) technologies has increased the need to support youth in\\ndeveloping AI/ML literacies. However, most work has centered on preparing young\\npeople to use these systems, with less attention to how they can participate in\\ndesigning and evaluating them. This study investigates how engaging young\\npeople in the design and auditing of generative language models (GLMs) may\\nfoster the development of their understanding of how these systems work from\\nboth technical and ethical perspectives. The study takes an in-pieces approach\\nto investigate novices' conceptions of GLMs. Such an approach supports the\\nanalysis of how technical and ethical conceptions evolve and relate to each\\nother. I am currently conducting a series of participatory design workshops\\nwith sixteen ninth graders (ages 14-15) in which they will (a) build GLMs from\\na data-driven perspective that glassboxes how data shapes model performance and\\n(b) audit commercial GLMs by repeatedly and systematically querying them to\\ndraw inferences about their behaviors. I will analyze participants'\\ninteractions to identify ethical and technical conceptions they may exhibit\\nwhile designing and auditing GLMs. I will also conduct clinical interviews and\\nuse microgenetic knowledge analysis and ordered network analysis to investigate\\nhow participants' ethical and technical conceptions of GLMs relate to each\\nother and change after the workshop. The study will contribute (a) evidence of\\nhow engaging youth in design and auditing activities may support the\\ndevelopment of ethical and technical understanding of GLMs and (b) an inventory\\nof novice design and auditing practices that may support youth's technical and\\nethical understanding of GLMs.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC,cs.CY\", \"published\": \"2025-04-21T14:30:16Z\"}"}
