{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04380v1\", \"title\": \"Tetrahedron-Net for Medical Image Registration\", \"summary\": \"Medical image registration plays a vital role in medical image processing.\\nExtracting expressive representations for medical images is crucial for\\nimproving the registration quality. One common practice for this end is\\nconstructing a convolutional backbone to enable interactions with skip\\nconnections among feature extraction layers. The de facto structure, U-Net-like\\nnetworks, has attempted to design skip connections such as nested or full-scale\\nones to connect one single encoder and one single decoder to improve its\\nrepresentation capacity. Despite being effective, it still does not fully\\nexplore interactions with a single encoder and decoder architectures. In this\\npaper, we embrace this observation and introduce a simple yet effective\\nalternative strategy to enhance the representations for registrations by\\nappending one additional decoder. The new decoder is designed to interact with\\nboth the original encoder and decoder. In this way, it not only reuses feature\\npresentation from corresponding layers in the encoder but also interacts with\\nthe original decoder to corporately give more accurate registration results.\\nThe new architecture is concise yet generalized, with only one encoder and two\\ndecoders forming a ``Tetrahedron'' structure, thereby dubbed Tetrahedron-Net.\\nThree instantiations of Tetrahedron-Net are further constructed regarding the\\ndifferent structures of the appended decoder. Our extensive experiments prove\\nthat superior performance can be obtained on several representative benchmarks\\nof medical image registration. Finally, such a ``Tetrahedron'' design can also\\nbe easily integrated into popular U-Net-like architectures including\\nVoxelMorph, ViT-V-Net, and TransMorph, leading to consistent performance gains.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.IR\", \"published\": \"2025-05-07T13:00:49Z\"}"}
