{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11948v1\", \"title\": \"On finitely generated Hausdorff spectra of groups acting on rooted trees\", \"summary\": \"We answer two longstanding questions of Klopsch (1999) and Shalev (2000) by\\nproving that the finitely generated Hausdorff spectrum of the closure of a\\nfinitely generated regular branch group with respect to the level-stabilizer\\nfiltration is the full interval [0,1]. Previous work related to the above\\nquestions include the celebrated result of Ab\\\\'ert and Vir\\\\'ag on the\\ncompleteness of the finitely generated Hausdorff spectrum of the group of\\n$p$-adic automorphisms $W_p$. We extend their result to any level-transitive\\niterated wreath product acting on a regular rooted tree, and more importantly,\\nprovide the first explicit examples of finitely generated subgroups with\\nprescribed Hausdorff dimension. In fact, in $W_p$ such subgroups can be taken\\nto be 2-generated, giving further evidence to a conjecture of Ab\\\\'ert and\\nVir\\\\'ag. Furthermore, we extend a well-known result of Klopsch (1999) for\\nbranch groups to closed level-transitive groups with fully dimensional rigid\\nstabilizers: these have full Hausdorff spectrum with respect to the\\nlevel-stabilizer filtration. In turn, we determine, for the first time, the\\nHausdorff spectum of many well-studied families of weakly branch groups. As an\\nadditional new contribution, we define {\\\\it nice filtrations} (which include\\nthe level-stabilizer filtration). In fact, the first and the last result can be\\nproven more generally with respect to these filtrations (under possibly some\\nfurther assumptions). Finally, we also consider two standard filtrations,\\nnamely the $2$-central lower series, and the dimension subgroup or\\nJenning-Zassenhaus series in the closure of the first Grigorchuck group, and\\nshow that its finitely generated Hausdorff spectra with respect to these\\nfiltrations is the full interval [0,1], answering a recent question of de las\\nHeras and Thillaisundaram (2022). This is obtained via a reduction to\\nproperties concerning to nice filtrations.\", \"main_category\": \"math.GR\", \"categories\": \"math.GR\", \"published\": \"2025-04-16T10:24:26Z\"}"}
