{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01958v1\", \"title\": \"Individual halo bias in models of $f(R)$ gravity\", \"summary\": \"Halo bias links the statistical properties of the spatial distribution of\\ndark matter halos to those of the underlying dark matter field, providing\\ninsights into clustering properties in both general relativity (GR) and\\nmodified-gravity scenarios such as $f(R)$ models. While the primary halo\\nmass-dependent bias has been studied in detailed, the secondary bias, which\\naccounts for the additional dependencies on other internal halo properties, can\\noffer a sensitive probe for testing gravity beyond the $\\\\Lambda$CDM model. To\\nquantify any potential deviations between $\\\\Lambda$CDM and $f(R)$ gravity\\nmodels in halo clustering, at both the primary and secondary level, as well as\\nin the distributions of halo properties in the cosmic web. Using $N$-body\\nsimulations of $f(R)$ gravity models, we assess the scaling relations and the\\nprimary and secondary bias signals of halo populations on the basis of a\\nhalo-by-halo estimator of large-scale effective bias. Our analysis is performed\\nusing halo number density as the independent variable. The relative difference\\nin the effective bias between the $f(R)$ models and $\\\\Lambda$CDM is sensitive,\\nalbeit slightly, to the power index of modified gravity. The largest deviations\\nfrom GR are measured for low-mass halos, where the average bias at fixed number\\ndensity decreases by up to 5\\\\% for fixed scaling indices. We also show that the\\nscaling relations for some environmental properties, including neighbour\\nstatistics, Mach number and local overdensity, exhibit small but non-negligible\\ndeviations (~3-5\\\\%) from GR for a wide range of number densities. Our results\\nalso suggests that the properties of halos in sheets and voids show the largest\\ndepartures from GR (> 10\\\\% in some cases). In terms of secondary bias, we do\\nnot find any statistically significant deviations with respect to $\\\\Lambda$CDM\\nfor any of the properties explored in this work.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-04-02T17:59:40Z\"}"}
