{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16407v1\", \"title\": \"Public-Key Quantum Fire and Key-Fire From Classical Oracles\", \"summary\": \"Quantum fire was recently formalized by Bostanci, Nehoran and Zhandry (STOC\\n25). This notion considers a distribution of quantum states that can be\\nefficiently cloned, but cannot be converted into a classical string.\\nPreviously, work of Nehoran and Zhandry (ITCS 24) showed how to construct\\nquantum fire relative to an inefficient unitary oracle. Later, the work of\\nBostanci, Nehoran, Zhandry gave a candidate construction based on group action\\nassumptions, and proved the correctness of their scheme; however, even in the\\nclassical oracle model they only conjectured the security, and no security\\nproof was given.\\n  In this work, we give the first construction of public-key quantum fire\\nrelative to a classical oracle, and prove its security unconditionally. This\\ngives the first classical oracle seperation between the two fundamental\\nprinciples of quantum mechanics that are equivalent in the\\ninformation-theoretic setting: no-cloning and no-telegraphing.\\n  Going further, we introduce a stronger notion called quantum key-fire where\\nthe clonable fire states can be used to run a functionality (such as a signing\\nor decryption key), and prove a secure construction relative to a classical\\noracle. As an application of this notion, we get the first public-key\\nencryption scheme whose secret key is clonable but satisfies unbounded\\nleakage-resilience (Cakan, Goyal, Liu-Zhang, Ribeiro [TCC 24]), relative to a\\nclassical oracle. Unbounded leakage-resilience is closely related to, and can\\nbe seen as a generalization of the notion of no-telegraphing.\\n  For all of our constructions, the oracles can be made efficient (i.e.\\npolynomial time), assuming the existence of post-quantum one-way functions.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cs.CR\", \"published\": \"2025-04-23T04:19:31Z\"}"}
