{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10829v1\", \"title\": \"LayoutCoT: Unleashing the Deep Reasoning Potential of Large Language\\n  Models for Layout Generation\", \"summary\": \"Conditional layout generation aims to automatically generate visually\\nappealing and semantically coherent layouts from user-defined constraints.\\nWhile recent methods based on generative models have shown promising results,\\nthey typically require substantial amounts of training data or extensive\\nfine-tuning, limiting their versatility and practical applicability.\\nAlternatively, some training-free approaches leveraging in-context learning\\nwith Large Language Models (LLMs) have emerged, but they often suffer from\\nlimited reasoning capabilities and overly simplistic ranking mechanisms, which\\nrestrict their ability to generate consistently high-quality layouts. To this\\nend, we propose LayoutCoT, a novel approach that leverages the reasoning\\ncapabilities of LLMs through a combination of Retrieval-Augmented Generation\\n(RAG) and Chain-of-Thought (CoT) techniques. Specifically, LayoutCoT transforms\\nlayout representations into a standardized serialized format suitable for\\nprocessing by LLMs. A Layout-aware RAG is used to facilitate effective\\nretrieval and generate a coarse layout by LLMs. This preliminary layout,\\ntogether with the selected exemplars, is then fed into a specially designed CoT\\nreasoning module for iterative refinement, significantly enhancing both\\nsemantic coherence and visual quality. We conduct extensive experiments on five\\npublic datasets spanning three conditional layout generation tasks.\\nExperimental results demonstrate that LayoutCoT achieves state-of-the-art\\nperformance without requiring training or fine-tuning. Notably, our CoT\\nreasoning module enables standard LLMs, even those without explicit deep\\nreasoning abilities, to outperform specialized deep-reasoning models such as\\ndeepseek-R1, highlighting the potential of our approach in unleashing the deep\\nreasoning capabilities of LLMs for layout generation tasks.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-15T03:12:01Z\"}"}
