{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16669v1\", \"title\": \"Binarity at LOw Metallicity (BLOeM): Bayesian inference of natal kicks\\n  from inert black hole binaries\", \"summary\": \"Context. The emerging population of inert black hole binaries (BHBs) provides\\na unique opportunity to constrain black hole (BH) formation physics. These\\nsystems are composed of a stellar-mass BH in a wide orbit around a\\nnon-degenerate star with no observed Xray emission. Inert BHBs allow for narrow\\nconstraints to be inferred on the natal kick and mass loss during BH-forming\\ncore-collapse events. Aims. In anticipation of the upcoming BLOeM survey, we\\naim to provide tight constraints on BH natal kicks by exploiting the full\\nparameter space obtained from combined spectroscopic and astrometric data to\\ncharacterize the orbits of inert BHBs. Multi-epoch spectroscopy from the BLOeM\\nproject will provide measurements of periods, eccentricities, and radial\\nvelocities for inert BHBs in the SMC, which complements Gaia astrometric\\nobservations of proper motions. Methods. We present a Bayesian parameter\\nestimation framework to infer natal kicks and mass loss during core-collapse\\nfrom inert BHBs, accounting for all available observables, including the\\nsystemic velocity and its orientation relative to the orbital plane. The\\nframework further allows for circumstances when some of the observables are\\nunavailable, such as for the distant BLOeM sources which preclude resolved\\norbits. Results. With our new framework, we are able to distinguish between BH\\nformation channels, even in the absence of a resolved orbit. In cases when the\\npre-explosion orbit can be assumed to be circular, we precisely recover the\\nparameters of the core-collapse, highlighting the importance of understanding\\nthe eccentricity landscape of pre-explosion binaries, both theoretically and\\nobservationally. Treating the near-circular, inert BHB, VFTS 243, as a\\nrepresentative of the anticipated BLOeM systems, we constrain the natal kick to\\nless than 27 km/s and the mass loss to less than 2.9 Msun within a 90% credible\\ninterval.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA,astro-ph.HE\", \"published\": \"2025-04-23T12:36:32Z\"}"}
