{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19934v1\", \"title\": \"Warm-Starting QAOA with XY Mixers: A Novel Approach for Quantum-Enhanced\\n  Vehicle Routing Optimization\", \"summary\": \"Quantum optimization algorithms, such as the Quantum Approximate Optimization\\nAlgorithm, are emerging as promising heuristics for solving complex\\ncombinatorial problems. To improve performance, several extensions to the\\nstandard QAOA framework have been proposed in recent years. Two notable\\ndirections include: warm-starting techniques, which incorporate classical\\napproximate solutions to guide the quantum evolution, and custom mixer\\nHamiltonians, such as XY mixers, which constrain the search to feasible\\nsubspaces aligned with the structure of the problem. In this work, we propose\\nan approach that integrates these two strategies: a warm-start initialization\\nwith an XY mixer ansatz, enabling constraint-preserving quantum evolution\\nbiased toward high-quality classical solutions. The method begins by\\nreformulating the combinatorial problem as a MaxCut instance, solved\\napproximately using the Goemans-Williamson algorithm. The resulting binary\\nsolution is relaxed and used to construct a biased superposition over valid\\none-hot quantum states, maintaining compatibility with the XY mixer's\\nconstraints. We evaluate the approach on 5-city instances of the Traveling\\nSalesperson Problem, a canonical optimization problem frequently encountered as\\na subroutine in real-world Vehicle Routing Problems. Our method is benchmarked\\nagainst both the standard XY-mixer QAOA and a warm-start-only variant based on\\nMaxCut relaxation. Results show that the proposed combination consistently\\noutperforms both baselines in terms of the percentage and rank of optimal\\nsolutions, demonstrating the effectiveness of combining structured\\ninitializations with constraint-aware quantum evolution for optimization\\nproblems.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-28T16:08:38Z\"}"}
