{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11300v1\", \"title\": \"Multi-Orbiter Continuous Lunar Beaming\", \"summary\": \"In this work, free-space optics-based continuous wireless power transmission\\nbetween multiple low lunar orbit satellites and a solar panel on the lunar\\nrover located at the lunar south pole are investigated based on the\\ntime-varying harvested power and overall system efficiency metrics. The\\nperformances are compared between a solar panel with the tracking ability and a\\nfixed solar panel that induces \\\\textit{the cosine effect} due to the\\ntime-dependent angle of incidence (AoI). In our work, the Systems Tool Kit\\n(STK) high-precision orbit propagator, which calculates the ephemeris data\\nprecisely, is utilized. Interestingly, orbiter deployments in constellations\\nchange significantly during a Moon revolution; thus, short-duration simulations\\ncannot be used straightforwardly. In our work, many satellite configurations\\nare assessed to be able to find a Cislunar constellation that establishes a\\ncontinuous line-of-sight (LoS) between the solar panel and at least a single\\nLLO satellite. It is found that 40-satellite schemes enable the establishment\\nof a continuous WPT system model. Besides, a satellite selection method (SSM)\\nis introduced so that only the best LoS link among multiple simultaneous links\\nfrom multiple satellites will be active for optimum efficiency. Our benchmark\\nsystem of a 40-satellite quadruple orbit scheme is compared with 30-satellite\\nand a single satellite schemes based on the average harvested powers and\\noverall system efficiencies 27.3 days so the trade-off options can be assessed\\nfrom the multiple Cislunar models. The outcomes show that the average system\\nefficiencies of single, 30-satellite, and 40-satellite schemes are 2.84%,\\n32.33%, and 33.29%, respectively, for the tracking panel and 0.97%, 18.33%, and\\n20.44%, respectively, for the fixed solar panel case.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-15T15:43:39Z\"}"}
