{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12069v1\", \"title\": \"A viscoplasticity model with an invariant-based non-Newtonian flow rule\\n  for unidirectional thermoplastic composites\", \"summary\": \"A three-dimensional mesoscopic viscoplasticity model for simulating\\nrate-dependent plasticity and creep in unidirectional thermoplastic composites\\nis presented. The constitutive model is a transversely isotropic extension of\\nan isotropic finite strain viscoplasticity model for neat polymers.\\nRate-dependent plasticity and creep are described by a non-Newtonian flow rule\\nwhere the viscosity of the material depends on an equivalent stress measure\\nthrough an Eyring-type relation. In the present formulation, transverse\\nisotropy is incorporated by defining the equivalent stress measure and flow\\nrule as functions of transversely isotropic stress invariants. In addition, the\\nEyring-type viscosity function is extended with anisotropic pressure\\ndependence. As a result of the formulation, plastic flow in fiber direction is\\neffectively excluded and pressure dependence of the polymer matrix is accounted\\nfor. The re-orientation of the transversely isotropic plane during plastic\\ndeformations is incorporated in the constitutive equations, allowing for an\\naccurate large deformation response. The formulation is fully implicit and a\\nconsistent linearization of the algorithmic constitutive equations is performed\\nto derive the consistent tangent modulus. The performance of the mesoscopic\\nconstitutive model is assessed through a comparison with a micromechanical\\nmodel for carbon/PEEK, with the original isotropic viscoplastic version for the\\npolymer matrix and with hyperelastic fibers. The micromodel is first used to\\ndetermine the material parameters of the mesoscale model with a few\\nstress-strain curves. It is demonstrated that the mesoscale model gives a\\nsimilar response to the micromodel under various loading conditions. Finally,\\nthe mesoscale model is validated against off-axis experiments on unidirectional\\nthermoplastic composite plies.\", \"main_category\": \"cs.CE\", \"categories\": \"cs.CE\", \"published\": \"2025-04-16T13:24:56Z\"}"}
