{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03606v1\", \"title\": \"Self-Organized Three-Dimensional Superstructures, Spinodal\\n  Decomposition, and Mechanical Response of Epitaxial Hf$_{1-x}$Al$_x$N Thin\\n  Films\", \"summary\": \"Transition metal aluminum nitrides are a technologically important class of\\nmultifunctional ceramics. While the HfAlN system is to a large extent\\nunexplored, we study phase stability, nanostructure design, and mechanical\\nproperties of rocksalt cubic (c-) phase and wurtzite-hexagonal (h-) phase\\nHf$_{1-x}$Al$_x$N$_y$ thin films grown on MgO(001) substrates using\\nion-assisted reactive magnetron sputtering. Single-crystal\\nc-Hf$_{1-x}$Al$_x$N$_y$ films were obtained with $x < 0.30$. Spinodal\\ndecomposition taking place during film deposition resulted in a\\nthree-dimensional checkerboard superstructure of AlN-rich and HfN-rich\\nnanodomains, as opposed to a metastable cubic solid solution. Lattice-resolved\\nscanning transmission electron microscopy and x-ray and electron diffraction\\nreveals that the superstructure period is along all three <100> directions and\\nscales almost linearly between 9-13 A with increasing Al content. For $x >\\n0.41$, however, nanocrystalline h-Hf$_{1-x}$Al$_x$N$_y$ consisting of\\nsegregated Hf- and Al-rich nanodomains in a (0001) fiber texture forms. The\\nnanoindentation hardness of these films increases sharply with x, from 26 GPa\\nfor HfNy, to 38 GPa for c-Hf$_{1-x}$Al$_x$N$_y$, due to dislocation pinning at\\nthe superstructure strain fields. The hardness drops to 22 GPa for the softer\\nh-Hf1-xAlxNy, still remaining considerably higher than that of a binary AlN. In\\nmicropillar compression testing, c-Hf$_{0.93}$Al$_{0.07}$N$_{1.15}$ exhibits a\\nlinear elastic response up until strain burst, with brittle fracture occurring\\nat a much higher yield stress compared to HfN$_y$, on {110}<011> slip systems,\\nwhich is attributed to superstructure inhibited dislocation motion. In\\ncontrast, h-Hf$_{0.59}$Al$_{0.41}$N$_{1.23}$ exhibits limited plasticity and a\\nhigh yield stress followed by strain burst, attributed to the nanocrystalline\\nstructure.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-05-06T15:05:07Z\"}"}
