{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11867v1\", \"title\": \"MDHP-Net: Detecting an Emerging Time-exciting Threat in IVN\", \"summary\": \"The integration of intelligent and connected technologies in modern vehicles,\\nwhile offering enhanced functionalities through Electronic Control Unit (ECU)\\nand interfaces like OBD-II and telematics, also exposes the vehicle's\\nin-vehicle network (IVN) to potential cyberattacks. Unlike prior work, we\\nidentify a new time-exciting threat model against IVN. These attacks inject\\nmalicious messages that exhibit a time-exciting effect, gradually manipulating\\nnetwork traffic to disrupt vehicle operations and compromise safety-critical\\nfunctions. We systematically analyze the characteristics of the threat:\\ndynamism, time-exciting impact, and low prior knowledge dependency. To validate\\nits practicality, we replicate the attack on a real Advanced Driver Assistance\\nSystem via Controller Area Network (CAN), exploiting Unified Diagnostic Service\\nvulnerabilities and proposing four attack strategies. While CAN's integrity\\nchecks mitigate attacks, Ethernet migration (e.g., DoIP/SOME/IP) introduces new\\nsurfaces. We further investigate the feasibility of time-exciting threat under\\nSOME/IP. To detect time-exciting threat, we introduce MDHP-Net, leveraging\\nMulti-Dimentional Hawkes Process (MDHP) and temporal and message-wise feature\\nextracting structures. Meanwhile, to estimate MDHP parameters, we developed the\\nfirst GPU-optimized gradient descent solver for MDHP (MDHP-GDS). These modules\\nsignificantly improves the detection rate under time-exciting attacks in\\nmulti-ECU IVN system. To address data scarcity, we release STEIA9, the first\\nopen-source dataset for time-exciting attacks, covering 9 Ethernet-based attack\\nscenarios. Extensive experiments on STEIA9 (9 attack scenarios) show MDHP-Net\\noutperforms 3 baselines, confirming attack feasibility and detection efficacy.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR\", \"published\": \"2025-04-16T08:41:24Z\"}"}
