{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11417v1\", \"title\": \"A tutorial on simulating nonlinear behaviors of flexible structures with\\n  the discrete differential geometry (DDG) method\", \"summary\": \"Flexible elastic structures, such as beams, rods, ribbons, plates, and\\nshells, exhibit complex nonlinear dynamical behaviors that are central to a\\nwide range of engineering and scientific applications, including soft robotics,\\ndeployable structures, and biomedical devices. While various numerical methods\\nhave been developed to simulate these behaviors, many conventional approaches\\nstruggle to simultaneously capture geometric and material nonlinearities, as\\nwell as nonlinear external interactions, particularly in highly deformable and\\ndynamically evolving systems. The Discrete Differential Geometry (DDG) method\\nhas emerged as a robust and efficient numerical framework that intrinsically\\npreserves geometric properties, accommodates material nonlinearity, and\\naccurately models interactions with external environments and fields. By\\ndirectly discretizing geometric and mechanical quantities, DDG provides an\\naccurate, stable, and efficient approach to modeling flexible structures,\\naddressing key limitations of traditional numerical methods. This tutorial\\nprovides a systematic introduction to the DDG method for simulating nonlinear\\nbehaviors in flexible structures. It covers DDG theory, simulation frameworks,\\nand MATLAB implementation, with examples spanning dynamic systems, geometric\\nand material nonlinearities, and external interactions like magnetics and\\nfluids, culminating in practical insights and future directions. By offering a\\ncomprehensive and practical guide, together with open-source MATLAB code, this\\ntutorial aims to facilitate the broader adoption of DDG-based numerical tools\\namong researchers and engineers in computational mechanics, applied\\nmathematics, and structural design.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-04-15T17:33:06Z\"}"}
