{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16419v1\", \"title\": \"PixelWeb: The First Web GUI Dataset with Pixel-Wise Labels\", \"summary\": \"Graphical User Interface (GUI) datasets are crucial for various downstream\\ntasks. However, GUI datasets often generate annotation information through\\nautomatic labeling, which commonly results in inaccurate GUI element BBox\\nannotations, including missing, duplicate, or meaningless BBoxes. These issues\\ncan degrade the performance of models trained on these datasets, limiting their\\neffectiveness in real-world applications. Additionally, existing GUI datasets\\nonly provide BBox annotations visually, which restricts the development of\\nvisually related GUI downstream tasks. To address these issues, we introduce\\nPixelWeb, a large-scale GUI dataset containing over 100,000 annotated web\\npages. PixelWeb is constructed using a novel automatic annotation approach that\\nintegrates visual feature extraction and Document Object Model (DOM) structure\\nanalysis through two core modules: channel derivation and layer analysis.\\nChannel derivation ensures accurate localization of GUI elements in cases of\\nocclusion and overlapping elements by extracting BGRA four-channel bitmap\\nannotations. Layer analysis uses the DOM to determine the visibility and\\nstacking order of elements, providing precise BBox annotations. Additionally,\\nPixelWeb includes comprehensive metadata such as element images, contours, and\\nmask annotations. Manual verification by three independent annotators confirms\\nthe high quality and accuracy of PixelWeb annotations. Experimental results on\\nGUI element detection tasks show that PixelWeb achieves performance on the\\nmAP95 metric that is 3-7 times better than existing datasets. We believe that\\nPixelWeb has great potential for performance improvement in downstream tasks\\nsuch as GUI generation and automated user interaction.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI,cs.HC\", \"published\": \"2025-04-23T05:01:25Z\"}"}
