{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13166v1\", \"title\": \"Topologically enabled superconductivity: possible implications for\\n  rhombohedral graphene\", \"summary\": \"We present a topological mechanism for superconductivity emerging from\\nChern-2 insulators. While, naively, time-reversal symmetry breaking is expected\\nto prevent superconductivity, it turns out that the opposite is the case: An\\nexplicit model calculation for a generalized attractive-U Haldane-Hubbard model\\ndemonstrates that superconductivity is only stabilized near the quantum\\nanomalous Hall state, but not near a trivial, time-reversal symmetric band\\ninsulator. As standard Bardeen-Cooper-Schrieffer-like mean-field theory fails\\nto capture any superconducting state, we explain this using an effective\\nfractionalized field theory involving fermionic chargeons, bosonic colorons and\\nan emergent U(1) gauge field. When the chargeons form a gapped topological band\\nstructure, the proliferation of single monopoles of this gauge field is\\nforbidden. However, long-ranged monopole-antimonopole correlations emerge, and\\nwe argue that those correspond to superconducting order. Using random phase\\napproximation on top of extensive slave-rotor mean-field calculations we\\ncharacterize coherence length and stiffness of the superconductor. Thereby, we\\ndeduce the phase diagram in parameter space and furthermore discuss the effect\\nof doping, temperature and an external magnetic field. We complement the\\nfractionalized theory with calculations using an effective spin model and\\nGutzwiller projected wavefunctions. While mostly based on a simple toy model,\\nwe argue that our findings contribute to a better understanding of\\nsuperconductivity emerging out of spin- and valley polarized rhombohedral\\ngraphene multilayers in a parameter regime with nearby quantum anomalous Hall\\ninsulators.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el,cond-mat.mes-hall,cond-mat.supr-con\", \"published\": \"2025-04-17T17:59:01Z\"}"}
