{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04164v1\", \"title\": \"The ALMA-ATOMS Survey: Exploring Protostellar Outflows in HC$_3$N\", \"summary\": \"We present the first systematic study of bipolar outflows using HC$_3$N as a\\ntracer in a sample of 146 massive star-forming regions from ALMA-ATOMS survey.\\nProtostellar outflows arise at the initial stage of star formation as a\\nconsequence of active accretion. In general, these outflows play a pivotal role\\nin regulating the star formation processes by injecting energetic material in\\nthe parent molecular clouds. In such process, lower velocity components of\\noutflows contain a significant portion of the energy. However, extraction of\\nthose component is difficult as the corresponding gas is often mixed with that\\nof the ambient cloud. In our sample, we identified 44 bipolar outflows and one\\nexplosive outflow in HC$_3$N (J=11--10). The host clumps of these outflows are\\nfound to be at different evolutionary stages, suggesting that outflows in\\nHC$_3$N are detectable in different stages of star formation. Also, the\\nnon-correlation of HC$_3$N outflows with clump evolutionary stages suggests\\nthat HC$_3$N is an unbiased tracer of outflows. Analyses revealed that HC$_3$N\\nperforms slightly better in detecting low-velocity components of outflows than\\ntraditionally employed tracers like SiO. The derived outflow parameters (i.e\\noutflow mass, momentum, and energy) show moderate correlations with clump mass\\nand luminosity. Our analysis of outflow opening angles and position-velocity\\ndiagrams across the outflow lobes show that, HC$_3$N is not only a good tracer\\nof low-velocity outflows, but can also detect high-velocity collimated\\noutflows. Overall, this study indicates that HC$_3$N can be used as a\\ncomplementary outflow tracer along with the traditionally known outflow\\ntracers, particularly in the detection of the low-velocity components of\\noutflows.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-05-07T06:33:19Z\"}"}
