{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12084v1\", \"title\": \"Green's functions of the fractional Laplacian on a square -- boundary\\n  considerations and applications to the L\\u00e9vy flight narrow capture problem\", \"summary\": \"On the unit square, we introduce a method for accurately computing\\nsource-neutral Green's functions of the fractional Laplacian operator with\\neither periodic or homogeneous Neumann boundary conditions. This method\\ninvolves analytically constructing the singular behavior of the Green's\\nfunction in a neighborhood around the location of the singularity, and then\\nformulating a ``smooth'' problem for the remainder term. This smooth problem\\ncan be solved for numerically using a basic finite difference scheme. This\\napproach allows immediate and accurate extraction of the regular part of the\\nGreen's function (and its gradient, if so desired). We apply this tool to gain\\ninsights into the narrow capture problem on the unit square, where a particle\\nundergoing a L\\\\'{e}vy flight of index $\\\\alpha \\\\in (0,1)$ searches for small\\ntarget(s) of radius $\\\\mathcal{O}(\\\\varepsilon)$ for $0 < \\\\varepsilon \\\\ll 1$. In\\nthe case of Neumann boundary conditions, we provide a physical interpretation\\nfor how the particle interacts with the boundary. Using a matched asymptotic\\nmethod, we compute a two-term expansion for the average search time, where the\\nsecond order term is computed in terms of Green's functions, encoding both\\nboundary effects (in the Neumann case) as well as how the targets are\\ndistributed within the search domain. We also illustrate through an analysis of\\nsplitting probabilities how a desired ``target'' can be ``shielded'' by\\n``obstacle'' targets, and how this shielding effect is lessened for decreasing\\n$\\\\alpha$. As in the case of the search time problem, this shielding effect is\\nencoded in a correction term requiring accurate computation of Green's\\nfunctions.\", \"main_category\": \"math.AP\", \"categories\": \"math.AP\", \"published\": \"2025-04-16T13:45:44Z\"}"}
