{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17280v1\", \"title\": \"EdgePoint2: Compact Descriptors for Superior Efficiency and Accuracy\", \"summary\": \"The field of keypoint extraction, which is essential for vision applications\\nlike Structure from Motion (SfM) and Simultaneous Localization and Mapping\\n(SLAM), has evolved from relying on handcrafted methods to leveraging deep\\nlearning techniques. While deep learning approaches have significantly improved\\nperformance, they often incur substantial computational costs, limiting their\\ndeployment in real-time edge applications. Efforts to create lightweight neural\\nnetworks have seen some success, yet they often result in trade-offs between\\nefficiency and accuracy. Additionally, the high-dimensional descriptors\\ngenerated by these networks poses challenges for distributed applications\\nrequiring efficient communication and coordination, highlighting the need for\\ncompact yet competitively accurate descriptors. In this paper, we present\\nEdgePoint2, a series of lightweight keypoint detection and description neural\\nnetworks specifically tailored for edge computing applications on embedded\\nsystem. The network architecture is optimized for efficiency without\\nsacrificing accuracy. To train compact descriptors, we introduce a combination\\nof Orthogonal Procrustes loss and similarity loss, which can serve as a general\\napproach for hypersphere embedding distillation tasks. Additionally, we offer\\n14 sub-models to satisfy diverse application requirements. Our experiments\\ndemonstrate that EdgePoint2 consistently achieves state-of-the-art (SOTA)\\naccuracy and efficiency across various challenging scenarios while employing\\nlower-dimensional descriptors (32/48/64). Beyond its accuracy, EdgePoint2\\noffers significant advantages in flexibility, robustness, and versatility.\\nConsequently, EdgePoint2 emerges as a highly competitive option for visual\\ntasks, especially in contexts demanding adaptability to diverse computational\\nand communication constraints.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-24T06:14:01Z\"}"}
