{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00667v1\", \"title\": \"A Practical Framework for Simulating Time-Resolved Spectroscopy Based on\\n  a Real-time Dyson Expansion\", \"summary\": \"Time-resolved spectroscopy is a powerful tool for probing electron dynamics\\nin molecules and solids, revealing transient phenomena on sub-femtosecond\\ntimescales. The interpretation of experimental results is often enhanced by\\nparallel numerical studies, which can provide insight and validation for\\nexperimental hypotheses. However, developing a theoretical framework for\\nsimulating time-resolved spectra remains a significant challenge. The most\\nsuitable approach involves the many-body non-equilibrium Green's function\\nformalism, which accounts for crucial dynamical many-body correlations during\\ntime evolution. While these dynamical correlations are essential for observing\\nemergent behavior in time-resolved spectra, they also render the formalism\\nprohibitively expensive for large-scale simulations. Substantial effort has\\nbeen devoted to reducing this computational cost -- through approximations and\\nnumerical techniques -- while preserving the key dynamical correlations. The\\nultimate goal is to enable first-principles simulations of time-dependent\\nsystems ranging from small molecules to large, periodic, multidimensional\\nsolids. In this perspective, we outline key challenges in developing practical\\nsimulations for time-resolved spectroscopy, with a particular focus on Green's\\nfunction methodologies. We highlight a recent advancement toward a scalable\\nframework: the real-time Dyson expansion (RT-DE). We introduce the theoretical\\nfoundation of RT-DE and discuss strategies for improving scalability, which\\nhave already enabled simulations of system sizes beyond the reach of previous\\nfully dynamical approaches. We conclude with an outlook on future directions\\nfor extending RT-DE to first-principles studies of dynamically correlated,\\nnon-equilibrium systems.\", \"main_category\": \"physics.comp-ph\", \"categories\": \"physics.comp-ph\", \"published\": \"2025-05-01T17:17:56Z\"}"}
