{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19804v1\", \"title\": \"Nonlinear Power Absorption in CCRF Discharges: Transition from Symmetric\\n  to Asymmetric Configurations\", \"summary\": \"This work builds upon previous studies of nonlinear dynamics in low-pressure\\ncapacitively coupled radio-frequency discharges, focusing on the electron power\\nabsorption mechanism in discharges with various geometric asymmetries. We\\npresent a comprehensive investigation using a fully kinetic electrostatic 1d3v\\nParticle-in-Cell/Monte Carlo collision simulation in spherical geometry. By\\nsystematically varying the inner electrode radius and the electrode gap\\ndistance, we analyze the influence of geometric asymmetry on key plasma\\nproperties, including electron density, power absorption, electron dynamics,\\nand current characteristics. A central focus is placed on the cumulative power\\ndensity as a diagnostic for energy deposition. In strongly asymmetric\\nconfigurations, the cumulative electron power density exhibits distinct\\nstepwise increases during sheath expansion, corresponding to the acceleration\\nof successive electron beams. These nonlinear signatures are directly linked to\\nthe excitation of plasma series resonance and enhanced beam-driven power\\nabsorption. In contrast, more symmetric configurations display smoother, more\\nsymmetric cumulative power evolution, indicating balanced energy transfer at\\nboth sheaths and reduced nonlinearities. Time- and space-resolved diagnostics\\nof cumulative power, current waveforms, and densities of energetic electrons\\nreveal the critical role of asymmetry in shaping electron confinement and\\nbeam-driven power absorption. These findings demonstrate that the discharge\\ngeometry is actually an important design parameter which needs to taken into\\naccount during the design and construction phase of a reactor as it directly\\ninfluences the plasma behavior with respect to energy deposition.\", \"main_category\": \"physics.plasm-ph\", \"categories\": \"physics.plasm-ph\", \"published\": \"2025-04-28T13:55:43Z\"}"}
