{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03262v1\", \"title\": \"Reexploring Molecular Complexity with ALMA: Insights into chemical\\n  differentiation from the molecular composition of hot cores in Sgr B2(N2)\", \"summary\": \"We used ALMA to perform a line survey of the high-mass star forming region\\nSgr B2(N), called ReMoCA. We modeled under the assumption of LTE the spectra\\nobtained toward the sources embedded in the secondary hot core Sgr B2(N2). We\\ncompared the chemical composition of these sources to that of sources from the\\nliterature and to predictions of the chemical kinetics model MAGICKAL. We\\ndetected up to 58 molecules toward Sgr B2(N2)'s hot cores, including up to 24\\nCOMs, as well as many less abundant isotopologs. The compositions of some pairs\\nof sources are well correlated, but differences also exist in particular for\\nHNCO and NH2CHO. The abundances of series of homologous molecules drop by about\\none order of magnitude at each further step in complexity. The nondetection of\\nradicals yields stringent constraints on the models. The comparison to the\\nchemical models confirms previous evidence of a high cosmic-ray ionization rate\\nin Sgr B2(N). The comparison to sources from the literature gives new insight\\ninto chemical differentiation. The composition of most hot cores of Sgr B2(N2)\\nis tightly correlated to that of the hot core G31.41+0.31 and the hot corino\\nIRAS 16293-2422B after normalizing the abundances by classes of molecules (O-,\\nN-, O+N-, and S-bearing). There is no overall correlation between Sgr B2(N2)\\nand the shocked region G+0.693-0.027 also located in Sgr B2, and even less with\\nthe cold starless core TMC-1. The class of N-bearing species reveals the\\nlargest variance among the four classes of molecules. The S-bearing class shows\\nin contrast the smallest variance. These results imply that the class of\\nN-bearing molecules reacts more sensitively to shocks, low-temperature gas\\nphase chemistry after non-thermal desorption, or density. The abundance shifts\\nobserved between the N- and O-bearing molecules may indicate how violently and\\ncompletely the ice mantles are desorbed. [abridged]\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-05-06T07:45:04Z\"}"}
