{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21745v1\", \"title\": \"Exponential advantage in quantum sensing of correlated parameters\", \"summary\": \"Conventionally in quantum sensing, the goal is to estimate one or more\\nunknown parameters that are assumed to be deterministic - that is, they do not\\nchange between shots of the quantum-sensing protocol. We instead consider the\\nsetting where the parameters are stochastic: each shot of the quantum-sensing\\nprotocol senses parameter values that come from independent random draws. In\\nthis work, we explore three examples where the stochastic parameters are\\ncorrelated and show how using entanglement provides a benefit in classification\\nor estimation tasks: (1) a two-parameter classification task, for which there\\nis an advantage in the low-shot regime; (2) an $N$-parameter estimation task\\nand a classification variant of it, for which an entangled sensor requires just\\na constant number (independent of $N$) shots to achieve the same accuracy as an\\nunentangled sensor using exponentially many (${\\\\sim}2^N$) shots; (3)\\nclassifying the magnetization of a spin chain in thermal equilibrium, where the\\nindividual spins fluctuate but the total spin in one direction is conserved -\\nthis gives a practical setting in which stochastic parameters are correlated in\\na way that an entangled sensor can be designed to exploit. We also present a\\ntheoretical framework for assessing, for a given choice of entangled sensing\\nprotocol and distributions to discriminate between, how much advantage the\\nentangled sensor would have over an unentangled sensor. Our work motivates the\\nfurther study of sensing correlated stochastic parameters using entangled\\nquantum sensors - and since classical sensors by definition cannot be\\nentangled, our work shows the possibility for entangled quantum sensors to\\nachieve an exponential advantage over classical sensors, in contrast to the\\ntypical quadratic advantage.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-30T15:39:30Z\"}"}
