{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11843v1\", \"title\": \"Scalable Multi-task Edge Sensing via Task-oriented Joint Information\\n  Gathering and Broadcast\", \"summary\": \"The recent advance of edge computing technology enables significant sensing\\nperformance improvement of Internet of Things (IoT) networks. In particular, an\\nedge server (ES) is responsible for gathering sensing data from distributed\\nsensing devices, and immediately executing different sensing tasks to\\naccommodate the heterogeneous service demands of mobile users. However, as the\\nnumber of users surges and the sensing tasks become increasingly\\ncompute-intensive, the huge amount of computation workloads and data\\ntransmissions may overwhelm the edge system of limited resources. Accordingly,\\nwe propose in this paper a scalable edge sensing framework for multi-task\\nexecution, in the sense that the computation workload and communication\\noverhead of the ES do not increase with the number of downstream users or\\ntasks. By exploiting the task-relevant correlations, the proposed scheme\\nimplements a unified encoder at the ES, which produces a common low-dimensional\\nmessage from the sensing data and broadcasts it to all users to execute their\\nindividual tasks. To achieve high sensing accuracy, we extend the well-known\\ninformation bottleneck theory to a multi-task scenario to jointly optimize the\\ninformation gathering and broadcast processes. We also develop an efficient\\ntwo-step training procedure to optimize the parameters of the neural\\nnetwork-based codecs deployed in the edge sensing system. Experiment results\\nshow that the proposed scheme significantly outperforms the considered\\nrepresentative benchmark methods in multi-task inference accuracy. Besides, the\\nproposed scheme is scalable to the network size, which maintains almost\\nconstant computation delay with less than 1% degradation of inference\\nperformance when the user number increases by four times.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-16T08:06:46Z\"}"}
