{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21522v1\", \"title\": \"The Principles of Probability: From Formal Logic to Measure Theory to\\n  the Principle of Indifference\", \"summary\": \"In this work, we develop a formal system of inductive logic. It uses an\\ninfinitary language that allows for countable conjunctions and disjunctions. It\\nis based on a set of nine syntactic rules of inductive inference, and contains\\nclassical first-order logic as a special case. We also provide natural,\\nprobabilistic semantics, and prove both $\\\\sigma$-compactness and completeness.\\n  We show that the whole of measure-theoretic probability theory is embedded in\\nthis system of inductive logic. The semantic models of inductive logic are\\nprobability measures on sets of structures. (Structures are the semantic models\\nof finitary, deductive logic.) Moreover, any probability space, together with a\\nset of its random variables, can be mapped to such a model in a way that gives\\neach outcome, event, and random variable a logical interpretation. This\\nembedding, however, is proper. There are scenarios that are expressible in this\\nsystem of logic which cannot be formulated in a measure-theoretic probability\\nmodel.\\n  The principle of indifference is an idea originating with Laplace. It says,\\nroughly, that if we are \\\"equally ignorant\\\" about two possibilities, then we\\nshould assign them the same probability. The principle of indifference has no\\nrigorous formulation in probability. It exists only as a heuristic. Moreover,\\nits use has a problematic history and is prone to apparent paradoxes. Within\\ninductive logic, however, we formulate it rigorously and illustrate its use\\nthrough a number of examples.\\n  Many of the ideas in inductive logic have counterparts in measure theory. The\\nprinciple of indifference, however, does not. Its formulation requires the\\nstructure of inductive logic, both its syntactic structure and the semantic\\nstructures embedded in its models. As such, it exemplifies the fact that\\ninductive logic is a strictly broader theory of probability than any that is\\nbased on measure theory alone.\", \"main_category\": \"math.PR\", \"categories\": \"math.PR,math.LO\", \"published\": \"2025-04-30T11:16:21Z\"}"}
