{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16906v1\", \"title\": \"An Accelerated Camera 3DMA Framework for Efficient Urban GNSS Multipath\\n  Estimation\", \"summary\": \"Robust GNSS positioning in urban environments is still plagued by multipath\\neffects, particularly due to the complex signal propagation induced by\\nubiquitous surfaces with varied radio frequency reflectivities. Current 3D\\nMapping Aided (3DMA) GNSS techniques show great potentials in mitigating\\nmultipath but face a critical trade-off between computational efficiency and\\nmodeling accuracy. Most approaches often rely on offline outdated or\\noversimplified 3D maps, while real-time LiDAR-based reconstruction boasts high\\naccuracy, it is problematic in low laser reflectivity conditions; camera 3DMA\\nis a good candidate to balance accuracy and efficiency but current methods\\nsuffer from extremely low reconstruction speed, a far cry from real-time\\nmultipath-mitigated navigation. This paper proposes an accelerated framework\\nincorporating camera multi-view stereo (MVS) reconstruction and ray tracing. By\\nhypothesizing on surface textures, an orthogonal visual feature fusion\\nframework is proposed, which robustly addresses both texture-rich and\\ntexture-poor surfaces, lifting off the reflectivity challenges in visual\\nreconstruction. A polygonal surface modeling scheme is further integrated to\\naccurately delineate complex building boundaries, enhancing the reconstruction\\ngranularity. To avoid excessively accurate reconstruction, reprojected point\\ncloud multi-plane fitting and two complexity control strategies are proposed,\\nthus improving upon multipath estimation speed. Experiments were conducted in\\nLujiazui, Shanghai, a typical multipath-prone district. The results show that\\nthe method achieves an average reconstruction accuracy of 2.4 meters in dense\\nurban environments featuring glass curtain wall structures, a traditionally\\ntough case for reconstruction, and achieves a ray-tracing-based multipath\\ncorrection rate of 30 image frames per second, 10 times faster than the\\ncontemporary benchmarks.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-23T17:34:37Z\"}"}
