{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09896v1\", \"title\": \"TWSSenti: A Novel Hybrid Framework for Topic-Wise Sentiment Analysis on\\n  Social Media Using Transformer Models\", \"summary\": \"Sentiment analysis is a crucial task in natural language processing (NLP)\\nthat enables the extraction of meaningful insights from textual data,\\nparticularly from dynamic platforms like Twitter and IMDB. This study explores\\na hybrid framework combining transformer-based models, specifically BERT,\\nGPT-2, RoBERTa, XLNet, and DistilBERT, to improve sentiment classification\\naccuracy and robustness. The framework addresses challenges such as noisy data,\\ncontextual ambiguity, and generalization across diverse datasets by leveraging\\nthe unique strengths of these models. BERT captures bidirectional context,\\nGPT-2 enhances generative capabilities, RoBERTa optimizes contextual\\nunderstanding with larger corpora and dynamic masking, XLNet models dependency\\nthrough permutation-based learning, and DistilBERT offers efficiency with\\nreduced computational overhead while maintaining high accuracy. We demonstrate\\ntext cleaning, tokenization, and feature extraction using Term Frequency\\nInverse Document Frequency (TF-IDF) and Bag of Words (BoW), ensure high-quality\\ninput data for the models. The hybrid approach was evaluated on benchmark\\ndatasets Sentiment140 and IMDB, achieving superior accuracy rates of 94\\\\% and\\n95\\\\%, respectively, outperforming standalone models. The results validate the\\neffectiveness of combining multiple transformer models in ensemble-like setups\\nto address the limitations of individual architectures. This research\\nhighlights its applicability to real-world tasks such as social media\\nmonitoring, customer sentiment analysis, and public opinion tracking which\\noffers a pathway for future advancements in hybrid NLP frameworks.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-04-14T05:44:11Z\"}"}
