{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00572v1\", \"title\": \"A Bioinformatic Study of Genetics Involved in Determining Mild Traumatic\\n  Brain Injury Severity and Recovery\", \"summary\": \"Aim: This in silico study sought to identify specific biomarkers for mild\\ntraumatic brain injury (mTBI) through the analysis of publicly available gene\\nand miRNA databases, hypothesizing their influence on neuronal structure,\\naxonal integrity, and regeneration. Methods: This study implemented a\\nthree-step process: (1) Data searching for mTBI-related genes in Gene and\\nMalaCard databases and literature review ; (2) Data analysis involved\\nperforming functional annotation through GO and KEGG, identifying hub genes\\nusing Cytoscape, mapping protein-protein interactions via DAVID and STRING, and\\npredicting miRNA targets using miRSystem, miRWalk2.0, and mirDIP (3)\\nRNA-sequencing analysis applied to the mTBI dataset GSE123336. Results: Eleven\\ncandidate hub genes associated with mTBI outcome were identified: APOE, S100B,\\nGFAP, BDNF, AQP4, COMT, MBP, UCHL1, DRD2, ASIC1, and CACNA1A. Enrichment\\nanalysis linked these genes to neuron projection regeneration and synaptic\\nplasticity. miRNAs linked to the mTBI candidate genes were hsa-miR-9-5p,\\nhsa-miR-204-5p, hsa-miR-1908-5p, hsa-miR-16-5p, hsa-miR-10a-5p, has-miR-218-5p,\\nhas-miR-34a-5p, and has-miR-199b-5p. The RNA sequencing revealed 2664\\ndifferentially expressed miRNAs post-mTBI, with 17 showing significant changes\\nat the time of injury and 48 hours post-injury. Two miRNAs were positively\\ncorrelated with direct head hits. Conclusion: Our study indicates that specific\\ngenes and miRNAs, particularly hsa-miR-10a-5p, may influence mTBI outcomes. Our\\nresearch may guide future mTBI diagnostics, emphasizing the need to measure and\\ntrack these specific genes and miRNAs in diverse cohorts.\", \"main_category\": \"q-bio.GN\", \"categories\": \"q-bio.GN,q-bio.NC\", \"published\": \"2025-05-01T14:56:46Z\"}"}
