{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03477v1\", \"title\": \"A generalised non-linear reconstructor for all Fourier-type wavefront\\n  sensors\", \"summary\": \"State-of-the-art adaptive optics (AO) systems perform non-linear Fourier-type\\nwavefront sensing for real-time corrections of dynamic wavefront aberrations.\\nThis general class of sensors uses a filtering mask in the focal plane that\\nconverts phase fluctuations of the incoming light into intensity variations in\\nthe subsequent pupil plane. Due to their high sensitivity, Fourier-type\\nwavefront sensors (WFSs) are the sensors of choice for many current and\\nupcoming AO systems in ophthalmic imaging, free-space optical communications\\n(FSOC) and astronomical ground-based telescopes such as the forthcoming\\ngeneration of extremely large telescopes (ELTs). Conventionally, linear\\nmethods, like a matrix-vector-multiplication (MVM), are used for the inversion\\nof Fourier-type WFSs. However, their non-linear behavior gives rise to severe\\nperformance degradations when significant channel perturbations are observed.\\nThey are expected to occur during strong atmospheric turbulence conditions,\\nwhich are commonplace for non-rural sites and daytime observations.\\n  This study presents a novel type of iterative reconstructor to overcome\\nnon-linear wavefront sensing regimes. The underlying method is the non-linear\\nLandweber iteration with Nesterov acceleration, well known in the field of\\ninverse problems. A significant advantage of the new approach is its direct\\napplicability to any Fourier-type WFS. This is implemented by adapting the\\nfiltering mask of the specific Fourier-type WFSs in the model-based algorithm.\\n  Several Fourier-type wavefront sensors are considered for ELT-scale\\ninstruments and their performance with the new algorithm is compared. The study\\ngoes on to concentrate on the pyramid wavefront sensor (PWFS), one of the most\\nwell-known Fourier-type WFSs. We demonstrate in end-to-end simulations that\\nthis novel approach outperforms linear methods in non-linear sensing regimes.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM,math-ph,math.MP\", \"published\": \"2025-05-06T12:31:40Z\"}"}
