{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03494v1\", \"title\": \"UPMAD-Net: A Brain Tumor Segmentation Network with Uncertainty Guidance\\n  and Adaptive Multimodal Feature Fusion\", \"summary\": \"Background: Brain tumor segmentation has a significant impact on the\\ndiagnosis and treatment of brain tumors. Accurate brain tumor segmentation\\nremains challenging due to their irregular shapes, vague boundaries, and high\\nvariability. Objective: We propose a brain tumor segmentation method that\\ncombines deep learning with prior knowledge derived from a region-growing\\nalgorithm. Methods: The proposed method utilizes a multi-scale feature fusion\\n(MSFF) module and adaptive attention mechanisms (AAM) to extract multi-scale\\nfeatures and capture global contextual information. To enhance the model's\\nrobustness in low-confidence regions, the Monte Carlo Dropout (MC Dropout)\\nstrategy is employed for uncertainty estimation. Results: Extensive experiments\\ndemonstrate that the proposed method achieves superior performance on Brain\\nTumor Segmentation (BraTS) datasets, significantly outperforming various\\nstate-of-the-art methods. On the BraTS2021 dataset, the test Dice scores are\\n89.18% for Enhancing Tumor (ET) segmentation, 93.67% for Whole Tumor (WT)\\nsegmentation, and 91.23% for Tumor Core (TC) segmentation. On the BraTS2019\\nvalidation set, the validation Dice scores are 87.43%, 90.92%, and 90.40% for\\nET, WT, and TC segmentation, respectively. Ablation studies further confirmed\\nthe contribution of each module to segmentation accuracy, indicating that each\\ncomponent played a vital role in overall performance improvement. Conclusion:\\nThis study proposed a novel 3D brain tumor segmentation network based on the\\nU-Net architecture. By incorporating the prior knowledge and employing the\\nuncertainty estimation method, the robustness and performance were improved.\\nThe code for the proposed method is available at\\nhttps://github.com/chenzhao2023/UPMAD_Net_BrainSeg.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-06T12:56:04Z\"}"}
