{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23879v1\", \"title\": \"Network topology effects on the social circle polls\", \"summary\": \"Election polls play a critical role in political discussions by probing\\npublic opinion and enabling political parties to assess their performance\\nbefore elections. However, traditional polling methods sometimes fail to\\npredict election outcomes accurately, leading researchers to explore new\\nmethodologies. One such approach is the \\\"social circle\\\" question, which asks\\nrespondents about the voting preferences of their social contacts. This method\\nleverages collective intelligence and has shown promise in improving predictive\\naccuracy. Nevertheless, the influence of the social network's topology on the\\neffectiveness of social circle polls remains unexplored. In this study, we\\ndevelop a theoretical framework to analyse how social network structure affects\\npolling accuracy. By simulating voter networks with varying levels of\\npolarisation and connectivity, we assess the performance of both standard and\\nsocial circle polling methods. Our findings indicate that while social circle\\npolls generally outperform traditional approaches, certain network\\ncharacteristics can introduce biases and undermine their performances,\\nparticularly in polarised situations, which are increasingly frequent in the\\ncurrent political landscape. To address these challenges, we propose a new\\nestimator that combines information from both standard and social circle polls,\\nimproving election outcome predictions. We demonstrate the applicability of our\\nmethod using real-world polling data from the 2016 U.S. presidential election,\\nshowcasing its practical utility and providing an estimate of the polarisation\\nlevel in that society. This work establishes a foundation for enhancing polling\\nmethodologies by assessing and integrating network features, which has\\nsignificant implications for social and political research.\", \"main_category\": \"physics.soc-ph\", \"categories\": \"physics.soc-ph\", \"published\": \"2025-03-31T09:28:09Z\"}"}
