{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04437v1\", \"title\": \"Probabilistic Zeeman-Doppler imaging of stellar magnetic fields: I.\\n  Analysis of tau Scorpii in the weak-field limit\", \"summary\": \"Zeeman-Doppler imaging (ZDI) is used to study the surface magnetic field\\ntopology of stars, based on high-resolution spectropolarimetric time series\\nobservations. Multiple ZDI inversions have been conducted for the early B-type\\nstar tau Sco, which has been found to exhibit a weak but complex non-dipolar\\nsurface magnetic field. The classical ZDI framework suffers from a significant\\nlimitation in that it provides little to no reliable uncertainty quantification\\nfor the reconstructed magnetic field maps, with essentially all published\\nresults being confined to point estimates. To fill this gap, we propose a\\nBayesian framework for probabilistic ZDI. Here, the proposed framework is\\ndemonstrated on tau Sco in the weak-field limit. We propose three distinct\\nstatistical models, and use archival ESPaDOnS high-resolution Stokes V\\nobservations to carry out the probabilistic magnetic inversion in closed form.\\nThe surface magnetic field is parameterised by a high-dimensional\\nspherical-harmonic expansion. By comparing three different prior distributions\\nover the latent variables in the spherical-harmonic decomposition, our results\\nshowcase the ZDI sensitivity to various hyperparameters. The mean magnetic\\nfield maps are qualitatively similar to previously published point estimates,\\nbut analysis of the magnetic energy distribution indicates high uncertainty and\\nhigher energy content at low angular degrees l. Our results effectively\\ndemonstrate that, for stars in the weak-field regime, reliable uncertainty\\nquantification of recovered magnetic field maps can be obtained in closed form\\nwith natural assumptions on the statistical model. Future work will explore\\nextending this framework beyond the weak-field approximation and incorporating\\nprior uncertainty over multiple stellar parameters in more complex magnetic\\ninversion problems.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.IM\", \"published\": \"2025-05-07T14:06:25Z\"}"}
