{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15088v1\", \"title\": \"Safety Co-Option and Compromised National Security: The Self-Fulfilling\\n  Prophecy of Weakened AI Risk Thresholds\", \"summary\": \"Risk thresholds provide a measure of the level of risk exposure that a\\nsociety or individual is willing to withstand, ultimately shaping how we\\ndetermine the safety of technological systems. Against the backdrop of the Cold\\nWar, the first risk analyses, such as those devised for nuclear systems,\\ncemented societally accepted risk thresholds against which safety-critical and\\ndefense systems are now evaluated. But today, the appropriate risk tolerances\\nfor AI systems have yet to be agreed on by global governing efforts, despite\\nthe need for democratic deliberation regarding the acceptable levels of harm to\\nhuman life. Absent such AI risk thresholds, AI technologists-primarily industry\\nlabs, as well as \\\"AI safety\\\" focused organizations-have instead advocated for\\nrisk tolerances skewed by a purported AI arms race and speculative\\n\\\"existential\\\" risks, taking over the arbitration of risk determinations with\\nlife-or-death consequences, subverting democratic processes.\\n  In this paper, we demonstrate how such approaches have allowed AI\\ntechnologists to engage in \\\"safety revisionism,\\\" substituting traditional\\nsafety methods and terminology with ill-defined alternatives that vie for the\\naccelerated adoption of military AI uses at the cost of lowered safety and\\nsecurity thresholds. We explore how the current trajectory for AI risk\\ndetermination and evaluation for foundation model use within national security\\nis poised for a race to the bottom, to the detriment of the US's national\\nsecurity interests. Safety-critical and defense systems must comply with\\nassurance frameworks that are aligned with established risk thresholds, and\\nfoundation models are no exception. As such, development of evaluation\\nframeworks for AI-based military systems must preserve the safety and security\\nof US critical and defense infrastructure, and remain in alignment with\\ninternational humanitarian law.\", \"main_category\": \"cs.CY\", \"categories\": \"cs.CY\", \"published\": \"2025-04-21T13:20:56Z\"}"}
