{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04157v1\", \"title\": \"Discontinuity Method for Evaluating Scattering Amplitudes within the\\n  Worldline Formalism\", \"summary\": \"The worldline formalism offers an alternative framework to the standard\\ndiagrammatic approach in quantum field theory, grounded in first-quantized\\nrelativistic path integrals. Over recent decades, this formalism has attracted\\ngrowing interest due to its potential applications and computational\\nadvantages. As a result, a collection of worldline master integrals has been\\nderived within this approach. However, efficient mathematical tools for\\nevaluating these integrals remain limited.\\n  Motivated by unitarity methods used in the conventional formalism of quantum\\nfield theory, this work proposes a novel framework for evaluating one-loop\\nworldline master integrals, up to a rational function in the kinematical\\nexternal invariants, through the computation of their discontinuities.\\nSimilarly to standard unitarity techniques, the method involves decomposing an\\n$n$-point one loop amplitude in $D=4$ dimensions into a linear combination of\\ntadpole, bubble, triangle, and box master integrals. The coefficients of this\\ndecomposition are rational functions of the external kinematic invariants. Each\\nmaster integral exhibits a characteristic discontinuity with respect to a\\nspecific kinematic invariant. Consequently, the rational coefficients can be\\ndetermined by directly computing the discontinuities of the corresponding\\nworldline master integrals. In the three-point and four-point on-shell cases,\\nthis computation is particularly tractable, as the discontinuities involve\\nDirac delta functions arising from the Sokhotski-Plemelj formula, which\\nsimplify the resulting integrals.\\n  For the four-point on-shell case, a set of master formulas for the\\ndiscontinuities is derived. The practical implementation of the proposed\\ndiscontinuity method is demonstrated through several illustrative examples.\", \"main_category\": \"hep-th\", \"categories\": \"hep-th,hep-ph\", \"published\": \"2025-05-07T06:15:56Z\"}"}
