{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10300v1\", \"title\": \"Measuring amount of computation done by C.elegans using whole brain\\n  neural activity\", \"summary\": \"Many dynamical systems found in biology, ranging from genetic circuits to the\\nhuman brain to human social systems, are inherently computational. Although\\nextensive research has explored their resulting functions and behaviors, the\\nunderlying computations often remain elusive. Even the fundamental task of\\nquantifying the \\\\textit{amount} of computation performed by a dynamical system\\nremains under-investigated. In this study we address this challenge by\\nintroducing a novel framework to estimate the amount of computation implemented\\nby an arbitrary physical system based on empirical time-series of its dynamics.\\nThis framework works by forming a statistical reconstruction of that dynamics,\\nand then defining the amount of computation in terms of both the complexity and\\nfidelity of this reconstruction. We validate our framework by showing that it\\nappropriately distinguishes the relative amount of computation across different\\nregimes of Lorenz dynamics and various computation classes of cellular\\nautomata. We then apply this framework to neural activity in\\n\\\\textit{Caenorhabditis elegans}, as captured by calcium imaging. By analyzing\\ntime-series neural data obtained from the fluorescent intensity of the calcium\\nindicator GCaMP, we find that high and low amounts of computation are required,\\nrespectively, in the neural dynamics of freely moving and immobile worms. Our\\nanalysis further sheds light on the amount of computation performed when the\\nsystem is in various locomotion states. In sum, our study refines the\\ndefinition of computational amount from time-series data and highlights neural\\ncomputation in a simple organism across distinct behavioral states.\", \"main_category\": \"q-bio.NC\", \"categories\": \"q-bio.NC\", \"published\": \"2025-04-14T15:09:13Z\"}"}
