{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16738v1\", \"title\": \"MOSAIC: A Skill-Centric Algorithmic Framework for Long-Horizon\\n  Manipulation Planning\", \"summary\": \"Planning long-horizon motions using a set of predefined skills is a key\\nchallenge in robotics and AI. Addressing this challenge requires methods that\\nsystematically explore skill combinations to uncover task-solving sequences,\\nharness generic, easy-to-learn skills (e.g., pushing, grasping) to generalize\\nacross unseen tasks, and bypass reliance on symbolic world representations that\\ndemand extensive domain and task-specific knowledge. Despite significant\\nprogress, these elements remain largely disjoint in existing approaches,\\nleaving a critical gap in achieving robust, scalable solutions for complex,\\nlong-horizon problems. In this work, we present MOSAIC, a skill-centric\\nframework that unifies these elements by using the skills themselves to guide\\nthe planning process. MOSAIC uses two families of skills: Generators compute\\nexecutable trajectories and world configurations, and Connectors link these\\nindependently generated skill trajectories by solving boundary value problems,\\nenabling progress toward completing the overall task. By breaking away from the\\nconventional paradigm of incrementally discovering skills from predefined start\\nor goal states--a limitation that significantly restricts exploration--MOSAIC\\nfocuses planning efforts on regions where skills are inherently effective. We\\ndemonstrate the efficacy of MOSAIC in both simulated and real-world robotic\\nmanipulation tasks, showcasing its ability to solve complex long-horizon\\nplanning problems using a diverse set of skills incorporating generative\\ndiffusion models, motion planning algorithms, and manipulation-specific models.\\nVisit https://skill-mosaic.github.io for demonstrations and examples.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.AI\", \"published\": \"2025-04-23T14:09:42Z\"}"}
