{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17413v1\", \"title\": \"Boundary observation and control for fractional heat and wave equations\", \"summary\": \"We establish boundary observability and control for the fractional heat\\nequation over arbitrary time horizons $T > 0$, within the optimal range of\\nfractional exponents $s \\\\in (1/2, 1)$. Our approach introduces a novel\\nsynthesis of techniques from fractional partial differential equations and\\ncontrol theory, combining several key ingredients in an original and effective\\nmanner:\\n  1. Boundary observability for low-frequency solutions of the fractional wave\\nequation. We begin by analyzing the associated fractional wave equation. Using\\na fractional analogue of Pohozaev's identity, we establish a partial boundary\\nobservability result for the low-frequency solutions. The corresponding\\nobservability time horizon increases with the eigenmode frequency, reflecting\\nthe inherently slower propagation speed of the fractional waves.\\n  2. Transmutation to the parabolic setting. Using transmutation techniques, we\\ntransfer the observability results from the wave setting to the parabolic one.\\nThis yields a frequency-dependent observability inequality for the fractional\\nheat equation, which - via duality - enables control of its low-frequency\\ncomponents.\\n  3. Frequency-wise iteration. Leveraging the dissipative nature of the\\nfractional heat equation, we develop an iterative procedure to successively\\ncontrol the entire frequency spectrum of solutions. The condition $s \\\\in (1/2,\\n1)$ is crucial in this analysis, as it guarantees sufficient decay of\\nhigh-frequency components, enabling the convergence of the iteration.\\n  4. Duality. By a duality argument, we derive boundary observability from the\\nboundary controllability of the fractional heat equation. Remarkably, this type\\nof boundary observability result is entirely new in the multi-dimensional\\nsetting and appears to be out of reach for existing methods. \\\\end{itemize}\", \"main_category\": \"math.AP\", \"categories\": \"math.AP\", \"published\": \"2025-04-24T10:11:56Z\"}"}
