{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04358v1\", \"title\": \"Reduced Cloud Cover Errors in a Hybrid AI-Climate Model Through Equation\\n  Discovery And Automatic Tuning\", \"summary\": \"Climate models rely on parameterizations that account for the effects of\\nsmall-scale processes on large-scale dynamics. Particularly cloud-related\\nparameterizations remain a major source of uncertainty in climate projections.\\nWhile hybrid Earth system models (ESMs) with machine learning-based\\nparameterizations could improve current ESMs, deep learning approaches often\\nlack interpretability, physical consistency, and computational efficiency.\\nFurthermore, most data-driven parameterizations are trained in a stand-alone\\nfashion and fail within ESMs, partly due to the difficulty of tuning the ESM to\\naccommodate new, non-traditional schemes. In this study, we introduce a novel\\ntwo-step pipeline for improving a climate model with data-driven\\nparameterizations. First, we incorporate a physically consistent, data-driven\\ncloud cover parameterization into the ICON global atmospheric model. The\\nparameterization, a diagnostic equation derived from storm-resolving\\nsimulations via symbolic regression, retains the interpretability and\\nefficiency of traditional parameterizations while improving fidelity. Second,\\nwe introduce an automated, gradient-free tuning procedure to recalibrate the\\nnew climate model with Earth observations. We employ the Nelder-Mead algorithm\\nand progressively increase simulation length, making our approach simple,\\ncomputationally efficient, and easily extendable to other ESMs. The tuned\\nhybrid model significantly reduces some long-standing biases in cloud cover and\\nradiative budgets, particularly over regions such as the Southern Ocean and the\\nsubtropical stratocumulus regions. Moreover, it remains robust under +4K\\nsurface warming. Our results highlight the potential of data-driven\\nparameterizations when combined with model tuning. This framework offers an\\nautomatic, efficient and practical approach to enhancing climate projections\\nwithout losing performance or interpretability.\", \"main_category\": \"physics.ao-ph\", \"categories\": \"physics.ao-ph\", \"published\": \"2025-05-07T12:12:51Z\"}"}
