{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01396v1\", \"title\": \"All Patches Matter, More Patches Better: Enhance AI-Generated Image\\n  Detection via Panoptic Patch Learning\", \"summary\": \"The exponential growth of AI-generated images (AIGIs) underscores the urgent\\nneed for robust and generalizable detection methods. In this paper, we\\nestablish two key principles for AIGI detection through systematic analysis:\\n\\\\textbf{(1) All Patches Matter:} Unlike conventional image classification where\\ndiscriminative features concentrate on object-centric regions, each patch in\\nAIGIs inherently contains synthetic artifacts due to the uniform generation\\nprocess, suggesting that every patch serves as an important artifact source for\\ndetection. \\\\textbf{(2) More Patches Better}: Leveraging distributed artifacts\\nacross more patches improves detection robustness by capturing complementary\\nforensic evidence and reducing over-reliance on specific patches, thereby\\nenhancing robustness and generalization. However, our counterfactual analysis\\nreveals an undesirable phenomenon: naively trained detectors often exhibit a\\n\\\\textbf{Few-Patch Bias}, discriminating between real and synthetic images based\\non minority patches. We identify \\\\textbf{Lazy Learner} as the root cause:\\ndetectors preferentially learn conspicuous artifacts in limited patches while\\nneglecting broader artifact distributions. To address this bias, we propose the\\n\\\\textbf{P}anoptic \\\\textbf{P}atch \\\\textbf{L}earning (PPL) framework, involving:\\n(1) Random Patch Replacement that randomly substitutes synthetic patches with\\nreal counterparts to compel models to identify artifacts in underutilized\\nregions, encouraging the broader use of more patches; (2) Patch-wise\\nContrastive Learning that enforces consistent discriminative capability across\\nall patches, ensuring uniform utilization of all patches. Extensive experiments\\nacross two different settings on several benchmarks verify the effectiveness of\\nour approach.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-02T06:32:09Z\"}"}
