{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13023v1\", \"title\": \"ChatEXAONEPath: An Expert-level Multimodal Large Language Model for\\n  Histopathology Using Whole Slide Images\", \"summary\": \"Recent studies have made significant progress in developing large language\\nmodels (LLMs) in the medical domain, which can answer expert-level questions\\nand demonstrate the potential to assist clinicians in real-world clinical\\nscenarios. Studies have also witnessed the importance of integrating various\\nmodalities with the existing LLMs for a better understanding of complex\\nclinical contexts, which are innately multi-faceted by nature. Although studies\\nhave demonstrated the ability of multimodal LLMs in histopathology to answer\\nquestions from given images, they lack in understanding of thorough clinical\\ncontext due to the patch-level data with limited information from public\\ndatasets. Thus, developing WSI-level MLLMs is significant in terms of the\\nscalability and applicability of MLLMs in histopathology. In this study, we\\nintroduce an expert-level MLLM for histopathology using WSIs, dubbed as\\nChatEXAONEPath. We present a retrieval-based data generation pipeline using\\n10,094 pairs of WSIs and histopathology reports from The Cancer Genome Atlas\\n(TCGA). We also showcase an AI-based evaluation protocol for a comprehensive\\nunderstanding of the medical context from given multimodal information and\\nevaluate generated answers compared to the original histopathology reports. We\\ndemonstrate the ability of diagnosing the given histopathology images using\\nChatEXAONEPath with the acceptance rate of 62.9% from 1,134 pairs of WSIs and\\nreports. Our proposed model can understand pan-cancer WSIs and clinical context\\nfrom various cancer types. We argue that our proposed model has the potential\\nto assist clinicians by comprehensively understanding complex morphology of\\nWSIs for cancer diagnosis through the integration of multiple modalities.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.CV\", \"published\": \"2025-04-17T15:33:17Z\"}"}
