{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15943v1\", \"title\": \"Ge$_{1-x}$Si$_{x}$ single crystals for Ge hole spin qubit integration\", \"summary\": \"Spin qubits are fundamental building blocks of modern quantum computing\\ndevices. The path of Ge-based hole-spin qubits has several advantages over\\nSi-based electron-spin systems, such as the absence of valley band degeneracy,\\nthe possibility of efficient field control due to large spin-orbit coupling,\\nand smaller effective masses. Among the possible Ge qubit devices, Ge/GeSi\\nplanar heterostructures have proven to be favourable for upscaling and\\nfabrication. The Si concentration of the straining GeSi buffer serves as an\\nimportant tuning parameter for the electronic structure of Ge/GeSi qubits. A\\nparticularly low Si concentration of x = 0.15 of the Ge$_{0.85}$Si$_{0.15}$\\ncrystal should enable minimal lattice strain for spin qubit heterostructures,\\nwhich is difficult to stabilize as a random alloy. We present a\\nsynchrotron-based study to investigate the chemical composition, valence band\\nelectronic structure and local atomic structure of a Ge$_{0.85}$Si$_{0.15}$\\nsingle crystal using the advanced combination of hard X-ray photoelectron\\nspectroscopy (HAXPES), hard X-ray momentum microscopy (HarMoMic) and X-ray\\nphotoelectron diffraction (XPD). We found that the Ge$_{0.85}$Si$_{0.15}$\\ncrystal has an individual, uniform valence band structure, with no signs of\\nphase separation. The shapes of the valence bands resemble those of pure Ge, as\\ndo the low effective masses. XPD experiments and Bloch wave calculations, show\\nthe Si atoms located at Ge lattice sites within the crystal, forming a random\\nalloy. This high chemical, electronic and structural quality of\\nGe$_{0.85}$Si$_{0.15}$ single-crystal substrates is of crucial importance for\\ntheir implementation to enable long spin lifetimes in Ge-based hole-spin\\nqubits. The results emphasise the power of combined X-ray spectromicroscopy\\ntechniques, which provide key insights into the qubit building blocks that form\\nthe basis of quantum technologies.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-22T14:40:46Z\"}"}
