{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03626v1\", \"title\": \"High-redshift Millennium and Astrid galaxies in effective field theory\\n  at the field level\", \"summary\": \"Effective Field Theory (EFT) modeling is expected to be a useful tool in the\\nera of future higher-redshift galaxy surveys such as DESI-II and Spec-S5 due to\\nits robust description of various large-scale structure tracers. However, large\\nvalues of EFT bias parameters of higher-redshift galaxies could jeopardize the\\nconvergence of the perturbative expansion. In this paper we measure the bias\\nparameters and other EFT coefficients from samples of two types of star-forming\\ngalaxies in the state-of-the-art MilleniumTNG and Astrid hydrodynamical\\nsimulations. Our measurements are based on the field-level EFT forward model\\nthat allows for precision EFT parameter measurements by virtue of cosmic\\nvariance cancellation. Specifically, we consider approximately representative\\nsamples of Lyman-break galaxies (LBGs) and Lyman-alpha emitters (LAEs) that are\\nconsistent with the observed (angular) clustering and number density of these\\ngalaxies at $z=3$. Reproducing the linear biases and number densities observed\\nfrom existing LAE and LBG data, we find quadratic bias parameters that are\\nroughly consistent with those predicted from the halo model coupled with a\\nsimple halo occupation distribution model. We also find non-perturbative\\nvelocity contributions (Fingers of God) of a similar size for LBGs to the\\nfamiliar case of Luminous Red Galaxies. However, these contributions are quite\\nsmall for LAEs despite their large satellite fraction values of up to $\\\\sim\\n30\\\\%$. Our results indicate that the effective momentum reach $k_{\\\\rm{Max}}$ at\\n$z=3$ for LAEs (LBGs) will be in the range $0.3-0.6 ~h\\\\rm{Mpc}^{-1}$\\n($0.2-0.8~h\\\\rm{Mpc}^{-1}$), suggesting that EFT will perform well for high\\nredshift galaxy clustering. This work provides the first step toward obtaining\\nrealistic simulation-based priors on EFT parameters for LAEs and LBGs.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-05-06T15:23:09Z\"}"}
