{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21415v1\", \"title\": \"Optimizing Mouse Dynamics for User Authentication by Machine Learning:\\n  Addressing Data Sufficiency, Accuracy-Practicality Trade-off, and Model\\n  Performance Challenges\", \"summary\": \"User authentication is essential to ensure secure access to computer systems,\\nyet traditional methods face limitations in usability, cost, and security.\\nMouse dynamics authentication, based on the analysis of users' natural\\ninteraction behaviors with mouse devices, offers a cost-effective,\\nnon-intrusive, and adaptable solution. However, challenges remain in\\ndetermining the optimal data volume, balancing accuracy and practicality, and\\neffectively capturing temporal behavioral patterns. In this study, we propose a\\nstatistical method using Gaussian kernel density estimate (KDE) and\\nKullback-Leibler (KL) divergence to estimate the sufficient data volume for\\ntraining authentication models. We introduce the Mouse Authentication Unit\\n(MAU), leveraging Approximate Entropy (ApEn) to optimize segment length for\\nefficient and accurate behavioral representation. Furthermore, we design the\\nLocal-Time Mouse Authentication (LT-AMouse) framework, integrating 1D-ResNet\\nfor local feature extraction and GRU for modeling long-term temporal\\ndependencies. Taking the Balabit and DFL datasets as examples, we significantly\\nreduced the data scale, particularly by a factor of 10 for the DFL dataset,\\ngreatly alleviating the training burden. Additionally, we determined the\\noptimal input recognition unit length for the user authentication system on\\ndifferent datasets based on the slope of Approximate Entropy. Training with\\nimbalanced samples, our model achieved a successful defense AUC 98.52% for\\nblind attack on the DFL dataset and 94.65% on the Balabit dataset, surpassing\\nthe current sota performance.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.AI\", \"published\": \"2025-04-30T08:16:52Z\"}"}
