{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15861v1\", \"title\": \"Stochastic low-frequency variability of 50 massive stars in the Cygnus\\n  OB associations and the Small Magellanic Cloud\", \"summary\": \"In recent years, high-precision high-cadence space photometry has revealed\\nthat stochastic low frequency (SLF) variability is common in the light curves\\nof massive stars. We use the data from the Transiting Exoplanet Survey\\nSatellite (TESS) to study and characterize the SLF variability found in a\\nsample of 49 O- and B-type main-sequence stars across six Cygnus\\nOB~associations and one low-metallicity SMC star AV~232. We compare these\\nresults to 53 previously studied SLF variables. We adopt two different methods\\nfor characterizing the signal. In the first, we follow earlier work and fit a\\nLorentzian-like profile to the power density spectrum of the residual light\\ncurve to derive the amplitude $\\\\alpha_0$, characteristic frequency $\\\\nu_{\\\\rm\\nchar}$, and slope $\\\\gamma$ of the variability. In our second model-independent\\nmethod, we calculate the root-mean-square (RMS) of the photometric variability\\nas well as the frequency at 50\\\\% of the accumulated power spectral density,\\n$\\\\nu_{50\\\\%}$, and the width of the cumulative integrated power density, $w$.\\nFor the full sample of 103 SLF variables, we find that $\\\\alpha_0$, $\\\\gamma$,\\nRMS, $\\\\nu_{50\\\\%}$, and $w$ correlate with the spectroscopic luminosity of the\\nstars. Both $\\\\alpha_0$ and RMS appear to increase for more evolved stars\\nwhereas $\\\\nu_{\\\\rm char}$ and $\\\\nu_{50\\\\%}$ both decrease. Finally, we compare\\nour results to 2-D and 3-D simulations of subsurface convection, core-generated\\ninternal gravity waves, and surface stellar winds, and find good agreement\\nbetween the observed $\\\\nu_{\\\\rm char}$ of our sample and predictions from\\nsub-surface convection.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-22T12:57:30Z\"}"}
