{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21737v1\", \"title\": \"Observation of Intrinsic and LED Light-Enhanced Memristor Performance in\\n  In-Plane Ferroelectric NbOI2\", \"summary\": \"Two-dimensional (2D) layered ferroelectrics, as an emerging area of research,\\nhave attracted extensive attention, while memristors based on new 2D\\nferroelectric materials have yet to be fully explored, thereby limiting their\\napplications in modern nanoelectronics. In this work, we report the observation\\nof intrinsic memristive behavior in a newly discovered 2D in-plane\\nferroelectric material, NbOI2, and the giant enhancement of the memristive\\nperformance using LED visible light. The results show that NbOI2 exhibits\\nintrinsically strong memristive response with a current on/off ratio of up to\\n10^4 and stable switching cycles, which is independent of back-gate voltage.\\nUnder LED visible light illumination, the current on/off ratio in NbOI2 is over\\none order of magnitude higher than that without light, meanwhile, the coercive\\nfield is significantly reduced to less than 1.22 kVcm-1, much lower than other\\n2D ferroelectric material-based memristors. Interestingly, both the intrinsic\\nand the light-enhanced resistive switching phenomena only occur along the\\nin-plane b-axis direction, indicating that the memristive behavior in NbOI2 is\\ndriven by electric field-induced and optical field-enhanced ferroelectric\\npolarization switching mechanisms, as evidenced by a combined\\norientation-dependent electrical/optoelectrical measurement and sweep\\ncycle-induced structural evolution analysis. Our study not only provides a\\nmaterials strategy based on new 2D ferroelectrics for designing memristor\\napplications, but also offers a simple optical method to enhance its\\nperformance, paving the path for its implementation in novel nanoelectronics\\nand optoelectronics.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,cond-mat.mes-hall\", \"published\": \"2025-04-30T15:33:37Z\"}"}
