{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12909v1\", \"title\": \"Real-time High-fidelity Gaussian Human Avatars with Position-based\\n  Interpolation of Spatially Distributed MLPs\", \"summary\": \"Many works have succeeded in reconstructing Gaussian human avatars from\\nmulti-view videos. However, they either struggle to capture pose-dependent\\nappearance details with a single MLP, or rely on a computationally intensive\\nneural network to reconstruct high-fidelity appearance but with rendering\\nperformance degraded to non-real-time. We propose a novel Gaussian human avatar\\nrepresentation that can reconstruct high-fidelity pose-dependence appearance\\nwith details and meanwhile can be rendered in real time. Our Gaussian avatar is\\nempowered by spatially distributed MLPs which are explicitly located on\\ndifferent positions on human body. The parameters stored in each Gaussian are\\nobtained by interpolating from the outputs of its nearby MLPs based on their\\ndistances. To avoid undesired smooth Gaussian property changing during\\ninterpolation, for each Gaussian we define a set of Gaussian offset basis, and\\na linear combination of basis represents the Gaussian property offsets relative\\nto the neutral properties. Then we propose to let the MLPs output a set of\\ncoefficients corresponding to the basis. In this way, although Gaussian\\ncoefficients are derived from interpolation and change smoothly, the Gaussian\\noffset basis is learned freely without constraints. The smoothly varying\\ncoefficients combined with freely learned basis can still produce distinctly\\ndifferent Gaussian property offsets, allowing the ability to learn\\nhigh-frequency spatial signals. We further use control points to constrain the\\nGaussians distributed on a surface layer rather than allowing them to be\\nirregularly distributed inside the body, to help the human avatar generalize\\nbetter when animated under novel poses. Compared to the state-of-the-art\\nmethod, our method achieves better appearance quality with finer details while\\nthe rendering speed is significantly faster under novel views and novel poses.\", \"main_category\": \"cs.GR\", \"categories\": \"cs.GR,cs.CV\", \"published\": \"2025-04-17T12:57:41Z\"}"}
