{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17304v1\", \"title\": \"You Are What You Bought: Generating Customer Personas for E-commerce\\n  Applications\", \"summary\": \"In e-commerce, user representations are essential for various applications.\\nExisting methods often use deep learning techniques to convert customer\\nbehaviors into implicit embeddings. However, these embeddings are difficult to\\nunderstand and integrate with external knowledge, limiting the effectiveness of\\napplications such as customer segmentation, search navigation, and product\\nrecommendations. To address this, our paper introduces the concept of the\\ncustomer persona. Condensed from a customer's numerous purchasing histories, a\\ncustomer persona provides a multi-faceted and human-readable characterization\\nof specific purchase behaviors and preferences, such as Busy Parents or Bargain\\nHunters.\\n  This work then focuses on representing each customer by multiple personas\\nfrom a predefined set, achieving readable and informative explicit user\\nrepresentations. To this end, we propose an effective and efficient solution\\nGPLR. To ensure effectiveness, GPLR leverages pre-trained LLMs to infer\\npersonas for customers. To reduce overhead, GPLR applies LLM-based labeling to\\nonly a fraction of users and utilizes a random walk technique to predict\\npersonas for the remaining customers. We further propose RevAff, which provides\\nan absolute error $\\\\epsilon$ guarantee while improving the time complexity of\\nthe exact solution by a factor of at least\\n$O(\\\\frac{\\\\epsilon\\\\cdot|E|N}{|E|+N\\\\log N})$, where $N$ represents the number of\\ncustomers and products, and $E$ represents the interactions between them. We\\nevaluate the performance of our persona-based representation in terms of\\naccuracy and robustness for recommendation and customer segmentation tasks\\nusing three real-world e-commerce datasets. Most notably, we find that\\nintegrating customer persona representations improves the state-of-the-art\\ngraph convolution-based recommendation model by up to 12% in terms of NDCG@K\\nand F1-Score@K.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR,cs.AI\", \"published\": \"2025-04-24T06:59:16Z\"}"}
