{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16904v1\", \"title\": \"Observation of Double Hysteresis in CoFe$_2$O$_4$/MnFe$_2$O$_4$\\n  Core/Shell Nanoparticles and Its Contribution to AC Heat Induction\", \"summary\": \"Magnetic core/shell nanoparticles are promising candidates for magnetic\\nhyperthermia due to its high AC magnetic heat induction (specific loss power\\n(SLP)). It's widely accepted that magnetic exchange-coupling between core and\\nshell plays the crucial role in enhancing SLP of magnetic core/shell\\nnanoparticles. However, the physical contribution of exchange coupling to SLP\\nhas not been systematically investigated, and the underlying mechanism remains\\nunclear. In this study, magnetic hard/soft CoFe$_2$O$_4$/MnFe$_2$O$_4 and\\ninverted soft/hard MnFe$_2$O$_4$/CoFe$_2$O$_4$ core/shell nanoparticles were\\nsynthesized, systematically varying the number of shell layers, to investigate\\nthe physical contribution of internal bias coupling at the core/shell interface\\nto AC heat induction (SLP). Our results show that a unique magnetic property,\\ndouble-hysteresis loop, was present and clearly observed, which was never\\nreported in previous core/shell research literature. According to the\\nexperimentally and theoretically analyzed results, the double-hysteresis\\nbehavior in core/shell nanoparticles was caused by the difference in magnetic\\nanisotropy between core and shell materials, separated by a non-magnetic\\ninterface. The enhanced SLP and maximum temperature rise (TAC,max) of\\ncore/shell nanoparticles are attributed to the optimized magnetic anisotropy,\\nAC magnetic softness and double hysteresis behavior due to the internal bias\\ncoupling. These results demonstrate that the rational design capabilities to\\nseparately control the magnetic anisotropy, AC/DC magnetic properties by\\nvarying the volume ration between core and shell and by switching hard or soft\\nphase materials between core and shell are effective modalities to enhance the\\nAC heat induction of core/shell nanoparticles for magnetic nanoparticle\\nhyperthermia.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,cond-mat.mes-hall\", \"published\": \"2025-04-23T17:28:28Z\"}"}
