{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12132v1\", \"title\": \"Weakly Semi-supervised Whole Slide Image Classification by Two-level\\n  Cross Consistency Supervision\", \"summary\": \"Computer-aided Whole Slide Image (WSI) classification has the potential to\\nenhance the accuracy and efficiency of clinical pathological diagnosis. It is\\ncommonly formulated as a Multiple Instance Learning (MIL) problem, where each\\nWSI is treated as a bag and the small patches extracted from the WSI are\\nconsidered instances within that bag. However, obtaining labels for a large\\nnumber of bags is a costly and time-consuming process, particularly when\\nutilizing existing WSIs for new classification tasks. This limitation renders\\nmost existing WSI classification methods ineffective. To address this issue, we\\npropose a novel WSI classification problem setting, more aligned with clinical\\npractice, termed Weakly Semi-supervised Whole slide image Classification\\n(WSWC). In WSWC, a small number of bags are labeled, while a significant number\\nof bags remain unlabeled. The MIL nature of the WSWC problem, coupled with the\\nabsence of patch labels, distinguishes it from typical semi-supervised image\\nclassification problems, making existing algorithms for natural images\\nunsuitable for directly solving the WSWC problem. In this paper, we present a\\nconcise and efficient framework, named CroCo, to tackle the WSWC problem\\nthrough two-level Cross Consistency supervision. CroCo comprises two\\nheterogeneous classifier branches capable of performing both instance\\nclassification and bag classification. The fundamental idea is to establish\\ncross-consistency supervision at both the bag-level and instance-level between\\nthe two branches during training. Extensive experiments conducted on four\\ndatasets demonstrate that CroCo achieves superior bag classification and\\ninstance classification performance compared to other comparative methods when\\nlimited WSIs with bag labels are available. To the best of our knowledge, this\\npaper presents for the first time the WSWC problem and gives a successful\\nresolution.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-16T14:45:26Z\"}"}
