{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15824v1\", \"title\": \"Characterization and ex vivo application of flexible 2D scintillating\\n  coatings in ultra-high dose rate electron beams for FLASH radiotherapy\", \"summary\": \"The increasing interest in FLASH-RT has lead to the conversion of linear\\naccelerators to enable ultra-high dose rate (UHDR) beams for preclinical\\nresearch. Dosimetry hereof remains challenging with several crucial aspects\\nmissing. This work shows the challenges for real-time 2D UHDR dosimetry, and\\naims to present a solution in the context of preclinical irradiations in\\nnon-homogeneous UHDR electron beams. An experimental camera-scintillation sheet\\ncombination, was used to investigate the spatial dose distribution of a\\nconverted UHDR Varian Trilogy. The dosimetric system was characterized by\\nvariation of the number of pulses and source to surface distance (SSD) and its\\napplication was investigated by variation of bolus thickness and ambient light\\nintensity. The challenges of prelcinical real time 2D dosimetry with\\nscintillating coatings were assessed by ex vivo irradiations of a rat brain,\\nmouse hindlimb and whole body mouse. Radiochromic EBT XD film was used as\\npassive reference dosimeter. The coating showed a linear response with the\\nnumber of pulses in the absence and presence of transparent bolus, up to 3 cm\\nthick, and with the inverse squared SSD. The presence of ambient light reduces\\nthe signal-background ratio. The sheet showed to have sufficient flexibility to\\nbe molded on the subjects' surface, following its curvatures. Linearity with\\nnumber of pulses was preserved in a preclinical setting. For small field sizes\\nthe light output became too low, resulting in noisy dose maps. The system\\nshowed robust within 5% for camera set up differences. Calibration of the\\nsystem was complicated due to set up variations and the inhomogeneity of the\\nbeam. We showed the need for 2D real-time dosimetry to determine beam\\ncharacteristics in non-homogeneous UHDR beams using a preclinical setting. We\\npresented one solution to meet this need with scintillating based dosimetry.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph\", \"published\": \"2025-04-22T12:11:50Z\"}"}
