{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15683v1\", \"title\": \"FinTextSim: Enhancing Financial Text Analysis with BERTopic\", \"summary\": \"Recent advancements in information availability and computational\\ncapabilities have transformed the analysis of annual reports, integrating\\ntraditional financial metrics with insights from textual data. To extract\\nvaluable insights from this wealth of textual data, automated review processes,\\nsuch as topic modeling, are crucial. This study examines the effectiveness of\\nBERTopic, a state-of-the-art topic model relying on contextual embeddings, for\\nanalyzing Item 7 and Item 7A of 10-K filings from S&P 500 companies\\n(2016-2022). Moreover, we introduce FinTextSim, a finetuned\\nsentence-transformer model optimized for clustering and semantic search in\\nfinancial contexts. Compared to all-MiniLM-L6-v2, the most widely used\\nsentence-transformer, FinTextSim increases intratopic similarity by 81% and\\nreduces intertopic similarity by 100%, significantly enhancing organizational\\nclarity. We assess BERTopic's performance using embeddings from both FinTextSim\\nand all-MiniLM-L6-v2. Our findings reveal that BERTopic only forms clear and\\ndistinct economic topic clusters when paired with FinTextSim's embeddings.\\nWithout FinTextSim, BERTopic struggles with misclassification and overlapping\\ntopics. Thus, FinTextSim is pivotal for advancing financial text analysis.\\nFinTextSim's enhanced contextual embeddings, tailored for the financial domain,\\nelevate the quality of future research and financial information. This improved\\nquality of financial information will enable stakeholders to gain a competitive\\nadvantage, streamlining resource allocation and decision-making processes.\\nMoreover, the improved insights have the potential to leverage business\\nvaluation and stock price prediction models.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.LG,econ.GN,q-fin.EC,q-fin.GN\", \"published\": \"2025-04-22T08:06:37Z\"}"}
