{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20776v1\", \"title\": \"ECOSoundSet: a finely annotated dataset for the automated acoustic\\n  identification of Orthoptera and Cicadidae in North, Central and temperate\\n  Western Europe\", \"summary\": \"Currently available tools for the automated acoustic recognition of European\\ninsects in natural soundscapes are limited in scope. Large and ecologically\\nheterogeneous acoustic datasets are currently needed for these algorithms to\\ncross-contextually recognize the subtle and complex acoustic signatures\\nproduced by each species, thus making the availability of such datasets a key\\nrequisite for their development. Here we present ECOSoundSet (European\\nCicadidae and Orthoptera Sound dataSet), a dataset containing 10,653 recordings\\nof 200 orthopteran and 24 cicada species (217 and 26 respective taxa when\\nincluding subspecies) present in North, Central, and temperate Western Europe\\n(Andorra, Belgium, Denmark, mainland France and Corsica, Germany, Ireland,\\nLuxembourg, Monaco, Netherlands, United Kingdom, Switzerland), collected partly\\nthrough targeted fieldwork in South France and Catalonia and partly through\\ncontributions from various European entomologists. The dataset is composed of a\\ncombination of coarsely labeled recordings, for which we can only infer the\\npresence, at some point, of their target species (weak labeling), and finely\\nannotated recordings, for which we know the specific time and frequency range\\nof each insect sound present in the recording (strong labeling). We also\\nprovide a train/validation/test split of the strongly labeled recordings, with\\nrespective approximate proportions of 0.8, 0.1 and 0.1, in order to facilitate\\ntheir incorporation in the training and evaluation of deep learning algorithms.\\nThis dataset could serve as a meaningful complement to recordings already\\navailable online for the training of deep learning algorithms for the acoustic\\nclassification of orthopterans and cicadas in North, Central, and temperate\\nWestern Europe.\", \"main_category\": \"cs.SD\", \"categories\": \"cs.SD,cs.AI,eess.AS\", \"published\": \"2025-04-29T13:53:33Z\"}"}
