{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05374v1\", \"title\": \"OcularAge: A Comparative Study of Iris and Periocular Images for\\n  Pediatric Age Estimation\", \"summary\": \"Estimating a child's age from ocular biometric images is challenging due to\\nsubtle physiological changes and the limited availability of longitudinal\\ndatasets. Although most biometric age estimation studies have focused on facial\\nfeatures and adult subjects, pediatric-specific analysis, particularly of the\\niris and periocular regions, remains relatively unexplored. This study presents\\na comparative evaluation of iris and periocular images for estimating the ages\\nof children aged between 4 and 16 years. We utilized a longitudinal dataset\\ncomprising more than 21,000 near-infrared (NIR) images, collected from 288\\npediatric subjects over eight years using two different imaging sensors. A\\nmulti-task deep learning framework was employed to jointly perform age\\nprediction and age-group classification, enabling a systematic exploration of\\nhow different convolutional neural network (CNN) architectures, particularly\\nthose adapted for non-square ocular inputs, capture the complex variability\\ninherent in pediatric eye images. The results show that periocular models\\nconsistently outperform iris-based models, achieving a mean absolute error\\n(MAE) of 1.33 years and an age-group classification accuracy of 83.82%. These\\nresults mark the first demonstration that reliable age estimation is feasible\\nfrom children's ocular images, enabling privacy-preserving age checks in\\nchild-centric applications. This work establishes the first longitudinal\\nbenchmark for pediatric ocular age estimation, providing a foundation for\\ndesigning robust, child-focused biometric systems. The developed models proved\\nresilient across different imaging sensors, confirming their potential for\\nreal-world deployment. They also achieved inference speeds of less than 10\\nmilliseconds per image on resource-constrained VR headsets, demonstrating their\\nsuitability for real-time applications.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.CV\", \"published\": \"2025-05-08T16:09:08Z\"}"}
