{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09912v1\", \"title\": \"Parameter Convergence Detector Based on VAMP Deep Unfolding: A Novel\\n  Radar Constant False Alarm Rate Detection Algorithm\", \"summary\": \"The sub-Nyquist radar framework exploits the sparsity of signals, which\\neffectively alleviates the pressure on system storage and transmission\\nbandwidth. Compressed sensing (CS) algorithms, such as the VAMP algorithm, are\\nused for sparse signal processing in the sub-Nyquist radar framework. By\\ncombining deep unfolding techniques with VAMP, faster convergence and higher\\naccuracy than traditional CS algorithms are achieved. However, deep unfolding\\ndisrupts the parameter constrains in traditional VAMP algorithm, leading to the\\ndistribution of non-sparse noisy estimation in VAMP deep unfolding unknown, and\\nits distribution parameter unable to be obtained directly using method of\\ntraditional VAMP, which prevents the application of VAMP deep unfolding in\\nradar constant false alarm rate (CFAR) detection. To address this problem, we\\nexplore the distribution of the non-sparse noisy estimation and propose a\\nparameter convergence detector (PCD) to achieve CFAR detection based on VAMP\\ndeep unfolding. Compared to the state-of-the-art methods, PCD leverages not\\nonly the sparse solution, but also the non-sparse noisy estimation, which is\\nused to iteratively estimate the distribution parameter and served as the test\\nstatistic in detection process. In this way, the proposed algorithm takes\\nadvantage of both the enhanced sparse recovery accuracy from deep unfolding and\\nthe distribution property of VAMP, thereby achieving superior CFAR detection\\nperformance. Additionally, the PCD requires no information about the power of\\nAWGN in the environment, which is more suitable for practical application. The\\nconvergence performance and effectiveness of the proposed PCD are analyzed\\nbased on the Banach Fixed-Point Theorem. Numerical simulations and practical\\ndata experiments demonstrate that PCD can achieve better false alarm control\\nand target detection performance.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-14T06:18:11Z\"}"}
