{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04908v1\", \"title\": \"Cloud-Fog Automation: The New Paradigm towards Autonomous Industrial\\n  Cyber-Physical Systems\", \"summary\": \"Autonomous Industrial Cyber-Physical Systems (ICPS) represent a future vision\\nwhere industrial systems achieve full autonomy, integrating physical processes\\nseamlessly with communication, computing and control technologies while\\nholistically embedding intelligence. Cloud-Fog Automation is a new digitalized\\nindustrial automation reference architecture that has been recently proposed.\\nThis architecture is a fundamental paradigm shift from the traditional\\nInternational Society of Automation (ISA)-95 model to accelerate the\\nconvergence and synergy of communication, computing, and control towards a\\nfully autonomous ICPS. With the deployment of new wireless technologies to\\nenable almost-deterministic ultra-reliable low-latency communications, a joint\\ndesign of optimal control and computing has become increasingly important in\\nmodern ICPS. It is also imperative that system-wide cyber-physical security are\\ncritically enforced. Despite recent advancements in the field, there are still\\nsignificant research gaps and open technical challenges. Therefore, a\\ndeliberate rethink in co-designing and synergizing communications, computing,\\nand control (which we term \\\"3C co-design\\\") is required. In this paper, we\\nposition Cloud-Fog Automation with 3C co-design as the new paradigm to realize\\nthe vision of autonomous ICPS. We articulate the state-of-the-art and future\\ndirections in the field, and specifically discuss how goal-oriented\\ncommunication, virtualization-empowered computing, and Quality of Service\\n(QoS)-aware control can drive Cloud-Fog Automation towards a fully autonomous\\nICPS, while accounting for system-wide cyber-physical security.\", \"main_category\": \"eess.SY\", \"categories\": \"eess.SY,cs.SY\", \"published\": \"2025-04-07T10:36:26Z\"}"}
