{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10933v1\", \"title\": \"Towards Robust Trajectory Embedding for Similarity Computation: When\\n  Triangle Inequality Violations in Distance Metrics Matter\", \"summary\": \"Trajectory similarity is a cornerstone of trajectory data management and\\nanalysis. Traditional similarity functions often suffer from high computational\\ncomplexity and a reliance on specific distance metrics, prompting a shift\\ntowards deep representation learning in Euclidean space. However, existing\\nEuclidean-based trajectory embeddings often face challenges due to the triangle\\ninequality constraints that do not universally hold for trajectory data. To\\naddress this issue, this paper introduces a novel approach by incorporating\\nnon-Euclidean geometry, specifically hyperbolic space, into trajectory\\nrepresentation learning. We present the first-ever integration of hyperbolic\\nspace to resolve the inherent limitations of the triangle inequality in\\nEuclidean embeddings. In particular, we achieve it by designing a Lorentz\\ndistance measure, which is proven to overcome triangle inequality constraints.\\nAdditionally, we design a model-agnostic framework LH-plugin to seamlessly\\nintegrate hyperbolic embeddings into existing representation learning\\npipelines. This includes a novel projection method optimized with the Cosh\\nfunction to prevent the diminishment of distances, supported by a theoretical\\nfoundation. Furthermore, we propose a dynamic fusion distance that\\nintelligently adapts to variations in triangle inequality constraints across\\ndifferent trajectory pairs, blending Lorentzian and Euclidean distances for\\nmore robust similarity calculations. Comprehensive experimental evaluations\\ndemonstrate that our approach effectively enhances the accuracy of trajectory\\nsimilarity measures in state-of-the-art models across multiple real-world\\ndatasets. The LH-plugin not only addresses the triangle inequality issues but\\nalso significantly refines the precision of trajectory similarity computations,\\nmarking a substantial advancement in the field of trajectory representation\\nlearning.\", \"main_category\": \"cs.DB\", \"categories\": \"cs.DB\", \"published\": \"2025-04-15T07:27:27Z\"}"}
