{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15842v1\", \"title\": \"Radiative equilibrium boundary condition and correlation analysis on\\n  catalytic surfaces in DSMC\", \"summary\": \"This study integrates radiative equilibrium boundary conditions on a\\ncatalytic surface within the Direct Simulation Monte Carlo (DSMC) method. The\\nradiative equilibrium boundary condition is based on the principle of energy\\nconservation at each surface element, enabling the accurate capture of\\nspatially varying surface temperatures and heat fluxes encountered during\\natmospheric re-entry. The surface catalycity is represented through the\\nfinite-rate surface chemistry (FRSC) model, specifically focusing on the\\nheterogeneous recombination of atomic oxygen on silica surfaces. Both the FRSC\\nmodel and the radiative equilibrium boundary conditions within the DSMC\\nframework are validated through comparison to analytical solutions. Numerical\\nsimulations are conducted for rarefied hypersonic flow around a two-dimensional\\ncylinder under representative re-entry conditions for both non-catalytic and\\ncatalytic surfaces. The results demonstrate significant discrepancies in\\ncomputed surface properties between the radiative equilibrium and conventional\\nisothermal boundary conditions. Furthermore, linear interpolation between\\nresults from two independent isothermal boundary conditions is shown to be\\ninadequate for accurately predicting surface heat flux, particularly when\\nsurface reactions are considered. The observed discrepancies originate from a\\nnon-linear correlation between surface temperature and heat flux, influenced by\\nfactors such as surface catalycity and local geometric variations along the\\ncylinder. These findings highlight the necessity of implementing radiative\\nequilibrium boundary conditions within DSMC to ensure physically accurate\\naerothermodynamic computations.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-22T12:38:19Z\"}"}
