{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10175v1\", \"title\": \"Global-in-time Well-posedness of Classical Solutions to the Vacuum Free\\n  Boundary Problem for the Viscous Saint-Venant System with Large Data\", \"summary\": \"We establish the global well-posedness of classical solutions to the vacuum\\nfree boundary problem of the 1-D viscous Saint-Venant system with large data.\\nSince the depth $\\\\rho$ of the fluid vanishes on the moving boundary, the\\nmomentum equations become degenerate both in the time evolution and spatial\\ndissipation, which may lead to singularities for the derivatives of the\\nvelocity u of the fluid and then makes it challenging to study classical\\nsolutions. By exploiting the intrinsic degenerate-singular structures of this\\nsystem, we are able to identify two classes of admissible initial depth profile\\nand obtain the global well-posedness theory here: $\\\\rho_0^\\\\alpha\\\\in H^3$\\n$(\\\\frac{1}{3}<\\\\alpha<1)$ vanishes as the distance to the moving boundary, which\\nsatisfies the BD entropy condition; while $\\\\rho_0\\\\in H^3$ vanishes as the\\ndistance to the moving boundary, which satisfies the physical vacuum boundary\\ncondition, but violates the BD entropy condition. Further, it is shown that for\\narbitrarily large time, the solutions obtained here are smooth (in Sobolev\\nspaces) all the way up to the moving boundary. One of the key ingredients of\\nthe analysis here is to establish some degenerate weighted estimates for the\\neffective velocity $v=u+ (\\\\log\\\\rho)_y$ (y is the Eulerian spatial coordinate)\\nvia its transport properties, which enables one to obtain the upper bounds for\\nthe first order derivatives of the flow map $\\\\eta$. Then the global regularity\\nuniformly up to the vacuum boundary can be obtained by carrying out a series of\\nweighted energy estimates carefully designed for this system. It is worth\\npointing out that the result here seems to be the first global existence theory\\nof classical solutions with large data that is independent of the BD entropy\\nfor such degenerate systems, and the methodology developed here can be applied\\nto more general degenerate CNS.\", \"main_category\": \"math.AP\", \"categories\": \"math.AP\", \"published\": \"2025-04-14T12:26:50Z\"}"}
