{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03445v1\", \"title\": \"Polar Coordinate-Based 2D Pose Prior with Neural Distance Field\", \"summary\": \"Human pose capture is essential for sports analysis, enabling precise\\nevaluation of athletes' movements. While deep learning-based human pose\\nestimation (HPE) models from RGB videos have achieved impressive performance on\\npublic datasets, their effectiveness in real-world sports scenarios is often\\nhindered by motion blur, occlusions, and domain shifts across different pose\\nrepresentations. Fine-tuning these models can partially alleviate such\\nchallenges but typically requires large-scale annotated data and still\\nstruggles to generalize across diverse sports environments. To address these\\nlimitations, we propose a 2D pose prior-guided refinement approach based on\\nNeural Distance Fields (NDF). Unlike existing approaches that rely solely on\\nangular representations of human poses, we introduce a polar coordinate-based\\nrepresentation that explicitly incorporates joint connection lengths, enabling\\na more accurate correction of erroneous pose estimations. Additionally, we\\ndefine a novel non-geodesic distance metric that separates angular and radial\\ndiscrepancies, which we demonstrate is better suited for polar representations\\nthan traditional geodesic distances. To mitigate data scarcity, we develop a\\ngradient-based batch-projection augmentation strategy, which synthesizes\\nrealistic pose samples through iterative refinement. Our method is evaluated on\\na long jump dataset, demonstrating its ability to improve 2D pose estimation\\nacross multiple pose representations, making it robust across different\\ndomains. Experimental results show that our approach enhances pose plausibility\\nwhile requiring only limited training data. Code is available at:\\nhttps://github.com/QGAN2019/polar-NDF.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-06T11:31:14Z\"}"}
