{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24271v1\", \"title\": \"Enhancing Image Resolution of Solar Magnetograms: A Latent Diffusion\\n  Model Approach\", \"summary\": \"The spatial properties of the solar magnetic field are crucial to decoding\\nthe physical processes in the solar interior and their interplanetary effects.\\nHowever, observations from older instruments, such as the Michelson Doppler\\nImager (MDI), have limited spatial or temporal resolution, which hinders the\\nability to study small-scale solar features in detail. Super resolving these\\nolder datasets is essential for uniform analysis across different solar cycles,\\nenabling better characterization of solar flares, active regions, and magnetic\\nnetwork dynamics. In this work, we introduce a novel diffusion model approach\\nfor Super-Resolution and we apply it to MDI magnetograms to match the\\nhigher-resolution capabilities of the Helioseismic and Magnetic Imager (HMI).\\nBy training a Latent Diffusion Model (LDM) with residuals on downscaled HMI\\ndata and fine-tuning it with paired MDI/HMI data, we can enhance the resolution\\nof MDI observations from 2\\\"/pixel to 0.5\\\"/pixel. We evaluate the quality of the\\nreconstructed images by means of classical metrics (e.g., PSNR, SSIM, FID and\\nLPIPS) and we check if physical properties, such as the unsigned magnetic flux\\nor the size of an active region, are preserved. We compare our model with\\ndifferent variations of LDM and Denoising Diffusion Probabilistic models\\n(DDPMs), but also with two deterministic architectures already used in the past\\nfor performing the Super-Resolution task. Furthermore, we show with an analysis\\nin the Fourier domain that the LDM with residuals can resolve features smaller\\nthan 2\\\", and due to the probabilistic nature of the LDM, we can asses their\\nreliability, in contrast with the deterministic models. Future studies aim to\\nsuper-resolve the temporal scale of the solar MDI instrument so that we can\\nalso have a better overview of the dynamics of the old events.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.IM,cs.LG\", \"published\": \"2025-03-31T16:16:26Z\"}"}
