{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16868v1\", \"title\": \"Hint towards inconsistency between BAO and Supernovae Dataset: The\\n  Evidence of Redshift Evolving Dark Energy from DESI DR2 is Absent\", \"summary\": \"The combination of independent cosmological datasets is a route towards\\nprecision and accurate inference of the cosmological parameters if these\\nobservations are not contaminated by systematic effects. However, the presence\\nof unknown systematics present in differrent datasets can lead to a biased\\ninference of the cosmological parameters. In this work, we test the consistency\\nof the two independent tracers of the low-redshift cosmic expansion, namely the\\nsupernovae dataset from Pantheon$+$ and the BAO dataset from DESI DR2 using the\\ndistance duality relation which is a cornerstone relation in cosmology under\\nthe framework of General Relativity. We find that these datasets violate the\\ndistance duality relation and show a signature of redshift evolution, hinting\\ntoward unaccounted physical effects or observational artifacts. Coincidentally\\nthis effect mimics a redshift evolving dark energy scenario when supernovae\\ndataset and DESI datasets are combined without accounting for this\\ninconsistency. Accounting for this effect in the likelihood refutes the\\nprevious claim of evidence of non-cosmological constant as dark energy model\\nfrom DESI DR2, and shows a result consistent with cosmological constant with\\n$w_0= -0.92\\\\pm 0.08$ and $w_a= -0.49^{+0.33}_{-0.36}$. This indicates that the\\ncurrent conclusion from DESI DR2 in combination with Pantheon$+$ is likely due\\nto the combination of two inconsistent datasets resulting in precise but\\ninaccurate inference of cosmological parameters. In the future, tests of this\\nkind for the consistency between different cosmological datasets will be\\nessential for robust inference of cosmological parameters and for deciphering\\nunaccounted physical effects or observational artifacts from supernovae and BAO\\ndatasets.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,gr-qc\", \"published\": \"2025-04-23T16:44:24Z\"}"}
