{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21718v1\", \"title\": \"VividListener: Expressive and Controllable Listener Dynamics Modeling\\n  for Multi-Modal Responsive Interaction\", \"summary\": \"Generating responsive listener head dynamics with nuanced emotions and\\nexpressive reactions is crucial for practical dialogue modeling in various\\nvirtual avatar animations. Previous studies mainly focus on the direct\\nshort-term production of listener behavior. They overlook the fine-grained\\ncontrol over motion variations and emotional intensity, especially in\\nlong-sequence modeling. Moreover, the lack of long-term and large-scale paired\\nspeaker-listener corpora including head dynamics and fine-grained\\nmulti-modality annotations (e.g., text-based expression descriptions, emotional\\nintensity) also limits the application of dialogue modeling.Therefore, we first\\nnewly collect a large-scale multi-turn dataset of 3D dyadic conversation\\ncontaining more than 1.4M valid frames for multi-modal responsive interaction,\\ndubbed ListenerX. Additionally, we propose VividListener, a novel framework\\nenabling fine-grained, expressive and controllable listener dynamics modeling.\\nThis framework leverages multi-modal conditions as guiding principles for\\nfostering coherent interactions between speakers and listeners.Specifically, we\\ndesign the Responsive Interaction Module (RIM) to adaptively represent the\\nmulti-modal interactive embeddings. RIM ensures the listener dynamics achieve\\nfine-grained semantic coordination with textual descriptions and adjustments,\\nwhile preserving expressive reaction with speaker behavior. Meanwhile, we\\ndesign the Emotional Intensity Tags (EIT) for emotion intensity editing with\\nmulti-modal information integration, applying to both text descriptions and\\nlistener motion amplitude.Extensive experiments conducted on our newly\\ncollected ListenerX dataset demonstrate that VividListener achieves\\nstate-of-the-art performance, realizing expressive and controllable listener\\ndynamics.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-30T15:05:12Z\"}"}
