{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12670v1\", \"title\": \"Temporal Attention Pooling for Frequency Dynamic Convolution in Sound\\n  Event Detection\", \"summary\": \"Recent advances in deep learning, particularly frequency dynamic convolution\\n(FDY conv), have significantly improved sound event detection (SED) by enabling\\nfrequency-adaptive feature extraction. However, FDY conv relies on temporal\\naverage pooling, which treats all temporal frames equally, limiting its ability\\nto capture transient sound events such as alarm bells, door knocks, and speech\\nplosives. To address this limitation, we propose temporal attention pooling\\nfrequency dynamic convolution (TFD conv) to replace temporal average pooling\\nwith temporal attention pooling (TAP). TAP adaptively weights temporal features\\nthrough three complementary mechanisms: time attention pooling (TA) for\\nemphasizing salient features, velocity attention pooling (VA) for capturing\\ntransient changes, and conventional average pooling for robustness to\\nstationary signals. Ablation studies show that TFD conv improves average PSDS1\\nby 3.02% over FDY conv with only a 14.8% increase in parameter count. Classwise\\nANOVA and Tukey HSD analysis further demonstrate that TFD conv significantly\\nenhances detection performance for transient-heavy events, outperforming\\nexisting FDY conv models. Notably, TFD conv achieves a maximum PSDS1 score of\\n0.456, surpassing previous state-of-the-art SED systems. We also explore the\\ncompatibility of TAP with other FDY conv variants, including dilated FDY conv\\n(DFD conv), partial FDY conv (PFD conv), and multi-dilated FDY conv (MDFD\\nconv). Among these, the integration of TAP with MDFD conv achieves the best\\nresult with a PSDS1 score of 0.459, validating the complementary strengths of\\ntemporal attention and multi-scale frequency adaptation. These findings\\nestablish TFD conv as a powerful and generalizable framework for enhancing both\\ntransient sensitivity and overall feature robustness in SED.\", \"main_category\": \"eess.AS\", \"categories\": \"eess.AS,cs.SD\", \"published\": \"2025-04-17T06:03:43Z\"}"}
