{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20657v1\", \"title\": \"Image deidentification in the XNAT ecosystem: use cases and solutions\", \"summary\": \"XNAT is a server-based data management platform widely used in academia for\\ncurating large databases of DICOM images for research projects. We describe in\\ndetail a deidentification workflow for DICOM data using facilities in XNAT,\\ntogether with independent tools in the XNAT \\\"ecosystem\\\". We list different\\ncontexts in which deidentification might be needed, based on our prior\\nexperience. The starting point for participation in the Medical Image\\nDe-Identification Benchmark (MIDI-B) challenge was a set of pre-existing local\\nmethodologies, which were adapted during the validation phase of the challenge.\\nOur result in the test phase was 97.91\\\\%, considerably lower than our peers,\\ndue largely to an arcane technical incompatibility of our methodology with the\\nchallenge's Synapse platform, which prevented us receiving feedback during the\\nvalidation phase. Post-submission, additional discrepancy reports from the\\norganisers and via the MIDI-B Continuous Benchmarking facility, enabled us to\\nimprove this score significantly to 99.61\\\\%. An entirely rule-based approach\\nwas shown to be capable of removing all name-related information in the test\\ncorpus, but exhibited failures in dealing fully with address data. Initial\\nexperiments using published machine-learning models to remove addresses were\\npartially successful but showed the models to be \\\"over-aggressive\\\" on other\\ntypes of free-text data, leading to a slight overall degradation in performance\\nto 99.54\\\\%. Future development will therefore focus on improving\\naddress-recognition capabilities, but also on better removal of identifiable\\ndata burned into the image pixels. Several technical aspects relating to the\\n\\\"answer key\\\" are still under discussion with the challenge organisers, but we\\nestimate that our percentage of genuine deidentification failures on the MIDI-B\\ntest corpus currently stands at 0.19\\\\%. (Abridged from original for arXiv\\nsubmission)\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,J.3\", \"published\": \"2025-04-29T11:33:51Z\"}"}
