{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06840v1\", \"title\": \"Interference Mitigation and Spectral Efficiency Enhancement in a\\n  Multi-BD Symbiotic Radio\", \"summary\": \"This study presents a framework designed to mitigate direct-link interference\\n(DLI) and inter-backscatter device interference (IBDI) in multi-backscatter\\northogonal frequency division multiplexing (OFDM)-based symbiotic radio (SR)\\nsystems. The framework employs OFDM signal designs with strategic allocation of\\nnull subcarriers and incorporates two backscatter modulation techniques: on-off\\nfrequency shift keying (OFSK) and multiple frequency shift keying (MFSK) for\\nsymbiotic backscatter communication (SBC). Additionally, we propose\\nFully-Orthogonal and Semi-Orthogonal multiple access schemes to facilitate SBC\\nalongside primary communication. The Fully-Orthogonal scheme maintains\\northogonality between direct link and SBC signals, thereby ensuring\\ninterference-free SBC, albeit at a reduced spectral efficiency. In contrast,\\nthe Semi-Orthogonal schemes eliminate IBDI but permit partial DLI, striking a\\nbalance between reliability and spectral efficiency. To address the partial DLI\\ninherent in Semi-Orthogonal schemes, successive interference cancellation (SIC)\\nis employed at the receiver, enhancing SBC reliability. To tackle channel\\nestimation challenges in SBC within the SR system, we implement non-coherent\\ndetection techniques at the receiver. The performance of the proposed system is\\nevaluated based on average bit error rate (BER) and sum-rate metrics,\\ndemonstrating the effectiveness of our schemes. We provide analytical results\\nfor the system's detection performance under both proposed modulation\\ntechniques and multiple access schemes, which are subsequently validated\\nthrough extensive simulations. These simulations indicate a notable error-rate\\nreduction of up to $10^{-3}$ at $20$ dB with the Fully-Orthogonal scheme with\\nMFSK.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-09T12:57:58Z\"}"}
