{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03326v1\", \"title\": \"Decoding the cosmological baryonic fluctuations using localized fast\\n  radio bursts\", \"summary\": \"Aims: The enigma of the missing baryons poses a prominent and unresolved\\nproblem in astronomy. Dispersion measures (DM) serve as a distinctive\\nobservable of fast radio bursts (FRBs). They quantify the electron column\\ndensity along each line of sight and reveal the missing baryons that are\\ndescribed in the Macquart (DM-z) relation. The scatter of this relation is\\nanticipated to be caused by the variation in the cosmic structure. This is not\\nyet statistically confirmed, however. We present statistical evidence that the\\ncosmological baryons fluctuate. Methods: We measured the foreground galaxy\\nnumber densities around 14 and 13 localized FRBs with the WISE-PS1-STRM and\\nWISE x SCOS photometric redshift galaxy catalog, respectively. The foreground\\ngalaxy number densities were determined through a comparison with measured\\nrandom apertures with a radius of 1 Mpc. Results: We found a positive\\ncorrelation between the excess of DM that is contributed by the medium outside\\ngalaxies (DM_cosmic) and the foreground galaxy number density. The correlation\\nis strong and statistically significant, with median Pearson coefficients of\\n0.6 and 0.6 and median p-values of 0.012 and 0.032 for the galaxy catalogs,\\nrespectively, as calculated with Monte Carlo simulations. Conclusions: Our\\nfindings indicate that the baryonic matter density outside galaxies exceeds its\\ncosmic average along the line of sight to regions with an excess galaxy\\ndensity, but there are fewer baryons along the line of sight to low-density\\nregions. This is statistical evidence that the ionized baryons fluctuate\\ncosmologically on a characteristic scale of $\\\\lesssim$6 Mpc.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,astro-ph.GA,astro-ph.HE\", \"published\": \"2025-05-06T08:54:19Z\"}"}
