{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07834v1\", \"title\": \"Inverse Design of Block Polymer Materials with Desired Nanoscale\\n  Structure and Macroscale Properties\", \"summary\": \"The rational design of novel polymers with tailored material properties has\\nbeen a long-standing challenge in the field due to the large number of possible\\npolymer design variables. To accelerate this design process, there is a\\ncritical need to develop novel tools to aid in the inverse design process and\\nefficiently explore the high-dimensional polymer design space. Optimizing\\nmacroscale material properties for polymeric systems is difficult as properties\\nare dictated by features on a multitude of length scales, ranging from the\\nchosen monomer chemistries to the chain level design to larger-scale domain\\nstructures. In this work, we present an efficient high-throughput in-silico\\nbased framework to effectively design high-performance polymers with desired\\nmulti-scale nanostructure and macroscale properties, which we call RAPSIDY 2.0\\n- Rapid Analysis of Polymer Structure and Inverse Design strategY 2.0. This new\\nversion of RAPSIDY builds upon our previous work, RAPSIDY 1.0, which focused\\npurely on identifying polymer designs that stabilized a desired nanoscale\\nmorphology. In RAPSIDY 2.0 we use a combination of molecular dynamics\\nsimulations and Bayesian optimization driven active learning to optimally query\\nhigh-dimensional polymer design spaces and propose promising design candidates\\nthat simultaneously stabilize a selected nanoscale morphology and exhibit\\ndesired macroscale material properties. We utilize MD simulations with polymer\\nchains preplaced into selected nanoscale morphologies and perform virtual\\nexperiments to determine the stability of the chosen polymer design within the\\ntarget morphology and calculate the desired macroscale material properties\\n(e.g., thermal conductivity). Our methodology directly addresses the unique\\nchallenge associated with copolymers, whose macroscale properties are a\\nfunction of both their chain design and mesoscale morphology, which are\\ncoupled.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-04-10T15:11:35Z\"}"}
