{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07696v1\", \"title\": \"Conformalized Generative Bayesian Imaging: An Uncertainty Quantification\\n  Framework for Computational Imaging\", \"summary\": \"Uncertainty quantification plays an important role in achieving trustworthy\\nand reliable learning-based computational imaging. Recent advances in\\ngenerative modeling and Bayesian neural networks have enabled the development\\nof uncertainty-aware image reconstruction methods. Current generative\\nmodel-based methods seek to quantify the inherent (aleatoric) uncertainty on\\nthe underlying image for given measurements by learning to sample from the\\nposterior distribution of the underlying image. On the other hand, Bayesian\\nneural network-based approaches aim to quantify the model (epistemic)\\nuncertainty on the parameters of a deep neural network-based reconstruction\\nmethod by approximating the posterior distribution of those parameters.\\nUnfortunately, an ongoing need for an inversion method that can jointly\\nquantify complex aleatoric uncertainty and epistemic uncertainty patterns still\\npersists. In this paper, we present a scalable framework that can quantify both\\naleatoric and epistemic uncertainties. The proposed framework accepts an\\nexisting generative model-based posterior sampling method as an input and\\nintroduces an epistemic uncertainty quantification capability through Bayesian\\nneural networks with latent variables and deep ensembling. Furthermore, by\\nleveraging the conformal prediction methodology, the proposed framework can be\\neasily calibrated to ensure rigorous uncertainty quantification. We evaluated\\nthe proposed framework on magnetic resonance imaging, computed tomography, and\\nimage inpainting problems and showed that the epistemic and aleatoric\\nuncertainty estimates produced by the proposed framework display the\\ncharacteristic features of true epistemic and aleatoric uncertainties.\\nFurthermore, our results demonstrated that the use of conformal prediction on\\ntop of the proposed framework enables marginal coverage guarantees consistent\\nwith frequentist principles.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.LG\", \"published\": \"2025-04-10T12:30:46Z\"}"}
