{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03713v1\", \"title\": \"Large Topological Magnetic Optical Effects and Imaging of\\n  Antiferromagnetic Octupole Domains of an Altermagnet-like Weyl Semimetal\", \"summary\": \"Pyrochlore iridates have attracted significant interest due to their complex\\nphase behavior arising from the interplay among electron correlations, quantum\\nmetric in flat bands, geometrically frustrated lattices, and topology induced\\nby strong spin-orbit coupling. In this study, we focus on Eu$_2$Ir$_2$O$_7$\\nthin films oriented along the (111) crystallographic direction. This quantum\\nmaterial, identified as an antiferromagnetic Weyl semimetal, exhibits a large\\nanomalous Hall effect in transport experiments. Here we employ optical circular\\ndichroism microscopy, to directly image ferroic octupole order and resolve\\nall-in--all-out and all-out--all-in antiferromagnetic domains below the N\\\\'eel\\ntemperature. Remarkably, despite the absence of a detectable net magnetic\\nmoment at zero applied magnetic field, we detected a large magnetic circular\\ndichroism signal ($\\\\sim 10^{-4}$) and Kerr effect ($\\\\sim 10^{-4}$ radians) in\\nzero magnetic field attributable to Berry curvature effects from Weyl nodes.\\nEu$_2$Ir$_2$O$_7$ is a non-collinear magnet with vanishing net moment and\\nmagnetic octupole order, similar to the recently proposed collinear d-wave\\naltermagnets, allowing for magneto-optical responses and anomalous Hall effect.\\nThis finding likely represents the first demonstration of magnetic circular\\ndichroism and Kerr effect in a topologically non-trivial quantum\\nantiferromagnet with a vanishing net magnetization. Our work opens up the\\npossibility of ultrafast domain switching in the terahertz frequency and the\\ndomain wall dynamics in the magnetic Weyl systems, which establishes the\\nfoundation for topological antiferromagnetic spintronics.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-05-06T17:36:17Z\"}"}
