{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20416v1\", \"title\": \"Large-scale artificial intelligence with 41 million nanophotonic neurons\\n  on a metasurface\", \"summary\": \"Conventional integrated circuits (ICs) struggle to meet the escalating\\ndemands of artificial intelligence (AI). This has sparked a renewed interest in\\nan unconventional computing paradigm: neuromorphic (brain-inspired) computing.\\nHowever, current neuromorphic systems face significant challenges in delivering\\na large number of parameters (i.e., weights) required for large-scale AI\\nmodels. As a result, most neuromorphic hardware is limited to basic benchmark\\ndemonstrations, hindering its application to real-world AI challenges. Here, we\\npresent a large-scale optical neural network (ONN) for machine learning\\nacceleration, featuring over 41 million photonic neurons. This system not only\\nsurpasses digital electronics in speed and energy efficiency but more\\nimportantly, closes the performance gap with large-scale AI models. Our ONN\\nleverages an innovative optical metasurface device featuring numerous spatial\\nmodes. This device integrates over 41 million meta-atoms on a 10 mm$^2$\\nmetasurface chip, enabling the processing of tens of millions of weights in a\\nsingle operation. For the first time, we demonstrate that an ONN, utilizing a\\nsingle-layer metasurface, can match the performance of deep and large-scale\\ndeep learning models, such as ResNet and Vision Transformer, across various\\nbenchmark tasks. Additionally, we show that our system can deliver\\nhigh-performance solutions to real-world AI challenges through its\\nunprecedented scale, such as accelerating the analysis of multi-gigapixel whole\\nslide images (WSIs) for cancer detection by processing the million-pixel\\nsub-image in a single shot. Our system reduces computing time and energy\\nconsumption by over 1,000 times compared to state-of-the-art graphic processing\\nunits (GPUs). This work presents a large-scale, low-power, and high-performance\\nneuromorphic computing system, paving the way for future disruptive AI\\ntechnologies.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics\", \"published\": \"2025-04-29T04:27:35Z\"}"}
