{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11066v1\", \"title\": \"Improving fingerprint presentation attack detection by an approach\\n  integrated into the personal verification stage\", \"summary\": \"Presentation Attack Detection (PAD) systems are usually designed\\nindependently of the fingerprint verification system. While this can be\\nacceptable for use cases where specific user templates are not predetermined,\\nit represents a missed opportunity to enhance security in scenarios where\\nintegrating PAD with the fingerprint verification system could significantly\\nleverage users' templates, which are the real target of a potential\\npresentation attack. This does not mean that a PAD should be specifically\\ndesigned for such users; that would imply the availability of many enrolled\\nusers' PAI and, consequently, complexity, time, and cost increase. On the\\ncontrary, we propose to equip a basic PAD, designed according to the state of\\nthe art, with an innovative add-on module called the Closeness Binary Code (CC)\\nmodule. The term \\\"closeness\\\" refers to a peculiar property of the bona\\nfide-related features: in an Euclidean feature space, genuine fingerprints tend\\nto cluster in a specific pattern. First, samples from the same finger are close\\nto each other, then samples from other fingers of the same user and finally,\\nsamples from fingers of other users. This property is statistically verified in\\nour previous publication, and further confirmed in this paper. It is\\nindependent of the user population and the feature set class, which can be\\nhandcrafted or deep network-based (embeddings). Therefore, the add-on can be\\ndesigned without the need for the targeted user samples; moreover, it exploits\\nher/his samples' \\\"closeness\\\" property during the verification stage. Extensive\\nexperiments on benchmark datasets and state-of-the-art PAD methods confirm the\\nbenefits of the proposed add-on, which can be easily coupled with the main PAD\\nmodule integrated into the fingerprint verification system.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-15T11:01:06Z\"}"}
