{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12067v1\", \"title\": \"LO2: Microservice API Anomaly Dataset of Logs and Metrics\", \"summary\": \"Context. Microservice-based systems have gained significant attention over\\nthe past years. A critical factor for understanding and analyzing the behavior\\nof these systems is the collection of monitoring data such as logs, metrics,\\nand traces. These data modalities can be used for anomaly detection and root\\ncause analysis of failures. In particular, multi-modal methods utilizing\\nseveral types of this data at once have gained traction in the research\\ncommunity since these three modalities capture different dimensions of system\\nbehavior. Aim. We provide a dataset that supports research on anomaly detection\\nand architectural degradation in microservice systems. We generate a\\ncomprehensive dataset of logs, metrics, and traces from a production\\nmicroservice system to enable the exploration of multi-modal fusion methods\\nthat integrate multiple data modalities. Method. We dynamically tested the\\nvarious APIs of the MS-based system, implementing the OAuth2.0 protocol using\\nthe Locust tool. For each execution of the prepared test suite, we collect logs\\nand performance metrics for correct and erroneous calls with data labeled\\naccording to the error triggered during the call. Contributions. We collected\\napproximately 657,000 individual log files, totaling over two billion log\\nlines. In addition, we collected more than 45 million individual metric files\\nthat contain 485 unique metrics. We provide an initial analysis of logs,\\nidentify key metrics through PCA, and discuss challenges in collecting traces\\nfor this system. Moreover, we highlight the possibilities for making a more\\nfine-grained version of the data set. This work advances anomaly detection in\\nmicroservice systems using multiple data sources.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE,cs.DC,cs.NI\", \"published\": \"2025-04-16T13:21:56Z\"}"}
