{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03715v1\", \"title\": \"DISARM++: Beyond scanner-free harmonization\", \"summary\": \"Harmonization of T1-weighted MR images across different scanners is crucial\\nfor ensuring consistency in neuroimaging studies. This study introduces a novel\\napproach to direct image harmonization, moving beyond feature standardization\\nto ensure that extracted features remain inherently reliable for downstream\\nanalysis. Our method enables image transfer in two ways: (1) mapping images to\\na scanner-free space for uniform appearance across all scanners, and (2)\\ntransforming images into the domain of a specific scanner used in model\\ntraining, embedding its unique characteristics. Our approach presents strong\\ngeneralization capability, even for unseen scanners not included in the\\ntraining phase. We validated our method using MR images from diverse cohorts,\\nincluding healthy controls, traveling subjects, and individuals with\\nAlzheimer's disease (AD). The model's effectiveness is tested in multiple\\napplications, such as brain age prediction (R2 = 0.60 \\\\pm 0.05), biomarker\\nextraction, AD classification (Test Accuracy = 0.86 \\\\pm 0.03), and diagnosis\\nprediction (AUC = 0.95). In all cases, our harmonization technique outperforms\\nstate-of-the-art methods, showing improvements in both reliability and\\npredictive accuracy. Moreover, our approach eliminates the need for extensive\\npreprocessing steps, such as skull-stripping, which can introduce errors by\\nmisclassifying brain and non-brain structures. This makes our method\\nparticularly suitable for applications that require full-head analysis,\\nincluding research on head trauma and cranial deformities. Additionally, our\\nharmonization model does not require retraining for new datasets, allowing\\nsmooth integration into various neuroimaging workflows. By ensuring\\nscanner-invariant image quality, our approach provides a robust and efficient\\nsolution for improving neuroimaging studies across diverse settings. The code\\nis available at this link.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-06T17:36:49Z\"}"}
