{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20598v1\", \"title\": \"Natural Language Processing tools for Pharmaceutical Manufacturing\\n  Information Extraction from Patents Natural Language Processing (NLP) tools\\n  for Pharmaceutical Manufacturing Information Extraction from Patents\", \"summary\": \"Abundant and diverse data on medicines manufacturing and other lifecycle\\ncomponents has been made easily accessible in the last decades. However, a\\nsignificant proportion of this information is characterised by not being\\ntabulated and usable for machine learning purposes. Thus, natural language\\nprocessing tools have been used to build databases in domains such as\\nbiomedical and chemical to address this limitation. This has allowed the\\ndevelopment of artificial intelligence applications, which have improved drug\\ndiscovery and treatments. In the pharmaceutical manufacturing context, some\\ninitiatives and datasets for primary processing can be found, but the\\nmanufacturing of drug products is an area which is still lacking, to the best\\nof our knowledge. This works aims to explore and adapt NLP tools used in other\\ndomains to extract information on both primary and secondary manufacturing,\\nemploying patents as the main source of data. Thus, two independent, but\\ncomplementary, models were developed comprising a method to select fragments of\\ntext that contain manufacturing data, and a named entity recognition system\\nthat enables extracting information on operations, materials, and conditions of\\na process. For the first model, the identification of relevant sections was\\nachieved using an unsupervised approach combining Latent Dirichlet Allocation\\nand k-Means clustering. The performance of this model measured as a Cohen's\\nkappa between model output and manual revision was higher than 90%. NER model\\nconsisted of a deep neural network, and an f1-score micro average of 84.2% was\\nobtained which is comparable to other works. Some considerations for these\\ntools to be used in data extraction are discussed throughout this document.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-04-29T09:56:23Z\"}"}
