{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15171v1\", \"title\": \"Audio-Visual Class-Incremental Learning for Fish Feeding intensity\\n  Assessment in Aquaculture\", \"summary\": \"Fish Feeding Intensity Assessment (FFIA) is crucial in industrial aquaculture\\nmanagement. Recent multi-modal approaches have shown promise in improving FFIA\\nrobustness and efficiency. However, these methods face significant challenges\\nwhen adapting to new fish species or environments due to catastrophic\\nforgetting and the lack of suitable datasets. To address these limitations, we\\nfirst introduce AV-CIL-FFIA, a new dataset comprising 81,932 labelled\\naudio-visual clips capturing feeding intensities across six different fish\\nspecies in real aquaculture environments. Then, we pioneer audio-visual class\\nincremental learning (CIL) for FFIA and demonstrate through benchmarking on\\nAV-CIL-FFIA that it significantly outperforms single-modality methods. Existing\\nCIL methods rely heavily on historical data. Exemplar-based approaches store\\nraw samples, creating storage challenges, while exemplar-free methods avoid\\ndata storage but struggle to distinguish subtle feeding intensity variations\\nacross different fish species. To overcome these limitations, we introduce\\nHAIL-FFIA, a novel audio-visual class-incremental learning framework that\\nbridges this gap with a prototype-based approach that achieves exemplar-free\\nefficiency while preserving essential knowledge through compact feature\\nrepresentations. Specifically, HAIL-FFIA employs hierarchical representation\\nlearning with a dual-path knowledge preservation mechanism that separates\\ngeneral intensity knowledge from fish-specific characteristics. Additionally,\\nit features a dynamic modality balancing system that adaptively adjusts the\\nimportance of audio versus visual information based on feeding behaviour\\nstages. Experimental results show that HAIL-FFIA is superior to SOTA methods on\\nAV-CIL-FFIA, achieving higher accuracy with lower storage needs while\\neffectively mitigating catastrophic forgetting in incremental fish species\\nlearning.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-21T15:24:34Z\"}"}
