{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03246v1\", \"title\": \"Bayesian full waveform inversion with sequential surrogate model\\n  refinement\", \"summary\": \"Bayesian formulations of inverse problems are attractive for their ability to\\nincorporate prior knowledge and update probabilistic models as new data become\\navailable. Markov chain Monte Carlo (MCMC) methods sample posterior probability\\ndensity functions (pdfs) but require accurate prior models and many likelihood\\nevaluations. Dimensionality-reduction methods, such as principal component\\nanalysis (PCA), can help define the prior and train surrogate models that\\nefficiently approximate costly forward solvers. However, for problems like full\\nwaveform inversion, the complex input/output relations often cannot be captured\\nwell by surrogate models trained only on prior samples, leading to biased\\nresults. Including samples from high-posterior-probability regions can improve\\naccuracy, but these regions are hard to identify in advance. We propose an\\niterative method that progressively refines the surrogate model. Starting with\\nlow-frequency data, we train an initial surrogate and perform an MCMC\\ninversion. The resulting posterior samples are then used to retrain the\\nsurrogate, allowing us to expand the frequency bandwidth in the next inversion\\nstep. Repeating this process reduces model errors and improves the surrogate's\\naccuracy over the relevant input domain. Ultimately, we obtain a highly\\naccurate surrogate across the full bandwidth, enabling a final MCMC inversion.\\nNumerical results from 2D synthetic crosshole Ground Penetrating Radar (GPR)\\nexamples show that our method outperforms ray-based approaches and those\\nrelying solely on prior sampling. The overall computational cost is reduced by\\nabout two orders of magnitude compared to full finite-difference time-domain\\nmodeling.\", \"main_category\": \"physics.geo-ph\", \"categories\": \"physics.geo-ph,stat.ML\", \"published\": \"2025-05-06T07:17:03Z\"}"}
