{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17783v1\", \"title\": \"Nanoscale infrared and microwave imaging of stacking faults in\\n  multilayer graphene\", \"summary\": \"Graphite occurs in a range of metastable stacking orders characterized by\\nboth the number and direction of shifts between adjacent layers by the length\\nof a single carbon-carbon bond. At the extremes are Bernal (or ``ABAB...'')\\nstacking, where the direction of the interlayer shift alternates with each\\nlayer, and rhombohedral (or ``ABCABC...'') stacking order where the shifts are\\nalways in the same direction. However, for an N-layer system, there are in\\nprinciple $N-1$ unique metastable stacking orders of this type. Recently, it\\nhas become clear that stacking order has a strong effect on the low energy\\nelectronic band structure with single-layer shifts completely altering the\\nelectronic properties. Most experimental work has focused on the extremal\\nstacking orders in large part due to the difficulty of isolating and\\nidentifying intermediate orders. Motivated by this challenge, here we describe\\ntwo atomic force microscopy (AFM) based techniques to unambiguously distinguish\\nstacking orders and defects in graphite flakes. Photo-thermal infrared atomic\\nforce microscope (AFM-IR) is able to distinguish stacking orders across\\nmultiple IR wavelengths and readily provides absolute contrast via IR spectral\\nanalysis. Scanning microwave impedance microscopy (sMIM) can distinguish the\\nrelative contrast between Bernal, intermediate and rhombohedral domains. We\\nshow that both techniques are well suited to characterizing graphite van der\\nWaals devices, providing high contrast determination of stacking order,\\nsubsurface imaging of graphene flakes buried under a hexagonal boron nitride\\n(hBN) dielectric layer, and identifying nanoscale domain walls. Our results\\npave the way for the reliable fabrication of graphene multilayer devices of\\ndefinite interlayer registry.\", \"main_category\": \"cond-mat.mes-hall\", \"categories\": \"cond-mat.mes-hall,cond-mat.mtrl-sci\", \"published\": \"2025-04-24T17:58:30Z\"}"}
