{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04233v1\", \"title\": \"Dust enrichment and growth in their earliest stages of protoplanetary\\n  disk formation\", \"summary\": \"Aims. Dust enrichment and growth during the initial stages of protoplanetary\\ndisk formation were numerically investigated. A particular objective was to\\ndetermine the effects of various growth barriers, which were mimicked by\\nsetting a series of upper permissible limits on maximum dust sizes. Methods. We\\nused the ngFEOSAD code to simulate the three-dimensional dynamics of gas and\\ndust in the polytropic approximation starting from the gravitational collapse\\nof a slowly rotating Bonnor-Ebert sphere to $\\\\approx 12$ kyr after the first\\nhydrostatic core and disk formation. Results. We found that dust growth starts\\nin the contracting cloud in the evolution stage that precedes disk formation\\nand the disk begins to form in an environment that is already enriched in grown\\ndust. The efficiency of dust growth in the disk is limited by dust growth\\nbarriers. For dust grains with maximum size < 100 $\\\\mu$m these are likely\\nelectrostatic or bouncing barriers, and for larger grains the fragmentation and\\ndrift barriers play the major role. The disk midplane becomes quickly enriched\\nwith dust, while the vertically integrated distribution of dust shows notable\\nlocal variations around the canonical 1:100 dust-to-gas mass ratio. These\\npositive and negative deviations are likely caused by local hydrodynamic flows,\\nsince the globally integrated dust-to-gas ratio deviates negligibly from the\\ninitial 1:100 value. We note that care should be taken when considering models\\nwith a fixed dust size, as it may attain a profound negative radial gradient\\nalready in the very early stages of disk formation. Models with a constant\\nStokes number may be preferable in this context. Conclusions. The early dust\\nenrichment and growth may facilitate planet formation as suggested by\\nobservations of protoplanetary disk substructures.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-05-07T08:37:02Z\"}"}
