{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16071v1\", \"title\": \"A Markov Chain Monte Carlo Method for Efficient Finite-Length LDPC Code\\n  Design\", \"summary\": \"Low-density parity-check (LDPC) codes are among the most prominent\\nerror-correction schemes. They find application to fortify various modern\\nstorage, communication, and computing systems. Protograph-based (PB) LDPC codes\\noffer many degrees of freedom in the code design and enable fast encoding and\\ndecoding. In particular, spatially-coupled (SC) and multi-dimensional (MD)\\ncirculant-based codes are PB-LDPC codes with excellent performance. Efficient\\nfinite-length (FL) algorithms are required in order to effectively exploit the\\navailable degrees of freedom offered by SC partitioning, lifting, and MD\\nrelocations. In this paper, we propose a novel Markov chain Monte Carlo (MCMC\\nor MC$^2$) method to perform this FL optimization, addressing the removal of\\nshort cycles. While iterating, we draw samples from a defined distribution\\nwhere the probability decreases as the number of short cycles from the previous\\niteration increases. We analyze our MC$^2$ method theoretically as we prove the\\ninvariance of the Markov chain where each state represents a possible\\npartitioning or lifting arrangement. Via our simulations, we then fit the\\ndistribution of the number of cycles resulting from a given arrangement on a\\nGaussian distribution. We derive estimates for cycle counts that are close to\\nthe actual counts. Furthermore, we derive the order of the expected number of\\niterations required by our approach to reach a local minimum as well as the\\nsize of the Markov chain recurrent class. Our approach is compatible with code\\ndesign techniques based on gradient-descent. Numerical results show that our\\nMC$^2$ method generates SC codes with remarkably less number of short cycles\\ncompared with the current state-of-the-art. Moreover, to reach the same number\\nof cycles, our method requires orders of magnitude less overall time compared\\nwith the available literature methods.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,eess.SP,math.IT\", \"published\": \"2025-04-22T17:51:40Z\"}"}
