{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04616v1\", \"title\": \"Person Recognition at Altitude and Range: Fusion of Face, Body Shape and\\n  Gait\", \"summary\": \"We address the problem of whole-body person recognition in unconstrained\\nenvironments. This problem arises in surveillance scenarios such as those in\\nthe IARPA Biometric Recognition and Identification at Altitude and Range\\n(BRIAR) program, where biometric data is captured at long standoff distances,\\nelevated viewing angles, and under adverse atmospheric conditions (e.g.,\\nturbulence and high wind velocity). To this end, we propose FarSight, a unified\\nend-to-end system for person recognition that integrates complementary\\nbiometric cues across face, gait, and body shape modalities. FarSight\\nincorporates novel algorithms across four core modules: multi-subject detection\\nand tracking, recognition-aware video restoration, modality-specific biometric\\nfeature encoding, and quality-guided multi-modal fusion. These components are\\ndesigned to work cohesively under degraded image conditions, large pose and\\nscale variations, and cross-domain gaps. Extensive experiments on the BRIAR\\ndataset, one of the most comprehensive benchmarks for long-range, multi-modal\\nbiometric recognition, demonstrate the effectiveness of FarSight. Compared to\\nour preliminary system, this system achieves a 34.1% absolute gain in 1:1\\nverification accuracy (TAR@0.1% FAR), a 17.8% increase in closed-set\\nidentification (Rank-20), and a 34.3% reduction in open-set identification\\nerrors (FNIR@1% FPIR). Furthermore, FarSight was evaluated in the 2025 NIST RTE\\nFace in Video Evaluation (FIVE), which conducts standardized face recognition\\ntesting on the BRIAR dataset. These results establish FarSight as a\\nstate-of-the-art solution for operational biometric recognition in challenging\\nreal-world conditions.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-07T17:58:25Z\"}"}
