{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21823v1\", \"title\": \"A Sequoia stellar candidate with very high 7Li and 9Be\", \"summary\": \"Aims. The metal-poor star BPM 3066 belongs to the retrograde halo and\\npresents unexpectedly strong spectral features of lithium. To gain insight into\\nthe origin of this peculiar abundance, we investigate the chemistry and\\nkinematic properties of this star. Methods. We performed a local thermodynamic\\nequilibrium chemical abundance analysis of UVES/VLT high-resolution spectra of\\nBPM 3066 using ATLAS9 and ATLAS12 model atmospheres and the MyGIsFOS code. We\\nfurther characterised the orbital properties of the star by integrating its\\norbit and analysing its integrals of motion using the galpy code. Results. The\\nstar BPM 3066 shows an exceptional overabundance of both lithium and beryllium.\\nThe abundances are A(Li) = 3.0 and A(Be) = 2.1, which are respectively about\\n0.8 and 2.2 dex higher than the Li and Be abundances expected at [Fe/H] = -1.5,\\nthe metallicity of the star. The observed ratio 7Li/9Be is 7.9, which is close\\nto that expected from a synthesis by spallation processes. Overabundances of\\nSi, Al, and of the neutron capture elements Sr,Y, Zr, and Ba are also measured.\\nKinematically, BPM 3066 has an eccentric, strongly retrograde orbit, confined\\nto a height lower than 1 kpc from the galactic plane, and it is a candidate\\nmember of the Sequoia/Thamnos accreted galaxy. Conclusions. The processes\\nleading to the 7Li and 9Be synthesis could have occurred in the environment of\\na hypernova. This is supported by some abundance anomalies like the high value\\nof Si, [Si/Fe]=1.2 and [Si/O]=1.1. However, the simultaneous high values of N,\\nNa, Al, Sc, Ti, and Cu are at odds with the expectations from a hypernova.\\nAlternatively, the abundances of BPM 3066 could result from the engulfing of\\nrocky planets that were rich in spallated Li and Be. In both cases, it is\\nremarkable that such an extreme abundance pattern has been found in a star\\nbelonging to the Sequoia/Thamnos accreted galaxy.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-30T17:26:59Z\"}"}
