{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16405v1\", \"title\": \"EEmo-Bench: A Benchmark for Multi-modal Large Language Models on Image\\n  Evoked Emotion Assessment\", \"summary\": \"The furnishing of multi-modal large language models (MLLMs) has led to the\\nemergence of numerous benchmark studies, particularly those evaluating their\\nperception and understanding capabilities.\\n  Among these, understanding image-evoked emotions aims to enhance MLLMs'\\nempathy, with significant applications such as human-machine interaction and\\nadvertising recommendations. However, current evaluations of this MLLM\\ncapability remain coarse-grained, and a systematic and comprehensive assessment\\nis still lacking.\\n  To this end, we introduce EEmo-Bench, a novel benchmark dedicated to the\\nanalysis of the evoked emotions in images across diverse content categories.\\n  Our core contributions include:\\n  1) Regarding the diversity of the evoked emotions, we adopt an emotion\\nranking strategy and employ the Valence-Arousal-Dominance (VAD) as emotional\\nattributes for emotional assessment. In line with this methodology, 1,960\\nimages are collected and manually annotated.\\n  2) We design four tasks to evaluate MLLMs' ability to capture the evoked\\nemotions by single images and their associated attributes: Perception, Ranking,\\nDescription, and Assessment. Additionally, image-pairwise analysis is\\nintroduced to investigate the model's proficiency in performing joint and\\ncomparative analysis.\\n  In total, we collect 6,773 question-answer pairs and perform a thorough\\nassessment on 19 commonly-used MLLMs.\\n  The results indicate that while some proprietary and large-scale open-source\\nMLLMs achieve promising overall performance, the analytical capabilities in\\ncertain evaluation dimensions remain suboptimal.\\n  Our EEmo-Bench paves the path for further research aimed at enhancing the\\ncomprehensive perceiving and understanding capabilities of MLLMs concerning\\nimage-evoked emotions, which is crucial for machine-centric emotion perception\\nand understanding.\", \"main_category\": \"cs.MM\", \"categories\": \"cs.MM\", \"published\": \"2025-04-23T04:18:17Z\"}"}
