{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07625v1\", \"title\": \"Deep Learning Meets Teleconnections: Improving S2S Predictions for\\n  European Winter Weather\", \"summary\": \"Predictions on subseasonal-to-seasonal (S2S) timescales--ranging from two\\nweeks to two month--are crucial for early warning systems but remain\\nchallenging owing to chaos in the climate system. Teleconnections, such as the\\nstratospheric polar vortex (SPV) and Madden-Julian Oscillation (MJO), offer\\nwindows of enhanced predictability, however, their complex interactions remain\\nunderutilized in operational forecasting. Here, we developed and evaluated deep\\nlearning architectures to predict North Atlantic-European (NAE) weather\\nregimes, systematically assessing the role of remote drivers in improving S2S\\nforecast skill of deep learning models. We implemented (1) a Long Short-term\\nMemory (LSTM) network predicting the NAE regimes of the next six weeks based on\\nprevious regimes, (2) an Index-LSTM incorporating SPV and MJO indices, and (3)\\na ViT-LSTM using a Vision Transformer to directly encode stratospheric wind and\\ntropical outgoing longwave radiation fields. These models are compared with\\noperational hindcasts as well as other AI models. Our results show that\\nleveraging teleconnection information enhances skill at longer lead times.\\nNotably, the ViT-LSTM outperforms ECMWF's subseasonal hindcasts beyond week 4\\nby improving Scandinavian Blocking (SB) and Atlantic Ridge (AR) predictions.\\nAnalysis of high-confidence predictions reveals that NAO-, SB, and AR\\nopportunity forecasts can be associated with SPV variability and MJO phase\\npatterns aligning with established pathways, also indicating new patterns.\\nOverall, our work demonstrates that encoding physically meaningful climate\\nfields can enhance S2S prediction skill, advancing AI-driven subseasonal\\nforecast. Moreover, the experiments highlight the potential of deep learning\\nmethods as investigative tools, providing new insights into atmospheric\\ndynamics and predictability.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-10T10:23:07Z\"}"}
