{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10474v1\", \"title\": \"Co-optimizing Physical Reconfiguration Parameters and Controllers for an\\n  Origami-inspired Reconfigurable Manipulator\", \"summary\": \"Reconfigurable robots that can change their physical configuration\\npost-fabrication have demonstrate their potential in adapting to different\\nenvironments or tasks. However, it is challenging to determine how to optimally\\nadjust reconfigurable parameters for a given task, especially when the\\ncontroller depends on the robot's configuration. In this paper, we address this\\nproblem using a tendon-driven reconfigurable manipulator composed of multiple\\nserially connected origami-inspired modules as an example. Under tendon\\nactuation, these modules can achieve different shapes and motions, governed by\\njoint stiffnesses (reconfiguration parameters) and the tendon displacements\\n(control inputs). We leverage recent advances in co-optimization of design and\\ncontrol for robotic system to treat reconfiguration parameters as design\\nvariables and optimize them using reinforcement learning techniques. We first\\nestablish a forward model based on the minimum potential energy method to\\npredict the shape of the manipulator under tendon actuations. Using the forward\\nmodel as the environment dynamics, we then co-optimize the control policy (on\\nthe tendon displacements) and joint stiffnesses of the modules for goal\\nreaching tasks while ensuring collision avoidance. Through co-optimization, we\\nobtain optimized joint stiffness and the corresponding optimal control policy\\nto enable the manipulator to accomplish the task that would be infeasible with\\nfixed reconfiguration parameters (i.e., fixed joint stiffness). We envision the\\nco-optimization framework can be extended to other reconfigurable robotic\\nsystems, enabling them to optimally adapt their configuration and behavior for\\ndiverse tasks and environments.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-14T17:56:38Z\"}"}
