{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00643v1\", \"title\": \"Deep Learning Assisted Outer Volume Removal for Highly-Accelerated\\n  Real-Time Dynamic MRI\", \"summary\": \"Real-time (RT) dynamic MRI plays a vital role in capturing rapid\\nphysiological processes, offering unique insights into organ motion and\\nfunction. Among these applications, RT cine MRI is particularly important for\\nfunctional assessment of the heart with high temporal resolution. RT imaging\\nenables free-breathing, ungated imaging of cardiac motion, making it a crucial\\nalternative for patients who cannot tolerate conventional breath-hold,\\nECG-gated acquisitions. However, achieving high acceleration rates in RT cine\\nMRI is challenging due to aliasing artifacts from extra-cardiac tissues,\\nparticularly at high undersampling factors. In this study, we propose a novel\\nouter volume removal (OVR) method to address this challenge by eliminating\\naliasing contributions from non-cardiac regions in a post-processing framework.\\nOur approach estimates the outer volume signal for each timeframe using\\ncomposite temporal images from time-interleaved undersampling patterns, which\\ninherently contain pseudo-periodic ghosting artifacts. A deep learning (DL)\\nmodel is trained to identify and remove these artifacts, producing a clean\\nouter volume estimate that is subsequently subtracted from the corresponding\\nk-space data. The final reconstruction is performed with a physics-driven DL\\n(PD-DL) method trained using an OVR-specific loss function to restore high\\nspatio-temporal resolution images. Experimental results show that the proposed\\nmethod at high accelerations achieves image quality that is visually comparable\\nto clinical baseline images, while outperforming conventional reconstruction\\ntechniques, both qualitatively and quantitatively. The proposed approach\\nprovides a practical and effective solution for artifact reduction in RT cine\\nMRI without requiring acquisition modifications, offering a pathway to higher\\nacceleration rates while preserving diagnostic quality.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.AI,cs.CV,physics.med-ph\", \"published\": \"2025-05-01T16:31:52Z\"}"}
