{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13074v1\", \"title\": \"SkyReels-V2: Infinite-length Film Generative Model\", \"summary\": \"Recent advances in video generation have been driven by diffusion models and\\nautoregressive frameworks, yet critical challenges persist in harmonizing\\nprompt adherence, visual quality, motion dynamics, and duration: compromises in\\nmotion dynamics to enhance temporal visual quality, constrained video duration\\n(5-10 seconds) to prioritize resolution, and inadequate shot-aware generation\\nstemming from general-purpose MLLMs' inability to interpret cinematic grammar,\\nsuch as shot composition, actor expressions, and camera motions. These\\nintertwined limitations hinder realistic long-form synthesis and professional\\nfilm-style generation. To address these limitations, we propose SkyReels-V2, an\\nInfinite-length Film Generative Model, that synergizes Multi-modal Large\\nLanguage Model (MLLM), Multi-stage Pretraining, Reinforcement Learning, and\\nDiffusion Forcing Framework. Firstly, we design a comprehensive structural\\nrepresentation of video that combines the general descriptions by the\\nMulti-modal LLM and the detailed shot language by sub-expert models. Aided with\\nhuman annotation, we then train a unified Video Captioner, named\\nSkyCaptioner-V1, to efficiently label the video data. Secondly, we establish\\nprogressive-resolution pretraining for the fundamental video generation,\\nfollowed by a four-stage post-training enhancement: Initial concept-balanced\\nSupervised Fine-Tuning (SFT) improves baseline quality; Motion-specific\\nReinforcement Learning (RL) training with human-annotated and synthetic\\ndistortion data addresses dynamic artifacts; Our diffusion forcing framework\\nwith non-decreasing noise schedules enables long-video synthesis in an\\nefficient search space; Final high-quality SFT refines visual fidelity. All the\\ncode and models are available at https://github.com/SkyworkAI/SkyReels-V2.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-17T16:37:27Z\"}"}
