{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16036v1\", \"title\": \"Rotational ultrasound and photoacoustic tomography of the human body\", \"summary\": \"Imaging the human body's morphological and angiographic information is\\nessential for diagnosing, monitoring, and treating medical conditions.\\nUltrasonography performs the morphological assessment of the soft tissue based\\non acoustic impedance variations, whereas photoacoustic tomography (PAT) can\\nvisualize blood vessels based on intrinsic hemoglobin absorption.\\nThree-dimensional (3D) panoramic imaging of the vasculature is generally not\\npractical in conventional ultrasonography with limited field-of-view (FOV)\\nprobes, and PAT does not provide sufficient scattering-based soft tissue\\nmorphological contrast. Complementing each other, fast panoramic rotational\\nultrasound tomography (RUST) and PAT are integrated for hybrid rotational\\nultrasound and photoacoustic tomography (RUS-PAT), which obtains 3D ultrasound\\nstructural and PAT angiographic images of the human body quasi-simultaneously.\\nThe RUST functionality is achieved in a cost-effective manner using a\\nsingle-element ultrasonic transducer for ultrasound transmission and rotating\\narc-shaped arrays for 3D panoramic detection. RUST is superior to conventional\\nultrasonography, which either has a limited FOV with a linear array or is\\nhigh-cost with a hemispherical array that requires both transmission and\\nreceiving. By switching the acoustic source to a light source, the system is\\nconveniently converted to PAT mode to acquire angiographic images in the same\\nregion. Using RUS-PAT, we have successfully imaged the human head, breast,\\nhand, and foot with a 10 cm diameter FOV, submillimeter isotropic resolution,\\nand 10 s imaging time for each modality. The 3D RUS-PAT is a powerful tool for\\nhigh-speed, 3D, dual-contrast imaging of the human body with potential for\\nrapid clinical translation.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph,eess.SP,physics.app-ph\", \"published\": \"2025-04-22T17:02:12Z\"}"}
