{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12619v1\", \"title\": \"SAM-Based Building Change Detection with Distribution-Aware Fourier\\n  Adaptation and Edge-Constrained Warping\", \"summary\": \"Building change detection remains challenging for urban development, disaster\\nassessment, and military reconnaissance. While foundation models like Segment\\nAnything Model (SAM) show strong segmentation capabilities, SAM is limited in\\nthe task of building change detection due to domain gap issues. Existing\\nadapter-based fine-tuning approaches face challenges with imbalanced building\\ndistribution, resulting in poor detection of subtle changes and inaccurate edge\\nextraction. Additionally, bi-temporal misalignment in change detection,\\ntypically addressed by optical flow, remains vulnerable to background noises.\\nThis affects the detection of building changes and compromises both detection\\naccuracy and edge recognition. To tackle these challenges, we propose a new\\nSAM-Based Network with Distribution-Aware Fourier Adaptation and\\nEdge-Constrained Warping (FAEWNet) for building change detection. FAEWNet\\nutilizes the SAM encoder to extract rich visual features from remote sensing\\nimages. To guide SAM in focusing on specific ground objects in remote sensing\\nscenes, we propose a Distribution-Aware Fourier Aggregated Adapter to aggregate\\ntask-oriented changed information. This adapter not only effectively addresses\\nthe domain gap issue, but also pays attention to the distribution of changed\\nbuildings. Furthermore, to mitigate noise interference and misalignment in\\nheight offset estimation, we design a novel flow module that refines building\\nedge extraction and enhances the perception of changed buildings. Our\\nstate-of-the-art results on the LEVIR-CD, S2Looking and WHU-CD datasets\\nhighlight the effectiveness of FAEWNet. The code is available at\\nhttps://github.com/SUPERMAN123000/FAEWNet.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-17T03:47:43Z\"}"}
