{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11140v1\", \"title\": \"An Unsupervised Network Architecture Search Method for Solving Partial\\n  Differential Equations\", \"summary\": \"Solving partial differential equations (PDEs) has been indispensable in\\nscientific and engineering applications. Recently, deep learning methods have\\nbeen widely used to solve high-dimensional problems, one of which is the\\nphysics-informed neural network (PINN). Typically, a deep learning method has\\nthree main components: a neural network, a loss function, and an optimizer.\\nWhile the construction of the loss function is rooted in the definition of\\nsolution space, how to choose a optimal neural network is somewhat ad hoc,\\nleaving much room for improvement. In the framework of PINN, we propose an\\nunsupervised network architecture search method for solving PDEs, termed\\nPINN-DARTS, which applies the differentiable architecture search (DARTS) to\\nfind the optimal network architecture structure in a given set of neural\\nnetworks. In this set, the number of layers and the number of neurons in each\\nlayer can change. In the searching phase, both network and architecture\\nparameters are updated simultaneously, so the running time is close to that of\\nPINN with a pre-determined network structure. Unlike available works, our\\napproach is unsupervised and purely based on the PDE residual without any prior\\nusage of solutions. PINN-DARTS outputs the optimal network structure as well as\\nthe associated numerical solution. The performance of PINN-DARTS is verified on\\nseveral benchmark PDEs, including elliptic, parabolic, wave, and Burgers'\\nequations. Compared to traditional architecture search methods, PINN-DARTS\\nachieves significantly higher architectural accuracy. Another interesting\\nobservation is that both the solution complexity and the PDE type have a\\nprominent impact on the optimal network architecture. Our study suggests that\\narchitectures with uneven widths from layer to layer may have superior\\nperformance across different solution complexities and different PDE types.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA\", \"published\": \"2025-04-15T12:42:32Z\"}"}
