{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00609v1\", \"title\": \"Wavefront errors in two-wavelength adaptive optics systems\", \"summary\": \"Two-wavelength adaptive optics (AO) systems sense turbulence-induced\\nwavefront distortions using an artificial beacon or natural guidestar at one\\nwavelength, while correcting and possibly transmitting at another. Although\\nmost existing AO systems employ this methodology, the literature on atmospheric\\nturbulence correction and AO system design generally focuses on performance at\\na single wavelength, neglecting the two-wavelength nature of the problem. In\\nthis paper, we undertake a rigorous study of the relevant wavefront errors\\nnecessary to quantify two-wavelength AO system performance.\\n  Since most AO systems employ separate tilt and higher-order correcting\\nsubsystems, our analysis mirrors this division, and we begin with higher-order\\nwavefront errors. Utilizing Mellin transform techniques, we derive closed-form\\nrelations for the piston-removed and piston- and tilt-removed variances. The\\nformer is a measure of the total, residual wavefront error that a\\ntwo-wavelength AO systems experiences; while the latter, quantifies the\\nresidual wavefront error due to higher-order aberrations.\\n  We then proceed to tilt or tracking errors and derive the two-wavelength\\nZernike- and gradient-tilt variances. Zernike tilt is the actual amount of tilt\\nin the turbulent atmosphere; yet, most AO tracking subsystems measure gradient\\ntilt. Consequently, we also derive the two-wavelength gradient-tilt,\\nZernike-tilt variance -- also known as centroid anisoplanatism -- to quantify\\nthis error.\\n  Lastly, we validate our analysis by performing two-wavelength wave-optics\\nsimulations and comparing the results to theory. We observe excellent agreement\\namong the simulated results and our theoretical predictions.\\n  The analysis and findings presented in this paper will be useful in the\\ncharacterization of existing, and the design of new, two-wavelength AO systems.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics\", \"published\": \"2025-05-01T15:38:21Z\"}"}
