{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17658v1\", \"title\": \"Insights from Analytical Theory of Eccentric Circumbinary Disks\", \"summary\": \"Eccentric cavities in circumbinary disks precess on timescales much longer\\nthan the binary orbital period. These long-lived steady states can be\\nunderstood as trapped modes in an effective potential primarily determined by\\nthe binary quadrupole and the inner-disk pressure support, with associated\\nfrequencies $\\\\omega_Q$ and $\\\\omega_P$. Within this framework, we show that the\\nratio $\\\\omega_P/\\\\omega_Q$ is the main parameter determining the mode spectrum,\\nand obtain a thorough understanding of it by systematically solving this\\nproblem with various degrees of sophistication. We first find analytical\\nsolutions for truncated power-law disks and use this insight in disks with\\nsmooth central cavities. Our main findings are: (i) The number of modes\\nincreases for thinner disks and more-equal-mass binaries. (ii) For 2D disks,\\nthe normalized ground-mode frequency, $\\\\omega_0/(\\\\omega_Q+\\\\omega_P)$, decreases\\nmonotonically with the ratio $\\\\omega_P/\\\\omega_Q$. (iii) For thin disks,\\n$\\\\omega_P\\\\ll\\\\omega_Q$, the ground-mode frequency coincides with the maximum of\\nthe effective potential, which tracks the gravitational quadrupole frequency\\ninside the inner-disk cavity, and is thus rather sensitive to the density\\nprofile of the cavity, where these modes are localized. (iv) For thick disks,\\n$\\\\omega_P\\\\gg\\\\omega_Q$, increasing pressure support anchors the peak of the\\neffective potential at the inner cavity radius as the ground-mode extends\\nfarther out and its frequency decreases. (v) In agreement with numerical\\nsimulations, with $\\\\omega_P/\\\\omega_Q \\\\simeq 0.1$, we find that disk precession\\nis rather insensitive to the density profile and ground-mode frequencies for 3D\\ndisks are about half the value for 2D disks.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.EP\", \"published\": \"2025-04-24T15:28:18Z\"}"}
