{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01773v1\", \"title\": \"Budget-Feasible Contracts\", \"summary\": \"The problem of computing near-optimal contracts in combinatorial settings has\\nrecently attracted significant interest in the computer science community.\\nPrevious work has provided a rich body of structural and algorithmic insights\\ninto this problem. However, most of these results rely on the assumption that\\nthe principal has an unlimited budget for incentivizing agents, an assumption\\nthat is often unrealistic in practice. This motivates the study of the optimal\\ncontract problem under budget constraints. We study multi-agent contracts with\\nbudget constraints under both binary and combinatorial actions. For binary\\nactions, our contribution is threefold. First, we generalize all previously\\nknown approximation guarantees on the principal's revenue to budgeted settings.\\nSecond, through the lens of budget constraints, we uncover insightful\\nconnections between the standard objective of the principal's revenue and other\\nobjectives. We identify a broad class of objectives, which we term BEST\\nobjectives, including reward, social welfare, and revenue, and show that they\\nare all equivalent (up to a constant factor), leading to approximation\\nguarantees for all BEST objectives. Third, we introduce the price of frugality,\\nwhich quantifies the loss due to budget constraints, and establish near-tight\\nbounds on this measure, providing deeper insights into the tradeoffs between\\nbudgets and incentives. For combinatorial actions, we establish a strong\\nnegative result. Specifically, we show that in a budgeted setting with\\nsubmodular rewards, no finite approximation is possible to any BEST objective.\\nThis stands in contrast to the unbudgeted setting with submodular rewards,\\nwhere a polynomial-time constant-factor approximation is known for revenue. On\\nthe positive side, for gross substitutes rewards, we recover our binary-actions\\nresults, obtaining a constant-factor approximation for all BEST objectives.\", \"main_category\": \"cs.GT\", \"categories\": \"cs.GT\", \"published\": \"2025-04-02T14:32:39Z\"}"}
