{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06973v1\", \"title\": \"HIP 15429: a newborn Be star on an eccentric binary orbit\", \"summary\": \"We identified a new post-interaction binary, HIP 15429, consisting of a\\nstripped star and a recently formed, rapidly rotating Be star companion ($v\\n\\\\sin i \\\\approx 270$ km/s) sharing many similarities with recently identified\\nbloated stripped stars. From orbital fitting of multi-epoch radial velocities\\nwe find a 221-day period. We also find an eccentricity of $e=0.52$, which is\\nunexpectedly high as tides are expected to have circularised the orbit\\nefficiently during the presumed recent mass transfer. The formation of a\\ncircumbinary disk during the mass transfer phase or the presence of an unseen\\ntertiary companion might explain the orbit's high eccentricity. We determined\\nphysical parameters for both stars by fitting the spectra of the disentangled\\nbinary components and multi-band photometry. The stripped nature of the donor\\nstar is affirmed by its high luminosity at a low inferred mass ($\\\\lesssim 1\\n\\\\mathrm{M}_\\\\odot$) and imprints of CNO-processed material in the surface\\nabundances. The donor's relatively large radius and cool temperature\\n($T_{\\\\mathrm{eff}} = 13.5 \\\\pm 0.5$ kK) suggest that it has only recently ceased\\nmass transfer. Evolutionary models assuming a 5-6 $\\\\mathrm{M}_\\\\odot$ progenitor\\ncan reproduce these parameters and imply that the binary is currently evolving\\ntowards a stage where the donor becomes a subdwarf orbiting a Be star. The\\nremarkably high eccentricity of HIP 15429 challenges standard tidal evolution\\nmodels, suggesting either inefficient tidal dissipation or external influences,\\nsuch as a tertiary companion or circumbinary disk. This underscores the need to\\nidentify and characterise more post-mass transfer binaries to benchmark and\\nrefine theoretical models of binary evolution.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-09T15:28:36Z\"}"}
