{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09991v1\", \"title\": \"Bipartite Matching is in Catalytic Logspace\", \"summary\": \"Matching is a central problem in theoretical computer science, with a large\\nbody of work spanning the last five decades. However, understanding matching in\\nthe time-space bounded setting remains a longstanding open question, even in\\nthe presence of additional resources such as randomness or non-determinism.\\n  In this work we study space-bounded machines with access to catalytic space,\\nwhich is additional working memory that is full with arbitrary data that must\\nbe preserved at the end of its computation. Despite this heavy restriction,\\nmany recent works have shown the power of catalytic space, its utility in\\ndesigning classical space-bounded algorithms, and surprising connections\\nbetween catalytic computation and derandomization.\\n  Our main result is that bipartite maximum matching ($MATCH$) can be computed\\nin catalytic logspace ($CL$) with a polynomial time bound ($CLP$). Moreover, we\\nshow that $MATCH$ can be reduced to the lossy coding problem for $NC$ circuits\\n($LOSSY[NC]$). This has consequences for matching, catalytic space, and\\nderandomization:\\n  - Matching: this is the first well studied subclass of $P$ which is known to\\ncompute $MATCH$, as well as the first algorithm simultaneously using sublinear\\nfree space and polynomial time with any additional resources.\\n  - Catalytic space: this is the first new problem shown to be in $CL$ since\\nthe model was defined, and one which is extremely central and well-studied.\\n  - Derandomization: we give the first class $\\\\mathcal{C}$ beyond $L$ for which\\nwe exhibit a natural problem in $LOSSY[\\\\mathcal{C}]$ which is not known to be\\nin $\\\\mathcal{C}$, as well as a full derandomization of the isolation lemma in\\n$CL$ in the context of $MATCH$.\\n  Our proof combines a number of strengthened ideas from isolation-based\\nalgorithms for matching alongside the compress-or-random framework in catalytic\\ncomputation.\", \"main_category\": \"cs.CC\", \"categories\": \"cs.CC,cs.DS\", \"published\": \"2025-04-14T08:53:50Z\"}"}
