{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00605v1\", \"title\": \"Surviving the Storm: The Impacts of Open RAN Disaggregation on Latency\\n  and Resilience\", \"summary\": \"The development of Open Radio Access Networks (Open RAN), with their\\ndisaggregated architectures and virtualization of network functions, has\\nbrought considerable flexibility and cost savings to mobile networks. However,\\nthese architectural advancements introduce additional latency during the\\ninitial attachment procedure of User Equipment (UE), increasing the risk of\\nsignaling storms. This paper investigates the latency impact due to\\ndisaggregation of the Base-band Unit (BBU) into the Central Unit (CU) and\\nDistributed Unit (DU). Specifically, we model the delays induced due to\\ndisaggregation on UE attachment, analyzing the performance under varying load\\nconditions, and sensitivity to processing times. We demonstrate that while both\\nmonolithic and Open RAN architectures experience performance degradation under\\nhigh-load conditions, Open RAN's added overheads can increase its\\nsusceptibility to congestion and signaling storms. However, Open RAN's inherent\\nflexibility, enabled by disaggregation and virtualization, allows efficient\\ndeployment of resources, faster service deployment, and adaptive congestion\\ncontrol mechanisms to mitigate these risks and enhance overall system\\nresilience. Thereby, we quantify resilience by introducing a new utility\\nfunction and propose a novel adaptation mechanism to reinforce Open RAN's\\nrobustness against signaling storms. Our results show that the proposed\\nadaptive mechanism significantly enhances resilience, achieving improvements of\\nup to 286% over fixed configurations, with resilience scores approaching 0.96\\nunder optimal conditions. While simulation results show that Open RAN\\ndisaggregation increases attachment latency and susceptibility to signaling\\ncongestion, they also highlight that its architectural flexibility can mitigate\\nthese effects, improving resilience under high-load conditions.\", \"main_category\": \"cs.NI\", \"categories\": \"cs.NI\", \"published\": \"2025-05-01T15:35:31Z\"}"}
