{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10928v1\", \"title\": \"Radiative-transfer models for dusty Type II supernovae\", \"summary\": \"Dust is expected to form on a year timescale in core-collapse supernova (SN)\\nejecta. Its existence is revealed through an infrared brightening, an optical\\ndimming, or a blue-red emission-line profile asymmetry. To investigate how the\\ndust location and amount impact observations, we computed\\nultraviolet-to-optical spectra of interacting and standard, noninteracting Type\\nII SNe using state-of-the-art models -- for simplicity we adopted 0.1micron\\nsilicate grains. These models account for the full ejecta and treat both\\nradioactive decay and shock power that arises from interaction of the ejecta\\nwith circumstellar material. In a Type IIn SN such as 1998S at one year,\\napproximately 3e-4Msun of dust within the dense shell reproduces the broad,\\nasymmetric Halpha profile. It causes an optical dimming of ~2mag (which\\nobscures any emission from the inner, metal-rich ejecta) but, paradoxically, a\\nmore modest dimming of the ultraviolet, which originates from the outer parts\\nof the dense shell. In Type II SNe with late-time interaction, such as\\nSN2017eaw, dust in the low-mass, fast outer ejecta dense shell tends to be\\noptically thin, impacting little the optical spectrum for dust masses of order\\n1e-4Msun. In such SNe II with interaction, dust in the inner metal-rich ejecta\\nhas negligible effect on observed spectra in the ultraviolet and optical. In\\nnoninteracting SNe II, dust within the metal-rich ejecta preferentially\\nquenches the [OI]6300,6364 and [CaII]7291,7323 metal lines, biasing the\\nemission in favor of the H-rich material which generates the Halpha and FeII\\nemission below 5500A. Our model with 5e-4Msun of dust below 2000km/s matches\\nclosely the optical spectrum of SN1987A at 714d. Modeling historical SNe\\nrequires treating both the ejecta material and the dust, as well as multiple\\npower sources, although interaction power will generally dominate.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA,astro-ph.HE\", \"published\": \"2025-04-15T07:14:17Z\"}"}
