{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23723v1\", \"title\": \"Undecidable problems associated with variational quantum algorithms\", \"summary\": \"Variational Quantum Algorithms (VQAs), such as the Variational Quantum\\nEigensolver (VQE) and the Quantum Approximate Optimization Algorithm (QAOA),\\nare widely studied as candidates for near-term quantum advantage. Recent work\\nhas shown that training VQAs is NP-hard in general. In this paper, we present a\\nconditional result suggesting that the training of VQAs is undecidable, even in\\nidealized, noiseless settings. We reduce the decision version of the digitized\\nVQA training problem-where circuit parameters are drawn from a discrete set-to\\nthe question of whether a universal Diophantine equation (UDE) has a root. This\\nreduction relies on encoding the UDE into the structure of a variational\\nquantum circuit via the matrix exponentials. The central step involves\\nestablishing a correspondence between the objective function of the VQA and a\\nknown UDE of 58 variables and degree 4. Our main result is conditional on a\\nnatural conjecture: that a certain system of structured complex polynomial\\nequations-arising from the inner product of a VQA circuit output and a fixed\\nobservable-has at least one solution. We argue this conjecture is plausible\\nbased on dimension-counting arguments (degrees of freedom in the Hamiltonians,\\nstate vector, and observable), and the generic solvability of such systems in\\nalgebraic geometry over the complex numbers. Under this assumption, we suggest\\nthat deciding whether a digitized VQA achieves a given energy threshold is\\nundecidable. This links the limitations of variational quantum algorithms to\\nfoundational questions in mathematics and logic, extending the known landscape\\nof quantum computational hardness to include uncomputability. Additionally, we\\nestablish an unconditional undecidability result for VQA convergence in open\\nquantum systems.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-03-31T04:52:43Z\"}"}
