{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15124v1\", \"title\": \"Bubble-assisted micromixing via thermally excited intrinsic air within\\n  microfluidic systems\", \"summary\": \"The micromixing process in microfluidic devices is of central importance in\\nquite a few applications, with microfluidic studies on carbon capture and\\nenvironmental monitoring being two examples. High surface area to volume ratio\\nin microscale flows outweighs the role of interfacial tension manipulation by\\nmeans of introducing a secondary phase to the main flow in order to augment the\\ntypically diffusion-dominant mass transfer operation. In this paper, we\\nintroduce an easily integrable continuous flow micromixing scheme implemented\\non a simple Y-type microchannel based on thermally excited intrinsic air within\\nmicrochannel. Thanks to the direct contact between the sputtered thin platinum\\nmicroheater and the co-flowing streams, trapped air in the liquid and/or tiny\\ncrevices is employed to generate elongated bubbles with a millisecond lifespan,\\nconsuming less than 0.4 W of power and thereby enabling homogeneous mixing. The\\nperformance of the micromixer is characterized in terms of the mixing index\\n(MI), and it is shown that immediately ahead of the microheater, the MI exceeds\\n95% for side-by-side flowing of water at different overall flowrates, namely 4,\\n10, and 20 uL/min. Interpreting the experimental results, supplemented by\\nscaling arguments, we quantitatively describe the ephemeral role of emerging\\nelongated bubbles in the micromixing process in which the Marangoni as well as\\nWeber numbers are recognized as the characteristic local non-dimensional groups\\nwhile the enhancing role of tiny daughter microbubbles on the micromixing\\ndownstream of the microchannel can be reflected in the Peclet and the Capillary\\nnumbers.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn,cond-mat.soft\", \"published\": \"2025-04-21T14:20:17Z\"}"}
