{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15026v1\", \"title\": \"Gaussian Shading++: Rethinking the Realistic Deployment Challenge of\\n  Performance-Lossless Image Watermark for Diffusion Models\", \"summary\": \"Ethical concerns surrounding copyright protection and inappropriate content\\ngeneration pose challenges for the practical implementation of diffusion\\nmodels. One effective solution involves watermarking the generated images.\\nExisting methods primarily focus on ensuring that watermark embedding does not\\ndegrade the model performance. However, they often overlook critical challenges\\nin real-world deployment scenarios, such as the complexity of watermark key\\nmanagement, user-defined generation parameters, and the difficulty of\\nverification by arbitrary third parties. To address this issue, we propose\\nGaussian Shading++, a diffusion model watermarking method tailored for\\nreal-world deployment. We propose a double-channel design that leverages\\npseudorandom error-correcting codes to encode the random seed required for\\nwatermark pseudorandomization, achieving performance-lossless watermarking\\nunder a fixed watermark key and overcoming key management challenges.\\nAdditionally, we model the distortions introduced during generation and\\ninversion as an additive white Gaussian noise channel and employ a novel soft\\ndecision decoding strategy during extraction, ensuring strong robustness even\\nwhen generation parameters vary. To enable third-party verification, we\\nincorporate public key signatures, which provide a certain level of resistance\\nagainst forgery attacks even when model inversion capabilities are fully\\ndisclosed. Extensive experiments demonstrate that Gaussian Shading++ not only\\nmaintains performance losslessness but also outperforms existing methods in\\nterms of robustness, making it a more practical solution for real-world\\ndeployment.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.CR\", \"published\": \"2025-04-21T11:18:16Z\"}"}
