{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04422v1\", \"title\": \"Pool Formation in Oceanic Games: Shapley Value and Proportional Sharing\", \"summary\": \"We study a game-theoretic model for pool formation in Proof of Stake\\nblockchain protocols. In such systems, stakeholders can form pools as a means\\nof obtaining regular rewards from participation in ledger maintenance, with the\\npower of each pool being dependent on its collective stake. The question we are\\ninterested in is the design of mechanisms that suitably split rewards among\\npool members and achieve favorable properties in the resulting pool\\nconfiguration. With this in mind, we initiate a non-cooperative game-theoretic\\nanalysis of the well known Shapley value scheme from cooperative game theory\\ninto the context of blockchains. In particular, we focus on the oceanic model\\nof games, proposed by Milnor and Shapley (1978), which is suitable for\\npopulations where a small set of large players coexists with a big mass of\\nrather small, negligible players. This provides an appropriate level of\\nabstraction for pool formation processes among the stakeholders. We provide\\ncomparisons between the Shapley mechanism and the more standard proportional\\nscheme, in terms of attained decentralization, via a Price of Stability\\nanalysis and in terms of susceptibility to Sybil attacks, i.e., the strategic\\nsplitting of a players' stake with the intention of participating in multiple\\npools for increased profit. Interestingly, while the widely deployed\\nproportional scheme appears to have certain advantages, the Shapley value\\nscheme, which rewards higher the most pivotal players, emerges as a competitive\\nalternative, by being able to bypass some of the downsides of proportional\\nsharing, while also not being far from optimal guarantees w.r.t.\\ndecentralization. Finally, we complement our study with some variations of\\nproportional sharing, where the profit is split in proportion to a\\nsuperadditive or a subadditive function of the stake, showing that the Shapley\\nvalue scheme still maintains the same advantages.\", \"main_category\": \"cs.GT\", \"categories\": \"cs.GT\", \"published\": \"2025-05-07T13:55:46Z\"}"}
