{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13022v1\", \"title\": \"CompGS++: Compressed Gaussian Splatting for Static and Dynamic Scene\\n  Representation\", \"summary\": \"Gaussian splatting demonstrates proficiency for 3D scene modeling but suffers\\nfrom substantial data volume due to inherent primitive redundancy. To enable\\nfuture photorealistic 3D immersive visual communication applications,\\nsignificant compression is essential for transmission over the existing\\nInternet infrastructure. Hence, we propose Compressed Gaussian Splatting\\n(CompGS++), a novel framework that leverages compact Gaussian primitives to\\nachieve accurate 3D modeling with substantial size reduction for both static\\nand dynamic scenes. Our design is based on the principle of eliminating\\nredundancy both between and within primitives. Specifically, we develop a\\ncomprehensive prediction paradigm to address inter-primitive redundancy through\\nspatial and temporal primitive prediction modules. The spatial primitive\\nprediction module establishes predictive relationships for scene primitives and\\nenables most primitives to be encoded as compact residuals, substantially\\nreducing the spatial redundancy. We further devise a temporal primitive\\nprediction module to handle dynamic scenes, which exploits primitive\\ncorrelations across timestamps to effectively reduce temporal redundancy.\\nMoreover, we devise a rate-constrained optimization module that jointly\\nminimizes reconstruction error and rate consumption. This module effectively\\neliminates parameter redundancy within primitives and enhances the overall\\ncompactness of scene representations. Comprehensive evaluations across multiple\\nbenchmark datasets demonstrate that CompGS++ significantly outperforms existing\\nmethods, achieving superior compression performance while preserving accurate\\nscene modeling. Our implementation will be made publicly available on GitHub to\\nfacilitate further research.\", \"main_category\": \"cs.GR\", \"categories\": \"cs.GR,cs.CV\", \"published\": \"2025-04-17T15:33:01Z\"}"}
