{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13099v1\", \"title\": \"RF-DETR Object Detection vs YOLOv12 : A Study of Transformer-based and\\n  CNN-based Architectures for Single-Class and Multi-Class Greenfruit Detection\\n  in Complex Orchard Environments Under Label Ambiguity\", \"summary\": \"This study conducts a detailed comparison of RF-DETR object detection base\\nmodel and YOLOv12 object detection model configurations for detecting\\ngreenfruits in a complex orchard environment marked by label ambiguity,\\nocclusions, and background blending. A custom dataset was developed featuring\\nboth single-class (greenfruit) and multi-class (occluded and non-occluded\\ngreenfruits) annotations to assess model performance under dynamic real-world\\nconditions. RF-DETR object detection model, utilizing a DINOv2 backbone and\\ndeformable attention, excelled in global context modeling, effectively\\nidentifying partially occluded or ambiguous greenfruits. In contrast, YOLOv12\\nleveraged CNN-based attention for enhanced local feature extraction, optimizing\\nit for computational efficiency and edge deployment. RF-DETR achieved the\\nhighest mean Average Precision (mAP50) of 0.9464 in single-class detection,\\nproving its superior ability to localize greenfruits in cluttered scenes.\\nAlthough YOLOv12N recorded the highest mAP@50:95 of 0.7620, RF-DETR\\nconsistently outperformed in complex spatial scenarios. For multi-class\\ndetection, RF-DETR led with an mAP@50 of 0.8298, showing its capability to\\ndifferentiate between occluded and non-occluded fruits, while YOLOv12L scored\\nhighest in mAP@50:95 with 0.6622, indicating better classification in detailed\\nocclusion contexts. Training dynamics analysis highlighted RF-DETR's swift\\nconvergence, particularly in single-class settings where it plateaued within 10\\nepochs, demonstrating the efficiency of transformer-based architectures in\\nadapting to dynamic visual data. These findings validate RF-DETR's\\neffectiveness for precision agricultural applications, with YOLOv12 suited for\\nfast-response scenarios. >Index Terms: RF-DETR object detection, YOLOv12,\\nYOLOv13, YOLOv14, YOLOv15, YOLOE, YOLO World, YOLO, You Only Look Once,\\nRoboflow, Detection Transformers, CNNs\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-17T17:08:11Z\"}"}
