{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10989v1\", \"title\": \"Global N-body Simulation of Gap Edge Structures Created by Perturbations\\n  from a Small Satellite Embedded in Saturn's Rings II: The Effect of\\n  Satellite's Orbital Eccentricity and Inclination\", \"summary\": \"Pan and Daphnis are embedded in Saturn's rings and opening a gap with\\nsatellite wakes at the gap edges. Furthermore, in the case of Daphnis,\\npronounced vertical wall structures casting shadows on the rings are also\\nobserved in the satellite wakes. In this paper, we perform a global 3D N-body\\nsimulation with non-zero $e_{\\\\rm s}$ or non-zero $i_{\\\\rm s}$ of the satellite\\norbit to investigate how they affect the gap edge structures. We found that the\\neffect of satellite eccentricity is important both in the satellite wakes and\\nthe vertical walls at the gap edges. The non-sinusoidal sawtooth-like satellite\\nwakes and azimuthally more localized vertical walls observed by Cassini are\\nsimultaneously reproduced in the detailed structures and spatial scales. Both\\nof them periodically vary due to the satellite excursions between the apocenter\\nand the pericenter. The ring particles in outer (inner) rings that undergo\\nclosest encounters with the satellite near the apocenter (pericenter) are\\nexcited the most highly. Because the excited eccentricities of the ring\\nparticles are converted to the inclinations through physical collisions, the\\nconversion is the most active for the particles that acquire the highest\\neccentricities, resulting in the azimuthally more localized vertical wall\\nstructures. The predicted height of the tallest vertical walls is $\\\\sim 0.2$\\ntimes the satellite Hill radius in the case of the satellite eccentricity\\ncomparable to Daphnis when adopting Hill scaling, which is twice as much as the\\nheight obtained in the case of the circular satellite orbit and is\\nquantitatively more consistent with the Cassini observation. These results show\\nthat the observed vertical walls are actually formed by the satellite wakes\\nfollowed by their conversion to the vertical motions through inter-particle\\ncollisions, rather than by the out-of-plane perturbation from the satellite in\\nan inclined orbit.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-15T09:01:52Z\"}"}
