{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19598v1\", \"title\": \"Lightweight Adapter Learning for More Generalized Remote Sensing Change\\n  Detection\", \"summary\": \"Deep learning methods have shown promising performances in remote sensing\\nimage change detection (CD). However, existing methods usually train a\\ndataset-specific deep network for each dataset. Due to the significant\\ndifferences in the data distribution and labeling between various datasets, the\\ntrained dataset-specific deep network has poor generalization performances on\\nother datasets. To solve this problem, this paper proposes a change adapter\\nnetwork (CANet) for a more universal and generalized CD. CANet contains\\ndataset-shared and dataset-specific learning modules. The former explores the\\ndiscriminative features of images, and the latter designs a lightweight adapter\\nmodel, to deal with the characteristics of different datasets in data\\ndistribution and labeling. The lightweight adapter can quickly generalize the\\ndeep network for new CD tasks with a small computation cost. Specifically, this\\npaper proposes an interesting change region mask (ICM) in the adapter, which\\ncan adaptively focus on interested change objects and decrease the influence of\\nlabeling differences in various datasets. Moreover, CANet adopts a unique batch\\nnormalization layer for each dataset to deal with data distribution\\ndifferences. Compared with existing deep learning methods, CANet can achieve\\nsatisfactory CD performances on various datasets simultaneously. Experimental\\nresults on several public datasets have verified the effectiveness and\\nadvantages of the proposed CANet on CD. CANet has a stronger generalization\\nability, smaller training costs (merely updating 4.1%-7.7% parameters), and\\nbetter performances under limited training datasets than other deep learning\\nmethods, which also can be flexibly inserted with existing deep models.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-28T09:01:56Z\"}"}
