{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04505v1\", \"title\": \"A disturbance in the force. How force fluctuations hinder dynamical\\n  friction and induce core stalling\", \"summary\": \"Dynamical friction is an important phenomena in stellar dynamics resulting in\\nthe slowing down of a test particle upon many two-body scatters with background\\nparticles. Chandrasekhar's original formulation, developed for idealized\\ninfinite and homogeneous systems, has been found to be sufficiently accurate\\neven in models of finite extent and radially dependent density profiles.\\nHowever, in some cases $N-$body simulations evidenced a breakdown of\\nChandrasekhar's formalism. In particular, in the case of cored stellar systems,\\nthe analytical predictions underestimate the rate of in-fall of the test\\nparticle. Several explanations for such discrepancy have been proposed so far,\\nin spite of this it remains unclear whether the origin is a finite N effect or\\nan effect arising from the resonance of the orbits of the test and field\\nparticles, which is independent on $N$, such as dynamical buoyancy. Here we aim\\nat shedding some light on this issue with tailored numerical experiments. We\\nperform ad hoc simulations of a massive tracer initially placed on a low\\neccentricity orbit in spherical equilibrium models with increasing resolution.\\nWe use an $N-$body code where the self-consistent interaction among the\\nbackground particles can be substituted with the effect of the static smooth\\npotential of the system's continuum limit, so that the higher order\\ncontributions to the dynamical friction arising from the formation of a wake\\ncan be neglected if needed. We find that, contrary to what reported in the\\nprevious literature, a suppression of dynamical friction happens in both cuspy\\nand cored models. When neglecting the interaction among field particles we\\nobserve in both cases a clear $N^{-1/2}$ scaling of the radius at which\\ndynamical friction ceases to be effective. This hints towards a\\ngranularity-induced origin of the so-called core-stalling of the massive tracer\\nin cored models.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,cond-mat.stat-mech,physics.plasm-ph\", \"published\": \"2025-05-07T15:25:59Z\"}"}
