{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00365v1\", \"title\": \"SacFL: Self-Adaptive Federated Continual Learning for\\n  Resource-Constrained End Devices\", \"summary\": \"The proliferation of end devices has led to a distributed computing paradigm,\\nwherein on-device machine learning models continuously process diverse data\\ngenerated by these devices. The dynamic nature of this data, characterized by\\ncontinuous changes or data drift, poses significant challenges for on-device\\nmodels. To address this issue, continual learning (CL) is proposed, enabling\\nmachine learning models to incrementally update their knowledge and mitigate\\ncatastrophic forgetting. However, the traditional centralized approach to CL is\\nunsuitable for end devices due to privacy and data volume concerns. In this\\ncontext, federated continual learning (FCL) emerges as a promising solution,\\npreserving user data locally while enhancing models through collaborative\\nupdates. Aiming at the challenges of limited storage resources for CL, poor\\nautonomy in task shift detection, and difficulty in coping with new adversarial\\ntasks in FCL scenario, we propose a novel FCL framework named SacFL. SacFL\\nemploys an Encoder-Decoder architecture to separate task-robust and\\ntask-sensitive components, significantly reducing storage demands by retaining\\nlightweight task-sensitive components for resource-constrained end devices.\\nMoreover, $\\\\rm{SacFL}$ leverages contrastive learning to introduce an\\nautonomous data shift detection mechanism, enabling it to discern whether a new\\ntask has emerged and whether it is a benign task. This capability ultimately\\nallows the device to autonomously trigger CL or attack defense strategy without\\nadditional information, which is more practical for end devices. Comprehensive\\nexperiments conducted on multiple text and image datasets, such as Cifar100 and\\nTHUCNews, have validated the effectiveness of $\\\\rm{SacFL}$ in both\\nclass-incremental and domain-incremental scenarios. Furthermore, a demo system\\nhas been developed to verify its practicality.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-05-01T07:26:35Z\"}"}
