{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06044v1\", \"title\": \"Polynomial-Time PIT from (Almost) Necessary Assumptions\", \"summary\": \"The celebrated result of Kabanets and Impagliazzo (Computational Complexity,\\n2004) showed that PIT algorithms imply circuit lower bounds, and vice versa.\\nSince then it has been a major challenge to understand the precise connections\\nbetween PIT and lower bounds. In particular, a main goal has been to understand\\nwhich lower bounds suffice to obtain efficient PIT algorithms, and how close\\nare they to lower bounds that are necessary for the conclusion.\\n  We construct polynomial-time PIT algorithms from lower bounds that are, up to\\nrelatively minor remaining gaps, necessary for the existence of such\\nalgorithms. That is, we prove that these lower bounds are, up to the mentioned\\nminor gaps, both sufficient and necessary for polynomial-time PIT, over fields\\nof characteristic zero. Over sufficiently large finite fields, we show a\\nsimilar result wherein the PIT algorithm runs in time $n^{\\\\log^{(c)}(n)}$, i.e.\\na power of $c$-iterated log for an arbitrarily large constant $c>1$.\\n  The key to these improvements is studying PIT versus lower bounds in the\\nuniform setting, in which we focus on proving lower bounds for uniform\\narithmetic circuits and their variants (and on deducing algorithms from such\\nlower bounds). Indeed, by working in this setting we obtain results that are\\nsignificantly tighter than previously known results concerning polynomial-time\\nPIT vs lower bounds, and are in fact also tighter than known\\nhardness-vs-randomness connections in the Boolean setting.\\n  Our results are obtained by combining recent techniques from Boolean hardness\\nvs randomness, and in particular the generator of Chen and Tell (FOCS 2021),\\nwith the algebraic hitting-set generator of Guo, Kumar, Saptharishi, and\\nSolomon (SIAM J. Computing 2022) along with the bootstrapping ideas of Agrawal,\\nGhosh, and Saxena (STOC 2018) and of Kumar, Saptharishi, and Tengse (SODA\\n2019).\", \"main_category\": \"cs.CC\", \"categories\": \"cs.CC\", \"published\": \"2025-04-08T13:44:21Z\"}"}
