{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16518v1\", \"title\": \"Preconditioning Natural and Second Order Gradient Descent in Quantum\\n  Optimization: A Performance Benchmark\", \"summary\": \"The optimization of parametric quantum circuits is technically hindered by\\nthree major obstacles: the non-convex nature of the objective function, noisy\\ngradient evaluations, and the presence of barren plateaus. As a result, the\\nselection of classical optimizer becomes a critical factor in assessing and\\nexploiting quantum-classical applications. One promising approach to tackle\\nthese challenges involves incorporating curvature information into the\\nparameter update. The most prominent methods in this field are quasi-Newton and\\nquantum natural gradient methods, which can facilitate faster convergence\\ncompared to first-order approaches. Second order methods however exhibit a\\nsignificant trade-off between computational cost and accuracy, as well as\\nheightened sensitivity to noise. This study evaluates the performance of three\\nfamilies of optimizers on synthetically generated MaxCut problems on a shallow\\nQAOA algorithm. To address noise sensitivity and iteration cost, we demonstrate\\nthat incorporating secant-penalization in the BFGS update rule (SP-BFGS) yields\\nimproved outcomes for QAOA optimization problems, introducing a novel approach\\nto stabilizing BFGS updates against gradient noise.\", \"main_category\": \"cs.CE\", \"categories\": \"cs.CE,quant-ph\", \"published\": \"2025-04-23T08:44:18Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16535v1\", \"title\": \"Decentralized Quantile Regression for Feature-Distributed Massive\\n  Datasets with Privacy Guarantees\", \"summary\": \"In this paper, we introduce a novel decentralized surrogate gradient-based\\nalgorithm for quantile regression in a feature-distributed setting, where\\nglobal features are dispersed across multiple machines within a decentralized\\nnetwork. The proposed algorithm, \\\\texttt{DSG-cqr}, utilizes a convolution-type\\nsmoothing approach to address the non-smooth nature of the quantile loss\\nfunction. \\\\texttt{DSG-cqr} is fully decentralized, conjugate-free, easy to\\nimplement, and achieves linear convergence up to statistical precision. To\\nensure privacy, we adopt the Gaussian mechanism to provide\\n$(\\\\epsilon,\\\\delta)$-differential privacy. To overcome the exact residual\\ncalculation problem, we estimate residuals using auxiliary variables and\\ndevelop a confidence interval construction method based on Wald statistics.\\nTheoretical properties are established, and the practical utility of the\\nmethods is also demonstrated through extensive simulations and a real-world\\ndata application.\", \"main_category\": \"stat.CO\", \"categories\": \"stat.CO\", \"published\": \"2025-04-23T09:04:21Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16551v1\", \"title\": \"A new approach for the unitary Dyson Brownian motion through the theory\\n  of viscosity solutions\", \"summary\": \"In this paper, we study the unitary Dyson Brownian motion through a partial\\ndifferential equation approach recently introduced for the real Dyson case. The\\nmain difference with the real Dyson case is that the spectrum is now on the\\ncircle and not on the real line, which leads to particular attention to\\ncomparison principles. First we recall why the system of particles which are\\nthe eigenvalues of unitary Dyson Brownian motion is well posed thanks to a\\ncontainment function. Then we proved that the primitive of the limit spectral\\nmeasure of the unitary Dyson Brownian motion is the unique solution to a\\nviscosity equation obtained by primitive the Dyson equation on the circle.\\nFinally, we study some properties of solutions of Dyson's equation on the\\ncircle. We prove a L $\\\\infty$ regularization. We also look at the long time\\nbehaviour in law of a solution through a study of the so-called free entropy of\\nthe system. We conclude by discussing the uniform convergence towards the\\nuniform measure on the circle of a solution of the Dyson equation.\", \"main_category\": \"math.AP\", \"categories\": \"math.AP,math.PR\", \"published\": \"2025-04-23T09:27:42Z\"}"}
