{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21781v1\", \"title\": \"Message Optimality and Message-Time Trade-offs for APSP and Beyond\", \"summary\": \"Round complexity is an extensively studied metric of distributed algorithms.\\nIn contrast, our knowledge of the \\\\emph{message complexity} of distributed\\ncomputing problems and its relationship (if any) with round complexity is still\\nquite limited. To illustrate, for many fundamental distributed graph\\noptimization problems such as (exact) diameter computation, All-Pairs Shortest\\nPaths (APSP), Maximum Matching etc., while (near) round-optimal algorithms are\\nknown, message-optimal algorithms are hitherto unknown. More importantly, the\\nexisting round-optimal algorithms are not message-optimal. This raises two\\nimportant questions: (1) Can we design message-optimal algorithms for these\\nproblems? (2) Can we give message-time tradeoffs for these problems in case the\\nmessage-optimal algorithms are not round-optimal?\\n  In this work, we focus on a fundamental graph optimization problem, \\\\emph{All\\nPairs Shortest Path (APSP)}, whose message complexity is still unresolved. We\\npresent two main results in the CONGEST model: (1) We give a message-optimal\\n(up to logarithmic factors) algorithm that solves weighted APSP, using\\n$\\\\tilde{O}(n^2)$ messages. This algorithm takes $\\\\tilde{O}(n^2)$ rounds. (2)\\nFor any $0 \\\\leq \\\\varepsilon \\\\le 1$, we show how to solve unweighted APSP in\\n$\\\\tilde{O}(n^{2-\\\\varepsilon })$ rounds and $\\\\tilde{O}(n^{2+\\\\varepsilon })$\\nmessages. At one end of this smooth trade-off, we obtain a (nearly)\\nmessage-optimal algorithm using $\\\\tilde{O}(n^2)$ messages (for $\\\\varepsilon =\\n0$), whereas at the other end we get a (nearly) round-optimal algorithm using\\n$\\\\tilde{O}(n)$ rounds (for $\\\\varepsilon = 1$). This is the first such\\nmessage-time trade-off result known.\", \"main_category\": \"cs.DC\", \"categories\": \"cs.DC,cs.DS\", \"published\": \"2025-04-30T16:34:53Z\"}"}
