{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21548v1\", \"title\": \"Leveraging Systems and Control Theory for Social Robotics: A Model-Based\\n  Behavioral Control Approach to Human-Robot Interaction\", \"summary\": \"Social robots (SRs) should autonomously interact with humans, while\\nexhibiting proper social behaviors associated to their role. By contributing to\\nhealth-care, education, and companionship, SRs will enhance life quality.\\nHowever, personalization and sustaining user engagement remain a challenge for\\nSRs, due to their limited understanding of human mental states. Accordingly, we\\nleverage a recently introduced mathematical dynamic model of human perception,\\ncognition, and decision-making for SRs. Identifying the parameters of this\\nmodel and deploying it in behavioral steering system of SRs allows to\\neffectively personalize the responses of SRs to evolving mental states of their\\nusers, enhancing long-term engagement and personalization. Our approach\\nuniquely enables autonomous adaptability of SRs by modeling the dynamics of\\ninvisible mental states, significantly contributing to the transparency and\\nawareness of SRs. We validated our model-based control system in experiments\\nwith 10 participants who interacted with a Nao robot over three chess puzzle\\nsessions, 45 - 90 minutes each. The identified model achieved a mean squared\\nerror (MSE) of 0.067 (i.e., 1.675% of the maximum possible MSE) in tracking\\nbeliefs, goals, and emotions of participants. Compared to a model-free\\ncontroller that did not track mental states of participants, our approach\\nincreased engagement by 16% on average. Post-interaction feedback of\\nparticipants (provided via dedicated questionnaires) further confirmed the\\nperceived engagement and awareness of the model-driven robot. These results\\nhighlight the unique potential of model-based approaches and control theory in\\nadvancing human-SR interactions.\", \"main_category\": \"eess.SY\", \"categories\": \"eess.SY,cs.RO,cs.SY\", \"published\": \"2025-04-30T11:48:26Z\"}"}
