{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11782v1\", \"title\": \"HyperKING: Quantum-Classical Generative Adversarial Networks for\\n  Hyperspectral Image Restoration\", \"summary\": \"Quantum machine intelligence starts showing its impact on satellite remote\\nsensing (SRS). Also, recent literature exhibits that quantum generative\\nintelligences encompass superior potential than their classical counterpart,\\nmotivating us to develop quantum generative adversarial networks (GANs) for\\nSRS. However, existing quantum GANs are restricted by the limited quantum bit\\n(qubit) resources of current quantum computers and process merely a small 2x2\\ngrayscale image, far from being applicable to SRS. Recently, the novel concept\\nof hybrid quantum-classical GAN, a quantum generator with a classical\\ndiscriminator, has upgraded the order to 28x28 (still grayscale), whereas it is\\nstill insufficient for SRS. This motivates us to design a radically new hybrid\\nframework, where both generator and discriminator are hybrid architectures. We\\ndemonstrate this feasibility, leading to a breakthrough of processing 128x128\\nhyperspectral images for SRS. Specifically, we design the quantum part with\\nmathematically provable quantum full expressibility (FE) to address core signal\\nprocessing tasks, wherein the FE property allows the quantum network to realize\\nany valid quantum operator with appropriate training. The classical part,\\ncomposed of convolutional layers, treats the read-in (compressing the optical\\ninformation into limited qubits) and read-out (addressing the quantum collapse\\neffect) procedures. The proposed innovative hybrid quantum GAN, named\\nHyperspectral Knot-like IntelligeNt dIscrimiNator and Generator (HyperKING),\\nwhere knot partly symbolizes the quantum entanglement and partly the compressed\\nquantum domain in the central part of the network architecture. HyperKING\\nsignificantly surpasses the classical approaches in hyperspectral tensor\\ncompletion, mixed noise removal (about 3dB improvement), and blind source\\nseparation results.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV\", \"published\": \"2025-04-16T05:35:06Z\"}"}
