{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04789v1\", \"title\": \"Multimodal Agricultural Agent Architecture (MA3): A New Paradigm for\\n  Intelligent Agricultural Decision-Making\", \"summary\": \"As a strategic pillar industry for human survival and development, modern\\nagriculture faces dual challenges: optimizing production efficiency and\\nachieving sustainable development. Against the backdrop of intensified climate\\nchange leading to frequent extreme weather events, the uncertainty risks in\\nagricultural production systems are increasing exponentially. To address these\\nchallenges, this study proposes an innovative \\\\textbf{M}ultimodal\\n\\\\textbf{A}gricultural \\\\textbf{A}gent \\\\textbf{A}rchitecture (\\\\textbf{MA3}),\\nwhich leverages cross-modal information fusion and task collaboration\\nmechanisms to achieve intelligent agricultural decision-making. This study\\nconstructs a multimodal agricultural agent dataset encompassing five major\\ntasks: classification, detection, Visual Question Answering (VQA), tool\\nselection, and agent evaluation. We propose a unified backbone for sugarcane\\ndisease classification and detection tools, as well as a sugarcane disease\\nexpert model. By integrating an innovative tool selection module, we develop a\\nmultimodal agricultural agent capable of effectively performing tasks in\\nclassification, detection, and VQA. Furthermore, we introduce a\\nmulti-dimensional quantitative evaluation framework and conduct a comprehensive\\nassessment of the entire architecture over our evaluation dataset, thereby\\nverifying the practicality and robustness of MA3 in agricultural scenarios.\\nThis study provides new insights and methodologies for the development of\\nagricultural agents, holding significant theoretical and practical\\nimplications. Our source code and dataset will be made publicly available upon\\nacceptance.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI\", \"published\": \"2025-04-07T07:32:41Z\"}"}
