{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00475v1\", \"title\": \"Quantum mechanics of inverted potential well -- Hermitian Hamiltonian\\n  with imaginary eigenvalues, quantum-classical correspondence\", \"summary\": \"We in this paper study the quantization of a particle in an inverted\\npotential well. The Hamiltonian is Hermitian, while the potential is unbounded\\nbelow. Classically the particle moves away acceleratingly from the center of\\npotential top. The existing eigenstates must be unstable with imaginary\\neigenvalues, which characterize the decay rate of states. We solve the\\nHamiltonian problem of inverted potential well by the algebraic method with\\nimaginary-frequency raising and lowering boson operators similar to the normal\\noscillator case. The boson number operator is non-Hermitian, while the\\ninteger-number eigenvalues are, of course, real. Dual sets of eigenstates,\\ndenoted by \\\"bra\\\" and \\\"ket\\\", are requested corresponding respectively to the\\ncomplex conjugate number-operators. Orthonormal condition exists between the\\n\\\"bra\\\" and \\\"ket\\\" states. We derive a spatially non-localized generating\\nfunction, from which $n$-th eigenfunctions can be generated by the raising\\noperators in coordinate representation. The \\\"bra\\\" and \\\"ket\\\" generating\\nfunctions are mutually normalized with the imaginary integration measure. The\\nprobability density operators defined between the \\\"bra\\\" and \\\"ket\\\" states are\\nnon-Hermitian invariants, which lead to the Schr\\\\H{o}dinger equations\\nrespectively for the \\\"bra\\\" and \\\"ket\\\" states. While probabilities of \\\"bra\\\" and\\n\\\"ket\\\" states themselves are not conserved quantities because of the decay. The\\nimaginary-frequency boson coherent states are defined as eigenstates of\\nlowering operators. The minimum uncertainty relation is proved explicitly in\\nthe coherent states. Finally the probability average of Heisenberg equation in\\nthe coherent states is shown precisely in agreement with the classical equation\\nof motion. The quantum-classical correspondence exists in the imaginary\\neigenvalue system.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-05-01T11:59:33Z\"}"}
