{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05161v1\", \"title\": \"DDPM Score Matching and Distribution Learning\", \"summary\": \"Score estimation is the backbone of score-based generative models (SGMs),\\nespecially denoising diffusion probabilistic models (DDPMs). A key result in\\nthis area shows that with accurate score estimates, SGMs can efficiently\\ngenerate samples from any realistic data distribution (Chen et al., ICLR'23;\\nLee et al., ALT'23). This distribution learning result, where the learned\\ndistribution is implicitly that of the sampler's output, does not explain how\\nscore estimation relates to classical tasks of parameter and density\\nestimation.\\n  This paper introduces a framework that reduces score estimation to these two\\ntasks, with various implications for statistical and computational learning\\ntheory:\\n  Parameter Estimation: Koehler et al. (ICLR'23) demonstrate that a\\nscore-matching variant is statistically inefficient for the parametric\\nestimation of multimodal densities common in practice. In contrast, we show\\nthat under mild conditions, denoising score-matching in DDPMs is asymptotically\\nefficient.\\n  Density Estimation: By linking generation to score estimation, we lift\\nexisting score estimation guarantees to $(\\\\epsilon,\\\\delta)$-PAC density\\nestimation, i.e., a function approximating the target log-density within\\n$\\\\epsilon$ on all but a $\\\\delta$-fraction of the space. We provide (i) minimax\\nrates for density estimation over H\\\\\\\"older classes and (ii) a quasi-polynomial\\nPAC density estimation algorithm for the classical Gaussian location mixture\\nmodel, building on and addressing an open problem from Gatmiry et al.\\n(arXiv'24).\\n  Lower Bounds for Score Estimation: Our framework offers the first principled\\nmethod to prove computational lower bounds for score estimation across general\\ndistributions. As an application, we establish cryptographic lower bounds for\\nscore estimation in general Gaussian mixture models, conceptually recovering\\nSong's (NeurIPS'24) result and advancing his key open problem.\", \"main_category\": \"stat.ML\", \"categories\": \"stat.ML,cs.DS,cs.LG,math.ST,stat.TH\", \"published\": \"2025-04-07T15:07:19Z\"}"}
