{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03348v1\", \"title\": \"Density of States Proportion on Charge Transfer Kinetics in Breathing\\n  Fermionic Systems of Molecules and Materials: A Perspective of Entropy-Ruled\\n  Method\", \"summary\": \"Conceptualization, theory, method developments and implementations are always\\nof great importance and an interesting task to explore a new dimension in\\nscience and technology, which is highly solicited for various functional-driven\\npotential applications (e.g., electronic devices, charge storage devices).\\nNumerous experimental and theoretical studies urge the necessity of a new\\ntheory or method to quantify the exact value of charge transport (CT)\\ncalculations (e.g., mobility and conductivity) through the appropriate process\\nand methods. With this motivation, the entropy-ruled charge dynamics method has\\nbeen recently proposed, which unifies band and hopping transport mechanism via\\nquantum-classical transition analogy. Here, the energy (in terms of chemical\\npotential) scaled entropy has a direct proportion with the density of states\\n(DOS); and hence it is termed as DOS proportion. This proportion principally\\nacts as a key descriptor for charge transport calculations in both molecular\\nand materials systems, which is directly connected with all CT quantities like\\nmobility, conductivity, current density etc. This perspective explains a unique\\nnature of entropy-ruled method for the entire transport range from delocalized\\nband to localization (or hopping) transport. The validity and limitations of\\nEinstein relation and Boltzmann approach are discussed with different limits\\nand physical conditions for disordered molecules and periodic systems. Finally,\\nthe futuristic scope and expected progress is addressed for correlated electron\\ndynamical systems and devices. It is well-noted that the new DOS proportion and\\nrelated entropy-ruled transport formalism are fundamentally more important for\\nnurturing semiconducting science and technology towards a new era.\", \"main_category\": \"cond-mat.mes-hall\", \"categories\": \"cond-mat.mes-hall\", \"published\": \"2025-05-06T09:16:48Z\"}"}
