{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16512v1\", \"title\": \"Criteria of Renormalizability in Effective Field Theories\", \"summary\": \"Any effective field theory relies on power counting rules that allow one to\\nperform a systematic expansion of calculated quantities in terms of some soft\\nscales. However, a naive power counting can be violated due to the presence of\\nvarious hard scales in a given scheme. A typical example of such a scale is an\\nultraviolet regulator. This issue is particularly challenging when the\\ninteraction is nonperturbative. The power counting is expected to be restored\\nin the course of renormalization, that is by redefining bare low-energy\\nconstants in the effective Lagrangian. Whether this procedure eventually leads\\nto a self-consistent framework is not a priory obvious. We discuss various\\ncriteria of renormalizability in application to nuclear chiral effective field\\ntheory and provide several instructive counterexamples.\", \"main_category\": \"hep-ph\", \"categories\": \"hep-ph,nucl-th\", \"published\": \"2025-04-23T08:38:24Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16529v1\", \"title\": \"6G EdgeAI: Performance Evaluation and Analysis\", \"summary\": \"Generative AI (GenAI) services powered by large language models (LLMs)\\nincreasingly deliver real-time interactions, yet existing 5G multi-access edge\\ncomputing (MEC) architectures often treat communication and computing as\\nseparate domains, limiting their ability to meet stringent latency\\nrequirements. To address this challenge, we introduce an Integrated\\nCommunication and Computing (ICC) framework where computing capabilities are\\nenabled to reside directly in radio access network (RAN) nodes and jointly\\nmanage bandwidth and computing resources. Our queueing-theoretic analysis shows\\nthat ICC outperforms 5G MEC, achieving higher service capacity (defined as the\\nmaximum arrival rate that maintains a specified fraction of jobs completed\\nwithin a given delay budget) by 98%. We corroborate these gains through\\nsystem-level simulations that account for transformer-based LLM workloads,\\nrealistic GPU specifications, and a priority-based scheduling scheme. The\\nsimulations show that ICC improves service capacity by 60%, demonstrating its\\npotential to enable efficient, cost-effective real-time GenAI services in 6G.\", \"main_category\": \"cs.DC\", \"categories\": \"cs.DC\", \"published\": \"2025-04-23T08:54:10Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16545v1\", \"title\": \"ToF-Splatting: Dense SLAM using Sparse Time-of-Flight Depth and\\n  Multi-Frame Integration\", \"summary\": \"Time-of-Flight (ToF) sensors provide efficient active depth sensing at\\nrelatively low power budgets; among such designs, only very sparse measurements\\nfrom low-resolution sensors are considered to meet the increasingly limited\\npower constraints of mobile and AR/VR devices. However, such extreme sparsity\\nlevels limit the seamless usage of ToF depth in SLAM. In this work, we propose\\nToF-Splatting, the first 3D Gaussian Splatting-based SLAM pipeline tailored for\\nusing effectively very sparse ToF input data. Our approach improves upon the\\nstate of the art by introducing a multi-frame integration module, which\\nproduces dense depth maps by merging cues from extremely sparse ToF depth,\\nmonocular color, and multi-view geometry. Extensive experiments on both\\nsynthetic and real sparse ToF datasets demonstrate the viability of our\\napproach, as it achieves state-of-the-art tracking and mapping performances on\\nreference datasets.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-23T09:19:43Z\"}"}
