{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04440v1\", \"title\": \"Towards Initialization-Agnostic Clustering with Iterative Adaptive\\n  Resonance Theory\", \"summary\": \"The clustering performance of Fuzzy Adaptive Resonance Theory (Fuzzy ART) is\\nhighly dependent on the preset vigilance parameter, where deviations in its\\nvalue can lead to significant fluctuations in clustering results, severely\\nlimiting its practicality for non-expert users. Existing approaches generally\\nenhance vigilance parameter robustness through adaptive mechanisms such as\\nparticle swarm optimization and fuzzy logic rules. However, they often\\nintroduce additional hyperparameters or complex frameworks that contradict the\\noriginal simplicity of the algorithm. To address this, we propose Iterative\\nRefinement Adaptive Resonance Theory (IR-ART), which integrates three key\\nphases into a unified iterative framework: (1) Cluster Stability Detection: A\\ndynamic stability detection module that identifies unstable clusters by\\nanalyzing the change of sample size (number of samples in the cluster) in\\niteration. (2) Unstable Cluster Deletion: An evolutionary pruning module that\\neliminates low-quality clusters. (3) Vigilance Region Expansion: A vigilance\\nregion expansion mechanism that adaptively adjusts similarity thresholds.\\nIndependent of the specific execution of clustering, these three phases\\nsequentially focus on analyzing the implicit knowledge within the iterative\\nprocess, adjusting weights and vigilance parameters, thereby laying a\\nfoundation for the next iteration. Experimental evaluation on 15 datasets\\ndemonstrates that IR-ART improves tolerance to suboptimal vigilance parameter\\nvalues while preserving the parameter simplicity of Fuzzy ART. Case studies\\nvisually confirm the algorithm's self-optimization capability through iterative\\nrefinement, making it particularly suitable for non-expert users in\\nresource-constrained scenarios.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-05-07T14:12:39Z\"}"}
