{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05164v1\", \"title\": \"Report on Neural-like Criticality in Ag-based Nanoparticle Networks\", \"summary\": \"Emulating the neural-like information processing dynamics of the brain\\nprovides a time and energy efficient approach for solving complex problems.\\nWhile the majority of neuromorphic hardware currently developed rely on large\\narrays of highly organized building units, such as in rigid crossbar\\narchitectures, in biological neuron assemblies make use of dynamic transitions\\nwithin highly parallel, reconfigurable connection schemes. Neuroscience\\nsuggests that efficiency of information processing in the brain rely on dynamic\\ninteractions and signal propagations which are self-tuned and non-rigid.\\nBrain-like dynamic and avalanche criticality have already been found in a\\nvariety of self-organized networks of nanoobjects, such as nanoparticles (NP)\\nor nanowires. Here we report on the dynamics of the electrical spiking signals\\nfrom Ag-based self-organized nanoparticle networks (NPNs) at the example of\\nmonometallic Ag NPNs, bimetallic AgAu alloy NPNs and composite Ag/ZrN NPNs,\\nwhich combine two distinct NP species. We present time series recordings of the\\nresistive switching responses in each network and showcase the determination of\\nswitching events as well as the evaluation of avalanche criticality. In each\\ncase, for Ag NPN, AgAu NPN and Ag/ZrN NPN, the agreement of three independently\\nderived estimates of the characteristic exponent provides evidence for\\navalanche criticality. The study shows that Ag-based NPNs offer a broad range\\nof versatility for integration purposes into physical computing systems without\\ndestroying their critical dynamics, as the composition of these NPNs can be\\nmodified to suit specific requirements for integration.\", \"main_category\": \"cond-mat.dis-nn\", \"categories\": \"cond-mat.dis-nn,cond-mat.mes-hall,cond-mat.mtrl-sci\", \"published\": \"2025-05-08T11:58:22Z\"}"}
