{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11989v1\", \"title\": \"Epstein zeta method for many-body lattice sums\", \"summary\": \"Many-body interactions arise naturally in the perturbative treatment of\\nclassical and quantum many-body systems and play a crucial role in the\\ndescription of condensed matter systems. In the case of three-body\\ninteractions, the Axilrod-Teller-Muto (ATM) potential is highly relevant for\\nthe quantitative prediction of material properties. The computation of the\\nresulting energies in d-dimensional lattice systems is challenging, as a\\nhigh-dimensional lattice sum needs to be evaluated to high precision. This work\\nsolves this long-standing issue. We present an efficiently computable\\nrepresentation of many-body lattice sums in terms of singular integrals over\\nproducts of Epstein zeta functions. For three-body interactions in 3D, this\\napproach reduces the runtime for computing the ATM lattice sum from weeks to\\nminutes. Our approach further extends to a broad class of n-body lattice sums.\\nWe demonstrate that the computational cost of our method only increases\\nlinearly with n, evading the exponential increase in complexity of direct\\nsummation. The evaluation of 51-body interactions on a two-dimensional lattice,\\ncorresponding to a 100-dimensional sum, can be performed within seconds on a\\nlaptop. We discuss techniques for computing the arising singular integrals and\\ncompare the accuracy of our results against computable benchmarks, achieving\\nfull precision for exponents greater than the system dimension. Finally, we\\napply our method to study the stability of a three-dimensional lattice system\\nwith Lennard-Jones two-body interactions under the inclusion of an ATM\\nthree-body term at finite pressure, finding a transition from the\\nface-centered-cubic to the body-centered-cubic lattice structure with\\nincreasing ATM coupling strength. This work establishes the mathematical\\nfoundation for an ongoing investigation into the influence of many-body\\ninteractions on the stability of matter.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cond-mat.mtrl-sci,cond-mat.str-el,cs.NA\", \"published\": \"2025-04-16T11:30:11Z\"}"}
