{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05379v1\", \"title\": \"Unconventional magnetoresistance and spin gapless semiconductor like\\n  behavior across the Martensitic transformation in off-stoichiometric\\n  Co-Fe-Ti-Si Heusler alloy thin films\", \"summary\": \"In this work, the effect of anti-site disorder on magnetic, electrical\\nresistivity, transverse magnetoresistance MR, and anomalous Hall resistivity of\\noff-stoichiometric CFTS Heusler alloy thin films, with a particular focus on\\nmartensitic phase transformation and spin gapless semiconductor SGS-like\\nbehavior, is investigated. These thin films were grown on Si (100) substrate at\\ndifferent substrate temperatures, TS, ranging from 200 C to 550 C using\\nmagnetron sputtering, enabling control over the degree of anti-site atomic\\nordering from disordered A2 to ordered L21. All the films, irrespective of\\ntheir disorder, exhibit a distinct thermal hysteresis and significant drop in\\nresistivity, crossover from asymmetric to symmetric magnetoresistance, and a\\nsharp increase in MR around 300 K, confirming the occurrence of a\\nthermo-elastic martensitic phase transformation. Detailed analysis of\\nresistivity data indicates that for TS200 and TS350 films, a SGS based two\\nchannel model describes the conductivity in the martensite phase, whereas\\nTS450, TS500, and TS550 films, exhibit a usual metallic behavior with a\\nresistivity minimum at low temperatures. All the CFTS films show soft\\nferromagnetic nature and follow the spin-wave equation up to 390 K. The\\nsaturation magnetization and Hall conductivity increase with increasing\\ncrystalline order. The scaling relation between the longitudinal resistivity\\nand the anomalous Hall resistivity in the martensite phase revels that skew\\nscattering is the dominating contribution in disordered films, and a change in\\ncharge carrier type from hole to electron around the martensitic transformation\\ntemperature. The asymmetric MR, persistent up to room temperature, highlights\\nthe potential of these films for spintronic applications such as spin valves.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,cond-mat.other\", \"published\": \"2025-05-08T16:13:15Z\"}"}
