{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17461v1\", \"title\": \"Evaluating Time Series Models for Urban Wastewater Management:\\n  Predictive Performance, Model Complexity and Resilience\", \"summary\": \"Climate change increases the frequency of extreme rainfall, placing a\\nsignificant strain on urban infrastructures, especially Combined Sewer Systems\\n(CSS). Overflows from overburdened CSS release untreated wastewater into\\nsurface waters, posing environmental and public health risks. Although\\ntraditional physics-based models are effective, they are costly to maintain and\\ndifficult to adapt to evolving system dynamics. Machine Learning (ML)\\napproaches offer cost-efficient alternatives with greater adaptability. To\\nsystematically assess the potential of ML for modeling urban infrastructure\\nsystems, we propose a protocol for evaluating Neural Network architectures for\\nCSS time series forecasting with respect to predictive performance, model\\ncomplexity, and robustness to perturbations. In addition, we assess model\\nperformance on peak events and critical fluctuations, as these are the key\\nregimes for urban wastewater management. To investigate the feasibility of\\nlightweight models suitable for IoT deployment, we compare global models, which\\nhave access to all information, with local models, which rely solely on nearby\\nsensor readings. Additionally, to explore the security risks posed by network\\noutages or adversarial attacks on urban infrastructure, we introduce error\\nmodels that assess the resilience of models. Our results demonstrate that while\\nglobal models achieve higher predictive performance, local models provide\\nsufficient resilience in decentralized scenarios, ensuring robust modeling of\\nurban infrastructure. Furthermore, models with longer native forecast horizons\\nexhibit greater robustness to data perturbations. These findings contribute to\\nthe development of interpretable and reliable ML solutions for sustainable\\nurban wastewater management. The implementation is available in our GitHub\\nrepository.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-24T11:52:13Z\"}"}
