{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06018v1\", \"title\": \"The hybrid dilemma -- do hybrid technologies play a transitionary or\\n  stationary role in transitions processes?\", \"summary\": \"This research unravels the stationary or transitionary dilemma of hybrid\\ntechnologies in transitions processes. A system dynamics technology interaction\\nframework is built and simulated based on Technological Innovation System and\\nLotka-Volterra to investigate the inter-technology relationship impacts and\\nmodes that hybrid technologies establish with incumbent and emerging\\ntechnologies. This is conducted for the case of conventional, hybrid and\\nbattery electric vehicles under various scenarios . Results reveal that, by\\nacting as an exploration-hybrid solution, hybrid technologies maintain a\\ntransitionary role by supporting mainly the technological development side of\\nemerging technology. On the contrary, by acting as an exploitation-hybrid\\nsolution, they hardly (or never) sustain an inhibitive role against both the\\ntechnological and market development sides of incumbent technology. While\\nhybrid technologies may play a stationary role on the market development side\\nin transitions processes, simulation results show that maintaining all\\ninter-technology relationship modes as business-as-usual (i.e., baseline\\nscenario) but instead simultaneously strengthening the various socio-technical\\ndimensions of emerging technology and destabilising the various socio-technical\\ndimensions of incumbent technology (i.e., sociotechnical scenario) is a more\\npromising pathway in both short term (e.g., an accelerated uptake of emerging\\ntechnology and decline of incumbent technology) and long term (e.g., highest\\nemission reduction). Findings, additionally, reinforce the existence of both\\nspillover and try-harder versions of 'sailing-ship effect', which are either\\nseriously doubted in the literature or partially validated using raw\\nbibliometric and patents data.\", \"main_category\": \"econ.GN\", \"categories\": \"econ.GN,q-fin.EC\", \"published\": \"2025-04-08T13:25:52Z\"}"}
