{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04960v1\", \"title\": \"Learning Item Representations Directly from Multimodal Features for\\n  Effective Recommendation\", \"summary\": \"Conventional multimodal recommender systems predominantly leverage Bayesian\\nPersonalized Ranking (BPR) optimization to learn item representations by\\namalgamating item identity (ID) embeddings with multimodal features.\\nNevertheless, our empirical and theoretical findings unequivocally demonstrate\\na pronounced optimization gradient bias in favor of acquiring representations\\nfrom multimodal features over item ID embeddings. As a consequence, item ID\\nembeddings frequently exhibit suboptimal characteristics despite the\\nconvergence of multimodal feature parameters. Given the rich informational\\ncontent inherent in multimodal features, in this paper, we propose a novel\\nmodel (i.e., LIRDRec) that learns item representations directly from these\\nfeatures to augment recommendation performance. Recognizing that features\\nderived from each modality may capture disparate yet correlated aspects of\\nitems, we propose a multimodal transformation mechanism, integrated with\\nmodality-specific encoders, to effectively fuse features from all modalities.\\nMoreover, to differentiate the influence of diverse modality types, we devise a\\nprogressive weight copying fusion module within LIRDRec. This module\\nincrementally learns the weight assigned to each modality in synthesizing the\\nfinal user or item representations. Finally, we utilize the powerful visual\\nunderstanding of Multimodal Large Language Models (MLLMs) to convert the item\\nimages into texts and extract semantics embeddings upon the texts via LLMs.\\nEmpirical evaluations conducted on five real-world datasets validate the\\nsuperiority of our approach relative to competing baselines. It is worth noting\\nthe proposed model, equipped with embeddings extracted from MLLMs and LLMs, can\\nfurther improve the recommendation accuracy of NDCG@20 by an average of 4.21%\\ncompared to the original embeddings.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR,cs.MM\", \"published\": \"2025-05-08T05:42:22Z\"}"}
