{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16514v1\", \"title\": \"A new proof of the Artin-Springer theorem in Schur index 2\", \"summary\": \"We provide a new proof of the analogue of the Artin-Springer theorem for\\ngroups of type $\\\\mathsf{D}$ that can be represented by similitudes over an\\nalgebra of Schur index $2$: an anisotropic generalized quadratic form over a\\nquaternion algebra $Q$ remains anisotropic after generic splitting of $Q$,\\nhence also under odd degree field extensions of the base field. Our proof is\\ncharacteristic free and does not use the excellence property.\", \"main_category\": \"math.KT\", \"categories\": \"math.KT\", \"published\": \"2025-04-23T08:40:13Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16531v1\", \"title\": \"Pure Error REML for Analyzing Data from Multi-Stratum Designs\", \"summary\": \"Since the dawn of response surface methodology, it has been recommended that\\ndesigns include replicate points, so that pure error estimates of variance can\\nbe obtained and used to provide unbiased estimated standard errors of the\\neffects of factors. In designs with more than one stratum, such as split-plot\\nand split-split-plot designs, it is less obvious how pure error estimates of\\nthe variance components should be obtained, and no pure error estimates are\\ngiven by the popular residual maximum likelihood (REML) method of estimation.\\nWe propose a method of pure error REML estimation of the variance components,\\nusing the full treatment model, obtained by treating each combination of factor\\nlevels as a discrete treatment. Our method is easy to implement using standard\\nsoftware and improved estimated standard errors of the fixed effects estimates\\ncan be obtained by applying the Kenward-Roger correction based on the pure\\nerror REML estimates. We illustrate the new method using several data sets and\\ncompare the performance of pure error REML with the standard REML method. The\\nresults are comparable when the assumed response surface model is correct, but\\nthe new method is considerably more robust in the case of model\\nmisspecification.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME\", \"published\": \"2025-04-23T08:55:42Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16547v1\", \"title\": \"Generation of Phonons with Angular Momentum During Ultrafast\\n  Demagnetization\", \"summary\": \"A major question in the field of femtosecond laser-induced demagnetization is\\nwhereto the angular momentum lost by the electrons is transferred. Recent\\nultrafast electron diffraction measurements [Tauchert \\\\textit{et al.}, Nature\\n{\\\\bf 602}, 73 (2022)] suggest that this angular momentum is transferred to the\\nrotational motion of atoms on a sub-picosecond timescale, but a theory\\nconfirmation of this proposition has yet to be given. Here we investigate the\\ncoupled electron-nuclear dynamics during ultrafast demagnetization of L1$_0$\\nFePt, using Ehrenfest nuclear dynamics simulations combined with the\\ntime-dependent density functional theory (TDDFT) framework. We demonstrate that\\natomic rotations appear, i.e., the generation of phonons carrying finite\\nangular momentum following ultrafast demagnetization. We further show that both\\nultrafast demagnetization and the generation of phonons with angular momentum\\narise from symmetry constraints imposed by the spin-orbit coupling, thus\\nproviding insight in spin-phonon interaction at ultrafast timescales.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,physics.atom-ph\", \"published\": \"2025-04-23T09:23:31Z\"}"}
