{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10338v1\", \"title\": \"Classifying Copy Number Variations Using State Space Modeling of\\n  Targeted Sequencing Data: A Case Study in Thalassemia\", \"summary\": \"Thalassemia, a blood disorder and one of the most prevalent hereditary\\ngenetic disorders worldwide, is often caused by copy number variations (CNVs)\\nin the hemoglobin genes. This disorder has incredible diversity, with a large\\nnumber of distinct profiles corresponding to alterations of different regions\\nin the genes. Correctly classifying an individual's profile is critical as it\\nimpacts treatment, prognosis, and genetic counseling. However, genetic\\nclassification is challenging due to the large number of profiles worldwide,\\nand often requires a large number of sequential tests. Targeted next generation\\nsequencing (NGS), which characterizes segments of an individual's genome, has\\nthe potential to dramatically reduce the cost of testing and increase accuracy.\\nIn this work, we introduce a probabilistic state space model for profiling\\nthalassemia from targeted NGS data, which naturally characterize the spatial\\nordering of the genes along the chromosome. We then use decision theory to\\nchoose the best profile among the different options. Due to our use of Bayesian\\nmethodology, we are also able to detect low-quality samples to be excluded from\\nconsideration, an important component of clinical screening. We evaluate our\\nmodel on a dataset of 57 individuals, including both controls and cases with a\\nvariety of thalassemia profiles. Our model has a sensitivity of 0.99 and\\nspecificity of 0.93 for thalassemia detection, and accuracy of 91.5\\\\% for\\ncharacterizing subtypes. Furthermore, the specificity and accuracy rise to\\n$0.96$ and 93.9\\\\% when low-quality samples are excluded using our automated\\nquality control method. This approach outperforms alternative methods,\\nparticularly in specificity, and is broadly applicable to other disorders.\", \"main_category\": \"q-bio.GN\", \"categories\": \"q-bio.GN\", \"published\": \"2025-04-14T15:47:41Z\"}"}
