{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04576v1\", \"title\": \"Scintillometry of Fast Radio Bursts: Resolution effects in two-screen\\n  models\", \"summary\": \"Fast Radio Bursts (FRBs) exhibit scintillation and scattering, often\\nattributed to interactions with plasma screens in the Milky Way and the host\\ngalaxy. When these two screens appear \\\"point-like\\\" to each other, two scales of\\nscintillation can be observed with sufficient frequency resolution. A screen\\nperceives a second screen as extended or resolved when the angular size of the\\nlatter is smaller than the angular resolution of the former. We define the\\nratio of these two as the Resolution Power (RP). Previous observational studies\\nhave argued that, in the resolving regime, scintillations disappear, assuming\\nthat a screen resolving another screen is equivalent to a screen resolving an\\nincoherent emission region. In this theoretical and simulation-based study of\\nresolving effects in two-screen scenarios, we argue that resolving quenches\\nonly the relatively broad-scale scintillation and that this quenching is a\\ngradual process. We present qualitative and quantitative predictions for\\ndynamic spectra, spectral autocorrelation functions (ACF), and modulation\\nindices in resolved and unresolved regimes of two-screen systems. We show that\\nthe spectral ACF of a two-screen system has a product term in addition to the\\nsum of individual screen contributions, causing the total modulation index to\\nrise to \\\\sqrt(3) in the unresolved regime. To aid in discovering resolving\\nsystems, we also present observable trends in multi-frequency observations of a\\nscreen resolving another screen or incoherent emission. Additionally we\\nintroduce a new formula to estimate the distance between the FRB and the screen\\nin its host galaxy. We also show that this formula, like previous ones in the\\nliterature, is only applicable to screens that are two-dimensional in the plane\\nof the sky.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.HE\", \"published\": \"2025-05-07T17:13:00Z\"}"}
