{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19806v1\", \"title\": \"Reinforcement Learning-Based Heterogeneous Multi-Task Optimization in\\n  Semantic Broadcast Communications\", \"summary\": \"Semantic broadcast communications (Semantic BC) for image transmission have\\nachieved significant performance gains for single-task scenarios. Nevertheless,\\nextending these methods to multi-task scenarios remains challenging, as\\ndifferent tasks typically require distinct objective functions, leading to\\npotential conflicts within the shared encoder. In this paper, we propose a\\ntri-level reinforcement learning (RL)-based multi-task Semantic BC framework,\\ntermed SemanticBC-TriRL, which effectively resolves such conflicts and enables\\nthe simultaneous support of multiple downstream tasks at the receiver side,\\nincluding image classification and content reconstruction tasks. Specifically,\\nthe proposed framework employs a bottom-up tri-level alternating learning\\nstrategy, formulated as a constrained multi-objective optimization problem. At\\nthe first level, task-specific decoders are locally optimized using supervised\\nlearning. At the second level, the shared encoder is updated via proximal\\npolicy optimization (PPO), guided by task-oriented rewards. At the third level,\\na multi-gradient aggregation-based task weighting module adaptively adjusts\\ntask priorities and steers the encoder optimization. Through this hierarchical\\nlearning process, the encoder and decoders are alternately trained, and the\\nthree levels are cohesively integrated via constrained learning objective.\\nBesides, the convergence of SemanticBC-TriRL is also theoretically established.\\nExtensive simulation results demonstrate the superior performance of the\\nproposed framework across diverse channel conditions, particularly in low SNR\\nregimes, and confirm its scalability with increasing numbers of receivers.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-28T13:59:01Z\"}"}
