{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12147v1\", \"title\": \"Quantitative error analysis of back-stripping based models: case study\\n  from Po Delta (northern Italy)\", \"summary\": \"Numerical back-stripping procedure is crucial for understanding the\\ngeological mechanisms of basin formation or for reconstructing the\\npalaeo-bathymetry in the oceanic regions. However, the importance of errors\\nassociated with data acquisition, processing and interpretation is often\\nunderestimated. These errors, which can impact the final results, are not part\\nof the computational workflow, although they often affect the model parameters\\nwith large uncertainties. In this study, we have qualitatively classified and\\nquantified all the main errors affecting the workflow of the back-stripping\\ntechnique using linear interpolation and combinatorics. We found that the\\nerrors influence different model parameters, some of which have an\\nequiprobability of occurrence, while others are characterized by an intrinsic\\nprobability. We applied the proposed method to the Po Delta in northern Italy,\\nhistorically influenced by anthropogenic and natural subsidence. By studying a\\n2D geological section characterized by thin Holocene sedimentary successions,\\nwe identified 12 sources of error that fall into three basic categories:\\ngeometry of the model layers; distribution of lithologies and petrophysical\\nproperties; past depositional environments. We then assessed the error ranges\\nand their probability of occurrence. The study shows that the errors can vary\\nsignificantly from metre- to millimetre-scale, defining the magnitude and\\ndistribution of each error source, which is essential for interpreting model\\nresults and assessing related uncertainties. It establishes a workflow for\\nfuture uncertainty management and aims to enhance open-source tools based on\\nthe back-stripping procedure.\", \"main_category\": \"physics.geo-ph\", \"categories\": \"physics.geo-ph\", \"published\": \"2025-04-16T14:56:59Z\"}"}
