{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19616v1\", \"title\": \"Exploring circumstellar chemistry in X-ray emitting AGB stars\", \"summary\": \"Aims. Our goal is to characterize the chemistry and physical conditions of\\nthe circumstellar envelopes (CSEs) of Asymptotic Giant Branch (AGB) binary\\ncandidate stars with UV-excess and X-ray emission, in particular, to identify\\nthe effects of the internal X-ray emission in the abundance of certain key\\nmolecules. Methods. We observed the 86.0-94.0 and 260.0-272.5 GHz spectral\\nranges searching for rotational transitions of the X-ray sensitive molecule\\n$HCO^{+}$ in four AGB stars, two of them detected in both UV and X-ray emission\\nand the other two detected only in UV. We derived the CSEs's physical\\nparameters from previous CO observations and determined the molecular\\nabundances of the detected species using radiative transfer models. We\\ndeveloped chemical kinetics models that account for the effects of internal\\nX-ray emission (as well as UV radiation) and compared our predictions with\\nobservations. Results. We report the detection of $HCO^{+}$ in the X-ray\\nemitting C-rich AGB T\\\\,Dra, while it remains undetected in the spectra of the\\nother three sources. In T\\\\,Dra we also detect SiO, HCN, HNC, $HC_{3}N$,\\n$SiC_{2}$, $C_{2}H$ and SiS. For the other targets only HCN and SiO are\\ndetected. The high fractional abundance of $HCO^{+}$ derived for T\\\\,Dra\\n($[1.5-3.0]\\\\times 10^{-8}$) is in good agreement with the predictions from our\\nchemical kinetics models including the effects of internal X-ray emission, and\\none order of magnitude higher than the values expected for C-rich AGB stars.\\nAdditionally, we identify abundance enhancements for HNC, and $HC_{3}N$\\nalongside a depletion of CO in the innermost regions of T\\\\,Dra's envelope.\\nConclusions. An internal X-ray source can significantly alter molecular\\nabundances in AGB CSEs, enhancing $HCO^{+}$, $N_{2}H^{+}$, HNC, and $HC_{3}N$\\nwhile depleting parent species like CO. UV radiation has a weaker effect unless\\nthe envelope is optically thin or porous.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA\", \"published\": \"2025-04-28T09:22:53Z\"}"}
