{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06834v1\", \"title\": \"Green building blocks reveal the complex anatomy of climate change\\n  mitigation technologies\", \"summary\": \"Climate-change mitigating innovation is considered essential for the world's\\ntransition toward a sustainable global economy. To guide this transition,\\nintegrated assessment models map sectoral emissions reduction targets into\\nlong-term trajectories towards carbon neutrality at the macro-level, while\\ndetailed engineering studies at the micro-level develop concrete\\ncarbon-mitigation technologies tailored to individual industries. However, we\\nlack a meso-level understanding of how solutions connect across technological\\ndomains. Building on the notion that innovating often entails combining\\nexisting technologies in new ways, we identify Green Building Blocks (GBBs):\\nmodules of technologies that can be added to nongreen technologies to mitigate\\ntheir climate-change impact. Using natural language processing and\\ndimensionality reduction techniques, we show how GBBs can be extracted from\\nlarge-scale patent data. Next, we describe the anatomy of the green transition\\nas a network that connects nongreen technologies to GBBs. This network has a\\nnontrivial structure: whereas some nongreen technologies can connect to various\\nGBBs, opening up a variety of ways to mitigate their impact on the global\\nclimate, other nongreen technologies only connect to a single GBB. Similarly,\\nsome GBBs are general purpose technologies that can reduce green house gases in\\na vast range of applications, whereas others are tailored to specific use\\ncases. Furthermore, GBBs prove predictive of the green technologies that firms\\ndevelop, allowing us to map the green capabilities of firms not in terms of the\\nspecific green technological solutions they invent, but in terms of their\\ncapacity to develop broader classes of solutions with the GBBs they possess.\", \"main_category\": \"physics.soc-ph\", \"categories\": \"physics.soc-ph,cs.SI\", \"published\": \"2025-04-09T12:50:29Z\"}"}
