{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03200v1\", \"title\": \"Monosilane Worlds: Sub-Neptunes with Atmospheres Shaped by Reduced Magma\\n  Oceans\", \"summary\": \"High-precision infrared spectroscopic measurements now enable detailed\\ncharacterization of sub-Neptune atmospheres, potentially providing constraints\\non their interiors. Motivated by this, atmospheric models have been developed\\nto explore chemical interactions between hydrogen-dominated atmospheres and\\npossibly underlying magma oceans with various redox states. Recent models have\\npredicted monosilane (SiH$_4$) as a potential atmospheric species derived from\\nmagma oceans in sub-Neptunes, but suggested that it is highly depleted in the\\nobservable atmospheric layers. Here, we propose that SiH$_4$ can persist\\nthroughout the atmospheres of sub-Neptunes with FeO-free reduced magma oceans\\nby considering the dissolution of H$_2$O into the magma oceans, a factor not\\naccounted for in previous models. We construct a one-dimensional atmospheric\\nmodel to simulate the chemical equilibrium composition of hydrogen-dominated\\natmospheres overlying FeO-free magma oceans, incorporating H-O-Si chemistry.\\nOur results show that the dissolution of H$_2$O enhances the SiH$_4$ molar\\nfraction to levels of 0.1--10~\\\\%, preventing it from reverting to silicates in\\nthe upper atmospheric layers. We find that SiH$_4$-rich atmospheres can exist\\nacross a broad parameter space with ground temperatures of 2000--6000~K and\\nhydrogen pressures of 10$^2$--10$^5$~bar. We discuss that SiH$_4$-rich\\natmospheres could contain the other silanes but lack C-/N-/O-bearing species.\\nThe detection of SiH$_4$ in future observations of sub-Neptunes would provide\\ncompelling evidence for the presence of a rocky core with a reduced magma\\nocean. However, the accuracy of our model is limited by the lack of data on the\\nnon-ideal behavior and radiative properties of SiH$_4$, highlighting the need\\nfor further numerical and laboratory investigations.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-05-06T05:36:12Z\"}"}
