{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04952v1\", \"title\": \"Study of Wormholes in Symmetric Teleparallel Theories of Gravity\", \"summary\": \"This thesis explores traversable wormhole (WH) solutions within symmetric\\nteleparallel gravity and its extensions, including $f(Q)$ and $f(Q, T)$\\ngravity. Chapter I reviews WH geometry and properties, general relativity, and\\nmodified gravity's role in WH physics. Chapter II constructs WHs in $f(Q)$\\ngravity using dark matter profiles like Pseudo-Isothermal and\\nNavarro-Frenk-White (NFW). For linear $f(Q)$ models, suitable redshift and\\nshape functions satisfying the flare-out condition yield viable WHs, with the\\nmonopole charge $\\\\eta$ driving Null Energy Condition (NEC) violation. The\\nVolume Integral Quantifier (VIQ) method shows minimal exotic matter is needed.\\nNonlinear models like $f(Q) = Q + m Q^n$ fail to meet WH criteria. Chapter III\\nstudies $f(Q, T)$ gravity, where $Q$ and the trace $T$ of the energy-momentum\\ntensor are coupled. WHs are examined under barotropic and anisotropic equations\\nof state using forms like $f(Q, T) = \\\\alpha Q + \\\\beta T$ and $f(Q, T) = Q +\\n\\\\lambda_1 Q^2 + \\\\eta_1 T$. NEC violations occur near the throat, indicating\\neffective matter-geometry coupling. Tolman-Oppenheimer-Volkoff (TOV) analysis\\nconfirms equilibrium under suitable parameters. Chapter IV employs the MIT bag\\nmodel in $f(Q, T)$ gravity, treating it as a source of exotic matter. Specific\\nshape functions lead to WHs with NEC violation and TOV-based stability under\\nradial perturbations. Chapter V considers WHs in $f(Q, T)$ gravity with\\nnoncommutative geometries inspired by string theory. Gaussian and Lorentzian\\nsmeared sources are used. Linear models yield analytical WH solutions,\\nnonlinear ones are numerical. All satisfy the flare-out condition and exhibit\\nNEC violation. Gravitational lensing analysis reveals distinguishable features\\nfrom black holes. Chapter VI summarizes the results, emphasizing observational\\nprospects in extended gravity frameworks.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc\", \"published\": \"2025-05-08T05:19:46Z\"}"}
