{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04571v1\", \"title\": \"Duality-Based Algorithm and Numerical Analysis for Optimal Insulation\\n  Problems on Non-Smooth Domains\", \"summary\": \"This article develops a numerical approximation of a convex non-local and\\nnon-smooth minimization problem. The physical problem involves determining the\\noptimal distribution, given by $h\\\\colon \\\\Gamma_I\\\\to [0,+\\\\infty)$, of a given\\namount $m\\\\in \\\\mathbb{N}$ of insulating material attached to a boundary part\\n$\\\\Gamma_I\\\\subseteq \\\\partial\\\\Omega$ of a thermally conducting body $\\\\Omega\\n\\\\subseteq \\\\mathbb{R}^d$, $d \\\\in \\\\mathbb{N}$, subject to conductive heat\\ntransfer. To tackle the non-local and non-smooth character of the problem, the\\narticle introduces a (Fenchel) duality framework: (a) At the continuous level,\\nusing (Fenchel) duality relations, we derive an a posteriori error identity\\nthat can handle arbitrary admissible approximations of the primal and dual\\nformulations of the convex non-local and non-smooth minimization problem; (b)\\nAt the discrete level, using discrete (Fenchel) duality relations, we derive an\\na priori error identity that applies to a Crouzeix--Raviart discretization of\\nthe primal formulation and a Raviart--Thomas discretization of the dual\\nformulation. The proposed framework leads to error decay rates that are optimal\\nwith respect to the specific regularity of a minimizer. In addition, we prove\\nconvergence of the numerical approximation under minimal regularity\\nassumptions. Since the discrete dual formulation can be written as a quadratic\\nprogram, it is solved using a primal-dual active set strategy interpreted as\\nsemismooth Newton method. A solution of the discrete primal formulation is\\nreconstructed from the solution of the discrete dual formulation by means of an\\ninverse generalized Marini formula. This is the first such formula for this\\nclass of convex non-local and non-smooth minimization problems.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA,math.AP,math.OC\", \"published\": \"2025-05-07T17:07:03Z\"}"}
