{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20032v1\", \"title\": \"More Clear, More Flexible, More Precise: A Comprehensive Oriented Object\\n  Detection benchmark for UAV\", \"summary\": \"Applications of unmanned aerial vehicle (UAV) in logistics, agricultural\\nautomation, urban management, and emergency response are highly dependent on\\noriented object detection (OOD) to enhance visual perception. Although existing\\ndatasets for OOD in UAV provide valuable resources, they are often designed for\\nspecific downstream tasks.Consequently, they exhibit limited generalization\\nperformance in real flight scenarios and fail to thoroughly demonstrate\\nalgorithm effectiveness in practical environments. To bridge this critical gap,\\nwe introduce CODrone, a comprehensive oriented object detection dataset for\\nUAVs that accurately reflects real-world conditions. It also serves as a new\\nbenchmark designed to align with downstream task requirements, ensuring greater\\napplicability and robustness in UAV-based OOD.Based on application\\nrequirements, we identify four key limitations in current UAV OOD datasets-low\\nimage resolution, limited object categories, single-view imaging, and\\nrestricted flight altitudes-and propose corresponding improvements to enhance\\ntheir applicability and robustness.Furthermore, CODrone contains a broad\\nspectrum of annotated images collected from multiple cities under various\\nlighting conditions, enhancing the realism of the benchmark. To rigorously\\nevaluate CODrone as a new benchmark and gain deeper insights into the novel\\nchallenges it presents, we conduct a series of experiments based on 22\\nclassical or SOTA methods.Our evaluation not only assesses the effectiveness of\\nCODrone in real-world scenarios but also highlights key bottlenecks and\\nopportunities to advance OOD in UAV applications.Overall, CODrone fills the\\ndata gap in OOD from UAV perspective and provides a benchmark with enhanced\\ngeneralization capability, better aligning with practical applications and\\nfuture algorithm development.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-28T17:56:02Z\"}"}
