{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17249v1\", \"title\": \"Demonstrating Berkeley Humanoid Lite: An Open-source, Accessible, and\\n  Customizable 3D-printed Humanoid Robot\", \"summary\": \"Despite significant interest and advancements in humanoid robotics, most\\nexisting commercially available hardware remains high-cost, closed-source, and\\nnon-transparent within the robotics community. This lack of accessibility and\\ncustomization hinders the growth of the field and the broader development of\\nhumanoid technologies. To address these challenges and promote democratization\\nin humanoid robotics, we demonstrate Berkeley Humanoid Lite, an open-source\\nhumanoid robot designed to be accessible, customizable, and beneficial for the\\nentire community. The core of this design is a modular 3D-printed gearbox for\\nthe actuators and robot body. All components can be sourced from widely\\navailable e-commerce platforms and fabricated using standard desktop 3D\\nprinters, keeping the total hardware cost under $5,000 (based on U.S. market\\nprices). The design emphasizes modularity and ease of fabrication. To address\\nthe inherent limitations of 3D-printed gearboxes, such as reduced strength and\\ndurability compared to metal alternatives, we adopted a cycloidal gear design,\\nwhich provides an optimal form factor in this context. Extensive testing was\\nconducted on the 3D-printed actuators to validate their durability and\\nalleviate concerns about the reliability of plastic components. To demonstrate\\nthe capabilities of Berkeley Humanoid Lite, we conducted a series of\\nexperiments, including the development of a locomotion controller using\\nreinforcement learning. These experiments successfully showcased zero-shot\\npolicy transfer from simulation to hardware, highlighting the platform's\\nsuitability for research validation. By fully open-sourcing the hardware\\ndesign, embedded code, and training and deployment frameworks, we aim for\\nBerkeley Humanoid Lite to serve as a pivotal step toward democratizing the\\ndevelopment of humanoid robotics. All resources are available at\\nhttps://lite.berkeley-humanoid.org.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-24T04:58:47Z\"}"}
