{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20874v1\", \"title\": \"Diagnostic performance of echocardiography in detecting and\\n  differentiating cardiac amyloidosis: a meta-analysis\", \"summary\": \"Aims: This meta-analysis aimed to evaluate the diagnostic performance of\\nechocardiographic parameters for cardiac amyloidosis (CA), with a focus on\\nsubtype stratification and comparisons with healthy controls. Methods and\\nResults: A comprehensive search identified 26 studies published before February\\n2025, encompassing 3,802 patients. Compared to healthy individuals, CA patients\\ndemonstrated significant echocardiographic abnormalities, including reduced\\nleft ventricular ejection fraction (LVEF; WMD = -10.65, 95% CI: [-11.84,\\n-9.46]), increased left atrial volume index (WMD = +15.87, 95% CI: [14.35,\\n17.38]), and thickened posterior wall (WMD = +5.14, 95% CI: [4.85, 5.42]).\\nSubtype analyses revealed that transthyretin cardiac amyloidosis (ATTR-CA) was\\nassociated with more pronounced systolic dysfunction than light-chain cardiac\\namyloidosis (AL-CA), evidenced by lower global longitudinal strain (WMD =\\n-2.02, 95% CI: [-2.66, -1.37]), reduced LVEF (WMD = -5.31, 95% CI: [-6.63,\\n-3.99]), and diminished tricuspid annular plane systolic excursion (WMD =\\n-1.59, 95% CI: [-2.23, -0.95]). Additionally, ATTR-CA patients exhibited\\ngreater ventricular wall thickening in both posterior wall (WMD = +1.87, 95%\\nCI: [1.51, 2.23]) and interventricular septum (WMD = +2.24, 95% CI: [1.85,\\n2.63]). Conclusion: Echocardiography plays a pivotal role in diagnosing CA and\\ndistinguishing between AL-CA and ATTR-CA. Key indices such as LVEF and global\\nlongitudinal strain are especially valuable for early detection, while\\nsubtype-specific patterns highlight distinct underlying pathophysiologies,\\noffering guidance for tailored diagnostic and therapeutic strategies.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph,q-bio.TO\", \"published\": \"2025-04-29T15:44:30Z\"}"}
