{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05704v1\", \"title\": \"Wave propagation and scattering in time dependent media:\\n  Lippmann-Schwinger equations, multiple scattering theory, Kirchhoff Helmholtz\\n  integrals, Green's functions, reciprocity theorems and Huygens' principle\", \"summary\": \"Wave scattering plays a central role for the modeling of complex wave\\npropagation across all corners of science and engineering applications,\\nincluding electromagnetic, acoustics, seismic and scattering physics. Wave\\ncontrol using time interfaces, where the properties of the medium through with\\nthe wave travels rapidly change in time, has opened further opportunities to\\ncontrol wave propagation in both space and time. For acoustic waves, studies on\\ntime modulated media have not been reported. In this context, full numerical\\nsolution of the wave equation using time interfaces is key to fully understand\\ntheir potential. When applying time interfaces, the underlying physics of\\nacoustic wave propagation and scattering and their similar roles on time and\\nspace, are still being explored. In this work, we introduce a mathematical\\nformulation of the Lippmann-Schwinger integral equations for acoustic wave\\nscattering when time interfaces are induced via a change of the velocity of the\\nmedium. We demonstrate that space-time duality for acoustic wave propagation\\nwith time interfaces and derive the Lippmann-Schwinger integral equations for\\nwave scattering in time-dependent media, multiple scattering theory, Kirchhoff\\nHelmholtz integrals, Green's functions, reciprocity theorems. We experimentally\\nverify our theoretical derivation by studying and measuring the acoustic wave\\nscattering in strongly scattering media. We illustrate the proposed framework\\nand present results of acoustic wave scattering without prior knowledge of the\\nbackground wave-fields. This improves the understanding of the generation and\\nwave scattering and opens previously inaccessible research directions,\\npotentially facilitating practical applications for acoustic, geophysical and\\noptical imaging.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics,physics.geo-ph\", \"published\": \"2025-04-08T05:56:20Z\"}"}
