{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17313v1\", \"title\": \"Tokenizing Stock Prices for Enhanced Multi-Step Forecast and Prediction\", \"summary\": \"Effective stock price forecasting (estimating future prices) and prediction\\n(estimating future price changes) are pivotal for investors, regulatory\\nagencies, and policymakers. These tasks enable informed decision-making, risk\\nmanagement, strategic planning, and superior portfolio returns. Despite their\\nimportance, forecasting and prediction are challenging due to the dynamic\\nnature of stock price data, which exhibit significant temporal variations in\\ndistribution and statistical properties. Additionally, while both forecasting\\nand prediction targets are derived from the same dataset, their statistical\\ncharacteristics differ significantly. Forecasting targets typically follow a\\nlog-normal distribution, characterized by significant shifts in mean and\\nvariance over time, whereas prediction targets adhere to a normal distribution.\\nFurthermore, although multi-step forecasting and prediction offer a broader\\nperspective and richer information compared to single-step approaches, it is\\nmuch more challenging due to factors such as cumulative errors and long-term\\ntemporal variance. As a result, many previous works have tackled either\\nsingle-step stock price forecasting or prediction instead. To address these\\nissues, we introduce a novel model, termed Patched Channel Integration Encoder\\n(PCIE), to tackle both stock price forecasting and prediction. In this model,\\nwe utilize multiple stock channels that cover both historical prices and price\\nchanges, and design a novel tokenization method to effectively embed these\\nchannels in a cross-channel and temporally efficient manner. Specifically, the\\ntokenization process involves univariate patching and temporal learning with a\\nchannel-mixing encoder to reduce cumulative errors. Comprehensive experiments\\nvalidate that PCIE outperforms current state-of-the-art models in forecast and\\nprediction tasks.\", \"main_category\": \"cs.CE\", \"categories\": \"cs.CE,q-fin.CP\", \"published\": \"2025-04-24T07:15:05Z\"}"}
