{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17425v1\", \"title\": \"MeerKAT discovers a jet-driven bow shock near GRS 1915+105. How an\\n  invisible large-scale jet sculpts a microquasar's environment\", \"summary\": \"Black holes, both supermassive and stellar-mass, impact the evolution of\\ntheir surroundings on a large range of scales. While the role of supermassive\\nblack holes is well studied, the effects of stellar-mass black holes on their\\nsurroundings, particularly in inducing structures in the interstellar medium\\n(ISM), remain under explored.\\n  This study focuses on the black hole X-ray binary GRS 1915+105, renowned for\\nits active jets, and the primary aim is to unveil and characterise the impact\\nof GRS 1915+105 on its environment by identifying structures induced by jet-ISM\\ninteraction. Methods: We observed GRS 1915+105 with MeerKAT for a total\\nexposure time of 14~hr, and we obtained the deepest image of GRS 1915+105 to\\ndate. Using a previously proposed self-similar model for large-scale jets, we\\ninferred the properties of both the jets and the ISM, providing insights into\\nthe jet-ISM interaction site.\\n  Our observations revealed a bow shock structure near GRS 1915+105, likely\\ninduced by a jet interacting with the ISM and blowing an overpressured cavity\\nin the medium. We constrained the ISM density to 100--160 particles\\\\,cm$^{-3}$\\nwhile assuming a temperature range of 10$^4$--10$^6$\\\\,K, which implies a bow\\nshock expansion velocity of $20\\\\,{\\\\rm km\\\\,s}^{-1}<\\\\dot{L} <\\\\,360\\\\,{\\\\rm\\nkm\\\\,s}^{-1}$. We estimate that the jet responsible for the formation of the bow\\nshock has an age between 0.09 and 0.22 Myr, and the time-averaged energy rate\\nConclusions: Our results confirm that in stellar-mass black holes, the energy\\ndissipated through jets can be comparable to the accretion energy, and through\\nthe interaction of the jet with the ISM, such energy is transferred back to the\\nenvironment.\\n  This feedback mechanism mirrors the powerful influence of supermassive black\\nholes on their environments, underscoring the significant role a black hole's\\nactivity has in shaping its surroundings.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.GA\", \"published\": \"2025-04-24T10:26:47Z\"}"}
