{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17726v1\", \"title\": \"Optical to infrared mapping of vapor-to-liquid phase change dynamics\\n  using generative machine learning\", \"summary\": \"Infrared thermography is a powerful tool for studying liquid-to-vapor phase\\nchange processes. However, its application has been limited in the study of\\nvapor-to-liquid phase transitions due to the presence of complex liquid\\ndynamics, multiple phases within the same field of view, and experimental\\ndifficulty. Here, we develop a calibration framework which is capable to\\nstudying one of the most complex two-phase heat transfer processes: dropwise\\ncondensation. The framework accounts for non-uniformities arising from dynamic\\ntwo-phase interactions such as droplet nucleation, growth, coalescence, and\\ndeparture, as well as substrate effects particularly observed on micro- and\\nnanoengineered surfaces. This approach enables high-resolution temperature\\nmeasurements with both spatial (12 $\\\\mu$m) and temporal (5 ms) precision,\\nleading to the discovery of local temperature phenomena unobservable using\\nconventional approaches. These observed temperature variations are linked to\\ndroplet statistics, showing how different regions contribute to local\\ncondensation heat transfer. We extend the developed method to quantify local\\nthermal parameters by fusing it with a generative machine learning model to map\\nvisual images into temperature fields. The model is informed of the physical\\nparameter by incorporating vapor pressure embedding as the conditional\\nparameter. This work represents a significant step toward simplifying local\\ntemperature measurements for vapor-to-liquid phase change phenomena by\\ndeveloping a methodology as well as a machine learning approach to map local\\nthermal phenomena using only optical images as the input.\", \"main_category\": \"physics.comp-ph\", \"categories\": \"physics.comp-ph,physics.app-ph,physics.flu-dyn\", \"published\": \"2025-04-24T16:39:20Z\"}"}
