{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16534v1\", \"title\": \"Partitioning of multiple brain metastases improves dose gradients in\\n  single-isocenter radiosurgery\", \"summary\": \"Background: A growing number of cancer patients with brain metastases can\\nbenefit from stereotactic radiosurgery (SRS) thanks to recent advances in\\nsystemic therapies. With an increasing patient load, single-isocenter\\ntreatments on widely available C-arm linear accelerators are an attractive\\noption. However, the planning of such treatments is challenging for\\nmulti-target cases due to the island blocking problem, which occurs when the\\nmulti-leaf collimator cannot conform to all targets simultaneously.\\n  Purpose: We propose a multi-target partitioning algorithm that mitigates\\nexcessive exposure of normal tissue caused by the island blocking problem.\\n  Methods: The algorithm divides (partitions) the set of targets into subsets\\nto treat with separate arc passes, optimizing both subsets and collimator\\nangles to minimize island blocking. The algorithm was incorporated into a fully\\nautomated treatment planning script and evaluated on 20 simulated patient\\ncases, each with 10 brain metastases and 21 Gy prescriptions. It was also\\nretrospectively evaluated on six clinical cases.\\n  Results: Partitioning significantly improved the gradient index, global\\nefficiency index, and brain V12Gy compared to simultaneous treatment of all\\nmetastases. For example, the average gradient index improved from 5.9 to 3.3,\\nglobal efficiency index from 0.32 to 0.46, and normal brain V12Gy from 49 cm3\\nto 26 cm3 between 3 and 9 arcs. The proposed algorithm outperformed baselines\\nin utilizing a limited number of arcs. All target partitioning strategies\\nincreased the total number of monitor units (MUs).\\n  Conclusions: The dose gradient in single-isocenter VMAT plans can be\\nsubstantially improved by treating a smaller subset of metastases at a time.\\nThis requires more MUs and arcs, implying a trade-off between delivery time and\\nplan quality which can be explored using the algorithm proposed in this paper.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph\", \"published\": \"2025-04-23T09:02:57Z\"}"}
