{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14991v1\", \"title\": \"Understanding Accuracy-Fairness Trade-offs in Re-ranking through\\n  Elasticity in Economics\", \"summary\": \"Fairness is an increasingly important factor in re-ranking tasks. Prior work\\nhas identified a trade-off between ranking accuracy and item fairness. However,\\nthe underlying mechanisms are still not fully understood. An analogy can be\\ndrawn between re-ranking and the dynamics of economic transactions. The\\naccuracy-fairness trade-off parallels the coupling of the commodity tax\\ntransfer process. Fairness considerations in re-ranking, similar to a commodity\\ntax on suppliers, ultimately translate into a cost passed on to consumers.\\nAnalogously, item-side fairness constraints result in a decline in user-side\\naccuracy. In economics, the extent to which commodity tax on the supplier (item\\nfairness) transfers to commodity tax on users (accuracy loss) is formalized\\nusing the notion of elasticity. The re-ranking fairness-accuracy trade-off is\\nsimilarly governed by the elasticity of utility between item groups. This\\ninsight underscores the limitations of current fair re-ranking evaluations,\\nwhich often rely solely on a single fairness metric, hindering comprehensive\\nassessment of fair re-ranking algorithms. Centered around the concept of\\nelasticity, this work presents two significant contributions. We introduce the\\nElastic Fairness Curve (EF-Curve) as an evaluation framework. This framework\\nenables a comparative analysis of algorithm performance across different\\nelasticity levels, facilitating the selection of the most suitable approach.\\nFurthermore, we propose ElasticRank, a fair re-ranking algorithm that employs\\nelasticity calculations to adjust inter-item distances within a curved space.\\nExperiments on three widely used ranking datasets demonstrate its effectiveness\\nand efficiency.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-04-21T09:41:08Z\"}"}
