{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17404v1\", \"title\": \"Redefining Superalignment: From Weak-to-Strong Alignment to Human-AI\\n  Co-Alignment to Sustainable Symbiotic Society\", \"summary\": \"Artificial Intelligence (AI) systems are becoming increasingly powerful and\\nautonomous, and may progress to surpass human intelligence levels, namely\\nArtificial Superintelligence (ASI). During the progression from AI to ASI, it\\nmay exceed human control, violate human values, and even lead to irreversible\\ncatastrophic consequences in extreme cases. This gives rise to a pressing issue\\nthat needs to be addressed: superalignment, ensuring that AI systems much\\nsmarter than humans, remain aligned with human (compatible) intentions and\\nvalues. Existing scalable oversight and weak-to-strong generalization methods\\nmay prove substantially infeasible and inadequate when facing ASI. We must\\nexplore safer and more pluralistic frameworks and approaches for\\nsuperalignment. In this paper, we redefine superalignment as the human-AI\\nco-alignment towards a sustainable symbiotic society, and highlight a framework\\nthat integrates external oversight and intrinsic proactive alignment. External\\noversight superalignment should be grounded in human-centered ultimate\\ndecision, supplemented by interpretable automated evaluation and correction, to\\nachieve continuous alignment with humanity's evolving values. Intrinsic\\nproactive superalignment is rooted in a profound understanding of the self,\\nothers, and society, integrating self-awareness, self-reflection, and empathy\\nto spontaneously infer human intentions, distinguishing good from evil and\\nproactively considering human well-being, ultimately attaining human-AI\\nco-alignment through iterative interaction. The integration of\\nexternally-driven oversight with intrinsically-driven proactive alignment\\nempowers sustainable symbiotic societies through human-AI co-alignment, paving\\nthe way for achieving safe and beneficial AGI and ASI for good, for human, and\\nfor a symbiotic ecology.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI\", \"published\": \"2025-04-24T09:53:49Z\"}"}
