{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11435v1\", \"title\": \"Robust Containment Queries over Collections of Trimmed NURBS Surfaces\\n  via Generalized Winding Numbers\", \"summary\": \"Efficient and accurate evaluation of containment queries for regions bound by\\ntrimmed NURBS surfaces is important in many graphics and engineering\\napplications. However, the algebraic complexity of surface-surface\\nintersections makes gaps and overlaps between surfaces difficult to avoid for\\nin-the-wild surface models. By considering this problem through the lens of the\\ngeneralized winding number (GWN), a mathematical construction that is\\nindifferent to the arrangement of surfaces in the shape, we can define a\\ncontainment query that is robust to model watertightness. Applying contemporary\\ntechniques for the 3D GWN on arbitrary curved surfaces would require some form\\nof geometric discretization, potentially inducing containment\\nmisclassifications near boundary components. In contrast, our proposed method\\ncomputes an accurate GWN directly on the curved geometry of the input model. We\\naccomplish this using a novel reformulation of the relevant surface integral\\nusing Stokes' theorem, which in turn permits an efficient adaptive quadrature\\ncalculation on the boundary and trimming curves of the model. While this is\\nsufficient for \\\"far-field\\\" query points that are distant from the surface, we\\naugment this approach for \\\"near-field\\\" query points (i.e., within a bounding\\nbox) and even those coincident to the surface patches via a strategy that\\ndirectly identifies and accounts for the jump discontinuity in the scalar\\nfield. We demonstrate that our method of evaluating the GWN field is robust to\\ncomplex trimming geometry in a CAD model, and is accurate up to arbitrary\\nprecision at arbitrary distances from the surface. Furthermore, the derived\\ncontainment query is robust to non-watertightness while respecting all curved\\nfeatures of the input shape.\", \"main_category\": \"cs.GR\", \"categories\": \"cs.GR,cs.CG,cs.NA,math.NA,I.3.5\", \"published\": \"2025-04-15T17:51:39Z\"}"}
