{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02588v1\", \"title\": \"Topological signatures of collective dynamics and turbulent-like energy\\n  cascades in active granular matter\", \"summary\": \"Active matter refers to a broad class of non-equilibrium systems where energy\\nis continuously injected at the level of individual ``particles.\\\" These systems\\nexhibit emergent collective behaviors that have no direct thermal-equilibrium\\ncounterpart. Their scale ranges from micrometer-sized swarms of bacteria to\\nmeter-scale human crowds. In recent years, the role of topology and\\nself-propelled topological defects in active systems has garnered significant\\nattention, particularly in polar and nematic active matter. Building on these\\nideas, we investigate emergent collective dynamics in apolar active granular\\nfluids. Using granular vibrators as a model experimental system of apolar\\nactive Brownian particles in a dry environment, we uncover a distinctive\\nthree-stage time evolution arising from the intricate interplay between\\nactivity and inelastic interactions. By analyzing the statistics, spatial\\ncorrelations, and dynamics of vortex-like topological defects in the\\ndisplacement vector field, we demonstrate their ability to describe and predict\\nthis intrinsic collective motion. Furthermore, we show that topological defects\\nplay a crucial role in the development of a turbulent-like inverse energy\\ncascade, where kinetic energy transfers across different length scales over\\ntime. As the system evolves, the power scaling of the energy transfer increases\\nwith the duration of observation. Our findings demonstrate how topological\\nconcepts can be applied to predict macroscopic collective phenomena in apolar\\nactive matter. This establishes a direct link between microscopic topological\\ndynamics and large-scale behaviors in active granular fluids.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-04-03T13:53:48Z\"}"}
