{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20589v1\", \"title\": \"Quasi-normal f-modes of anisotropic quark stars in full general\\n  relativity\", \"summary\": \"We investigate f-mode oscillations of anisotropic quark stars within the\\nframework of full general relativity. We consider two different equations of\\nstate (EOSs), one is the MIT bag model EOS and the other is EOS-A. Our study\\nexamines the impact of the pressure anisotropy on the equilibrium structure, as\\nwell as on the frequencies and damping times of f-mode oscillations. Our\\nresults confirm that the f-mode frequency scales linearly with the square root\\nof the average density, with anisotropy influencing both the slope and\\nintercept of this relation. The dependence of the f-mode frequency on total\\nmass reveals distinct trends based on the relative dominance of tangential and\\nradial pressure. When the tangential pressure exceeds the radial pressure, the\\nfrequency increases with mass, exhibiting rapid growth for massive quark stars.\\nWhen the radial pressure dominates, the frequency increases with mass; however,\\nin cases where the radial pressure is significantly greater than the tangential\\npressure, the frequency decreases as mass increases. For low-mass quark stars,\\nstronger tangential pressure leads to an increase in frequency, while beyond a\\nthreshold mass, a further increase in tangential pressure results in a decrease\\nin frequency. For the chosen range of anisotropic strengths, the frequency\\nvaries between 1.3 kHz and 2.3 kHz for the MIT bag EOS and between 1.8 kHz and\\n3.4 kHz for EOS-A. We find that the normalized damping time follows a linear\\ntrend with compactness. For a fixed stellar mass, an increase in tangential\\npressure relative to radial pressure reduces the damping time, whereas a\\ndecrease in tangential pressure significantly increases it. The damping time\\nranges from 83 ms to 900 ms for the MIT bag EOS and from 60 ms to 761 ms for\\nEOS-A. We present semi-empirical expressions for both the frequency and damping\\ntime as functions of mass, radius, and anisotropic strength.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc\", \"published\": \"2025-04-29T09:41:47Z\"}"}
