{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17308v1\", \"title\": \"Physics-based super-resolved simulation of 3D elastic wave propagation\\n  adopting scalable Diffusion Transformer\", \"summary\": \"In this study, we develop a Diffusion Transformer (referred as to DiT1D) for\\nsynthesizing realistic earthquake time histories. The DiT1D generates realistic\\nbroadband accelerograms (0-30 Hz resolution), constrained at low frequency by\\n3-dimensional (3D) elastodynamics numerical simulations, ensuring the\\nfulfillment of the minimum observable physics. The DiT1D architecture,\\nsuccessfully adopted in super-resolution image generation, is trained on\\nrecorded single-station 3-components (3C) accelerograms. Thanks to Multi-Head\\nCross-Attention (MHCA) layers, we guide the DiT1D inference by enforcing the\\nlow-frequency part of the accelerogram spectrum into it. The DiT1D learns the\\nlow-to-high frequency map from the recorded accelerograms, duly normalized, and\\nsuccessfully transfer it to synthetic time histories. The latter are\\nlow-frequency by nature, because of the lack of knowledge on the underground\\nstructure of the Earth, demanded to fully calibrate the numerical model. We\\ndeveloped a CNN-LSTM lightweight network in conjunction with the DiT1D, so to\\npredict the peak amplitude of the broadband signal from its low-pass-filtered\\ncounterpart, and rescale the normalized accelerograms rendered by the DiT1D.\\nDespite the DiT1D being agnostic to any earthquake event peculiarities\\n(magnitude, site conditions, etc.), it showcases remarkable zero-shot\\nprediction realism when applied to the output of validated earthquake\\nsimulations. The generated time histories are viable input accelerograms for\\nearthquake-resistant structural design and the pre-trained DiT1D holds a huge\\npotential to integrate full-scale fault-to-structure digital twins of\\nearthquake-prone regions.\", \"main_category\": \"physics.geo-ph\", \"categories\": \"physics.geo-ph\", \"published\": \"2025-04-24T07:05:33Z\"}"}
