{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02469v1\", \"title\": \"An MHD Simulation of the Possible Modulations of Stellar CMEs Radio\\n  Observations by an Exoplanetary Magnetosphere\", \"summary\": \"Type II radio bursts are the indicator of adverse space weather in a stellar\\nsystem. These radio bursts are the consequence of shock wave acceleration due\\nto the coronal mass ejection (CME). Here, we perform a series of\\nmagnetohydrodynamic (MHD) simulations of a CME-driven star-planet system in\\norder to investigate the modulation in radio burst mechanism by a close-in\\nexoplanetary system. We use a model for the stellar wind with a close-in\\nexoplanet, and a CME model based on the eruption of a flux rope. We are able to\\ngenerate synthetic radio burst images from our MHD simulations. We find that\\nradio burst like phenomena is most likely to be observed for moderately active\\nsolar like stars and close-in exoplanetary systems have significant influence\\non the nature of radio burst spectrum. We find that when the planetary field is\\nnot too strong, the planetary magnetosphere is pushing against the CME,\\nincreasing its density so the radio burst is visible at higher frequencies.\\nWhen the planetary field is very strong, the large magnetosphere does not leave\\nroom for the CME shock to evolve so the radio burst is more visible in the\\nlower frequencies associated with the weak compression at the flanks of the CME\\nshock. In case of highly active solar-like stars, strong overlying stellar\\nfields weakens the solar-like CME shock, thus generates very weak (almost\\nnon-visible) radio burst signals. For HD 189733 (moderate stellar field), only\\nintensity difference is visible when the CME arrives the planet. We also do not\\nfind significant modulation in the radio emission by a close-in exoplanet\\nsystem when the stellar magnetic field is complex. In summary, our result\\nsuggests that the nature of the radio burst spectrum is highly dependent on the\\ntopology of the stellar magnetic field and the close-in exoplanetary magnetic\\nfield strength.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,astro-ph.SR\", \"published\": \"2025-04-03T10:42:30Z\"}"}
