{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06978v1\", \"title\": \"Wheat3DGS: In-field 3D Reconstruction, Instance Segmentation and\\n  Phenotyping of Wheat Heads with Gaussian Splatting\", \"summary\": \"Automated extraction of plant morphological traits is crucial for supporting\\ncrop breeding and agricultural management through high-throughput field\\nphenotyping (HTFP). Solutions based on multi-view RGB images are attractive due\\nto their scalability and affordability, enabling volumetric measurements that\\n2D approaches cannot directly capture. While advanced methods like Neural\\nRadiance Fields (NeRFs) have shown promise, their application has been limited\\nto counting or extracting traits from only a few plants or organs. Furthermore,\\naccurately measuring complex structures like individual wheat heads-essential\\nfor studying crop yields-remains particularly challenging due to occlusions and\\nthe dense arrangement of crop canopies in field conditions. The recent\\ndevelopment of 3D Gaussian Splatting (3DGS) offers a promising alternative for\\nHTFP due to its high-quality reconstructions and explicit point-based\\nrepresentation. In this paper, we present Wheat3DGS, a novel approach that\\nleverages 3DGS and the Segment Anything Model (SAM) for precise 3D instance\\nsegmentation and morphological measurement of hundreds of wheat heads\\nautomatically, representing the first application of 3DGS to HTFP. We validate\\nthe accuracy of wheat head extraction against high-resolution laser scan data,\\nobtaining per-instance mean absolute percentage errors of 15.1%, 18.3%, and\\n40.2% for length, width, and volume. We provide additional comparisons to\\nNeRF-based approaches and traditional Muti-View Stereo (MVS), demonstrating\\nsuperior results. Our approach enables rapid, non-destructive measurements of\\nkey yield-related traits at scale, with significant implications for\\naccelerating crop breeding and improving our understanding of wheat\\ndevelopment.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-09T15:31:42Z\"}"}
