{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05282v1\", \"title\": \"Electronic and Optical Properties of the Recently Synthesized 2D\\n  Vivianites (Vivianenes): Insights from First-Principles Calculations\", \"summary\": \"Vivianite (Fe$_3$(PO$_4$)$_2$8H$_2$O) is a naturally occurring layered\\nmaterial with significant environmental and technological relevance. This work\\npresents a comprehensive theoretical investigation of its two-dimensional (2D)\\ncounterpart, Vivianene, focusing on its structural, electronic, and optical\\nproperties. Using density functional theory (DFT) calculations and ab initio\\nmolecular dynamics (AIMD) simulations, we evaluate its thermodynamic stability,\\nband structure, density of states, and optical response. Our results confirm\\nthat Vivianene retains the main structural features of bulk Vivianite while\\nexhibiting enhanced thermodynamic stability at room temperature. The electronic\\nstructure analysis reveals an indirect bandgap of 3.03 eV for Vivianene, which\\nis slightly lower than the 3.21 eV observed for bulk Vivianite, deviating from\\nthe expected quantum confinement trend in 2D materials. The projected density\\nof states (PDOS) analysis indicates that Fe d orbitals predominantly contribute\\nto the valence and conduction bands. Optical calculations demonstrate that\\nVivianene exhibits a higher optical band gap (3.6 eV) than bulk Vivianite (3.2\\neV), with significant absorption in the ultraviolet region. The refractive\\nindex and reflectivity analyses suggest that most of the incident light is\\nabsorbed rather than reflected, reinforcing its potential for optoelectronic\\napplications. These findings provide valuable insights into the fundamental\\nproperties of Vivianene and highlight its potential for advanced applications\\nin sensing, optoelectronics, and energy-related technologies.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,physics.comp-ph\", \"published\": \"2025-05-08T14:27:33Z\"}"}
