{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02272v1\", \"title\": \"Generative Classifier for Domain Generalization\", \"summary\": \"Domain generalization (DG) aims to improve the generalizability of computer\\nvision models toward distribution shifts. The mainstream DG methods focus on\\nlearning domain invariance, however, such methods overlook the potential\\ninherent in domain-specific information. While the prevailing practice of\\ndiscriminative linear classifier has been tailored to domain-invariant\\nfeatures, it struggles when confronted with diverse domain-specific\\ninformation, e.g., intra-class shifts, that exhibits multi-modality. To address\\nthese issues, we explore the theoretical implications of relying on domain\\ninvariance, revealing the crucial role of domain-specific information in\\nmitigating the target risk for DG. Drawing from these insights, we propose\\nGenerative Classifier-driven Domain Generalization (GCDG), introducing a\\ngenerative paradigm for the DG classifier based on Gaussian Mixture Models\\n(GMMs) for each class across domains. GCDG consists of three key modules:\\nHeterogeneity Learning Classifier~(HLC), Spurious Correlation Blocking~(SCB),\\nand Diverse Component Balancing~(DCB). Concretely, HLC attempts to model the\\nfeature distributions and thereby capture valuable domain-specific information\\nvia GMMs. SCB identifies the neural units containing spurious correlations and\\nperturbs them, mitigating the risk of HLC learning spurious patterns.\\nMeanwhile, DCB ensures a balanced contribution of components in HLC, preventing\\nthe underestimation or neglect of critical components. In this way, GCDG excels\\nin capturing the nuances of domain-specific information characterized by\\ndiverse distributions. GCDG demonstrates the potential to reduce the target\\nrisk and encourage flat minima, improving the generalizability. Extensive\\nexperiments show GCDG's comparable performance on five DG benchmarks and one\\nface anti-spoofing dataset, seamlessly integrating into existing DG methods\\nwith consistent improvements.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-03T04:38:33Z\"}"}
