{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00567v1\", \"title\": \"Error Exponents for Oblivious Relaying and Connections to Source Coding\\n  with a Helper\", \"summary\": \"The information bottleneck channel, also known as oblivious relaying, is a\\ntwo-hop channel where a transmitter sends messages to a remote receiver via an\\nintermediate relay node. A codeword sent by the transmitter passes through a\\ndiscrete memoryless channel to reach the relay, and then the relay processes\\nthe noisy channel output and forwards it to the receiver through a noiseless\\nrate-limited link. The relay is oblivious, in the sense that it has no\\nknowledge of the channel codebook used in transmission. Past works on oblivious\\nrelaying are focused on characterizing achievable rates. In this work, we study\\nerror exponents and explore connections to loseless source coding with a\\nhelper, also known as the Wyner-Ahlswede-K\\\\\\\"orner (WAK) problem. We first\\nestablish an achievable error exponent for oblivious relaying under constant\\ncompositions codes. A key feature of our analysis is the use of the type\\ncovering lemma to design the relay's compress-forward scheme. We then show that\\nemploying constant composition code ensembles does not improve the rates\\nachieved with their IID counterparts. We also derive a sphere packing upper\\nbound for the error exponent. In the second part of this paper, we establish a\\nconnection between the information bottleneck channel and the WAK problem. We\\nshow that good codes for the latter can be produced through permuting codes\\ndesigned for the former. This is accomplished by revisiting Ahlswede's covering\\nlemma, and extending it to achieve simultaneous covering of a type class by\\nseveral distinct sets using the same sequence of permutations. We then apply\\nour approach to attain the best known achievable error exponent for the WAK\\nproblem, previously established by Kelly and Wagner. As a byproduct of our\\nderivations, we also establish error exponents and achievable rates under\\nmismatched decoding rules.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-05-01T14:50:51Z\"}"}
