{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20559v1\", \"title\": \"A Case Study of the Tornadic Supercell in the province of Pampanga,\\n  Philippines (27 May 2024)\", \"summary\": \"This study provides an integrated damage, visual, environmental, and remote\\nsensing analysis of the tornado event that struck the suburb of Candating in\\nArayat, Pampanga on 27 May 2024. Satellite imagery and photographs of the\\ndamage indicate that the tornado caused EF2 damage on the Enhanced Fujita (EF)\\nscale across a $\\\\sim$2 km path. Videos of the tornado and its parent storm\\nreveal a well-defined wall cloud and low-level mesocyclone, but without a sign\\nof precipitation curtain, indicative of its low-precipitation mode. Subsequent\\nradar analysis supports these and other tornadic supercell features. Mid- and\\nupper-tropospheric synoptic-scale ascent was subtle, influenced by the approach\\nof TC Ewiniar. However, a modest meridional flow aloft over the area provided\\nsufficient deep-layer shear to support supercell development. The Southwest\\nMonsoon acted as a low-level jet, promoting warm, moist advection into western\\nLuzon. The supercell developed around mid-noon and was characterized by\\nlarge-undiluted instability, attributed to steep low-level lapse rates.\\nAlthough low-level shear and its associated near-surface horizontal vorticity\\nwere weak, the latter is highly streamwise allowing for efficient ingestion,\\ntilting, and stretching into vertical vorticity, which aided in tornadogenesis.\\nBoth satellite and radar data suggest that storm interactions (i.e., nudging\\nprocess) and terrain interactions with nearby Mt. Arayat may have contributed\\nto the initiation and intensification of the supercell through lee-side\\nconvergence and enhancing vorticity. The complex tropical environment of the\\nCandating, Arayat tornado mirrors several characteristics of well-documented\\nNorth American tornadic environments. This highlights the need for more\\nresearch into the atmospheric conditions conducive to tornadic activity in the\\nPhilippines.\", \"main_category\": \"physics.ao-ph\", \"categories\": \"physics.ao-ph\", \"published\": \"2025-04-29T09:01:54Z\"}"}
