{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21331v1\", \"title\": \"Towards Space Group Determination from EBSD Patterns: The Role of Deep\\n  Learning and High-throughput Dynamical Simulations\", \"summary\": \"The design of novel materials hinges on the understanding of\\nstructure-property relationships. However, our capability to synthesize a large\\nnumber of materials has outpaced the ability and speed needed to characterize\\nthem. While the overall chemical constituents can be readily known during\\nsynthesis, the structural evolution and characterization of newly synthesized\\nsamples remains a bottleneck for the ultimate goal of high throughput\\nnanomaterials discovery. Thus, scalable methods for crystal symmetry\\ndetermination that can analyze a large volume of material samples within a\\nshort time-frame are especially needed. Kikuchi diffraction in the SEM is a\\npromising technique for this due to its sensitivity to dynamical scattering,\\nwhich may provide information beyond just the seven crystal systems and\\nfourteen Bravais lattices. After diffraction patterns are collected from\\nmaterial samples, deep learning methods may be able to classify the space group\\nsymmetries using the patterns as input, which paired with the elemental\\ncomposition, would help enable the determination of the crystal structure. To\\ninvestigate the feasibility of this solution, neural networks were trained to\\npredict the space group type of background corrected EBSD patterns. Our\\nnetworks were first trained and tested on an artificial dataset of EBSD\\npatterns of 5,148 different cubic phases, created through physics-based\\ndynamical simulations. Next, Maximum Classifier Discrepancy, an unsupervised\\ndeep learning-based domain adaptation method, was utilized to train neural\\nnetworks to make predictions for experimental EBSD patterns. We introduce a\\nrelabeling scheme, which enables our models to achieve accuracy scores higher\\nthan 90% on simulated and experimental data, suggesting that neural networks\\nare capable of making predictions of crystal symmetry from an EBSD pattern.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,cs.CV\", \"published\": \"2025-04-30T05:36:31Z\"}"}
