{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02419v1\", \"title\": \"Numerical simulations of the pressure-driven flow of pairs of rigid\\n  spheres in elastoviscoplastic fluids\", \"summary\": \"We investigate through numerical simulations the hydrodynamic interactions\\nbetween two rigid spherical particles suspended on the axis of a cylindrical\\ntube filled with an elastoviscoplastic fluid subjected to pressure-driven flow.\\nThe simulations are performed by the finite element method with the arbitrary\\nLagrangian-Eulerian formulation. We carry out a parametric analysis to examine\\nthe impact of the yield stress and relaxation time of the fluid and of particle\\nconfinement on the dynamics of the system. We identify master curves of the\\nparticle relative velocity as a function of the inter-particle distance. When\\nthe yield stress of the suspending phase is much lower than the viscous stress,\\nthose curves highlight short-range attractive interactions and long-range\\nrepulsive interactions between particles, with the latter specifically\\npromoting their alignment. As the yield stress increases, the attractive\\ninteraction is replaced by stasis at short distance, characterized by a\\nvanishing relative velocity and the formation of an unyielded region that\\nconnects the two spheres, where the fluid behaves like a viscoelastic solid.\\nAdditionally, the combined effects of plasticity and elasticity enhance the\\nrepulsion between the particles, promoting their ordering. Also increasing the\\nconfinement of the particles enhances repulsion, thus allowing to achieve\\nordering within shorter lengths in the flow direction. Reducing shear thinning\\namplifies peak relative velocities and expands the attractive region due to\\nincreased viscoelastic stresses and stress gradients. While a stable\\nequilibrium may appear at larger separations, its impact is limited by low\\nrelative velocities.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-03T09:20:24Z\"}"}
