{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20002v1\", \"title\": \"Boundary crisis and long transients of the Atlantic overturning\\n  circulation mediated by an edge state\", \"summary\": \"The Atlantic Meridional Overturning Circulation (AMOC), a large-scale ocean\\ncurrent and vital climate component, could transition to a substantially\\nweakened flow state. Despite severe associated impacts, it remains difficult to\\nreliably estimate the proximity to potential critical thresholds and predict\\nthe AMOC's fate under global warming. To advance our understanding of Earth\\nsystem stability, a global view on the dynamics is needed beyond the local\\nstability analysis underlying, e.g., standard early warning signs. Here we\\nexplore the phase space of an intermediate-complexity climate model featuring a\\nmetastable AMOC. For two atmospheric carbon dioxide (CO$_2$) levels, we\\nexplicitly compute the edge state (also called Melancholia state), a chaotic\\nsaddle embedded in the basin boundary that separates the strong and weak AMOC\\nattractors found in the model. While being unstable, the edge state can govern\\nthe transient climate for centuries. Its dynamics exhibits strong centennial\\nAMOC oscillations driven by atmosphere-ice-ocean interactions in the North\\nAtlantic. We demonstrate that at CO$_2$ levels projected to be reached in the\\nnext decades, the simulated AMOC undergoes a boundary crisis where the current\\nAMOC attractor collides with the edge state. Near but beyond the crisis, long\\nchaotic transients occur due to a resulting ghost state, causing a splitting of\\nensemble trajectories under time-dependent forcing. Rooted in dynamical systems\\ntheory, our results offer an interpretation of large ensemble variances and a\\nso-called stochastic bifurcation observed in earth system models under\\nintermediate forcing scenarios.\", \"main_category\": \"nlin.CD\", \"categories\": \"nlin.CD,math.DS,physics.ao-ph\", \"published\": \"2025-04-28T17:22:58Z\"}"}
