{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20957v1\", \"title\": \"A Quieter State of Charge -- Ultra-Low-Noise Collective Current in\\n  Charge-Density-Wave Nanowires\", \"summary\": \"In quasi-one-dimensional (quasi-1D) charge-density-wave (CDW) systems,\\nelectric current comprises normal electrons and a collective, electron-lattice\\ncondensate current associated with CDW sliding. While achieving the\\ndissipation-less Frohlich current of the sliding condensate is impossible in\\nreal materials, one can imagine an important related target, namely reaching\\nthe electron transport regime where electronic noise is inhibited due to the\\ncollective, strongly-correlated nature of the electron-lattice condensate\\ncurrent. Here we report that in nanowires of the fully-gapped CDW material\\n(TaSe4)2I, low-frequency electronic noise is suppressed below the limit of\\nthermalized charge carriers in passive resistors. When the current is dominated\\nby the sliding Frohlich condensate, the normalized noise spectral density\\ndecreases linearly with current -- a striking departure from the constant value\\nobserved in conventional conductors. This discovery signals intrinsically lower\\ncurrent fluctuations within a correlated transport regime. The dominant noise\\nsource due to fluctuations in the CDW depinning threshold is extrinsic and\\ncaused by lattice imperfections that locally pin the condensate. Once the bias\\nvoltage is well past threshold and the sliding mode is established, the\\nnormalized noise drops below the noise of normal electrons. No residual minimum\\nnoise level is observed for the current of the condensate. Since flicker noise\\nlimits phase stability in communication systems, reduces the sensitivity and\\nselectivity of sensors, and degrades coherence in quantum devices, our\\ndiscovery introduces a fundamentally new strategy for achieving ultra-low-noise\\nperformance in nanoscale and quantum electronics using strongly correlated\\nmaterials.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el,cond-mat.mes-hall,cond-mat.mtrl-sci\", \"published\": \"2025-04-29T17:28:20Z\"}"}
