{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03521v1\", \"title\": \"Response of the solar atmosphere to flux emergence: With\\n  emergence-driven prominence formation\", \"summary\": \"Flux emergence is crucial for the formation of solar active regions and\\ntriggering of various eruptions. However, the detailed mechanisms by which flux\\nemergence drives these eruptions remain unclear and require numerical\\ninvestigation. Using 2.5-dimensional magnetohydrodynamic simulations, we\\ninvestigate the interaction between emerging flux and background magnetic\\nfields and dynamics of the induced eruptions. By systematically varying the\\nstrength and angle of the emerging magnetic field relative to the background\\nfield, we investigate its impact on the initiation and evolution of solar\\neruptions. The simulations show that magnetic reconnection between the emerging\\nflux and background field drives the formation of current sheets, magnetic\\nislands and multithermal jets. Stronger magnetic fields result in earlier\\neruptions, more energetic jets, and enhanced heating. The formation and\\nejection of magnetic islands affect the structure and dynamics of the jet. When\\nthe hot and cool components of jets reach the other footpoint of magnetic\\nloops, they will generate spicules near the transition region. Varying the\\nangle between the emerging flux and the background field, we find that larger\\nangles delay filament ascent and eruption timing but facilitate filament\\nformation. Filaments form a hot shell and oscillate with a period of 10 minutes\\ndriven by periodic plasma ejections. Repetitive reconnection events inject cold\\nplasma into the self-consistently formed filament channel, introducing a new\\nprominence formation mechanism by flux-emergence-fed injection. Our analysis\\nhighlights the dynamic interplay between magnetic reconnection, plasma cooling\\nand heating, and filament dynamics. These findings provide insights into solar\\neruptions and their observational signatures, emphasizing the role of\\nmulti-thermal structures in the corona.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-05-06T13:35:48Z\"}"}
