{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16733v1\", \"title\": \"Identification of quasars variable over long time scales from infrared\\n  surveys. Ensemble variability and structure function properties\", \"summary\": \"Quasars are variable and their variability can both constrain their physical\\nproperties and help to identify them. We look for ways to efficiently identify\\nquasars exhibiting consistent variability over multi-year time-scales, based on\\na small number of epochs. Using infrared (IR) is desirable to avoid bias\\nagainst reddened objects. We compare the apparent brightness of known quasars\\nthat have been observed with two IR surveys, covering up to a twenty-year\\nbaseline: the Two Micron All Sky Survey (2MASS; 1997-2001) and the VISTA\\nHemisphere Survey (VHS; 2009-2017). We look at the previous studies of the\\nselected variable quasars to see if their variable behaviour is known and when\\navailable we use multi-epoch monitoring with the Zwicky Transient Facility\\n(ZTF) to obtain a measure of optical variability of individual objects. We\\nbuild a sample of ~2500 quasars that show statistically significant variability\\nbetween the 2MASS and VHS. About 1500 of these come from the new Quaia sample\\nbased on Gaia spectra and about 1/3 of these have hardly been studied. The\\nQuaia sample constitutes the main product of this work. Based on ensemble\\nvariability and structure function analysis we demonstrate that the selected\\nobjects in our sample are representative of the typical quasar population and\\nshow behaviour, consistent with other quasar samples. Our analysis strengthens\\nprevious results, for example that variability decreases with the rest-frame\\nwavelength and that it exhibits peaks for certain absolute magnitudes of the\\nquasars. Similarly, the structure function shows an increase in variability for\\nrest-frame time lags below ~1500 d and a decrease for longer lags, just like in\\nprevious studies. Our selection, even though it is based on two epochs only,\\nseems to be surprisingly robust, showing up to ~11% contamination by quasars\\nthat show stable non-variable behaviour in ZTF.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-23T14:04:47Z\"}"}
