{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03672v1\", \"title\": \"Statistical geochemical constraints on present-day water outgassing as a\\n  source of secondary atmospheres on the TRAPPIST-1 exoplanets\", \"summary\": \"The TRAPPIST-1 planetary system is observationally favorable for studying if\\nplanets orbiting M stars can retain atmospheres and host habitable conditions.\\nRecent JWST secondary eclipse observations of TRAPPIST-1 c rule out a thick\\n\\\\ch{CO2} atmosphere but do not rule out atmospheric water vapor or its\\nphotochemical product, oxygen. Given the high expected escape rate, maintenance\\nof atmospheric water vapor would require a present-day water source, such as\\nvolcanic outgassing. Here, we simulate water outgassing on the TRAPPIST-1\\nplanets over a broad phase space based on solar system terrestrial bodies. We\\nthen apply two filters based on observation and geochemistry that narrow this\\nphase space and constrain the plausible outgassing scenarios. For all seven\\nTRAPPIST-1 planets, we find that the water outgassing rate is most likely\\n$\\\\sim$0.03x Earth's but has upper limits of $\\\\sim$8x Earth's. The allowed range\\nalso implies low, Mars-like magma emplacement rates and relatively dry,\\nEarth-like mantles, although mantle water mass fractions up to 1 wt\\\\% are\\npossible. We also present scenarios with magma emplacement rates similar to\\nMars, Earth, and Io, resulting in different preferred mantle water content and\\noutgassing rates. We find that water outgassing rates are potentially high\\nenough to balance water escape rates, providing a theoretical pathway for the\\nTRAPPIST-1 planets to maintain surface water or water-vapor-containing\\natmospheres over long timescales. The bounds on outgassing rates and interior\\nproperties can be used in atmospheric chemistry and escape models to\\ncontextualize future observations of the TRAPPIST-1 planets, and may be\\napplicable to other terrestrial exoplanets.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,physics.geo-ph\", \"published\": \"2025-05-06T16:11:35Z\"}"}
