{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15753v1\", \"title\": \"Markov Kernels, Distances and Optimal Control: A Parable of Linear\\n  Quadratic Non-Gaussian Distribution Steering\", \"summary\": \"For a controllable linear time-varying (LTV) pair\\n$(\\\\boldsymbol{A}_t,\\\\boldsymbol{B}_t)$ and $\\\\boldsymbol{Q}_{t}$ positive\\nsemidefinite, we derive the Markov kernel for the It\\\\^{o} diffusion\\n${\\\\mathrm{d}}\\\\boldsymbol{x}_{t}=\\\\boldsymbol{A}_{t}\\\\boldsymbol{x}_t {\\\\mathrm{d}}\\nt + \\\\sqrt{2}\\\\boldsymbol{B}_{t}{\\\\mathrm{d}}\\\\boldsymbol{w}_{t}$ with an\\naccompanying killing of probability mass at rate\\n$\\\\frac{1}{2}\\\\boldsymbol{x}^{\\\\top}\\\\boldsymbol{Q}_{t}\\\\boldsymbol{x}$. This Markov\\nkernel is the Green's function for an associated linear\\nreaction-advection-diffusion partial differential equation. Our result\\ngeneralizes the recently derived kernel for the special case\\n$\\\\left(\\\\boldsymbol{A}_t,\\\\boldsymbol{B}_t\\\\right)=\\\\left(\\\\boldsymbol{0},\\\\boldsymbol{I}\\\\right)$,\\nand depends on the solution of an associated Riccati matrix ODE. A consequence\\nof this result is that the linear quadratic non-Gaussian Schr\\\\\\\"{o}dinger bridge\\nis exactly solvable. This means that the problem of steering a controlled LTV\\ndiffusion from a given non-Gaussian distribution to another over a fixed\\ndeadline while minimizing an expected quadratic cost can be solved using\\ndynamic Sinkhorn recursions performed with the derived kernel. Our derivation\\nfor the\\n$\\\\left(\\\\boldsymbol{A}_t,\\\\boldsymbol{B}_t,\\\\boldsymbol{Q}_t\\\\right)$-parametrized\\nkernel pursues a new idea that relies on finding a state-time dependent\\ndistance-like functional given by the solution of a deterministic optimal\\ncontrol problem. This technique breaks away from existing methods, such as\\ngeneralizing Hermite polynomials or Weyl calculus, which have seen limited\\nsuccess in the reaction-diffusion context. Our technique uncovers a new\\nconnection between Markov kernels, distances, and optimal control. This\\nconnection is of interest beyond its immediate application in solving the\\nlinear quadratic Schr\\\\\\\"{o}dinger bridge problem.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC,cs.LG,cs.SY,eess.SY,math.PR,math.ST,stat.TH\", \"published\": \"2025-04-22T10:07:43Z\"}"}
