{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19912v1\", \"title\": \"Can AI Agents Design and Implement Drug Discovery Pipelines?\", \"summary\": \"The rapid advancement of artificial intelligence, particularly autonomous\\nagentic systems based on Large Language Models (LLMs), presents new\\nopportunities to accelerate drug discovery by improving in-silico modeling and\\nreducing dependence on costly experimental trials. Current AI agent-based\\nsystems demonstrate proficiency in solving programming challenges and\\nconducting research, indicating an emerging potential to develop software\\ncapable of addressing complex problems such as pharmaceutical design and drug\\ndiscovery. This paper introduces DO Challenge, a benchmark designed to evaluate\\nthe decision-making abilities of AI agents in a single, complex problem\\nresembling virtual screening scenarios. The benchmark challenges systems to\\nindependently develop, implement, and execute efficient strategies for\\nidentifying promising molecular structures from extensive datasets, while\\nnavigating chemical space, selecting models, and managing limited resources in\\na multi-objective context. We also discuss insights from the DO Challenge 2025,\\na competition based on the proposed benchmark, which showcased diverse\\nstrategies explored by human participants. Furthermore, we present the Deep\\nThought multi-agent system, which demonstrated strong performance on the\\nbenchmark, outperforming most human teams. Among the language models tested,\\nClaude 3.7 Sonnet, Gemini 2.5 Pro and o3 performed best in primary agent roles,\\nand GPT-4o, Gemini 2.0 Flash were effective in auxiliary roles. While\\npromising, the system's performance still fell short of expert-designed\\nsolutions and showed high instability, highlighting both the potential and\\ncurrent limitations of AI-driven methodologies in transforming drug discovery\\nand broader scientific research.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.MA\", \"published\": \"2025-04-28T15:41:28Z\"}"}
