{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19632v1\", \"title\": \"QFDNN: A Resource-Efficient Variational Quantum Feature Deep Neural\\n  Networks for Fraud Detection and Loan Prediction\", \"summary\": \"Social financial technology focuses on trust, sustainability, and social\\nresponsibility, which require advanced technologies to address complex\\nfinancial tasks in the digital era. With the rapid growth in online\\ntransactions, automating credit card fraud detection and loan eligibility\\nprediction has become increasingly challenging. Classical machine learning (ML)\\nmodels have been used to solve these challenges; however, these approaches\\noften encounter scalability, overfitting, and high computational costs due to\\ncomplexity and high-dimensional financial data. Quantum computing (QC) and\\nquantum machine learning (QML) provide a promising solution to efficiently\\nprocessing high-dimensional datasets and enabling real-time identification of\\nsubtle fraud patterns. However, existing quantum algorithms lack robustness in\\nnoisy environments and fail to optimize performance with reduced feature sets.\\nTo address these limitations, we propose a quantum feature deep neural network\\n(QFDNN), a novel, resource efficient, and noise-resilient quantum model that\\noptimizes feature representation while requiring fewer qubits and simpler\\nvariational circuits. The model is evaluated using credit card fraud detection\\nand loan eligibility prediction datasets, achieving competitive accuracies of\\n82.2% and 74.4%, respectively, with reduced computational overhead.\\nFurthermore, we test QFDNN against six noise models, demonstrating its\\nrobustness across various error conditions. Our findings highlight QFDNN\\npotential to enhance trust and security in social financial technology by\\naccurately detecting fraudulent transactions while supporting sustainability\\nthrough its resource-efficient design and minimal computational overhead.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cs.LG\", \"published\": \"2025-04-28T09:47:28Z\"}"}
