{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15044v1\", \"title\": \"Beyond Terabit/s Integrated Neuromorphic Photonic Processor for DSP-Free\\n  Optical Interconnects\", \"summary\": \"The rapid expansion of generative AI drives unprecedented demands for\\nhigh-performance computing. Training large-scale AI models now requires vast\\ninterconnected GPU clusters across multiple data centers. Multi-scale AI\\ntraining and inference demand uniform, ultra-low latency, and energy-efficient\\nlinks to enable massive GPUs to function as a single cohesive unit. However,\\ntraditional electrical and optical interconnects, relying on conventional\\ndigital signal processors (DSPs) for signal distortion compensation,\\nincreasingly fail to meet these stringent requirements. To overcome these\\nlimitations, we present an integrated neuromorphic optical signal processor\\n(OSP) that leverages deep reservoir computing and achieves DSP-free,\\nall-optical, real-time processing. Experimentally, our OSP achieves a 100 Gbaud\\nPAM4 per lane, 1.6 Tbit/s data center interconnect over a 5 km optical fiber in\\nthe C-band (equivalent to over 80 km in the O-band), far exceeding the reach of\\nstate-of-the-art DSP solutions, which are fundamentally constrained by\\nchromatic dispersion in IMDD systems. Simultaneously, it reduces processing\\nlatency by four orders of magnitude and energy consumption by three orders of\\nmagnitude. Unlike DSPs, which introduce increased latency at high data rates,\\nour OSP maintains consistent, ultra-low latency regardless of data rate\\nscaling, making it ideal for future optical interconnects. Moreover, the OSP\\nretains full optical field information for better impairment compensation and\\nadapts to various modulation formats, data rates, and wavelengths. Fabricated\\nusing a mature silicon photonic process, the OSP can be monolithically\\nintegrated with silicon photonic transceivers, enhancing the compactness and\\nreliability of all-optical interconnects. This research provides a highly\\nscalable, energy-efficient, and high-speed solution, paving the way for\\nnext-generation AI infrastructure.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics,cs.AI,cs.ET\", \"published\": \"2025-04-21T11:56:36Z\"}"}
