{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03364v1\", \"title\": \"DroidRetriever: An Autonomous Navigation and Information Integration\\n  System Facilitating Mobile Sensemaking\", \"summary\": \"Users regularly rely on mobile applications for their daily information\\nneeds, and mobile sensemaking is prevalent in various domains such as\\neducation, healthcare, business intelligence, and emergency response, where\\ntimely and context-aware information-processing and decision-making is\\ncritical. However, valuable information is often scattered across the closed\\necosystems within various applications, posing challenges for traditional\\nsearch engines to retrieve data openly and in real-time. Additionally, due to\\nlimitations such as mobile device screen sizes, language differences, and\\nunfamiliarity with specific applications and domain knowledge, users have to\\nfrequently switch between multiple applications and spend substantial time\\nlocating and integrating the information. To address these challenges, we\\npresent DroidRetriever, a system for cross-application information retrieval to\\nfacilitate mobile sensemaking. DroidRetriever can automatically navigate to\\nrelevant interfaces based on users' natural language commands, capture\\nscreenshots, extract and integrate information, and finally present the\\nresults. Our experimental results demonstrate that DroidRetriever can extract\\nand integrate information with near-human accuracy while significantly reducing\\nprocessing time. Furthermore, with minimal user intervention, DroidRetriever\\neffectively corrects and completes various information retrieval tasks,\\nsubstantially reducing the user's workload. Our summary of the motivations for\\nintervention and the discussion of their necessity provide valuable\\nimplications for future research. We will open-source our code upon acceptance\\nof the paper.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-05-06T09:37:51Z\"}"}
