{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11146v1\", \"title\": \"Exploring Student Behaviors and Motivations using AI TAs with Optional\\n  Guardrails\", \"summary\": \"AI-powered chatbots and digital teaching assistants (AI TAs) are gaining\\npopularity in programming education, offering students timely and personalized\\nfeedback. Despite their potential benefits, concerns about student\\nover-reliance and academic misconduct have prompted the introduction of\\n\\\"guardrails\\\" into AI TAs - features that provide scaffolded support rather than\\ndirect solutions. However, overly restrictive guardrails may lead students to\\nbypass these tools and use unconstrained AI models, where interactions are not\\nobservable, thus limiting our understanding of students' help-seeking\\nbehaviors. To investigate this, we designed and deployed a novel AI TA tool\\nwith optional guardrails in one lab of a large introductory programming course.\\nAs students completed three code writing and debugging tasks, they had the\\noption to receive guardrailed help or use a \\\"See Solution\\\" feature which\\ndisabled the guardrails and generated a verbatim response from the underlying\\nmodel. We investigate students' motivations and use of this feature and examine\\nthe association between usage and their course performance. We found that 50%\\nof the 885 students used the \\\"See Solution\\\" feature for at least one problem\\nand 14% used it for all three problems. Additionally, low-performing students\\nwere more likely to use this feature and use it close to the deadline as they\\nstarted assignments later. The predominant factors that motivated students to\\ndisable the guardrails were assistance in solving problems, time pressure, lack\\nof self-regulation, and curiosity. Our work provides insights into students'\\nsolution-seeking motivations and behaviors, which has implications for the\\ndesign of AI TAs that balance pedagogical goals with student preferences.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC,cs.CY\", \"published\": \"2025-04-15T12:48:22Z\"}"}
