{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00337v1\", \"title\": \"T2VPhysBench: A First-Principles Benchmark for Physical Consistency in\\n  Text-to-Video Generation\", \"summary\": \"Text-to-video generative models have made significant strides in recent\\nyears, producing high-quality videos that excel in both aesthetic appeal and\\naccurate instruction following, and have become central to digital art creation\\nand user engagement online. Yet, despite these advancements, their ability to\\nrespect fundamental physical laws remains largely untested: many outputs still\\nviolate basic constraints such as rigid-body collisions, energy conservation,\\nand gravitational dynamics, resulting in unrealistic or even misleading\\ncontent. Existing physical-evaluation benchmarks typically rely on automatic,\\npixel-level metrics applied to simplistic, life-scenario prompts, and thus\\noverlook both human judgment and first-principles physics. To fill this gap, we\\nintroduce \\\\textbf{T2VPhysBench}, a first-principled benchmark that\\nsystematically evaluates whether state-of-the-art text-to-video systems, both\\nopen-source and commercial, obey twelve core physical laws including Newtonian\\nmechanics, conservation principles, and phenomenological effects. Our benchmark\\nemploys a rigorous human evaluation protocol and includes three targeted\\nstudies: (1) an overall compliance assessment showing that all models score\\nbelow 0.60 on average in each law category; (2) a prompt-hint ablation\\nrevealing that even detailed, law-specific hints fail to remedy physics\\nviolations; and (3) a counterfactual robustness test demonstrating that models\\noften generate videos that explicitly break physical rules when so instructed.\\nThe results expose persistent limitations in current architectures and offer\\nconcrete insights for guiding future research toward truly physics-aware video\\ngeneration.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI,cs.CL,cs.CV\", \"published\": \"2025-05-01T06:34:55Z\"}"}
