{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21680v1\", \"title\": \"Hoist with His Own Petard: Inducing Guardrails to Facilitate\\n  Denial-of-Service Attacks on Retrieval-Augmented Generation of LLMs\", \"summary\": \"Retrieval-Augmented Generation (RAG) integrates Large Language Models (LLMs)\\nwith external knowledge bases, improving output quality while introducing new\\nsecurity risks. Existing studies on RAG vulnerabilities typically focus on\\nexploiting the retrieval mechanism to inject erroneous knowledge or malicious\\ntexts, inducing incorrect outputs. However, these approaches overlook critical\\nweaknesses within LLMs, leaving important attack vectors unexplored and\\nlimiting the scope and efficiency of attacks. In this paper, we uncover a novel\\nvulnerability: the safety guardrails of LLMs, while designed for protection,\\ncan also be exploited as an attack vector by adversaries. Building on this\\nvulnerability, we propose MutedRAG, a novel denial-of-service attack that\\nreversely leverages the guardrails of LLMs to undermine the availability of RAG\\nsystems. By injecting minimalistic jailbreak texts, such as \\\"\\\\textit{How to\\nbuild a bomb}\\\", into the knowledge base, MutedRAG intentionally triggers the\\nLLM's safety guardrails, causing the system to reject legitimate queries.\\nBesides, due to the high sensitivity of guardrails, a single jailbreak sample\\ncan affect multiple queries, effectively amplifying the efficiency of attacks\\nwhile reducing their costs. Experimental results on three datasets demonstrate\\nthat MutedRAG achieves an attack success rate exceeding 60% in many scenarios,\\nrequiring only less than one malicious text to each target query on average. In\\naddition, we evaluate potential defense strategies against MutedRAG, finding\\nthat some of current mechanisms are insufficient to mitigate this threat,\\nunderscoring the urgent need for more robust solutions.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR\", \"published\": \"2025-04-30T14:18:11Z\"}"}
