{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07031v1\", \"title\": \"Identifying Key Challenges of Hardness-Based Resampling\", \"summary\": \"Performance gap across classes remains a persistent challenge in machine\\nlearning, often attributed to variations in class hardness. One way to quantify\\nclass hardness is through sample complexity - the minimum number of samples\\nrequired to effectively learn a given class. Sample complexity theory suggests\\nthat class hardness is driven by differences in the amount of data required for\\ngeneralization. That is, harder classes need substantially more samples to\\nachieve generalization. Therefore, hardness-based resampling is a promising\\napproach to mitigate these performance disparities. While resampling has been\\nstudied extensively in data-imbalanced settings, its impact on balanced\\ndatasets remains unexplored.\\n  This raises the fundamental question whether resampling is effective because\\nit addresses data imbalance or hardness imbalance. We begin addressing this\\nquestion by introducing class imbalance into balanced datasets and evaluate its\\neffect on performance disparities. We oversample hard classes and undersample\\neasy classes to bring hard classes closer to their sample complexity\\nrequirements while maintaining a constant dataset size for fairness. We\\nestimate class-level hardness using the Area Under the Margin (AUM) hardness\\nestimator and leverage it to compute resampling ratios. Using these ratios, we\\nperform hardness-based resampling on the well-known CIFAR-10 and CIFAR-100\\ndatasets.\\n  Contrary to theoretical expectations, our results show that hardness-based\\nresampling does not meaningfully affect class-wise performance disparities. To\\nexplain this discrepancy, we conduct detailed analyses to identify key\\nchallenges unique to hardness-based imbalance, distinguishing it from\\ntraditional data-based imbalance. Our insights help explain why theoretical\\nsample complexity expectations fail to translate into practical performance\\ngains and we provide guidelines for future research.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-09T16:45:57Z\"}"}
