{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09891v1\", \"title\": \"NR-SSOR right preconditioned RRGMRES for arbitrary singular systems and\\n  least squares problems\", \"summary\": \"GMRES is known to determine a least squares solution of $ A x = b $ where $ A\\n\\\\in R^{n \\\\times n} $ without breakdown for arbitrary $ b \\\\in R^n $, and initial\\niterate $ x_0 \\\\in R^n $ if and only if $ A $ is range-symmetric, i.e. $ R(A^T)\\n= R(A) $, where $ A $ may be singular and $ b $ may not be in the range space $\\nR(A) $ of $ A $.\\n  In this paper, we propose applying the Range Restricted GMRES (RRGMRES) to $\\nA C A^T z = b $, where $ C \\\\in R^{n \\\\times n} $ is symmetric positive definite.\\nThis determines a least squares solution $ x = C A^T z $ of $ A x = b $ without\\nbreakdown for arbitrary (singular) matrix $ A \\\\in R^{n \\\\times n} $ and $ b, x_0\\n\\\\in R^n $, and is much more stable and accurate compared to GMRES, RRGMRES and\\nMINRES-QLP applied to $ A x = b $ for inconsistent problems when $ b \\\\notin\\nR(A) $. In particular, we propose applying the NR-SSOR as the inner iteration\\nright preconditioner, which also works efficiently for least squares problems $\\n\\\\min_{x \\\\in R^n} \\\\| b - A x\\\\|_2 $ for $ A \\\\in R^{m \\\\times n} $ and arbitrary $\\nb \\\\in R^m $.\\n  Numerical experiments demonstrate the validity of the proposed method.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA\", \"published\": \"2025-04-14T05:34:02Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09907v1\", \"title\": \"A Novel Radar Constant False Alarm Rate Detection Algorithm Based on\\n  VAMP Deep Unfolding\", \"summary\": \"The combination of deep unfolding with vector approximate message passing\\n(VAMP) algorithm, results in faster convergence and higher sparse recovery\\naccuracy than traditional compressive sensing approaches. However, deep\\nunfolding alters the parameters in traditional VAMP algorithm, resulting in the\\nunattainable distribution parameter of the recovery error of non-sparse noisy\\nestimation via traditional VAMP, which hinders the utilization of VAMP deep\\nunfolding in constant false alarm rate (CFAR) detection in sub-Nyquist radar\\nsystem. Based on VAMP deep unfolding, we provide a parameter convergence\\ndetector (PCD) to estimate the recovery error distribution parameter and\\nimplement CFAR detection. Compared to the state-of-the-art approaches, both the\\nsparse solution and non-sparse noisy estimation are utilized to estimate the\\ndistribution parameter and implement CFAR detection in PCD, which leverages\\nboth the VAMP distribution property and the improved sparse recovery accuracy\\nprovided by deep unfolding. Simulation results indicate that PCD offers\\nimproved false alarm rate control performance and higher target detection rate.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-14T06:06:20Z\"}"}
