{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04116v1\", \"title\": \"RFNNS: Robust Fixed Neural Network Steganography with Popular Deep\\n  Generative Models\", \"summary\": \"Image steganography is a technique that conceals secret information in a\\ncover image to achieve covert communication. Recent research has demonstrated\\nthat Fixed Neural Network Steganography (FNNS) exhibits significant practical\\nadvantages, as it enables stable and efficient steganographic embedding and\\nextraction without requiring neural network training. However, the stego image\\ngenerated by existing FNNS methods suffers from considerable distortion and\\nexhibits poor robustness, severely reducing the security and practicality of\\nsteganography. To address the aforementioned issues, we propose a Robust Fixed\\nNeural Network Steganography (RFNNS). In RFNNS, we introduce a texture-aware\\nlocalization technique to add perturbations carrying secret image information\\nto complex texture areas that are less perceptible to the human eye, thereby\\nensuring the quality of the stego image. To enhance robustness, a robust\\nsteganographic perturbation generation (RSPG) strategy is designed, which\\nenables slight perturbations to be accurately decoded even after common image\\nattacks. Subsequently, the generated robust perturbations are combined with the\\nAI-generated cover image to produce the stego image. The receiver only needs to\\nshare the secret key and employ the same decoding network structure to\\naccurately extract the secret image from the attacked stego image. Experimental\\nresults demonstrate that RFNNS achieves enhanced performance in terms of\\nsecurity, including imperceptibility and anti-steganalysis performance.\\nFurthermore, RFNNS demonstrates superior robustness against common image\\nattacks, such as JPEG compression, Gaussian noise, and contrast adjustment,\\nacross diverse embedding capacities, outperforming existing SOTA FNNS methods.\", \"main_category\": \"cs.MM\", \"categories\": \"cs.MM\", \"published\": \"2025-05-07T04:15:03Z\"}"}
