{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11938v1\", \"title\": \"Exact noise and dissipation operators for quantum stochastic\\n  thermodynamics\", \"summary\": \"The theory of open quantum systems plays a fundamental role in several\\nscientific and technological disciplines, from quantum computing and\\ninformation science to molecular electronics and quantum thermodynamics.\\nDespite its widespread relevance, a rigorous formulation of quantum dissipation\\nin conjunction with thermal noise remains a topic of active research. In this\\nwork, we establish a formal correspondence between classical stochastic\\nthermodynamics, in particular the Fokker-Planck and Klein-Kramers equations,\\nand the quantum master equation. Building on prior studies of multiplicative\\nnoise in classical stochastic differential equations, we demonstrate that\\nthermal noise at the quantum level manifests as a multidimensional geometric\\nstochastic process. By applying canonical quantization, we introduce a novel\\nHermitian dissipation operator that serves as a quantum analogue of classical\\nviscous friction. This operator not only preserves the mathematical rigor of\\nopen quantum system dynamics but also allows for a well-defined expression of\\nheat exchange between a system and its environment, enabling the formulation of\\nan alternative quantum equipartition theorem. Our framework ensures a precise\\nenergy balance that aligns with the first law of thermodynamics and an entropy\\nbalance consistent with the second law. The theoretical formalism is applied to\\ntwo prototypical quantum systems, the harmonic oscillator and a particle in an\\ninfinite potential well, for whom it provides new insights into nonequilibrium\\nthermodynamics at the quantum scale. Our results advance the understanding of\\ndissipation in quantum systems and establish a foundation for future studies on\\nstochastic thermodynamics in the quantum domain.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,math-ph,math.MP\", \"published\": \"2025-04-16T10:16:33Z\"}"}
