{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20475v1\", \"title\": \"The Gaia Catalogue of Galactic AGB Stars\", \"summary\": \"This paper describes the identification of Gaia counterparts of a sample of\\noxygen-rich AGB stars with OH maser emission as a first step towards the\\ncompilation of a general Gaia Catalogue of Galactic AGB stars. With this\\ncatalogue, tests of evolutionary models for the AGB star population in the\\nsolar neighbourhood will become feasible. We cross-matched AGB star candidates\\nshowing OH maser emission with Gaia DR3 using a cross-match with AllWISE and\\n2MASS as intermediate steps to avoid ambiguities. With the help of the Virtual\\nObservatory, we retrieved photometric data from the near-ultraviolet to the\\nfar-infrared and built spectral energy distributions (SEDs) of the sources. The\\nSEDs were fitted with theoretical models. The fit results, together with\\ninformation from the literature, allowed us to clean the sample from non-AGB\\nstars and to obtain bolometric fluxes for the AGB stars. Distances based on\\nGaia parallaxes were used to derive the stellar luminosities. We identified\\nunique Gaia counterparts for 1487 OH masers. Of these, 1172 had an unambiguous\\nclassification as AGB stars; they make up the Gaia OH/IR star sample.\\nParallaxes with relative errors $<$20\\\\% and astrometric excess noise $<$1.5 mas\\nwere available for 222 OH/IR stars. We conclude that the study of the AGB\\npopulation in the solar neighbourhood is limited by the obscuration by\\ncircumstellar dust, as \\\\G\\\\ DR3 only provides parallaxes for a few of our\\ncandidates. The location of the OH/IR stars matches that of LPV discovered by\\n\\\\G\\\\ in the (BP$-$RP; G$_{abs}$) diagram, but the OH/IR star sample is biased\\ntowards redder colours (BP$-$RP$>$4) mag and larger amplitudes ($>$1 mag in the\\nG-band), which are typical for periodic large-amplitude Mira variables.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA\", \"published\": \"2025-04-29T07:16:02Z\"}"}
