{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01617v1\", \"title\": \"The Mini-SiTian Array: Evaluation Camera System\", \"summary\": \"The Mini-SiTian project, which is the pathfinder for the SiTian project,\\nutilizes three 30 cm telescopes equipped with commercial CMOS cameras (ZWO\\nASI6200MM Pro) to simulate large-area time-domain survey. Due to the avoidance\\nof the traditional mechanical shutter, the CMOS camera is favorable in\\ntime-domain survey projects. In the future, the SiTian telescope array will\\nemploy a two-by-two scientific-grade mosaic CMOS camera to survey a\\n10,000-degree square area every 30 minutes. Therefore, the performance of CMOS\\ndirectly determines the detection capability of SiTian telescopes for transient\\nsources, and a comprehensive understanding of the performance of CMOS cameras\\nis crucial. In this research, laboratory testing was conducted to thoroughly\\nevaluate three cameras by assessing several critical parameters, including bias\\nstability, dark current, pixel anomalies, linearity, gain, and read noise. We\\nfind exceptional short-term bias stability with standard deviations below 0.02\\nADU, negligible dark current of approximately 0.002 e$^{-}$ pixel$^{-1}$\\ns$^{-1}$ at $0^\\\\circ\\\\text{C}$, and excellent linearity with nonlinearity\\nconsistently below $\\\\pm$ 0.5\\\\%, and a small proportion (0.06\\\\% to 0.08\\\\%) of\\npixels with anomalous responses. Furthermore, our analysis demonstrates uniform\\ngain values across all cameras, ranging from 0.252 to 0.255 e$^{-}$ ADU$^{-1}$,\\nwith low readout noise, measured to be below 1.6 e$^{-}$ using conventional\\nmethods. We also propose a novel method for pixel-level gain and read noise\\ncalculation for CMOS sensors, which revealed a narrow gain distribution and a\\nlow median read noise of 1.028 e$^-$ for one of the cameras. The laboratory\\ntesting of the ZWO ASI6200MM Pro cameras indicates their potential to meet the\\nrequirements of time-domain surveys for the Mini-SiTian project.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM\", \"published\": \"2025-04-02T11:26:32Z\"}"}
