{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21743v1\", \"title\": \"Three-Dimensional Stacking as a Line Intensity Mapping Statistic\", \"summary\": \"Line-intensity mapping (LIM) is a growing technique that measures the\\nintegrated spectral-line emission from unresolved galaxies over a\\nthree-dimensional region of the Universe. Although LIM experiments ultimately\\naim to provide powerful cosmological constraints via auto-correlation, many LIM\\nexperiments are also designed to take advantage of overlapping galaxy surveys,\\nenabling joint analyses of the two datasets. We introduce a flexible simulation\\npipeline that can generate mock galaxy surveys and mock LIM data simultaneously\\nfor the same population of simulated galaxies. Using this pipeline, we explore\\na simple joint analysis technique: three-dimensional co-addition (stacking) of\\nLIM data on the positions of galaxies from a traditional galaxy catalogue. We\\ntest how the output of this technique reacts to changes in experimental design\\nof both the LIM experiment and the galaxy survey, its sensitivity to various\\nastrophysical parameters, and its susceptibility to common systematic errors.\\nWe find that an ideal catalogue for a stacking analysis targets as many\\nhigh-mass dark matter halos as possible. We also find that the signal in a LIM\\nstacking analysis originates almost entirely from the large-scale clustering of\\nhalos around the catalogue objects, rather than the catalogue objects\\nthemselves. While stacking is a sensitive and conceptually simple way to\\nachieve a LIM detection, thus providing a valuable way to validate a LIM\\nauto-correlation detection, it will likely require a full cross-correlation to\\nachieve further characterization of the galaxy tracers involved, as the\\ncosmological and astrophysical parameters we explore here have degenerate\\neffects on the stack.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,astro-ph.GA\", \"published\": \"2025-03-27T17:52:27Z\"}"}
