{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12865v1\", \"title\": \"DashChat: Interactive Authoring of Industrial Dashboard Design\\n  Prototypes through Conversation with LLM-Powered Agents\", \"summary\": \"Industrial dashboards, commonly deployed by organizations such as enterprises\\nand governments, are increasingly crucial in data communication and\\ndecision-making support across various domains. Designing an industrial\\ndashboard prototype is particularly challenging due to its visual complexity,\\nwhich can include data visualization, layout configuration, embellishments, and\\nanimations. Additionally, in real-world industrial settings, designers often\\nencounter numerous constraints. For instance, when companies negotiate\\ncollaborations with clients and determine design plans, they typically need to\\ndemo design prototypes and iterate on them based on mock data quickly. Such a\\ntask is very common and crucial during the ideation stage, as it not only helps\\nsave developmental costs but also avoids data-related issues such as lengthy\\ndata handover periods. However, existing authoring tools of dashboards are\\nmostly not tailored to such prototyping needs, and motivated by these gaps, we\\npropose DashChat, an interactive system that leverages large language models\\n(LLMs) to generate industrial dashboard design prototypes from natural\\nlanguage. We collaborated closely with designers from the industry and derived\\nthe requirements based on their practical experience. First, by analyzing 114\\nhigh-quality industrial dashboards, we summarized their common design patterns\\nand inject the identified ones into LLMs as reference. Next, we built a\\nmulti-agent pipeline powered by LLMs to understand textual requirements from\\nusers and generate practical, aesthetic prototypes. Besides, functionally\\ndistinct, parallel-operating agents are created to enable efficient generation.\\nThen, we developed a user-friendly interface that supports text-based\\ninteraction for generating and modifying prototypes. Two user studies\\ndemonstrated that our system is both effective and efficient in supporting\\ndesign prototyping.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-17T11:46:17Z\"}"}
