{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04384v1\", \"title\": \"DATA: Multi-Disentanglement based Contrastive Learning for Open-World\\n  Semi-Supervised Deepfake Attribution\", \"summary\": \"Deepfake attribution (DFA) aims to perform multiclassification on different\\nfacial manipulation techniques, thereby mitigating the detrimental effects of\\nforgery content on the social order and personal reputations. However, previous\\nmethods focus only on method-specific clues, which easily lead to overfitting,\\nwhile overlooking the crucial role of common forgery features. Additionally,\\nthey struggle to distinguish between uncertain novel classes in more practical\\nopen-world scenarios. To address these issues, in this paper we propose an\\ninnovative multi-DisentAnglement based conTrastive leArning framework, DATA, to\\nenhance the generalization ability on novel classes for the open-world\\nsemi-supervised deepfake attribution (OSS-DFA) task. Specifically, since all\\ngeneration techniques can be abstracted into a similar architecture, DATA\\ndefines the concept of 'Orthonormal Deepfake Basis' for the first time and\\nutilizes it to disentangle method-specific features, thereby reducing the\\noverfitting on forgery-irrelevant information. Furthermore, an augmented-memory\\nmechanism is designed to assist in novel class discovery and contrastive\\nlearning, which aims to obtain clear class boundaries for the novel classes\\nthrough instance-level disentanglements. Additionally, to enhance the\\nstandardization and discrimination of features, DATA uses bases contrastive\\nloss and center contrastive loss as auxiliaries for the aforementioned modules.\\nExtensive experimental evaluations show that DATA achieves state-of-the-art\\nperformance on the OSS-DFA benchmark, e.g., there are notable accuracy\\nimprovements in 2.55% / 5.7% under different settings, compared with the\\nexisting methods.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-07T13:05:32Z\"}"}
