{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21612v1\", \"title\": \"Selective Variable Convolution Meets Dynamic Content Guided Attention\\n  for Infrared Small Target Detection\", \"summary\": \"Infrared Small Target Detection (IRSTD) system aims to identify small targets\\nin complex backgrounds. Due to the convolution operation in Convolutional\\nNeural Networks (CNNs), applying traditional CNNs to IRSTD presents challenges,\\nsince the feature extraction of small targets is often insufficient, resulting\\nin the loss of critical features. To address these issues, we propose a dynamic\\ncontent guided attention multiscale feature aggregation network (DCGANet),\\nwhich adheres to the attention principle of 'coarse-to-fine' and achieves high\\ndetection accuracy. First, we propose a selective variable convolution (SVC)\\nmodule that integrates the benefits of standard convolution, irregular\\ndeformable convolution, and multi-rate dilated convolution. This module is\\ndesigned to expand the receptive field and enhance non-local features, thereby\\neffectively improving the discrimination of targets from backgrounds. Second,\\nthe core component of DCGANet is a two-stage content guided attention module.\\nThis module employs two-stage attention mechanism to initially direct the\\nnetwork's focus to salient regions within the feature maps and subsequently\\ndetermine whether these regions correspond to targets or background\\ninterference. By retaining the most significant responses, this mechanism\\neffectively suppresses false alarms. Additionally, we propose adaptive dynamic\\nfeature fusion (ADFF) module to substitute for static feature cascading. This\\ndynamic feature fusion strategy enables DCGANet to adaptively integrate\\ncontextual features, thereby enhancing its ability to discriminate true targets\\nfrom false alarms. DCGANet has achieved new benchmarks across multiple\\ndatasets.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV\", \"published\": \"2025-04-30T13:09:20Z\"}"}
