{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21822v1\", \"title\": \"On the difficulty of capturing the distribution function of neutrinos in\\n  neutron star merger simulations\", \"summary\": \"The collision of two neutron stars is a rich source of information about\\nnuclear physics. In particular, the kilonova signal following a merger can help\\nus elucidate the role of neutron stars in nucleosynthesis, and informs us about\\nthe properties of matter above nuclear saturation. Approximate modeling of\\nneutrinos remains an important limitation to our ability to make predictions\\nfor these observables. Part of the problem is the fermionic nature of\\nneutrinos. By the exclusion principle, the expected value $f_\\\\nu$ for the\\nnumber of neutrinos in a quantum state is at most 1. Any process producing\\nneutrinos is suppressed by a blocking factor $(1-f_\\\\nu)$. Recent simulations\\nfocused on neutrino physics mostly use a gray two-moment scheme to evolve\\nneutrinos. This evolves integrals of $f_\\\\nu$ over momentum space, preventing\\ndirect calculations of blocking factors. Monte Carlo methods may be an\\nattractive alternative, providing access to the full distribution of neutrinos.\\nTheir current implementation is however inadequate to estimate $f_\\\\nu$: in our\\nmost recent simulations, a single Monte Carlo packet causes, in the worst\\ncases, estimates of $f_\\\\nu$ to jump from $f_\\\\nu=0$ to $f_\\\\nu\\\\sim 10^5$. While\\nthis is concerning, this brazen violation of the fermionic nature of neutrinos\\nhas been largely inconsequential as the interactions used in simulations avoid\\ndirect calculations of $f_\\\\nu$. We are however reaching a level of modeling at\\nwhich this problem can no longer be ignored. Here, we discuss the relatively\\nsimple origin of this issue. We then show that very rough estimates of $f_\\\\nu$\\ncan in theory be obtained in merger simulations, but that they will require a\\ncombination of unintuitive weighting schemes for Monte Carlo packets and\\nsmoothing of the neutrino distribution at coarser resolution than what the\\nmerger simulation uses.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,gr-qc\", \"published\": \"2025-04-30T17:26:41Z\"}"}
