{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15852v1\", \"title\": \"Recovering Nesterov accelerated dynamics from Heavy Ball dynamics via\\n  time rescaling\", \"summary\": \"In a real Hilbert space, we consider two classical problems: the global\\nminimization of a smooth and convex function $f$ (i.e., a convex optimization\\nproblem) and finding the zeros of a monotone and continuous operator $V$ (i.e.,\\na monotone equation). Attached to the optimization problem, first we study the\\nasymptotic properties of the trajectories generated by a second-order dynamical\\nsystem which features a constant viscous friction coefficient and a positive,\\nmonotonically increasing function $b(\\\\cdot)$ multiplying $\\\\nabla f$. For a\\ngenerated solution trajectory $y(t)$, we show small $o$ convergence rates\\ndependent on $b(t)$ for $f(y(t)) - \\\\min f$, and the weak convergence of $y(t)$\\ntowards a global minimizer of $f$. In 2015, Su, Boyd and Cand\\\\'es introduced a\\nsecond-order system which could be seen as the continuous-time counterpart of\\nNesterov's accelerated gradient. As the first key point of this paper, we show\\nthat for a special choice for $b(t)$, these two seemingly unrelated dynamical\\nsystems are connected: namely, they are time reparametrizations of each other.\\nEvery statement regarding the continuous-time accelerated gradient system may\\nbe recovered from its Heavy Ball counterpart.\\n  As the second key point of this paper, we observe that this connection\\nextends beyond the optimization setting. Attached to the monotone equation\\ninvolving the operator $V$, we again consider a Heavy Ball-like system which\\nfeatures an additional correction term which is the time derivative of the\\noperator along the trajectory. We establish a time reparametrization\\nequivalence with the Fast OGDA dynamics introduced by Bot, Csetnek and Nguyen\\nin 2022, which can be seen as an analog of the continuous accelerated gradient\\ndynamics, but for monotone operators. Again, every statement regarding the Fast\\nOGDA system may be recovered from a Heavy Ball-like system.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC\", \"published\": \"2025-04-22T12:46:42Z\"}"}
