{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04577v1\", \"title\": \"Relative benefits of different active learning methods to conceptual\\n  physics learning\", \"summary\": \"Extensive research has demonstrated that active learning methods are more\\neffective than traditional lecturing at improving student conceptual\\nunderstanding and reducing failure rates in undergraduate physics courses.\\nResearchers have developed several distinct active learning methods that are\\nnow widely implemented in introductory physics; however, the relative benefits\\nof these methods remain unknown. Here we present the first multi-institutional\\ncomparison of the impacts of four well-established active learning methods\\n(ISLE, Peer Instruction, Tutorials, and SCALE-UP) on conceptual learning. We\\nalso investigate student development of peer networks and the activities that\\ntake place during instruction to explain differences in these impacts. Data\\ninclude student concept inventory scores, peer network surveys, and classroom\\nvideo recordings from 31 introductory physics and astronomy courses at 28\\ndifferent institutions in the United States containing a total of 2,855\\nstudents. We find measurable increases in student conceptual learning in all\\nfour active learning methods (ranging from 2.09-sigma to 6.22-sigma differences\\nfrom a null effect), and significantly larger conceptual learning gains in\\nSCALE-UP than in both ISLE (2.25-sigma difference) and Peer Instruction\\n(2.54-sigma difference). Conceptual learning gains in Tutorials are not\\nsignificantly different from those in the other three methods. Despite the\\nhypothesized benefits of student interactions, student development of peer\\nnetworks is similar across the four methods. Instead, we observe differences in\\nclassroom activities; in many of the observed ISLE and Peer Instruction\\ncourses, instructors lecture for a large fraction of class time. In Tutorials\\nand SCALE-UP courses, instructors dedicate most in-class time to\\nstudent-centered activities such as worksheets and laboratory work.\", \"main_category\": \"physics.ed-ph\", \"categories\": \"physics.ed-ph\", \"published\": \"2025-05-07T17:14:19Z\"}"}
