{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04143v1\", \"title\": \"Evaluating Performance Consistency in Competitive Programming:\\n  Educational Implications and Contest Design Insights\", \"summary\": \"Competitive programming (CP) contests are often treated as interchangeable\\nproxies for algorithmic skill, yet the extent to which results at lower contest\\ntiers anticipate performance at higher tiers, and how closely any tier\\nresembles the ubiquitous online-contest circuit, remains unclear. We analyze\\nten years (2015--2024) of International Collegiate Programming Contest (ICPC)\\nstandings, comprising five long-running superregional championships (Africa \\\\&\\nArab, Asia East, Asia West, North America, and Northern Eurasia), associated\\nlocal regionals of North America and Northern Eurasia, and the World Finals.\\nFor 366 World Finalist teams (2021--2024) we augment the dataset with\\npre-contest Codeforces ratings. Pairwise rank alignment is measured with\\nKendall's $\\\\tau$.\\n  Overall, superregional ranks predict World Final ranks only moderately\\n(weighted $\\\\tau=0.407$), but regional-to-superregional consistency varies\\nwidely: Northern Eurasia exhibits the strongest alignment ($\\\\tau=0.521$) while\\nAsia West exhibits the weakest ($\\\\tau=0.188$). Internal consistency within a\\nregion can exceed its predictive value for Worlds -- e.g., Northern Eurasia and\\nNorth America regionals vs. superregionals ($\\\\tau=0.666$ and $\\\\tau=0.577$,\\nrespectively). Codeforces ratings correlate more strongly with World Final\\nresults ($\\\\tau=0.596$) than any single ICPC tier, suggesting that\\nhigh-frequency online contests capture decisive skill factors that many\\nsuperregional sets miss.\\n  We argue that contest organizers can improve both fairness and pedagogical\\nvalue by aligning problem style and selection rules with the formats that\\ndemonstrably differentiate teams, in particular the Northern-Eurasian model and\\nwell-curated online rounds. All data, scripts, and additional analyses are\\npublicly released to facilitate replication and further study.\", \"main_category\": \"cs.CY\", \"categories\": \"cs.CY,stat.AP\", \"published\": \"2025-05-07T05:48:56Z\"}"}
