{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11352v1\", \"title\": \"Diagnostic Uncertainty Limits the Potential of Early Warning Signals to\\n  Identify Epidemic Emergence\", \"summary\": \"Methods to detect the emergence of infectious diseases, and approach to the\\n\\\"critical transition\\\" RE = 1, have to potential to avert substantial disease\\nburden by facilitating preemptive actions like vaccination campaigns. Early\\nwarning signals (EWS), summary statistics of infection case time series, show\\npromise in providing such advanced warnings. As EWS are computed on test\\npositive case data, the accuracy of this underlying data is integral to their\\npredictive ability, but will vary with changes in the diagnostic test accuracy\\nand the incidence of the target disease relative to clinically-compatible\\nbackground noise. We simulated emergent and null time series as the sum of an\\nSEIR-generated measles time series, and background noise generated by either\\nindependent draws from a Poisson distribution, or an SEIR simulation with\\nrubella-like parameters. We demonstrate that proactive outbreak detection with\\nEWS metrics is resilient to decreasing diagnostic accuracy, so long as\\nbackground infections remain proportionally low. Under situations with large,\\nepisodic, noise, imperfect diagnostic tests cannot appropriately discriminate\\nbetween emergent and null periods. Not all EWS metrics performed equally: we\\nfind that the mean was the least affected by changes to the noise structure and\\nmagnitude, given a moderately accurate diagnostic test (>= to 95% sensitive and\\nspecific), and the autocovariance and variance were the most predictive when\\nthe noise incidence did not exhibit large temporal variations. In these\\nsituations, diagnostic test accuracy should not be a precursor to the\\nimplementation of an EWS metric-based alert system.\", \"main_category\": \"q-bio.OT\", \"categories\": \"q-bio.OT\", \"published\": \"2025-04-15T16:22:58Z\"}"}
