{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15741v1\", \"title\": \"Stochastic Programming for Dynamic Temperature Control of Refrigerated\\n  Road Transport\", \"summary\": \"Temperature control in refrigerated delivery vehicles is critical for\\npreserving product quality, yet existing approaches neglect critical\\noperational uncertainties, such as stochastic door opening durations and\\nheterogeneous initial product temperatures. We propose a framework to optimize\\ncooling policies for refrigerated trucks on fixed routes by explicitly modeling\\nthese uncertainties while capturing all relevant thermodynamic interactions in\\nthe trailer. To this end, we integrate high-fidelity thermodynamic modeling\\nwith a multistage stochastic programming formulation and solve the resulting\\nproblem using stochastic dual dynamic programming. In cooperation with industry\\npartners and based on real-world data, we set up computational experiments that\\ndemonstrate that our stochastic policy consistently outperforms the best\\ndeterministic benchmark by 35% on average while being computationally\\ntractable. In a separate analysis, we show that by fixing the duration of\\ntemperature violations, our policy operates with up to $40$\\\\% less fuel than\\ndeterministic policies. Our results demonstrate that pallet-level thermal\\nstatus information is the single most crucial information in the problem and\\ncan be used to significantly reduce temperature violations. Knowledge of the\\ntiming and length of customer stops is the second most important factor and,\\ntogether with detailed modeling of thermodynamic interactions, can be used to\\nfurther significantly reduce violations. Our analysis of the optimal stochastic\\ncooling policy reveals that preemptive cooling before a stop is the key element\\nof an optimal policy. These findings highlight the value of sophisticated\\ncontrol strategies in maintaining the quality of perishable products while\\nreducing the carbon footprint of the industry and improving operational\\nefficiency.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC\", \"published\": \"2025-04-22T09:45:36Z\"}"}
