{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21456v1\", \"title\": \"Collisions with tidal disruption event disks: implications for\\n  quasi-periodic X-ray eruptions\", \"summary\": \"A popular class of models for interpreting quasi-periodic X-ray eruptions\\nfrom galactic nuclei (QPEs) invoke collisions between an object on an extreme\\nmass ratio inspiral (EMRI) and an accretion disk around a supermassive black\\nhole. There are strong links between QPE systems and those disks which formed\\nfollowing a tidal disruption event (TDE), and at least two events (AT2019qiz\\nand AT2022upj) are known to have occurred following an otherwise typical TDE.\\nWe show that the fact that these disks were formed following a TDE strongly\\nconstrains their properties, more so than previous models have assumed. Models\\nbased on steady-state AGN-like disks have mass contents which grow strongly\\nwith size $M_{\\\\rm disk}\\\\propto R_{\\\\rm out}^{7/2}$ and do not conserve the mass\\nor angular momentum of the disrupted star. A very different scaling must be\\nsatisfied by a TDE disk in order to conserve the disrupted stars angular\\nmomentum, $M_{\\\\rm disk} \\\\propto R_{\\\\rm out}^{-1/2}$. These constraints\\nsubstantially change the predicted scaling relationships between QPE\\nobservables (luminosity, duration, energy, temperature) and the QPE period.\\nThey also allow QPE observables to be written in terms of the properties of the\\ntwo stars assumed to be involved (the one tidally disrupted and the one on an\\nEMRI), making plausibility tests of these models possible. We show that these\\nmodifications to the disk structure imply that (i) QPEs cannot be powered by\\ncollisions between an orbiting black hole and a TDE disk, (ii) QPEs also cannot\\nbe powered by collisions between the surface of a stellar EMRI and a TDE disk.\\nA framework in which the collisions are between a TDE disk and a star which has\\npuffed up to fill its Hills sphere with a trailing debris stream (as seen in\\nrecent simulations) cannot be ruled out from the data, and should be the focus\\nof further study.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-30T09:23:21Z\"}"}
