{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04524v1\", \"title\": \"Edge-GPU Based Face Tracking for Face Detection and Recognition\\n  Acceleration\", \"summary\": \"Cost-effective machine vision systems dedicated to real-time and accurate\\nface detection and recognition in public places are crucial for many modern\\napplications. However, despite their high performance, which could be reached\\nusing specialized edge or cloud AI hardware accelerators, there is still room\\nfor improvement in throughput and power consumption. This paper aims to suggest\\na combined hardware-software approach that optimizes face detection and\\nrecognition systems on one of the latest edge GPUs, namely NVIDIA Jetson AGX\\nOrin. First, it leverages the simultaneous usage of all its hardware engines to\\nimprove processing time. This offers an improvement over previous works where\\nthese tasks were mainly allocated automatically and exclusively to the CPU or,\\nto a higher extent, to the GPU core. Additionally, the paper suggests\\nintegrating a face tracker module to avoid redundantly running the face\\nrecognition algorithm for every frame but only when a new face appears in the\\nscene. The results of extended experiments suggest that simultaneous usage of\\nall the hardware engines that are available in the Orin GPU and tracker\\nintegration into the pipeline yield an impressive throughput of 290 FPS (frames\\nper second) on 1920 x 1080 input size frames containing in average of 6\\nfaces/frame. Additionally, a substantial saving of power consumption of around\\n800 mW was achieved when compared to running the task on the CPU/GPU engines\\nonly and without integrating a tracker into the Orin GPU\\\\'92s pipeline. This\\nhardware-codesign approach can pave the way to design high-performance machine\\nvision systems at the edge, critically needed in video monitoring in public\\nplaces where several nearby cameras are usually deployed for a same scene.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AR,cs.LG,eess.IV\", \"published\": \"2025-05-07T15:57:53Z\"}"}
