{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17515v1\", \"title\": \"Mamba-Sea: A Mamba-based Framework with Global-to-Local Sequence\\n  Augmentation for Generalizable Medical Image Segmentation\", \"summary\": \"To segment medical images with distribution shifts, domain generalization\\n(DG) has emerged as a promising setting to train models on source domains that\\ncan generalize to unseen target domains. Existing DG methods are mainly based\\non CNN or ViT architectures. Recently, advanced state space models, represented\\nby Mamba, have shown promising results in various supervised medical image\\nsegmentation. The success of Mamba is primarily owing to its ability to capture\\nlong-range dependencies while keeping linear complexity with input sequence\\nlength, making it a promising alternative to CNNs and ViTs. Inspired by the\\nsuccess, in the paper, we explore the potential of the Mamba architecture to\\naddress distribution shifts in DG for medical image segmentation. Specifically,\\nwe propose a novel Mamba-based framework, Mamba-Sea, incorporating\\nglobal-to-local sequence augmentation to improve the model's generalizability\\nunder domain shift issues. Our Mamba-Sea introduces a global augmentation\\nmechanism designed to simulate potential variations in appearance across\\ndifferent sites, aiming to suppress the model's learning of domain-specific\\ninformation. At the local level, we propose a sequence-wise augmentation along\\ninput sequences, which perturbs the style of tokens within random continuous\\nsub-sequences by modeling and resampling style statistics associated with\\ndomain shifts. To our best knowledge, Mamba-Sea is the first work to explore\\nthe generalization of Mamba for medical image segmentation, providing an\\nadvanced and promising Mamba-based architecture with strong robustness to\\ndomain shifts. Remarkably, our proposed method is the first to surpass a Dice\\ncoefficient of 90% on the Prostate dataset, which exceeds previous SOTA of\\n88.61%. The code is available at https://github.com/orange-czh/Mamba-Sea.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-24T12:57:25Z\"}"}
