{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21438v1\", \"title\": \"Wasserstein-Aitchison GAN for angular measures of multivariate extremes\", \"summary\": \"Economically responsible mitigation of multivariate extreme risks -- extreme\\nrainfall in a large area, huge variations of many stock prices, widespread\\nbreakdowns in transportation systems -- requires estimates of the probabilities\\nthat such risks will materialize in the future. This paper develops a new\\nmethod, Wasserstein--Aitchison Generative Adversarial Networks (WA-GAN), which\\nprovides simulated values of future $d$-dimensional multivariate extreme events\\nand which hence can be used to give estimates of such probabilities. The main\\nhypothesis is that, after transforming the observations to the unit-Pareto\\nscale, their distribution is regularly varying in the sense that the\\ndistributions of their radial and angular components (with respect to the\\n$L_1$-norm) converge and become asymptotically independent as the radius gets\\nlarge. The method is a combination of standard extreme value analysis modeling\\nof the tails of the marginal distributions with nonparametric GAN modeling of\\nthe angular distribution. For the latter, the angular values are transformed to\\nAitchison coordinates in a full $(d-1)$-dimensional linear space, and a\\nWasserstein GAN is trained on these coordinates and used to generate new\\nvalues. A reverse transformation is then applied to these values and gives\\nsimulated values on the original data scale. The method shows good performance\\ncompared to other existing methods in the literature, both in terms of\\ncapturing the dependence structure of the extremes in the data, as well as in\\ngenerating accurate new extremes of the data distribution. The comparison is\\nperformed on simulated multivariate extremes from a logistic model in\\ndimensions up to 50 and on a 30-dimensional financial data set.\", \"main_category\": \"stat.ML\", \"categories\": \"stat.ML,cs.LG\", \"published\": \"2025-04-30T08:54:28Z\"}"}
