{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00619v1\", \"title\": \"Diverse Semantics-Guided Feature Alignment and Decoupling for\\n  Visible-Infrared Person Re-Identification\", \"summary\": \"Visible-Infrared Person Re-Identification (VI-ReID) is a challenging task due\\nto the large modality discrepancy between visible and infrared images, which\\ncomplicates the alignment of their features into a suitable common space.\\nMoreover, style noise, such as illumination and color contrast, reduces the\\nidentity discriminability and modality invariance of features. To address these\\nchallenges, we propose a novel Diverse Semantics-guided Feature Alignment and\\nDecoupling (DSFAD) network to align identity-relevant features from different\\nmodalities into a textual embedding space and disentangle identity-irrelevant\\nfeatures within each modality. Specifically, we develop a Diverse\\nSemantics-guided Feature Alignment (DSFA) module, which generates pedestrian\\ndescriptions with diverse sentence structures to guide the cross-modality\\nalignment of visual features. Furthermore, to filter out style information, we\\npropose a Semantic Margin-guided Feature Decoupling (SMFD) module, which\\ndecomposes visual features into pedestrian-related and style-related\\ncomponents, and then constrains the similarity between the former and the\\ntextual embeddings to be at least a margin higher than that between the latter\\nand the textual embeddings. Additionally, to prevent the loss of pedestrian\\nsemantics during feature decoupling, we design a Semantic Consistency-guided\\nFeature Restitution (SCFR) module, which further excavates useful information\\nfor identification from the style-related features and restores it back into\\nthe pedestrian-related features, and then constrains the similarity between the\\nfeatures after restitution and the textual embeddings to be consistent with\\nthat between the features before decoupling and the textual embeddings.\\nExtensive experiments on three VI-ReID datasets demonstrate the superiority of\\nour DSFAD.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-01T15:55:38Z\"}"}
