{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11022v1\", \"title\": \"Meta-learning For Few-Shot Time Series Crop Type Classification: A\\n  Benchmark On The EuroCropsML Dataset\", \"summary\": \"Spatial imbalances in crop type data pose significant challenges for accurate\\nclassification in remote sensing applications. Algorithms aiming at\\ntransferring knowledge from data-rich to data-scarce tasks have thus surged in\\npopularity. However, despite their effectiveness in previous evaluations, their\\nperformance in challenging real-world applications is unclear and needs to be\\nevaluated. This study benchmarks transfer learning and several meta-learning\\nalgorithms, including (First-Order) Model-Agnostic Meta-Learning ((FO)-MAML),\\nAlmost No Inner Loop (ANIL), and Task-Informed Meta-Learning (TIML), on the\\nreal-world EuroCropsML time series dataset, which combines farmer-reported crop\\ndata with Sentinel-2 satellite observations from Estonia, Latvia, and Portugal.\\nOur findings indicate that MAML-based meta-learning algorithms achieve slightly\\nhigher accuracy compared to simpler transfer learning methods when applied to\\ncrop type classification tasks in Estonia after pre-training on data from\\nLatvia. However, this improvement comes at the cost of increased computational\\ndemands and training time. Moreover, we find that the transfer of knowledge\\nbetween geographically disparate regions, such as Estonia and Portugal, poses\\nsignificant challenges to all investigated algorithms. These insights\\nunderscore the trade-offs between accuracy and computational resource\\nrequirements in selecting machine learning methods for real-world crop type\\nclassification tasks and highlight the difficulties of transferring knowledge\\nbetween different regions of the Earth. To facilitate future research in this\\ndomain, we present the first comprehensive benchmark for evaluating transfer\\nand meta-learning methods for crop type classification under real-world\\nconditions. The corresponding code is publicly available at\\nhttps://github.com/dida-do/eurocrops-meta-learning.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.CV\", \"published\": \"2025-04-15T09:47:57Z\"}"}
