{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06807v1\", \"title\": \"Evaluating amyloid-beta as a surrogate endpoint in trials of\\n  anti-amyloid drugs in Alzheimer's disease: a Bayesian meta-analysis\", \"summary\": \"The use of amyloid-beta (A$\\\\beta$) clearance to support regulatory approvals\\nof drugs in Alzheimer's disease (AD) remains controversial. We evaluate\\nA$\\\\beta$ as a potential trial-level surrogate endpoint for clinical function in\\nAD using a meta-analysis. Randomised controlled trials (RCTs) reporting data on\\nthe effectiveness of anti- A$\\\\beta$ monoclonal antibodies (MABs) on A$\\\\beta$\\nand clinical outcomes were identified through a literature review. A Bayesian\\nbivariate meta-analysis was used to evaluate surrogate relationships between\\nthe treatment effects on A$\\\\beta$ and clinical function, with the intercept,\\nslope and variance quantifying the trial level association. The analysis was\\nperformed using RCT data both collectively across all MABs and separately for\\neach MAB through subgroup analysis. The latter analysis was extended by\\napplying Bayesian hierarchical models to borrow information across treatments.\\nWe identified 23 RCTs with 39 treatment contrasts for seven MABs. The\\nassociation between treatment effects on A$\\\\beta$ and Clinical Dementia Rating\\n- Sum of Boxes (CDR-SOB) across all MABs was strong: with intercept of -0.03\\n(95% credible intervals: -0.16, 0.11), slope of 1.41 (0.60, 2.21) and variance\\nof 0.02 (0.00, 0.05). For individual treatments, the surrogate relationships\\nwere suboptimal, displaying large uncertainty. The use of hierarchical models\\nconsiderably reduced the uncertainty around key parameters, narrowing the\\nintervals for the slopes by an average of 71% (range: 51%-95%) and for the\\nvariances by 28% (7%-65%). Our results suggest that A$\\\\beta$ is a potential\\nsurrogate endpoint for CDR-SOB when assuming a common surrogate relationship\\nacross all MABs. When allowing for information-sharing, the surrogate\\nrelationships improved, but only for lecanemab and aducanumab was the\\nimprovement sufficient to support a surrogate relationship.\", \"main_category\": \"stat.AP\", \"categories\": \"stat.AP\", \"published\": \"2025-04-09T11:55:05Z\"}"}
