{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02360v1\", \"title\": \"On graded going-down domains, II\", \"summary\": \"In this paper we consider the graded going-down property of graded integral\\ndomains in pullbacks. It then enables us to give original examples of these\\ndomains.\", \"main_category\": \"math.AC\", \"categories\": \"math.AC\", \"published\": \"2025-04-03T07:51:21Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02376v1\", \"title\": \"An Efficient Reservation Protocol for Medium Access: When Tree Splitting\\n  Meets Reinforcement Learning\", \"summary\": \"As an enhanced version of massive machine-type communication in 5G, massive\\ncommunication has emerged as one of the six usage scenarios anticipated for 6G,\\nowing to its potential in industrial internet-of-things and smart metering.\\nDriven by the need for random multiple-access (RMA) in massive communication,\\nas well as, next-generation Wi-Fi, medium access control has attracted\\nconsiderable recent attention. Holding the promise of attaining\\nbandwidth-efficient collision resolution, multiaccess reservation no doubt\\nplays a central role in RMA, e.g., the distributed coordination function (DCF)\\nin IEEE 802.11. In this paper, we are interested in maximizing the bandwidth\\nefficiency of reservation protocols for RMA under quality-of-service\\nconstraints. Particularly, we present a tree splitting based reservation\\nscheme, in which the attempting probability is dynamically optimized by\\npartially observable Markov decision process or reinforcement learning (RL).\\nThe RL-empowered tree-splitting algorithm guarantees that all these terminals\\nwith backlogged packets at the beginning of a contention cycle can be\\nscheduled, thereby providing a first-in-first-out service. More importantly, it\\nsubstantially reduces the reservation bandwidth determined by the communication\\ncomplexity of DCF, through judiciously conceived coding and interaction for\\nexchanging information required by distributed ordering. Simulations\\ndemonstrate that the proposed algorithm outperforms the CSMA/CA based DCF in\\nIEEE 802.11.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-04-03T08:10:25Z\"}"}
