{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17491v1\", \"title\": \"On the robustness of the emergent spatiotemporal dynamics in\\n  biophysically realistic and phenomenological whole-brain models at multiple\\n  network resolutions\", \"summary\": \"The human brain is a complex dynamical system which displays a wide range of\\nmacroscopic and mesoscopic patterns of neural activity, whose mechanistic\\norigin remains poorly understood. Whole-brain modelling allows us to explore\\ncandidate mechanisms causing the observed patterns. However, it is not fully\\nestablished how the choice of model type and the networks' resolution influence\\nthe simulation results, hence, it remains unclear, to which extent conclusions\\ndrawn from these results are limited by modelling artefacts. Here, we compare\\nthe dynamics of a biophysically realistic, linear-nonlinear cascade model of\\nwhole-brain activity with a phenomenological Wilson-Cowan model using three\\nstructural connectomes based on the Schaefer parcellation scheme with 100, 200,\\nand 500 nodes. Both neural mass models implement the same mechanistic\\nhypotheses, which specifically address the interaction between excitation,\\ninhibition, and a slow adaptation current, which affects the excitatory\\npopulations. We quantify the emerging dynamical states in detail and\\ninvestigate how consistent results are across the different model variants.\\nThen we apply both model types to the specific phenomenon of slow oscillations,\\nwhich are a prevalent brain rhythm during deep sleep. We investigate the\\nconsistency of model predictions when exploring specific mechanistic hypotheses\\nabout the effects of both short- and long-range connections and of the\\nantero-posterior structural connectivity gradient on key properties of these\\noscillations. Overall, our results demonstrate that the coarse-grained dynamics\\nare robust to changes in both model type and network resolution. In some cases,\\nhowever, model predictions do not generalize. Thus, some care must be taken\\nwhen interpreting model results.\", \"main_category\": \"q-bio.NC\", \"categories\": \"q-bio.NC,nlin.AO\", \"published\": \"2025-04-24T12:32:40Z\"}"}
