{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21358v1\", \"title\": \"A comparative study of deep learning and ensemble learning to extend the\\n  horizon of traffic forecasting\", \"summary\": \"Traffic forecasting is vital for Intelligent Transportation Systems, for\\nwhich Machine Learning (ML) methods have been extensively explored to develop\\ndata-driven Artificial Intelligence (AI) solutions. Recent research focuses on\\nmodelling spatial-temporal correlations for short-term traffic prediction,\\nleaving the favourable long-term forecasting a challenging and open issue. This\\npaper presents a comparative study on large-scale real-world signalized\\narterials and freeway traffic flow datasets, aiming to evaluate promising ML\\nmethods in the context of large forecasting horizons up to 30 days. Focusing on\\nmodelling capacity for temporal dynamics, we develop one ensemble ML method,\\neXtreme Gradient Boosting (XGBoost), and a range of Deep Learning (DL) methods,\\nincluding Recurrent Neural Network (RNN)-based methods and the state-of-the-art\\nTransformer-based method. Time embedding is leveraged to enhance their\\nunderstanding of seasonality and event factors. Experimental results highlight\\nthat while the attention mechanism/Transformer framework is effective for\\ncapturing long-range dependencies in sequential data, as the forecasting\\nhorizon extends, the key to effective traffic forecasting gradually shifts from\\ntemporal dependency capturing to periodicity modelling. Time embedding is\\nparticularly effective in this context, helping naive RNN outperform Informer\\nby 31.1% for 30-day-ahead forecasting. Meanwhile, as an efficient and robust\\nmodel, XGBoost, while learning solely from time features, performs\\ncompetitively with DL methods. Moreover, we investigate the impacts of various\\nfactors like input sequence length, holiday traffic, data granularity, and\\ntraining data size. The findings offer valuable insights and serve as a\\nreference for future long-term traffic forecasting research and the improvement\\nof AI's corresponding learning capabilities.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-30T06:31:21Z\"}"}
