{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21730v1\", \"title\": \"Cert-SSB: Toward Certified Sample-Specific Backdoor Defense\", \"summary\": \"Deep neural networks (DNNs) are vulnerable to backdoor attacks, where an\\nattacker manipulates a small portion of the training data to implant hidden\\nbackdoors into the model. The compromised model behaves normally on clean\\nsamples but misclassifies backdoored samples into the attacker-specified target\\nclass, posing a significant threat to real-world DNN applications. Currently,\\nseveral empirical defense methods have been proposed to mitigate backdoor\\nattacks, but they are often bypassed by more advanced backdoor techniques. In\\ncontrast, certified defenses based on randomized smoothing have shown promise\\nby adding random noise to training and testing samples to counteract backdoor\\nattacks. In this paper, we reveal that existing randomized smoothing defenses\\nimplicitly assume that all samples are equidistant from the decision boundary.\\nHowever, it may not hold in practice, leading to suboptimal certification\\nperformance. To address this issue, we propose a sample-specific certified\\nbackdoor defense method, termed Cert-SSB. Cert-SSB first employs stochastic\\ngradient ascent to optimize the noise magnitude for each sample, ensuring a\\nsample-specific noise level that is then applied to multiple poisoned training\\nsets to retrain several smoothed models. After that, Cert-SSB aggregates the\\npredictions of multiple smoothed models to generate the final robust\\nprediction. In particular, in this case, existing certification methods become\\ninapplicable since the optimized noise varies across different samples. To\\nconquer this challenge, we introduce a storage-update-based certification\\nmethod, which dynamically adjusts each sample's certification region to improve\\ncertification performance. We conduct extensive experiments on multiple\\nbenchmark datasets, demonstrating the effectiveness of our proposed method. Our\\ncode is available at https://github.com/NcepuQiaoTing/Cert-SSB.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.AI,cs.CV,cs.LG\", \"published\": \"2025-04-30T15:21:25Z\"}"}
