{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03556v1\", \"title\": \"A Comprehensive Survey of Large AI Models for Future Communications:\\n  Foundations, Applications and Challenges\", \"summary\": \"The 6G wireless communications aim to establish an intelligent world of\\nubiquitous connectivity, providing an unprecedented communication experience.\\nLarge artificial intelligence models (LAMs) are characterized by significantly\\nlarger scales (e.g., billions or trillions of parameters) compared to typical\\nartificial intelligence (AI) models. LAMs exhibit outstanding cognitive\\nabilities, including strong generalization capabilities for fine-tuning to\\ndownstream tasks, and emergent capabilities to handle tasks unseen during\\ntraining. Therefore, LAMs efficiently provide AI services for diverse\\ncommunication applications, making them crucial tools for addressing complex\\nchallenges in future wireless communication systems. This study provides a\\ncomprehensive review of the foundations, applications, and challenges of LAMs\\nin communication. First, we introduce the current state of AI-based\\ncommunication systems, emphasizing the motivation behind integrating LAMs into\\ncommunications and summarizing the key contributions. We then present an\\noverview of the essential concepts of LAMs in communication. This includes an\\nintroduction to the main architectures of LAMs, such as transformer, diffusion\\nmodels, and mamba. We also explore the classification of LAMs, including large\\nlanguage models (LLMs), large vision models (LVMs), large multimodal models\\n(LMMs), and world models, and examine their potential applications in\\ncommunication. Additionally, we cover the training methods and evaluation\\ntechniques for LAMs in communication systems. Lastly, we introduce optimization\\nstrategies such as chain of thought (CoT), retrieval augmented generation\\n(RAG), and agentic systems. Following this, we discuss the research\\nadvancements of LAMs across various communication scenarios. Finally, we\\nanalyze the challenges in the current research and provide insights into\\npotential future research directions.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-05-06T14:09:29Z\"}"}
