{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00541v1\", \"title\": \"KnowEEG: Explainable Knowledge Driven EEG Classification\", \"summary\": \"Electroencephalography (EEG) is a method of recording brain activity that\\nshows significant promise in applications ranging from disease classification\\nto emotion detection and brain-computer interfaces. Recent advances in deep\\nlearning have improved EEG classification performance yet model explainability\\nremains an issue. To address this key limitation of explainability we introduce\\nKnowEEG; a novel explainable machine learning approach for EEG classification.\\nKnowEEG extracts a comprehensive set of per-electrode features, filters them\\nusing statistical tests, and integrates between-electrode connectivity\\nstatistics. These features are then input to our modified Random Forest model\\n(Fusion Forest) that balances per electrode statistics with between electrode\\nconnectivity features in growing the trees of the forest. By incorporating\\nknowledge from both the generalized time-series and EEG-specific domains,\\nKnowEEG achieves performance comparable to or exceeding state-of-the-art deep\\nlearning models across five different classification tasks: emotion detection,\\nmental workload classification, eyes open/closed detection, abnormal EEG\\nclassification, and event detection. In addition to high performance, KnowEEG\\nprovides inherent explainability through feature importance scores for\\nunderstandable features. We demonstrate by example on the eyes closed/open\\nclassification task that this explainability can be used to discover knowledge\\nabout the classes. This discovered knowledge for eyes open/closed\\nclassification was proven to be correct by current neuroscience literature.\\nTherefore, the impact of KnowEEG will be significant for domains where EEG\\nexplainability is critical such as healthcare.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-05-01T14:05:55Z\"}"}
