{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02551v1\", \"title\": \"Human-Centered Development of an Explainable AI Framework for Real-Time\\n  Surgical Risk Surveillance\", \"summary\": \"Background: Artificial Intelligence (AI) clinical decision support (CDS)\\nsystems have the potential to augment surgical risk assessments, but successful\\nadoption depends on an understanding of end-user needs and current workflows.\\nThis study reports the initial co-design of MySurgeryRisk, an AI CDS tool to\\npredict the risk of nine post-operative complications in surgical patients.\\nMethods: Semi-structured focus groups and interviews were held as co-design\\nsessions with perioperative physicians at a tertiary academic hospital in the\\nSoutheastern United States. Participants were read a surgical vignette and\\nasked questions to elicit an understanding of their current decision-making\\npractices before being introduced to the MySurgeryRisk prototype web interface.\\nThey were asked to provide feedback on the user interface and system features.\\nSession transcripts were qualitatively coded, after which thematic analysis\\ntook place. Results: Data saturation was reached after 20 surgeons and\\nanesthesiologists from varying career stages participated across 11 co-design\\nsessions. Thematic analysis resulted in five themes: (1) decision-making\\ncognitive processes, (2) current approach to decision-making, (3) future\\napproach to decision-making with MySurgeryRisk, (4) feedback on current\\nMySurgeryRisk prototype, and (5) trustworthy considerations. Conclusion:\\nClinical providers perceived MySurgeryRisk as a promising CDS tool that factors\\nin a large volume of data and is computed in real-time without any need for\\nmanual input. Participants provided feedback on the design of the interface and\\nimaged applications of the tool in the clinical workflow. However, its\\nsuccessful implementation will depend on its actionability and explainability\\nof model outputs, integration into current electronic systems, and calibration\\nof trust among end-users.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-03T13:05:46Z\"}"}
