{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05041v1\", \"title\": \"ADNP-15: An Open-Source Histopathological Dataset for Neuritic Plaque\\n  Segmentation in Human Brain Whole Slide Images with Frequency Domain Image\\n  Enhancement for Stain Normalization\", \"summary\": \"Alzheimer's Disease (AD) is a neurodegenerative disorder characterized by\\namyloid-beta plaques and tau neurofibrillary tangles, which serve as key\\nhistopathological features. The identification and segmentation of these\\nlesions are crucial for understanding AD progression but remain challenging due\\nto the lack of large-scale annotated datasets and the impact of staining\\nvariations on automated image analysis. Deep learning has emerged as a powerful\\ntool for pathology image segmentation; however, model performance is\\nsignificantly influenced by variations in staining characteristics,\\nnecessitating effective stain normalization and enhancement techniques. In this\\nstudy, we address these challenges by introducing an open-source dataset\\n(ADNP-15) of neuritic plaques (i.e., amyloid deposits combined with a crown of\\ndystrophic tau-positive neurites) in human brain whole slide images. We\\nestablish a comprehensive benchmark by evaluating five widely adopted deep\\nlearning models across four stain normalization techniques, providing deeper\\ninsights into their influence on neuritic plaque segmentation. Additionally, we\\npropose a novel image enhancement method that improves segmentation accuracy,\\nparticularly in complex tissue structures, by enhancing structural details and\\nmitigating staining inconsistencies. Our experimental results demonstrate that\\nthis enhancement strategy significantly boosts model generalization and\\nsegmentation accuracy. All datasets and code are open-source, ensuring\\ntransparency and reproducibility while enabling further advancements in the\\nfield.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.CV\", \"published\": \"2025-05-08T08:25:44Z\"}"}
