{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20502v1\", \"title\": \"Laser-induced modulation of the ferromagnetic-antiferromagnetic phase\\n  fraction in FeRh films\", \"summary\": \"With his huge entropy change and a strong interplay between magnetic order,\\nstructural and electrical properties, the first-order\\nantiferromagnetic/ferromagnetic phase transition is a paradigmatic example of\\nthe multicaloric effect. The unraveling of the physics underlying the phase\\ntransition needs a better understanding of the thermal hysteresis of FeRh\\nwithin the AF-FM phase coexistence region. In this work, we compare the effect\\nof two very different types of thermal cycling on the hysteresis of the\\nmagnetic order: quasi-static heating, and cooling of the entire 195 nm thick\\nfilm, and a f =100 kHz modulated heating driven by a laser focused down to a\\nspot of about ten micron squared at the film surface. Taking advantage of the\\nreflectivity difference between both phases to probe optically their respective\\nfraction, we show that whereas only temperature-driven reflectivity variations\\n(dR/dT , thermoreflectance) are detected in the pure phases, a huge modulation\\nof the phase-dependent reflectance at the driving frequency f is detected in\\nthe phase coexistence temperature range. This is quantitatively described as\\nresulting from a substantial modulation of the FM fraction (up to 90%) with\\nincreasing laser power. A simplified rate-independent hysteresis model with\\nreturn-point-memory (RPM), represented in terms of bistable units that undergo\\na temperature excursion corresponding to a given laser power, reproduces very\\nwell the optically measured FM phase modulation characteristics for a broad\\nrange of temperature excursions. This offers an insight into the leading role\\nof quenched disorder in defining thermal hysteresis in FeRh under high\\nexcitation frequency, when the material is periodically driven\\nout-of-equilibrium.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-29T07:44:29Z\"}"}
