{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11235v1\", \"title\": \"Guided Wave-Based Structural Awareness Under Varying Operating States\\n  via Manifold Representations\", \"summary\": \"Guided wave-based structural health monitoring (SHM) remains a powerful\\nstrategy for identifying early-stage defects and safeguarding vital aerospace\\nstructures. Yet, its practical use is often hindered by the enormous,\\nhigh-dimensional data streams produced by sensor arrays operating at megahertz\\nsampling rates, coupled with the added complexity of shifts in environmental\\nand operational conditions (EOCs). Studies have explored various\\ndata-compression approaches that retain critical diagnostic details in a\\nlower-dimensional latent space. While conventional techniques can streamline\\ndimensionality to some extent, they do not always capture the nonlinear\\ninteractions typical of guided waves. Manifold learning, as illustrated by\\nDiffusion Maps, tackles these nonlinearities by deriving low-dimensional\\nembeddings directly from wave signals, minimizing the need for manual feature\\nextraction. In parallel, developments in deep learning -- particularly\\nautoencoders -- provide an encoder-decoder model for both data compression and\\nreconstruction. Convolutional autoencoders (CAEs) and variational autoencoders\\n(VAEs) have been particularly effective for guided wave applications. However,\\ncurrent methods can still struggle to maintain accurate state estimation under\\nchanging EOCs, and they are often limited to a single task. In response, the\\nproposed framework adopts a two-fold strategy: it compresses high-dimensional\\nsignals into lower-dimensional representations and then leverages those\\nrepresentations to both estimate structural states and reconstruct the original\\ndata, even as conditions vary. Applied to two real-world SHM use-cases, this\\nintegrated method has proven its ability to preserve and retrieve key damage\\nsignatures under noise, shifting operational parameters, and other complicating\\nfactors.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-15T14:38:30Z\"}"}
