{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11973v1\", \"title\": \"Probing the cold nature of dark matter\", \"summary\": \"A pressureless dark matter component fits well with several cosmological\\nobservations. However, there are indications that cold dark matter may\\nencounter challenges in explaining observations at small scales, particularly\\nat galactic scales. Observational data suggest that dark matter models\\nincorporating a pressure component could provide solutions to these small-scale\\nproblems. In this work, we investigate the possibility that present-day dark\\nmatter may result from a decaying non-cold dark matter sector transitioning\\ninto the dark energy sector. As the sensitivity of astronomical surveys rapidly\\nincreases, we explore an interacting scenario between dark energy and non-cold\\ndark matter, where dark energy has a constant equation of state ($w_{\\\\rm de}$),\\nand dark matter, being non-cold, also has a constant (non-zero) equation of\\nstate ($w_{\\\\rm dm}$). Considering the phantom and quintessence nature of dark\\nenergy, characterized by its equation of state, we separately analyze\\ninteracting phantom and interacting quintessence scenarios. We constrain these\\nscenarios using Cosmic Microwave Background (CMB) measurements and their\\ncombination with external probes, such as DESI-BAO and PantheonPlus. From our\\nanalyses, we find that a very mild preference for non-cold dark matter cannot\\nbe excluded based on the employed datasets. Additionally, for some datasets,\\nthere is a pronounced preference for the presence of an interaction at more\\nthan 95\\\\% confidence level (CL). Moreover, when the dark energy equation of\\nstate lies in the phantom regime, the $S_8$ tension can be alleviated. This\\nstudy suggests that cosmological models incorporating a non-cold dark matter\\ncomponent should be considered as viable scenarios with novel phenomenological\\nimplications, as reflected in the present work.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,gr-qc\", \"published\": \"2025-04-16T11:10:56Z\"}"}
