{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00345v1\", \"title\": \"Denoising weak lensing mass maps with diffusion model: systematic\\n  comparison with generative adversarial network\", \"summary\": \"(abridged) Weak gravitational lensing (WL) is the unique and powerful probe\\ninto the large-scale structures of the Universe. Removing the shape noise from\\nthe observed WL field, i.e., denoising, enhances the potential of WL by\\naccessing information at small scales where the shape noise dominates without\\ndenoising. We utilise two machine learning (ML) models for denosing: generative\\nadversarial network (GAN) and diffusion model (DM). We evaluate the performance\\nof denosing with GAN and DM utilising the large suite of mock WL observations,\\nwhich serve as the training and test data sets. We apply denoising to 1,000\\nmaps with GAN and DM models trained with 39,000 mock observations. Both models\\ncan fairly well reproduce the true convergence map on large scales. Then, we\\nmeasure cosmological statistics: power spectrum, bispectrum, one-point\\nprobability distribution function, peak and minima counts, and scattering\\ntransform coefficients. We find that DM outperforms GAN in almost all\\nstatistics and recovers the correct statistics down to small scales within\\nroughly $0.3 \\\\sigma$ level at the scales accessible from current and future WL\\nsurveys. We also conduct the stress tests on the trained model; denoising the\\nmaps with different characteristics, e.g., different source redshifts, from the\\ndata used in training. The performance degrades at small scales, but the\\nstatistics can still be recovered at large scales. Though the training of DM is\\nmore computationally demanding compared with GAN, there are several advantages:\\nnumerically stable training, higher performance in the reconstruction of\\ncosmological statistics, and sampling multiple realisations once the model is\\ntrained. It has been known that DM can generate higher-quality images in\\nreal-world problems than GAN, the superiority has been confirmed as well in the\\nWL denoising problem.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-05-01T06:45:50Z\"}"}
