{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24115v1\", \"title\": \"TeleAntiFraud-28k: A Audio-Text Slow-Thinking Dataset for Telecom Fraud\\n  Detection\", \"summary\": \"The detection of telecom fraud faces significant challenges due to the lack\\nof high-quality multimodal training data that integrates audio signals with\\nreasoning-oriented textual analysis. To address this gap, we present\\nTeleAntiFraud-28k, the first open-source audio-text slow-thinking dataset\\nspecifically designed for automated telecom fraud analysis. Our dataset is\\nconstructed through three strategies: (1) Privacy-preserved text-truth sample\\ngeneration using automatically speech recognition (ASR)-transcribed call\\nrecordings (with anonymized original audio), ensuring real-world consistency\\nthrough text-to-speech (TTS) model regeneration; (2) Semantic enhancement via\\nlarge language model (LLM)-based self-instruction sampling on authentic ASR\\noutputs to expand scenario coverage; (3) Multi-agent adversarial synthesis that\\nsimulates emerging fraud tactics through predefined communication scenarios and\\nfraud typologies. The generated dataset contains 28,511 rigorously processed\\nspeech-text pairs, complete with detailed annotations for fraud reasoning. The\\ndataset is divided into three tasks: scenario classification, fraud detection,\\nfraud type classification. Furthermore, we construct TeleAntiFraud-Bench, a\\nstandardized evaluation benchmark comprising proportionally sampled instances\\nfrom the dataset, to facilitate systematic testing of model performance on\\ntelecom fraud detection tasks. We also contribute a production-optimized\\nsupervised fine-tuning (SFT) model trained on hybrid real/synthetic data, while\\nopen-sourcing the data processing framework to enable community-driven dataset\\nexpansion. This work establishes a foundational framework for multimodal\\nanti-fraud research while addressing critical challenges in data privacy and\\nscenario diversity. The project will be released at\\nhttps://github.com/JimmyMa99/TeleAntiFraud.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.MM\", \"published\": \"2025-03-31T14:06:17Z\"}"}
