{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04148v1\", \"title\": \"Energy Efficient RSMA-Based LEO Satellite Communications Assisted by\\n  UAV-Mounted BD-Active RIS: A DRL Approach\", \"summary\": \"This paper proposes an advanced non-terrestrial communication architecture\\nthat integrates Rate-Splitting Multiple Access (RSMA) with a Beyond-Diagonal\\nActive Reconfigurable Intelligent Surface (BD-ARIS) mounted on a UAV under the\\ncoverage of a Low Earth Orbit (LEO) satellite. The BD-ARIS adopts a\\ngroup-connected structure to enhance signal amplification and adaptability,\\nwhile RSMA enables efficient multi-user access by dividing messages into common\\nand private components. The system jointly optimizes satellite beamforming, UAV\\npositioning, power allocation, and rate-splitting ratios to maximize the\\noverall energy efficiency (EE). To solve the resulting non-convex and\\nhigh-dimensional problem, we employ three state-of-the-art deep reinforcement\\nlearning (DRL) algorithms: Trust Region Policy Optimization (TRPO), Twin\\nDelayed Deep Deterministic Policy Gradient (TD3), and Asynchronous Advantage\\nActor-Critic (A3C). Moreover, realistic models for the power consumption of\\nboth the UAV and the BD-ARIS are considered. Simulation results reveal that\\nTRPO consistently achieves the best performance in terms of EE and sum rate,\\nespecially under high transmit powers and challenging deployment scenarios. TD3\\nconverges faster and performs competitively in moderate settings, while A3C\\nsuffers from instability due to its high variance. Additionally, the robustness\\nof each algorithm under channel state information (CSI) uncertainty is\\nevaluated, confirming TRPO resilience to imperfect observations. Overall, the\\nproposed RSMA-BD-ARIS framework significantly outperforms conventional\\nRIS-assisted designs and provides a scalable, energy-efficient solution for 6G\\nand massive IoT applications in non-terrestrial networks.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP,cs.SY,eess.SY\", \"published\": \"2025-05-07T05:58:31Z\"}"}
