{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03458v1\", \"title\": \"The classification of Alzheimer's disease and mild cognitive impairment\\n  improved by dynamic functional network analysis\", \"summary\": \"Brain network analysis using functional MRI has advanced our understanding of\\ncortical activity and its changes in neurodegenerative disorders that cause\\ndementia. Recently, research in brain connectivity has focused on dynamic\\n(time-varying) brain networks that capture both spatial and temporal\\ninformation on cortical, regional co-activity patterns. However, this approach\\nhas been largely unexplored within the Alzheimer's spectrum. We analysed age-\\nand sex-matched static and dynamic fMRI brain networks from 315 individuals\\nwith Alzheimer's Disease (AD), Mild Cognitive Impairment (MCI), and\\ncognitively-normal Healthy Elderly (HE), using data from the ADNI-3 protocol.\\nWe examined both similarities and differences between these groups, employing\\nthe Juelich brain atlas for network nodes, sliding-window correlations for\\ntime-varying network links, and non-parametric statistics to assess\\nbetween-group differences at the link or the node centrality level. While the\\nHE and MCI groups show similar static and dynamic networks at the link level,\\nsignificant differences emerge compared to AD participants. We found stable\\n(stationary) differences in patterns of functional connections between the\\nwhite matter regions and the parietal lobe's, and somatosensory cortices, while\\nmetastable (temporal) networks' differences were consistently found between the\\namygdala and hippocampal formation. In addition, our node centrality analysis\\nshowed that the white matter connectivity patterns are local in nature. Our\\nresults highlight shared and unique functional connectivity patterns in both\\nstationary and dynamic functional networks, emphasising the need to include\\ndynamic information in brain network analysis in studies of Alzheimer's\\nspectrum.\", \"main_category\": \"q-bio.NC\", \"categories\": \"q-bio.NC,q-bio.QM\", \"published\": \"2025-05-06T11:57:06Z\"}"}
