{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20037v1\", \"title\": \"Polarization of light from fast rotating Wolf-Rayet stars: A Monte Carlo\\n  simulations compared to analytical formula\", \"summary\": \"Fast-rotating Wolf-Rayet (WR) stars are potential progenitors of long\\ngamma-ray bursts, but observational verification is challenging. Spectral lines\\nfrom their expanding stellar wind obscure accurate rotational velocity\\nmeasurements. Intrinsic polarization from wind rotation may help determine\\nrotational speeds, requiring precise wind models. Our study aims to investigate\\nthe intrinsic polarization due to the rotational distortion of WR winds\\nconsidering multiple scattering of photons and compare it to a\\nsingle-scattering model, where we use an analytical expression of the\\npolarization. We study the polarization signatures resulting from the prolate\\nstructure of rotating winds of two WR stars using a 3D Monte Carlo radiative\\ntransfer code Hyperion. We estimated the intrinsic polarization resulting from\\nmultiple scattering in WR winds for different rotational velocities,\\ninclination angles, and mass-loss rates. Our results indicate that at a\\nrotation rate of less than 50 % of the critical rate, the intrinsic\\npolarization from multiple scattering is close to that of a single scattering\\nmodel. However, at higher rotation velocities, the polarization from multiple\\nscattering increases with inclination up to 40$^\\\\circ$, while it decreases for\\ninclinations higher than about 60$^\\\\circ$. This dependence is inconsistent with\\nthe single-scattering model. We also discuss the effect of the mass-loss rate\\non the polarization and find that the polarization changes linearly with the\\nmass-loss rate. However, it is important to note that the relationship between\\npolarization and mass-loss rate may vary for different types of stars. The\\nresults have implications for future studies of stellar winds and mass loss and\\nmay help to improve our understanding of the complex environments of massive\\nstars. Our research offers valuable information on the complex polarization\\npatterns observed in stellar winds.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.HE\", \"published\": \"2025-04-28T17:58:19Z\"}"}
