{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12037v1\", \"title\": \"Integrating Neural Networks and Tensor Networks for Computing Free\\n  Energy\", \"summary\": \"Computing free energy is a fundamental problem in statistical physics.\\nRecently, two distinct methods have been developed and have demonstrated\\nremarkable success: the tensor-network-based contraction method and the\\nneural-network-based variational method. Tensor networks are accu?rate, but\\ntheir application is often limited to low-dimensional systems due to the high\\ncomputational complexity in high-dimensional systems. The neural network method\\napplies to systems with general topology. However, as a variational method, it\\nis not as accurate as tensor networks. In this work, we propose an integrated\\napproach, tensor-network-based variational autoregressive networks (TNVAN),\\nthat leverages the strengths of both tensor networks and neural networks:\\ncombining the variational autoregressive neural network's ability to compute an\\nupper bound on free energy and perform unbiased sampling from the variational\\ndistribution with the tensor network's power to accurately compute the\\npartition function for small sub-systems, resulting in a robust method for\\nprecisely estimating free energy. To evaluate the proposed approach, we\\nconducted numerical experiments on spin glass systems with various topologies,\\nincluding two-dimensional lattices, fully connected graphs, and random graphs.\\nOur numerical results demonstrate the superior accuracy of our method compared\\nto existing approaches. In particular, it effectively handles systems with\\nlong-range interactions and leverages GPU efficiency without requiring singular\\nvalue decomposition, indicating great potential in tackling statistical\\nmechanics problems and simulating high-dimensional complex systems through both\\ntensor networks and neural networks.\", \"main_category\": \"cond-mat.stat-mech\", \"categories\": \"cond-mat.stat-mech\", \"published\": \"2025-04-16T12:52:19Z\"}"}
