{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17371v1\", \"title\": \"Highly Accurate and Diverse Traffic Data: The DeepScenario Open 3D\\n  Dataset\", \"summary\": \"Accurate 3D trajectory data is crucial for advancing autonomous driving. Yet,\\ntraditional datasets are usually captured by fixed sensors mounted on a car and\\nare susceptible to occlusion. Additionally, such an approach can precisely\\nreconstruct the dynamic environment in the close vicinity of the measurement\\nvehicle only, while neglecting objects that are further away. In this paper, we\\nintroduce the DeepScenario Open 3D Dataset (DSC3D), a high-quality,\\nocclusion-free dataset of 6 degrees of freedom bounding box trajectories\\nacquired through a novel monocular camera drone tracking pipeline. Our dataset\\nincludes more than 175,000 trajectories of 14 types of traffic participants and\\nsignificantly exceeds existing datasets in terms of diversity and scale,\\ncontaining many unprecedented scenarios such as complex vehicle-pedestrian\\ninteraction on highly populated urban streets and comprehensive parking\\nmaneuvers from entry to exit. DSC3D dataset was captured in five various\\nlocations in Europe and the United States and include: a parking lot, a crowded\\ninner-city, a steep urban intersection, a federal highway, and a suburban\\nintersection. Our 3D trajectory dataset aims to enhance autonomous driving\\nsystems by providing detailed environmental 3D representations, which could\\nlead to improved obstacle interactions and safety. We demonstrate its utility\\nacross multiple applications including motion prediction, motion planning,\\nscenario mining, and generative reactive traffic agents. Our interactive online\\nvisualization platform and the complete dataset are publicly available at\\napp.deepscenario.com, facilitating research in motion prediction, behavior\\nmodeling, and safety validation.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-24T08:43:48Z\"}"}
