{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19719v1\", \"title\": \"A computer vision method to estimate ventilation rate of Atlantic salmon\\n  in sea fish farms\", \"summary\": \"The increasing demand for aquaculture production necessitates the development\\nof innovative, intelligent tools to effectively monitor and manage fish health\\nand welfare. While non-invasive video monitoring has become a common practice\\nin finfish aquaculture, existing intelligent monitoring methods predominantly\\nfocus on assessing body condition or fish swimming patterns and are often\\ndeveloped and evaluated in controlled tank environments, without demonstrating\\ntheir applicability to real-world aquaculture settings in open sea farms. This\\nunderscores the necessity for methods that can monitor physiological traits\\ndirectly within the production environment of sea fish farms. To this end, we\\nhave developed a computer vision method for monitoring ventilation rates of\\nAtlantic salmon (Salmo salar), which was specifically designed for videos\\nrecorded in the production environment of commercial sea fish farms using the\\nexisting infrastructure. Our approach uses a fish head detection model, which\\nclassifies the mouth state as either open or closed using a convolutional\\nneural network. This is followed with multiple object tracking to create\\ntemporal sequences of fish swimming across the field of view of the underwater\\nvideo camera to estimate ventilation rates. The method demonstrated high\\nefficiency, achieving a Pearson correlation coefficient of 0.82 between ground\\ntruth and predicted ventilation rates in a test set of 100 fish collected\\nindependently of the training data. By accurately identifying pens where fish\\nexhibit signs of respiratory distress, our method offers broad applicability\\nand the potential to transform fish health and welfare monitoring in finfish\\naquaculture.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-28T12:13:57Z\"}"}
