{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23933v1\", \"title\": \"PupiNet: Seamless OCT-OCTA Interconversion Through Wavelet-Driven and\\n  Multi-Scale Attention Mechanisms\", \"summary\": \"Optical Coherence Tomography (OCT) and Optical Coherence Tomography\\nAngiography (OCTA) are key diagnostic tools for clinical evaluation and\\nmanagement of retinal diseases. Compared to traditional OCT, OCTA provides\\nricher microvascular information, but its acquisition requires specialized\\nsensors and high-cost equipment, creating significant challenges for the\\nclinical deployment of hardware-dependent OCTA imaging methods. Given the\\ntechnical complexity of OCTA image acquisition and potential mechanical\\nartifacts, this study proposes a bidirectional image conversion framework\\ncalled PupiNet, which accurately achieves bidirectional transformation between\\n3D OCT and 3D OCTA. The generator module of this framework innovatively\\nintegrates wavelet transformation and multi-scale attention mechanisms,\\nsignificantly enhancing image conversion quality. Meanwhile, an Adaptive\\nDiscriminator Augmentation (ADA) module has been incorporated into the\\ndiscriminator to optimize model training stability and convergence efficiency.\\nTo ensure clinical accuracy of vascular structures in the converted images, we\\ndesigned a Vessel Structure Matcher (VSM) supervision module, achieving precise\\nmatching of vascular morphology between generated images and target images.\\nAdditionally, the Hierarchical Feature Calibration (HFC) module further\\nguarantees high consistency of texture details between generated images and\\ntarget images across different depth levels. To rigorously validate the\\nclinical effectiveness of the proposed method, we conducted a comprehensive\\nevaluation on a paired OCT-OCTA image dataset containing 300 eyes with various\\nretinal pathologies. Experimental results demonstrate that PupiNet not only\\nreliably achieves high-quality bidirectional transformation between the two\\nmodalities but also shows significant advantages in image fidelity, vessel\\nstructure preservation, and clinical usability.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV\", \"published\": \"2025-03-31T10:27:23Z\"}"}
