{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23748v1\", \"title\": \"THEMIS: Towards Practical Intellectual Property Protection for\\n  Post-Deployment On-Device Deep Learning Models\", \"summary\": \"On-device deep learning (DL) has rapidly gained adoption in mobile apps,\\noffering the benefits of offline model inference and user privacy preservation\\nover cloud-based approaches. However, it inevitably stores models on user\\ndevices, introducing new vulnerabilities, particularly model-stealing attacks\\nand intellectual property infringement. While system-level protections like\\nTrusted Execution Environments (TEEs) provide a robust solution, practical\\nchallenges remain in achieving scalable on-device DL model protection,\\nincluding complexities in supporting third-party models and limited adoption in\\ncurrent mobile solutions. Advancements in TEE-enabled hardware, such as\\nNVIDIA's GPU-based TEEs, may address these obstacles in the future. Currently,\\nwatermarking serves as a common defense against model theft but also faces\\nchallenges here as many mobile app developers lack corresponding machine\\nlearning expertise and the inherent read-only and inference-only nature of\\non-device DL models prevents third parties like app stores from implementing\\nexisting watermarking techniques in post-deployment models.\\n  To protect the intellectual property of on-device DL models, in this paper,\\nwe propose THEMIS, an automatic tool that lifts the read-only restriction of\\non-device DL models by reconstructing their writable counterparts and leverages\\nthe untrainable nature of on-device DL models to solve watermark parameters and\\nprotect the model owner's intellectual property. Extensive experimental results\\nacross various datasets and model structures show the superiority of THEMIS in\\nterms of different metrics. Further, an empirical investigation of 403\\nreal-world DL mobile apps from Google Play is performed with a success rate of\\n81.14%, showing the practicality of THEMIS.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.LG,cs.SE\", \"published\": \"2025-03-31T05:58:57Z\"}"}
