{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21648v1\", \"title\": \"Moment estimates for solutions of SPDEs with L\\u00e9vy colored noise\", \"summary\": \"In this article, we continue the investigations initiated by the first author\\nin Balan (2015) related to the study of stochastic partial differential\\nequations (SPDEs) with L\\\\'evy colored noise on $\\\\mathbb{R}_{+} \\\\times\\n\\\\mathbb{R}^d$. This noise is constructed from a L\\\\'evy white noise (which is in\\nturn built from a Poisson random measure with intensity $dtdx \\\\nu(dz)$), using\\nthe convolution with a suitable spatial kernel $\\\\kappa$. We assume that the\\nL\\\\'evy measure $\\\\nu$ has finite variance. Therefore, the stochastic integral\\nwith respect to this noise is constructed similarly to the integral with\\nrespect to the spatially-homogeneous Gaussian case considered in Dalang (1999).\\nUsing Rosenthal's inequality, we provide an upper bound for the $p$-th moment\\nof the stochastic integral with respect to the L\\\\'evy colored noise, which\\nallows us to identify sufficient conditions for the solution of an SPDE driven\\nby this noise to have higher order moments. We first analyze this question for\\nthe linear SPDE, considering as examples the stochastic heat and wave equations\\nin any dimension $d$, for three examples of kernels $\\\\kappa$: the heat kernel,\\nthe Riesz kernel, and the Bessel kernel. Then, we present a general theory for\\na non-linear SPDE with Lipschitz coefficients, and perform a detailed analysis\\nin the case of the heat equation (in dimension $d\\\\geq 1$), and wave equation\\n(in dimension $d\\\\leq 3$), for the same kernels $\\\\kappa$. We show that the\\nsolution of each of these equations has a finite upper Lyapounov exponent of\\norder $p\\\\geq 2$, and in some cases, is weakly intermittent (in the sense of\\nFoondun and Khoshnevisan, 2013). In the case of the parabolic/hyperbolic\\nAnderson model with L\\\\'evy colored noise, we provide the Poisson chaos\\nexpansion of the solution and the explicit form of the second-order Lyapounov\\nexponent.\", \"main_category\": \"math.PR\", \"categories\": \"math.PR\", \"published\": \"2025-04-30T13:52:09Z\"}"}
