{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23700v1\", \"title\": \"Dual-band Unified Exploration of Three CMZ Clouds (DUET). Cloud-wide\\n  census of continuum sources showing low spectral indices\", \"summary\": \"The Milky Way's Central Molecular Zone (CMZ) is measured to form stars 10\\ntimes less efficiently than in the Galactic disk, based on emission from\\nhigh-mass stars. However, the CMZ's low-mass protostellar population, which\\naccounts for most of the initial stellar mass budget and star formation rate\\n(SFR), is poorly constrained observationally due to limited sensitivity and\\nresolution. We present the Dual-band Unified Exploration of Three CMZ Clouds\\n(DUET) survey, targeting the 20 km/s Cloud, Sgr C, and Dust Ridge cloud e using\\nthe Atacama Large Millimeter/submillimeter Array (ALMA) at 1.3 and 3 mm. The\\nmosaicked observations achieve a comparable resolution of 0.2-0.3\\\" (~1600-2500\\nau) and a sky coverage of 8.3-10.4 square arcmin, respectively. We report 563\\ncontinuum sources at 1.3 mm and 330 at 3 mm, respectively, and a dual-band\\ncatalog with 450 continuum sources. These sources are marginally resolved at\\nthe 2,000 au resolution. We find a cloud-wide deviation (>70%) from\\ncommonly-used dust modified blackbody (MBB) models, characterized by either low\\nspectral indices or low brightness temperatures. Three possible explanations\\nfor the deviation are discussed. (1) Optically thick Class 0/I Young stellar\\nobjects (YSOs) with very small beam filling factors can lead to lower\\nbrightness temperatures than what MBB models predict. (2) Large (mm/cm-sized)\\ndust grains have more significant self-scattering, and therefore\\nfrequency-dependent albedo could cause lower spectral indices. (3) Free-free\\nemission over 30 uJy can severely contaminate dust emission and cause low\\nspectral indices for mJy sources in our sample, although the needed number of\\nmassive protostars (embedded UCHII regions) is infeasibly high for the normal\\nstellar initial mass function. A reliable measurement of the SFR at low\\nprotostellar masses will require future work to distinguish between these\\npossible explanations.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.SR\", \"published\": \"2025-03-31T03:56:43Z\"}"}
