{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10208v1\", \"title\": \"From Prompting to Alignment: A Generative Framework for Query\\n  Recommendation\", \"summary\": \"In modern search systems, search engines often suggest relevant queries to\\nusers through various panels or components, helping refine their information\\nneeds. Traditionally, these recommendations heavily rely on historical search\\nlogs to build models, which suffer from cold-start or long-tail issues.\\nFurthermore, tasks such as query suggestion, completion or clarification are\\nstudied separately by specific design, which lacks generalizability and hinders\\nadaptation to novel applications. Despite recent attempts to explore the use of\\nLLMs for query recommendation, these methods mainly rely on the inherent\\nknowledge of LLMs or external sources like few-shot examples, retrieved\\ndocuments, or knowledge bases, neglecting the importance of the calibration and\\nalignment with user feedback, thus limiting their practical utility. To address\\nthese challenges, we first propose a general Generative Query Recommendation\\n(GQR) framework that aligns LLM-based query generation with user preference.\\nSpecifically, we unify diverse query recommendation tasks by a universal prompt\\nframework, leveraging the instruct-following capability of LLMs for effective\\ngeneration. Secondly, we align LLMs with user feedback via presenting a\\nCTR-alignment framework, which involves training a query-wise CTR predictor as\\na process reward model and employing list-wise preference alignment to maximize\\nthe click probability of the generated query list. Furthermore, recognizing the\\ninconsistency between LLM knowledge and proactive search intents arising from\\nthe separation of user-initiated queries from models, we align LLMs with user\\ninitiative via retrieving co-occurrence queries as side information when\\nhistorical logs are available.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR,cs.LG\", \"published\": \"2025-04-14T13:21:29Z\"}"}
