{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01845v1\", \"title\": \"Dust environment of long-period comet C/2023 A3 (Tsuchinshan-ATLAS)\", \"summary\": \"We present a characterization of the dust environment of long-period comet\\nC/2023 A3 (Tsuchinshan-ATLAS) by analyzing an extensive dataset, including dust\\ntail images and photometric measurements, from 10 au pre-perihelion to 1.6 au\\npost-perihelion, using our forward Monte Carlo code. For this analysis, we\\ncombine pre-perihelion images from the Zwicky Transient Facility with\\npost-perihelion images from the Sierra Nevada Observatory (IAA-CSIC, Granada,\\nSpain), along with both amateur and professional photometric measurements,\\nincluding Af$\\\\rho$ and magnitude data. We find that the dust loss rate\\nincreases monotonically from the assumed start of activity at a heliocentric\\ndistance of approximately 15 au down to 4 au inbound, where the comet exhibits\\na notable decrease in dust production by about one order of magnitude.\\nFollowing this period of reduced activity, the dust production rate rises again\\ntoward perihelion, reaching a peak production rate of 10$^5$ kg s$^{-1}$. The\\nsize distribution of the particles follows a power law, with its index\\ndecreasing toward perihelion, along with a reduction in the minimum particle\\nradius, leading to both brightness and dust mass being dominated by small\\nparticles at perihelion. The particle speeds exhibit a dependence on\\nheliocentric distance ($r_h$) that closely follows the classical $r_h^{-0.5}$\\nlaw near perihelion but deviates at larger heliocentric distances. We\\ndemonstrate that the dependence of particle speeds on the cosine of the solar\\nzenith angle at the emission point plays a significant role in shaping the\\nsynthetic dust tails and in the formation of a dark stripe along the tail axis\\nobserved in high spatial resolution images near the comet's perihelion.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-02T15:50:16Z\"}"}
