{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12271v1\", \"title\": \"On the effective magnetostrictive properties of anisotropic\\n  magneto-active elastomers in the small-deformation limit\", \"summary\": \"Magneto-active elastomers (MAEs) are composite materials comprising an\\nelastomer matrix with embedded magnetic particles, endowing the composite with\\ncoupled effective magneto-mechanical responses. It is widely reported that\\nanisotropic MAEs exhibit much stronger magneto-mechanical coupling than\\nisotropic MAEs. However, most efforts to model effective magneto-mechanical\\nproperties of MAEs via homogenization focused on isotropic microstructures or\\nthose with large separations between particles, to use analytical solutions. In\\nthis work, we introduce a periodic homogenization approach to compute effective\\nmagneto-mechanical properties of anisotropic MAEs, and analyze microstructural\\nfeatures that enhance the magneto-mechanical coupling. Using the finite element\\nmethod, we numerically determine the effect of particle shape, gap, and voids\\non the effective stiffness, permeability, and magneto-mechanical coupling\\ntensors for chain-like periodic microstructures. Using insights gained from the\\nfull-field simulations, we derive an analytical expression for the\\nmagneto-mechanical coupling in the chain direction, in terms of the volume\\nfraction, gap size, and properties of the matrix and particles. Results show\\nthat the overall magnetostriction of anisotropic MAEs is most sensitive to the\\ngap between particles and the waviness of the particle chains, with smaller gap\\nsizes and straighter chains yielding higher overall magnetostriction.\\nSimulations also show that while isotropic MAEs elongate in a uniform magnetic\\nfield, anisotropic MAEs contract with much larger strain amplitudes, a result\\nof the attractive forces between particles being much stronger in anisotropic\\nMAEs than in isotropic MAEs. Results provide fundamental insights into the\\nmechanisms that govern magneto-mechanical coupling in anisotropic MAEs, and\\nconstitute a toolbox of homogenized MAE material properties.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-16T17:32:29Z\"}"}
