{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03225v1\", \"title\": \"Optimal Abort Policy for Mission-Critical Systems under Imperfect\\n  Condition Monitoring\", \"summary\": \"While most on-demand mission-critical systems are engineered to be reliable\\nto support critical tasks, occasional failures may still occur during missions.\\nTo increase system survivability, a common practice is to abort the mission\\nbefore an imminent failure. We consider optimal mission abort for a system\\nwhose deterioration follows a general three-state (normal, defective, failed)\\nsemi-Markov chain. The failure is assumed self-revealed, while the healthy and\\ndefective states have to be {inferred} from imperfect condition monitoring\\ndata. Due to the non-Markovian process dynamics, optimal mission abort for this\\npartially observable system is an intractable stopping problem. For a tractable\\nsolution, we introduce a novel tool of Erlang mixtures to approximate\\nnon-exponential sojourn times in the semi-Markov chain. This allows us to\\napproximate the original process by a surrogate continuous-time Markov chain\\nwhose optimal control policy can be solved through a partially observable\\nMarkov decision process (POMDP). We show that the POMDP optimal policies\\nconverge almost surely to the optimal abort decision rules when the Erlang rate\\nparameter diverges. This implies that the expected cost by adopting the POMDP\\nsolution converges to the optimal expected cost. Next, we provide comprehensive\\nstructural results on the optimal policy of the surrogate POMDP. Based on the\\nresults, we develop a modified point-based value iteration algorithm to\\nnumerically solve the surrogate POMDP. We further consider mission abort in a\\nmulti-task setting where a system executes several tasks consecutively before a\\nthorough inspection. Through a case study on an unmanned aerial vehicle, we\\ndemonstrate the capability of real-time implementation of our model, even when\\nthe condition-monitoring signals are generated with high frequency.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC\", \"published\": \"2025-05-06T06:38:53Z\"}"}
