{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10163v1\", \"title\": \"Shoulder Range of Motion Rehabilitation Robot Incorporating\\n  Scapulohumeral Rhythm for Frozen Shoulder\", \"summary\": \"This paper presents a novel rehabilitation robot designed to address the\\nchallenges of passive range of motion (PROM) exercises for frozen shoulder\\npatients by integrating advanced scapulohumeral rhythm stabilization. Frozen\\nshoulder is characterized by limited glenohumeral motion and disrupted\\nscapulohumeral rhythm, with therapist-assisted interventions being highly\\neffective for restoring normal shoulder function. While existing robotic\\nsolutions replicate natural shoulder biomechanics, they lack the ability to\\nstabilize compensatory movements, such as shoulder shrugging, which are\\ncritical for effective rehabilitation. Our proposed device features a 6 degrees\\nof freedom (DoF) mechanism, including 5 DoF for shoulder motion and an\\ninnovative 1 DoF Joint press for scapular stabilization. The robot employs a\\npersonalized two-phase operation: recording normal shoulder movement patterns\\nfrom the unaffected side and applying them to guide the affected side.\\nExperimental results demonstrated the robot's ability to replicate recorded\\nmotion patterns with high precision, with root mean square error (RMSE) values\\nconsistently below 1 degree. In simulated frozen shoulder conditions, the robot\\neffectively suppressed scapular elevation, delaying the onset of compensatory\\nmovements and guiding the affected shoulder to move more closely in alignment\\nwith normal shoulder motion, particularly during arm elevation movements such\\nas abduction and flexion. These findings confirm the robot's potential as a\\nrehabilitation tool capable of automating PROM exercises while correcting\\ncompensatory movements. The system provides a foundation for advanced,\\npersonalized rehabilitation for patients with frozen shoulders.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-14T12:19:19Z\"}"}
