{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15043v1\", \"title\": \"Energy-Efficient UAV-Mounted RIS for IoT: A Hybrid Energy Harvesting and\\n  DRL Approach\", \"summary\": \"Many future Internet of Things (IoT) applications are expected to rely\\nheavily on reconfigurable intelligent surface (RIS)-aided unmanned aerial\\nvehicles (UAVs). However, the endurance of such systems is constrained by the\\nlimited onboard energy, where frequent recharging or battery replacements are\\nrequired. This consequently disrupts continuous operation and may be\\nimpractical in disaster scenarios. To address this challenge, we explore a dual\\nenergy harvesting (EH) framework that integrates time-switching (TS),\\npower-splitting (PS), and element-splitting (ES) EH protocols for radio\\nfrequency energy, along with solar energy as a renewable source. First, we\\npresent the proposed system architecture and EH operating protocols,\\nintroducing the proposed hybrid ES-TS-PS EH strategy to extend UAV-mounted RIS\\nendurance. Next, we outline key application scenarios and the associated design\\nchallenges. After that, a deep reinforcement learning-based framework is\\nintroduced to maximize the EH efficiency by jointly optimizing UAV trajectory,\\nRIS phase shifts, and EH strategies. The framework considers dual EH, hardware\\nimpairments, and channel state information imperfections to reflect real-world\\ndeployment conditions. The optimization problem is formulated as a Markov\\ndecision process and solved using an enhanced deep deterministic policy\\ngradient algorithm, incorporating clipped double Q-learning and softmax-based\\nQ-value estimation for improved stability and efficiency. The results\\ndemonstrate significant performance gains compared to the considered baseline\\napproaches. Finally, possible challenges and open research directions are\\npresented, highlighting the transformative potential of energy-efficient\\nUAV-mounted RIS networks for IoT systems.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-04-21T11:54:40Z\"}"}
