{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12236v1\", \"title\": \"Towards Human-Centered Early Prediction Models for Academic Performance\\n  in Real-World Contexts\", \"summary\": \"Supporting student success requires collaboration among multiple\\nstakeholders. Researchers have explored machine learning models for academic\\nperformance prediction; yet key challenges remain in ensuring these models are\\ninterpretable, equitable, and actionable within real-world educational support\\nsystems. First, many models prioritize predictive accuracy but overlook\\nhuman-centered considerations, limiting trust among students and reducing their\\nusefulness for educators and institutional decision-makers. Second, most models\\nrequire at least a month of data before making reliable predictions, delaying\\nopportunities for early intervention. Third, current models primarily rely on\\nsporadically collected, classroom-derived data, missing broader behavioral\\npatterns that could provide more continuous and actionable insights. To address\\nthese gaps, we present three modeling approaches-LR, 1D-CNN, and MTL-1D-CNN-to\\nclassify students as low or high academic performers. We evaluate them based on\\nexplainability, fairness, and generalizability to assess their alignment with\\nkey social values. Using behavioral and self-reported data collected within the\\nfirst week of two Spring terms, we demonstrate that these models can identify\\nat-risk students as early as week one. However, trade-offs across\\nhuman-centered considerations highlight the complexity of designing predictive\\nmodels that effectively support multi-stakeholder decision-making and\\nintervention strategies. We discuss these trade-offs and their implications for\\ndifferent stakeholders, outlining how predictive models can be integrated into\\nstudent support systems. Finally, we examine broader socio-technical challenges\\nin deploying these models and propose future directions for advancing\\nhuman-centered, collaborative academic prediction systems.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-16T16:40:56Z\"}"}
