{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21725v1\", \"title\": \"New {\\\\em ab initio} constrained extended Skyrme equations of state for\\n  simulations of neutron stars, supernovae and binary mergers: I. Subsaturation\\n  density domain\", \"summary\": \"In numerical simulations of core-collapse supernova and binary neutron stars\\nmergers information about the energetics and composition of matter is\\nimplemented via external tables covering the huge ranges of thermodynamic\\nconditions explored during the astrophysical evolution. More than 120 general\\npurpose equation of state tables have been contributed so far. Not all of them\\ncomply with current constraints from theoretical and experimental nuclear\\nphysics and astrophysical observations of neutron stars. Systematic\\ninvestigations of the role that dense matter properties play in the evolution\\nof these astrophysical phenomena require that more equation of state tables are\\nprovided. We build a set of general purpose equation of state tables. At zero\\ntemperature, they comply with all currently accepted constraints, including ab\\ninitio chiral effective field theory calculations of pure neutron and symmetric\\nnuclear matter. This set is designed to explore a wide variety of the behaviors\\nof the effective masses as functions of density, which is reflected into a wide\\nrange of thermal behaviors. We employ Brussels extended Skyrme interactions\\ngenerated by means of Bayesian inference techniques. An extended nuclear\\nstatistical equilibrium model is developed for modeling sub-saturated\\ninhomogeneous nuclear matter. We study the properties of sub-saturated\\ninhomogeneous nuclear matter over wide ranges of density, temperature and\\nproton fraction. We analyze the mechanisms of transition to homogeneous matter\\nand estimate the transition density. Our key results include the presence of a\\nthink $^{14}$He layer in the inner crusts of (neo-)neutron stars, significant\\nabundance of other exotic isotopes of H and He in warm and neutron rich matter\\nand a detailed study of the thermodynamic stability of cold stellar matter. The\\nequation of state tables will be publicly available in the Compose online\\ndatabase.\", \"main_category\": \"nucl-th\", \"categories\": \"nucl-th,astro-ph.HE\", \"published\": \"2025-04-30T15:11:02Z\"}"}
