{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21693v1\", \"title\": \"Numerically efficient quasi-adiabatic propagator path integral approach\\n  with two independent non-commuting baths\", \"summary\": \"Path integral methods, like the quasi-adiabatic propagator path integral\\n(QUAPI), are widely used in general-purpose and highly accurate numerical\\nbenchmark simulations of open quantum systems, particularly in regimes\\ninaccessible to perturbative methods. Nevertheless, the applicability of the\\nQUAPI method to realistic systems of interest is restricted by the\\nexponentially growing computer memory requirements with respect to the size of\\nthe quantum system and the time range of non-Markovian correlation effects.\\nThis exponential ''wall'' becomes even more severe for multiple non-commuting\\nfluctuating environments. In the present work, we address the numerical\\nefficiency and accuracy of approximations that have been introduced for the\\nQUAPI method with a single general environment, for the case of two independent\\nnon-commuting environments where one of them is considered as a pure dephasing\\nenvironment. Specifically, we consider a sharply defined cut-off of the memory\\ntime, path filtering and mask assisted coarse graining of influence functional\\ncoefficients (MACGIC-QUAPI) as approximations. We demonstrate that commonly\\napplied numerical techniques such as path filtering cannot be straightforwardly\\ntransferred to the two bath case even in the weak-coupling and quasi-Markovian\\nlimits. On the other hand, the sharply defined memory cut-off can be accurately\\nhandled with the mask assisted coarse graining (MACGIC-QUAPI) approach. Our\\nfindings demonstrates that if system coupling operators to different baths do\\nnot commute, the additive nature of the statistically independent environments\\nmay be misleading. Particularly, the quasi-Markovian nature of a pure dephasing\\nbath is lost, once there simultaneously exists another non-commuting source of\\nfluctuations.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,physics.chem-ph\", \"published\": \"2025-03-27T16:58:13Z\"}"}
