{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01776v1\", \"title\": \"Hydrodynamic simulations of the Disc of Gas Around Supermassive black\\n  holes (HDGAS) -II; The transition from neutral atomic to molecular gas phases\", \"summary\": \"We use HDGAS hydrodynamic simulations to study the impact of active galactic\\nnucleus (AGN) feedback on the conversion of atomic-gas to molecular-gas within\\nthe circumnuclear-disc (CND) of a typical AGN-dominated galaxy. The comparison\\nof CI, CII, and CO line intensities and their ratios in the HDGAS\\npost-processing radiative-transfer analysis reveals the complex interplay\\nbetween AGN-activity, cold molecular gas properties, and the physical processes\\ngoverning the evolution of star-formation in galaxies. Our results demonstrate\\nthat the CI/CO intensity ratio serves as a reliable indicator of the\\natomic-to-molecular gas transition. We present the probability distribution\\nfunction (PDF) and abundance trends of various metal species related to\\nmolecular H$2$ gas, highlighting differences in clumpiness and intensity maps\\nbetween AGN feedback and NoAGN models. The profile of the integrated intensity\\n(moment-0) maps shows that the AGN-feedback model exhibits a lower CI/CO\\nintensity ratio in the vicinity of the supermassive black hole (< 50 pc),\\nindicating a smaller atomic-gas abundance and the presence of positive\\nAGN-feedback. Our simulations have successfully predicted the presence of\\nfaint-CO emissions extending to larger radii from the galactic center. We also\\nexplore the relationships between CII/CO and CI/CII intensity ratios, as well\\nas the ratios versus CO intensity, which provides insights into the \\\"CO-dark\\\"\\nissues. One notable feature in the later time-scale of the AGN model is the\\npresence of a \\\"CO-dark\\\" region, where the intensity of CO emission ($\\\\rm\\nI_{CO}$) is depleted relative to the H$_2$ column density ($N_{\\\\rm H_2}$)\\ncompared to the NoAGN model.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-02T14:38:45Z\"}"}
