{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19715v1\", \"title\": \"Model-based controller assisted domain randomization in deep\\n  reinforcement learning: application to nonlinear powertrain control\", \"summary\": \"Complex mechanical systems such as vehicle powertrains are inherently subject\\nto multiple nonlinearities and uncertainties arising from parametric\\nvariations. Modeling and calibration errors are therefore unavoidable, making\\nthe transfer of control systems from simulation to real-world systems a\\ncritical challenge. Traditional robust controls have limitations in handling\\ncertain types of nonlinearities and uncertainties, requiring a more practical\\napproach capable of comprehensively compensating for these various constraints.\\nThis study proposes a new robust control approach using the framework of deep\\nreinforcement learning (DRL). The key strategy lies in the synergy among domain\\nrandomization-based DRL, long short-term memory (LSTM)-based actor and critic\\nnetworks, and model-based control (MBC). The problem setup is modeled via the\\nlatent Markov decision process (LMDP), a set of vanilla MDPs, for a controlled\\nsystem subject to uncertainties and nonlinearities. In LMDP, the dynamics of an\\nenvironment simulator is randomized during training to improve the robustness\\nof the control system to real testing environments. The randomization increases\\ntraining difficulties as well as conservativeness of the resultant control\\nsystem; therefore, progress is assisted by concurrent use of a model-based\\ncontroller based on a nominal system model. Compared to traditional DRL-based\\ncontrols, the proposed controller design is smarter in that we can achieve a\\nhigh level of generalization ability with a more compact neural network\\narchitecture and a smaller amount of training data. The proposed approach is\\nverified via practical application to active damping for a complex powertrain\\nsystem with nonlinearities and parametric variations. Comparative tests\\ndemonstrate the high robustness of the proposed approach.\", \"main_category\": \"eess.SY\", \"categories\": \"eess.SY,cs.AI,cs.LG,cs.SY\", \"published\": \"2025-04-28T12:09:07Z\"}"}
