{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00558v1\", \"title\": \"Exponentially Consistent Low Complexity Tests for Outlier Hypothesis\\n  Testing with Distribution Uncertainty\", \"summary\": \"We revisit the outlier hypothesis testing (OHT) problem of Li et al. (TIT\\n2024) and propose exponentially consistent tests when there is distribution\\nuncertainty for both nominal samples and outliers. In original OHT, one is\\ngiven a list of sequences, most of which are generated i.i.d. from a\\ndistribution called the nominal distribution while the rest are generated\\ni.i.d. from another distribution named the anomalous distribution. The task of\\nOHT is to identify outliers when both the nominal and anomalous distributions\\nare unknown. Motivated by the study for classification with distribution\\nuncertainty by Hsu and Wang (ISIT 2020), we consider OHT with distribution\\nuncertainty, where each nominal sample is generated from a distribution\\ncentered around the unknown nominal distribution and each outlier is generated\\nfrom a distribution centered around the unknown anomalous distribution. With a\\nfurther step towards practical applications, in the spirit of Bu et al. (TSP\\n2019), we propose low-complexity tests when the number of outliers is known and\\nunknown, and show that our proposed tests are exponentially consistent.\\nFurthermore, we demonstrate that there is a penalty for not knowing the number\\nof outliers in the error exponent when outliers exist. Our results strengthen\\nBu et al. in three aspects: i) our tests allow distribution uncertainty and\\nreveal the impact of distribution uncertainty on the performance of\\nlow-complexity tests; ii) when the number of outliers is known and there is no\\ndistribution uncertainty, our test achieves the same asymptotic performance\\nwith lower complexity; and iii) when the number of outliers is unknown, we\\ncharacterize the tradeoff among the three error probabilities, while two of\\nthese error probabilities were not analyzed by Bu et al. even when there is no\\ndistribution uncertainty. Finally, we illustrate our theoretical results using\\nnumerical examples.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-05-01T14:33:56Z\"}"}
