{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04794v1\", \"title\": \"Enhancing Trust in AI Marketplaces: Evaluating On-Chain Verification of\\n  Personalized AI models using zk-SNARKs\", \"summary\": \"The rapid advancement of artificial intelligence (AI) has brought about\\nsophisticated models capable of various tasks ranging from image recognition to\\nnatural language processing. As these models continue to grow in complexity,\\nensuring their trustworthiness and transparency becomes critical, particularly\\nin decentralized environments where traditional trust mechanisms are absent.\\nThis paper addresses the challenge of verifying personalized AI models in such\\nenvironments, focusing on their integrity and privacy. We propose a novel\\nframework that integrates zero-knowledge succinct non-interactive arguments of\\nknowledge (zk-SNARKs) with Chainlink decentralized oracles to verify AI model\\nperformance claims on blockchain platforms. Our key contribution lies in\\nintegrating zk-SNARKs with Chainlink oracles to securely fetch and verify\\nexternal data to enable trustless verification of AI models on a blockchain.\\nOur approach addresses the limitations of using unverified external data for AI\\nverification on the blockchain while preserving sensitive information of AI\\nmodels and enhancing transparency. We demonstrate our methodology with a linear\\nregression model predicting Bitcoin prices using on-chain data verified on the\\nSepolia testnet. Our results indicate the framework's efficacy, with key\\nmetrics including proof generation taking an average of 233.63 seconds and\\nverification time of 61.50 seconds. This research paves the way for transparent\\nand trustless verification processes in blockchain-enabled AI ecosystems,\\naddressing key challenges such as model integrity and model privacy protection.\\nThe proposed framework, while exemplified with linear regression, is designed\\nfor broader applicability across more complex AI models, setting the stage for\\nfuture advancements in transparent AI verification.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.DC\", \"published\": \"2025-04-07T07:38:29Z\"}"}
