{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05687v1\", \"title\": \"Radial Isotropic Position via an Implicit Newton's Method\", \"summary\": \"Placing a dataset $A = \\\\{\\\\mathbf{a}_i\\\\}_{i \\\\in [n]} \\\\subset \\\\mathbb{R}^d$ in\\nradial isotropic position, i.e., finding an invertible $\\\\mathbf{R} \\\\in\\n\\\\mathbb{R}^{d \\\\times d}$ such that the unit vectors $\\\\{(\\\\mathbf{R}\\n\\\\mathbf{a}_i) \\\\|\\\\mathbf{R} \\\\mathbf{a}_i\\\\|_2^{-1}\\\\}_{i \\\\in [n]}$ are in\\nisotropic position, is a powerful tool with applications in functional\\nanalysis, communication complexity, coding theory, and the design of learning\\nalgorithms. When the transformed dataset has a second moment matrix within a\\n$\\\\exp(\\\\pm \\\\epsilon)$ factor of a multiple of $\\\\mathbf{I}_d$, we call\\n$\\\\mathbf{R}$ an $\\\\epsilon$-approximate Forster transform.\\n  We give a faster algorithm for computing approximate Forster transforms,\\nbased on optimizing an objective defined by Barthe [Barthe98]. When the\\ntransform has a polynomially-bounded aspect ratio, our algorithm uses\\n$O(nd^{\\\\omega - 1}(\\\\frac n \\\\epsilon)^{o(1)})$ time to output an\\n$\\\\epsilon$-approximate Forster transform with high probability, when one\\nexists. This is almost the natural limit of this approach, as even evaluating\\nBarthe's objective takes $O(nd^{\\\\omega - 1})$ time. Previously, the\\nstate-of-the-art runtime in this regime was based on cutting-plane methods, and\\nscaled at least as $\\\\approx n^3 + n^2 d^{\\\\omega - 1}$. We also provide explicit\\nestimates on the aspect ratio in the smoothed analysis setting, and show that\\nour algorithm similarly improves upon those in the literature.\\n  To obtain our results, we develop a subroutine of potential broader interest:\\na reduction from almost-linear time sparsification of graph Laplacians to the\\nability to support almost-linear time matrix-vector products. We combine this\\ntool with new stability bounds on Barthe's objective to implicitly implement a\\nbox-constrained Newton's method [CMTV17, ALOW17].\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS,math.OC\", \"published\": \"2025-04-08T05:00:28Z\"}"}
