{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21275v1\", \"title\": \"Hurdle Network Model With Latent Dynamic Shrinkage For Enhanced Edge\\n  Prediction in Zero-Inflated Directed Network Time Series\", \"summary\": \"This article aims to model international trade relationships among 29\\ncountries in the apparel industry between 1994 and 2013. Bilateral trade flows\\ncan be represented as a directed network, where nodes correspond to countries\\nand directed edges indicate trade flows (i.e., whether one country exported to\\nanother in a given year). Additionally, node (e.g., GDP) and edge-specific\\n(e.g., labor provision) covariates are also available. The study focuses on two\\nkey challenges: (1) capturing multiple forms of temporal and network\\ndependence, and dependence on covariates; and (2) accounting for potential\\ntrade volume as an important but partially observed edge-specific covariate,\\nwhich is only available for country pairs that engaged in trade.\\n  To address these challenges, we introduce the dynamic hurdle network model\\n(Hurdle-Net) for zero-inflated directed network time series that incorporates\\nseveral novel features. First, it represents the time series as a paired binary\\nand continuous time series and utilizes a hurdle model that effectively handles\\nsparsity in edge occurrence. Second, the model captures evolving network\\ndependencies using node-specific latent variables governed by a dynamic\\nshrinkage process. Third, it leverages a shared latent structure across the\\nbinary and continuous components, reflecting the fact that both networks\\ninvolve the same nodes. Finally, the model employs a generalized logistic link\\nfunction to relate edge occurrence to edge weight, allowing for a parsimonious\\nand coherent hierarchical Bayesian framework that jointly models both network\\ncomponents. Compared to static or independent models, Hurdle-Net provides\\nimproved model selection, estimation, and prediction performance for analyzing\\ninternational trade patterns. Its effectiveness is demonstrated through\\nsimulation studies and an application to bilateral trade flow data.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME,stat.AP\", \"published\": \"2025-04-30T03:09:17Z\"}"}
