{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02260v1\", \"title\": \"Implicit Neural Differential Model for Spatiotemporal Dynamics\", \"summary\": \"Hybrid neural-physics modeling frameworks through differentiable programming\\nhave emerged as powerful tools in scientific machine learning, enabling the\\nintegration of known physics with data-driven learning to improve prediction\\naccuracy and generalizability. However, most existing hybrid frameworks rely on\\nexplicit recurrent formulations, which suffer from numerical instability and\\nerror accumulation during long-horizon forecasting. In this work, we introduce\\nIm-PiNDiff, a novel implicit physics-integrated neural differentiable solver\\nfor stable and accurate modeling of spatiotemporal dynamics. Inspired by deep\\nequilibrium models, Im-PiNDiff advances the state using implicit fixed-point\\nlayers, enabling robust long-term simulation while remaining fully end-to-end\\ndifferentiable. To enable scalable training, we introduce a hybrid gradient\\npropagation strategy that integrates adjoint-state methods with reverse-mode\\nautomatic differentiation. This approach eliminates the need to store\\nintermediate solver states and decouples memory complexity from the number of\\nsolver iterations, significantly reducing training overhead. We further\\nincorporate checkpointing techniques to manage memory in long-horizon rollouts.\\nNumerical experiments on various spatiotemporal PDE systems, including\\nadvection-diffusion processes, Burgers' dynamics, and multi-physics chemical\\nvapor infiltration processes, demonstrate that Im-PiNDiff achieves superior\\npredictive performance, enhanced numerical stability, and substantial\\nreductions in memory and runtime cost relative to explicit and naive implicit\\nbaselines. This work provides a principled, efficient, and scalable framework\\nfor hybrid neural-physics modeling.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-03T04:07:18Z\"}"}
