{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15863v1\", \"title\": \"DERD-Net: Learning Depth from Event-based Ray Densities\", \"summary\": \"Event cameras offer a promising avenue for multi-view stereo depth estimation\\nand Simultaneous Localization And Mapping (SLAM) due to their ability to detect\\nblur-free 3D edges at high-speed and over broad illumination conditions.\\nHowever, traditional deep learning frameworks designed for conventional cameras\\nstruggle with the asynchronous, stream-like nature of event data, as their\\narchitectures are optimized for discrete, image-like inputs. We propose a\\nscalable, flexible and adaptable framework for pixel-wise depth estimation with\\nevent cameras in both monocular and stereo setups. The 3D scene structure is\\nencoded into disparity space images (DSIs), representing spatial densities of\\nrays obtained by back-projecting events into space via known camera poses. Our\\nneural network processes local subregions of the DSIs combining 3D convolutions\\nand a recurrent structure to recognize valuable patterns for depth prediction.\\nLocal processing enables fast inference with full parallelization and ensures\\nconstant ultra-low model complexity and memory costs, regardless of camera\\nresolution. Experiments on standard benchmarks (MVSEC and DSEC datasets)\\ndemonstrate unprecedented effectiveness: (i) using purely monocular data, our\\nmethod achieves comparable results to existing stereo methods; (ii) when\\napplied to stereo data, it strongly outperforms all state-of-the-art (SOTA)\\napproaches, reducing the mean absolute error by at least 42%; (iii) our method\\nalso allows for increases in depth completeness by more than 3-fold while still\\nyielding a reduction in median absolute error of at least 30%. Given its\\nremarkable performance and effective processing of event-data, our framework\\nholds strong potential to become a standard approach for using deep learning\\nfor event-based depth estimation and SLAM. Project page:\\nhttps://github.com/tub-rip/DERD-Net\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.LG,cs.RO,eess.SP\", \"published\": \"2025-04-22T12:58:05Z\"}"}
