{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07952v1\", \"title\": \"Dynamic Cheatsheet: Test-Time Learning with Adaptive Memory\", \"summary\": \"Despite their impressive performance on complex tasks, current language\\nmodels (LMs) typically operate in a vacuum: Each input query is processed\\nseparately, without retaining insights from previous attempts. Here, we present\\nDynamic Cheatsheet (DC), a lightweight framework that endows a black-box LM\\nwith a persistent, evolving memory. Rather than repeatedly re-discovering or\\nre-committing the same solutions and mistakes, DC enables models to store and\\nreuse accumulated strategies, code snippets, and general problem-solving\\ninsights at inference time. This test-time learning enhances performance\\nsubstantially across a range of tasks without needing explicit ground-truth\\nlabels or human feedback. Leveraging DC, Claude 3.5 Sonnet's accuracy more than\\ndoubled on AIME math exams once it began retaining algebraic insights across\\nquestions. Similarly, GPT-4o's success rate on Game of 24 increased from 10% to\\n99% after the model discovered and reused a Python-based solution. In tasks\\nprone to arithmetic mistakes, such as balancing equations, DC enabled GPT-4o\\nand Claude to reach near-perfect accuracy by recalling previously validated\\ncode, whereas their baselines stagnated around 50%. Beyond arithmetic\\nchallenges, DC yields notable accuracy gains on knowledge-demanding tasks.\\nClaude achieved a 9% improvement in GPQA-Diamond and an 8% boost on MMLU-Pro\\nproblems. Crucially, DC's memory is self-curated, focusing on concise,\\ntransferable snippets rather than entire transcript. Unlike finetuning or\\nstatic retrieval methods, DC adapts LMs' problem-solving skills on the fly,\\nwithout modifying their underlying parameters. Overall, our findings present DC\\nas a promising approach for augmenting LMs with persistent memory, bridging the\\ndivide between isolated inference events and the cumulative, experience-driven\\nlearning characteristic of human cognition.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.CL\", \"published\": \"2025-04-10T17:57:33Z\"}"}
