{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11991v1\", \"title\": \"Non-Markovian Quantum Master and Fokker-Planck Equation for\\n  Gravitational Systems and Gravitational Decoherence\", \"summary\": \"A quantum master equation describing the stochastic dynamics of a quantum\\nmassive system interacting with a quantum gravitational field is useful for the\\ninvestigation of quantum gravitational and quantum informational issues such as\\nthe quantum nature of gravity, gravity-induced entanglement and gravitational\\ndecoherence. Studies of the decoherence of quantum systems by an\\nelectromagnetic field shows that a lower temperature environment is more\\nconducive to successful quantum information processing experiments. Likewise,\\nthe quantum nature of (perturbative) gravity is far better revealed at lower\\ntemperatures than high, minimizing the corruptive effects of thermal noise. In\\nthis work, generalizing earlier results of the Markovian ABH master equation\\n[1,2] which is valid only for high temperatures, we derive a non-Markovian\\nquantum master equation for the reduced density matrix, and the associated\\nFokker-Planck equation for the Wigner distribution function, for the stochastic\\ndynamics of two masses following quantum trajectories, interacting with a\\ngraviton field, including the effects of graviton noise, valid for all\\ntemperatures. We follow the influence functional approach exemplified in the\\nderivation of the non-Markovian Hu-Paz-Zhang master equation [62,64] for\\nquantum Brownian motion. We find that in the low temperature limit, the\\noff-diagonal elements of the reduced density matrix decrease in time\\nlogarithmically for the zero temperature part and quadratically in time for the\\ntemperature-dependent part, which is distinctly different from the Markovian\\ncase. We end with a summary of our findings and a discussion on how this\\nproblem studied here is related to the quantum stochastic equation derived in\\n[77] for gravitational self force studies, and to quantum optomechanics where\\nexperimental observation of gravitational decoherence and entanglement may be\\nimplemented.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc,cond-mat.stat-mech,hep-th,quant-ph\", \"published\": \"2025-04-16T11:33:23Z\"}"}
