{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03708v1\", \"title\": \"CHEX-MATE: exploring the kinematical properties of Planck galaxy\\n  clusters\", \"summary\": \"We analyse the kinematical properties of the CHEX-MATE (Cluster HEritage\\nproject with XMM-Newton - Mass Assembly and Thermodynamics at the Endpoint of\\nstructure formation) galaxy cluster sample. [...] We derive cluster mass\\nprofiles for 75 clusters using the \\\\textsc{MG-MAMPOSSt} procedure, which\\nrecovers the gravitational potential and the anisotropy profiles from\\nline-of-sight velocities and projected positions of galaxy members. The\\nstandard NFW and the Burkert models with flatter cores than NFW both adequately\\nfit the kinematic data, with only marginal statistical preference for one model\\nover the other. An estimation of the mass bias $(1-B_1) =\\nM^{SZ}_{500}/M^{M}_{500} $ is performed from the comparison with\\nSZ-X-ray-calibrated mass estimates, resulting in a value of $ 0.54 \\\\pm 0.11$\\nwhen four evidently disturbed clusters are removed from the sample. We assess\\nthe dynamical state of the clusters by inferring the Anderson-Darling\\ncoefficient $(A^2)$ and the fraction of galaxies in substructures\\n($f_\\\\text{sub}$). Except for a few cases, we found relatively low values for\\n$A^2$, suggesting that CHEX-MATE clusters are not too far from relaxation.\\nMoreover, no significant trends emerge among $A^2,\\\\,f_\\\\text{sub}$ and the\\ndifference between the log-masses estimated by \\\\textsc{MG-MAMPOSSt} and by\\nSZ-X-ray.\\n  We study the concentration-mass relation for the sample; despite the large\\nscatter, we observe signs of an increasing trend for large-mass clusters, in\\nagreement with recent theoretical expectations.\\n  Finally, the analysis of radial anisotropy profiles of member galaxies -\\nstacked in five bins of mass and redshift - reveals that orbits tend to be\\nisotropic at the center and more radial towards the edge, as already found in\\nprevious studies. A slight trend of increasing radial orbits at $r_{200}$ is\\nobserved in clusters with larger velocity dispersion\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,astro-ph.GA\", \"published\": \"2025-05-06T17:27:54Z\"}"}
