{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19706v1\", \"title\": \"Open-set Anomaly Segmentation in Complex Scenarios\", \"summary\": \"Precise segmentation of out-of-distribution (OoD) objects, herein referred to\\nas anomalies, is crucial for the reliable deployment of semantic segmentation\\nmodels in open-set, safety-critical applications, such as autonomous driving.\\nCurrent anomalous segmentation benchmarks predominantly focus on favorable\\nweather conditions, resulting in untrustworthy evaluations that overlook the\\nrisks posed by diverse meteorological conditions in open-set environments, such\\nas low illumination, dense fog, and heavy rain. To bridge this gap, this paper\\nintroduces the ComsAmy, a challenging benchmark specifically designed for\\nopen-set anomaly segmentation in complex scenarios. ComsAmy encompasses a wide\\nspectrum of adverse weather conditions, dynamic driving environments, and\\ndiverse anomaly types to comprehensively evaluate the model performance in\\nrealistic open-world scenarios. Our extensive evaluation of several\\nstate-of-the-art anomalous segmentation models reveals that existing methods\\ndemonstrate significant deficiencies in such challenging scenarios,\\nhighlighting their serious safety risks for real-world deployment. To solve\\nthat, we propose a novel energy-entropy learning (EEL) strategy that integrates\\nthe complementary information from energy and entropy to bolster the robustness\\nof anomaly segmentation under complex open-world environments. Additionally, a\\ndiffusion-based anomalous training data synthesizer is proposed to generate\\ndiverse and high-quality anomalous images to enhance the existing copy-paste\\ntraining data synthesizer. Extensive experimental results on both public and\\nComsAmy benchmarks demonstrate that our proposed diffusion-based synthesizer\\nwith energy and entropy learning (DiffEEL) serves as an effective and\\ngeneralizable plug-and-play method to enhance existing models, yielding an\\naverage improvement of around 4.96% in $\\\\rm{AUPRC}$ and 9.87% in\\n$\\\\rm{FPR}_{95}$.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-28T12:00:10Z\"}"}
