{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15883v1\", \"title\": \"Integrating Non-Linear Radon Transformation for Diabetic Retinopathy\\n  Grading\", \"summary\": \"Diabetic retinopathy is a serious ocular complication that poses a\\nsignificant threat to patients' vision and overall health. Early detection and\\naccurate grading are essential to prevent vision loss. Current automatic\\ngrading methods rely heavily on deep learning applied to retinal fundus images,\\nbut the complex, irregular patterns of lesions in these images, which vary in\\nshape and distribution, make it difficult to capture subtle changes. This study\\nintroduces RadFuse, a multi-representation deep learning framework that\\nintegrates non-linear RadEx-transformed sinogram images with traditional fundus\\nimages to enhance diabetic retinopathy detection and grading. Our RadEx\\ntransformation, an optimized non-linear extension of the Radon transform,\\ngenerates sinogram representations to capture complex retinal lesion patterns.\\nBy leveraging both spatial and transformed domain information, RadFuse enriches\\nthe feature set available to deep learning models, improving the\\ndifferentiation of severity levels. We conducted extensive experiments on two\\nbenchmark datasets, APTOS-2019 and DDR, using three convolutional neural\\nnetworks (CNNs): ResNeXt-50, MobileNetV2, and VGG19. RadFuse showed significant\\nimprovements over fundus-image-only models across all three CNN architectures\\nand outperformed state-of-the-art methods on both datasets. For severity\\ngrading across five stages, RadFuse achieved a quadratic weighted kappa of\\n93.24%, an accuracy of 87.07%, and an F1-score of 87.17%. In binary\\nclassification between healthy and diabetic retinopathy cases, the method\\nreached an accuracy of 99.09%, precision of 98.58%, and recall of 99.6%,\\nsurpassing previously established models. These results demonstrate RadFuse's\\ncapacity to capture complex non-linear features, advancing diabetic retinopathy\\nclassification and promoting the integration of advanced mathematical\\ntransforms in medical image analysis.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-22T13:27:28Z\"}"}
