{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04413v1\", \"title\": \"A Detailed Investigation of HD 209458 b HST & JWST Transmission Spectra\\n  with SANSAR\", \"summary\": \"HD 209458 b is the first exoplanet on which an atmosphere was detected. Since\\nthen, its atmosphere has been investigated using multiple telescopes and\\ninstruments. However, many of its atmospheric constraints remain debatable.\\nWhile HST observations suggested a highly sub-solar metallicity, recent JWST\\nNIRCam observations by Xue et al. 2024 constrained a super-solar metallicity\\nwith highly sub-solar C/O. In this work, we show a detailed investigation of HD\\n209458 b transmission spectra observations from JWST and HST using SANSAR, a\\nnewly developed planetary atmosphere modeling framework, with free, equilibrium\\nchemistry and self-consistent grid retrievals. The overall best-fitting model\\nwith free retrievals ($\\\\chi^2_{\\\\rm{red}}$=1.21) constrains its metallicity and\\nC/O to be highly sub-solar, while equilibrium chemistry and grid retrievals\\n($\\\\chi^2_{\\\\rm{red}}$=1.27 and 1.30, respectively) are consistent with solar\\nvalues using STIS+WFC3+NIRCam observations. The retrieved abundances of H$_2$O\\nand CO$_2$ are almost three orders of magnitude lower (highly sub-solar) with\\nSTIS+WFC3+NIRCam compared to just NIRCam, using free retrievals. NIRCam\\nobservations alone also result in misleading constraints on metallicity and\\nC/O, with equilibrium chemistry and grid retrieval. We find that the model\\nchoice of varying C/H or O/H to vary the C/O in equilibrium chemistry\\nretrievals leads to different metallicity constraints with NIRCam, but similar\\nconstraints with STIS+WFC3+NIRCam. We conclude that NIRCam observations alone\\ncan lead to overestimation of abundances for exoplanet atmospheres and,\\ntherefore, should be used in combination with UV/Optical and near-infrared\\nobservations to obtain robust constraints on abundances, C/O, and metallicity.\\nSpecifically, even though we can detect the CO$_2$ feature with just NIRCam, we\\ncannot constrain its abundances robustly without the optical baseline.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,astro-ph.IM\", \"published\": \"2025-05-07T13:47:49Z\"}"}
