{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23832v1\", \"title\": \"An extrapolated and provably convergent algorithm for nonlinear matrix\\n  decomposition with the ReLU function\", \"summary\": \"Nonlinear matrix decomposition (NMD) with the ReLU function, denoted\\nReLU-NMD, is the following problem: given a sparse, nonnegative matrix $X$ and\\na factorization rank $r$, identify a rank-$r$ matrix $\\\\Theta$ such that\\n$X\\\\approx \\\\max(0,\\\\Theta)$. This decomposition finds application in data\\ncompression, matrix completion with entries missing not at random, and manifold\\nlearning. The standard ReLU-NMD model minimizes the least squares error, that\\nis, $\\\\|X - \\\\max(0,\\\\Theta)\\\\|_F^2$. The corresponding optimization problem is\\nnondifferentiable and highly nonconvex. This motivated Saul to propose an\\nalternative model, Latent-ReLU-NMD, where a latent variable $Z$ is introduced\\nand satisfies $\\\\max(0,Z)=X$ while minimizing $\\\\|Z - \\\\Theta\\\\|_F^2$ (``A\\nnonlinear matrix decomposition for mining the zeros of sparse data'', SIAM J.\\nMath. Data Sci., 2022). Our first contribution is to show that the two\\nformulations may yield different low-rank solutions $\\\\Theta$; in particular, we\\nshow that Latent-ReLU-NMD can be ill-posed when ReLU-NMD is not, meaning that\\nthere are instances in which the infimum of Latent-ReLU-NMD is not attained\\nwhile that of ReLU-NMD is. We also consider another alternative model, called\\n3B-ReLU-NMD, which parameterizes $\\\\Theta=WH$, where $W$ has $r$ columns and $H$\\nhas $r$ rows, allowing one to get rid of the rank constraint in\\nLatent-ReLU-NMD. Our second contribution is to prove the convergence of a block\\ncoordinate descent (BCD) applied to 3B-ReLU-NMD and referred to as BCD-NMD. Our\\nthird contribution is a novel extrapolated variant of BCD-NMD, dubbed eBCD-NMD,\\nwhich we prove is also convergent under mild assumptions. We illustrate the\\nsignificant acceleration effect of eBCD-NMD compared to BCD-NMD, and also show\\nthat eBCD-NMD performs well against the state of the art on synthetic and\\nreal-world data sets.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,eess.IV,math.OC,stat.ML\", \"published\": \"2025-03-31T08:27:41Z\"}"}
