{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03639v1\", \"title\": \"Differential Privacy for Network Assortativity\", \"summary\": \"The analysis of network assortativity is of great importance for\\nunderstanding the structural characteristics of and dynamics upon networks.\\nOften, network assortativity is quantified using the assortativity coefficient\\nthat is defined based on the Pearson correlation coefficient between vertex\\ndegrees. It is well known that a network may contain sensitive information,\\nsuch as the number of friends of an individual in a social network (which is\\nabstracted as the degree of vertex.). So, the computation of the assortativity\\ncoefficient leads to privacy leakage, which increases the urgent need for\\nprivacy-preserving protocol. However, there has been no scheme addressing the\\nconcern above.\\n  To bridge this gap, in this work, we are the first to propose approaches\\nbased on differential privacy (DP for short). Specifically, we design three\\nDP-based algorithms: $Local_{ru}$, $Shuffle_{ru}$, and $Decentral_{ru}$. The\\nfirst two algorithms, based on Local DP (LDP) and Shuffle DP respectively, are\\ndesigned for settings where each individual only knows his/her direct friends.\\nIn contrast, the third algorithm, based on Decentralized DP (DDP), targets\\nscenarios where each individual has a broader view, i.e., also knowing his/her\\nfriends' friends. Theoretically, we prove that each algorithm enables an\\nunbiased estimation of the assortativity coefficient of the network. We further\\nevaluate the performance of the proposed algorithms using mean squared error\\n(MSE), showing that $Shuffle_{ru}$ achieves the best performance, followed by\\n$Decentral_{ru}$, with $Local_{ru}$ performing the worst. Note that these three\\nalgorithms have different assumptions, so each has its applicability scenario.\\nLastly, we conduct extensive numerical simulations, which demonstrate that the\\npresented approaches are adequate to achieve the estimation of network\\nassortativity under the demand for privacy protection.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR\", \"published\": \"2025-05-06T15:40:47Z\"}"}
