{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19528v1\", \"title\": \"Evolution of cavities in BCC-Fe with coexisting H and He under fusion\\n  environments\", \"summary\": \"In the fusion environment, understanding the synergistic effects of\\ntransmutation-produced hydrogen (H), helium (He), and irradiation-induced\\ndisplacement damage in iron-based alloys is crucial for the development of\\nstructural materials for fusion reactors. When H and He atoms are\\nsimultaneously introduced into the matrix, the interaction between\\nirradiation-induced cavity defects (voids and bubbles) with H and He, along\\nwith their evolutionary behavior remains poorly understood. In this study, the\\nevolutionary behavior of cavities in body-centered cubic (BCC) iron (Fe) with H\\nand He atoms is systematically investigated through a combination of molecular\\ndynamics (MD) calculations and statistical thermodynamics. First, an efficient\\nand suitable set of Fe-H-He ternary potential functions for describing\\ninteratomic interactions is established. Based on the newly developed MD model,\\nthe evolutionary behavior of H/He atoms and cavities is systematically\\ninvestigated under various temperature and cavity structure conditions.\\nSpecifically, the kinetic process of H/He capture by cavities is elucidated for\\ndifferent scenarios. Additionally, thermodynamic analyses are employed to\\nassess the feasibility of cavity trapping of H under varying conditions. The\\nresults exhibit strong consistency with experimental results and provide\\nsignificant evidence supporting the formation of the core-shell structure\\n(where He is confined at the cavity center while H accumulates at the surface)\\nfrom both kinetic and thermodynamic perspectives. This work provides\\nmechanistic insights into the nucleation and growth of cavities over extended\\ntemporal and spatial scales in the presence of H-He synergies.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,physics.atm-clus,physics.atom-ph\", \"published\": \"2025-04-28T07:09:19Z\"}"}
