{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19670v1\", \"title\": \"A search for Maunder-minimum candidate stars\", \"summary\": \"Stars with very low levels of magnetic activity provide an opportunity for a\\nmore quantitative comparison with the Sun during its Maunder minimum. We employ\\nspectra from the RAVE survey in a search for particularly low-activity stars\\nwith the goal of identifying candidates for so-called Maunder-minimum stars.\\nSpectra were used to measure the relative flux in the cores of the Ca II\\ninfrared-triplet (IRT) lines. Those were converted to absolute emission-line\\nfluxes and were corrected with target fluxes from high-resolution STELLA and\\nultra-high-resolution PEPSI spectra. Absolute Ca II IRT fluxes for a total of\\n78111 RAVE dwarf stars are presented and compared with fluxes of the 123 stars\\nfrom our high-resolution STELLA+PEPSI sample. RAVE fluxes appear higher than\\nthe STELLA and PEPSI fluxes by on average 19% for IRT-1, 21% for IRT-2, and 25%\\nfor IRT-3 due to their lower spectral resolution. Our sample also spans a\\nmetallicity [Fe/H] range relative to the Sun of -1.5 to +0.5 dex. We confirm\\nthe strong dependency of IRT fluxes on metallicity and quantify it to be at\\nmost $\\\\pm$14% in the B-V range 0.53-0.73. Without a metallicity correction,\\npractically all very-low-activity RAVE dwarfs show a super-solar metallicity.\\nAfter correcting for spectral resolution and for metallicity, we find 13 RAVE\\nstars out of 13326 (0.1%) that fall well below our empirical lower flux bound\\nfrom high-resolution versus B-V. For solar B-V, this relates to a photospheric\\nuncorrected radiative loss in the IRT lines of log R_IRT=-4.13 (~20% below the\\nsolar-minimum value in late 2016). However, 11 targets turned out to be evolved\\nstars based on their Gaia DR3 parallaxes. Two stars, TIC 352227373 (G2V) and\\nTYC 7560-477-1 (G7V), are our only Maunder-minimum candidates from the present\\nsearch. Contrary to the initial suggestion from the Mount-Wilson H&K Survey, we\\nconclude that such stars are very rare.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-28T10:56:46Z\"}"}
