{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05367v1\", \"title\": \"Joint Super-Resolution and Segmentation for 1-m Impervious Surface Area\\n  Mapping in China's Yangtze River Economic Belt\", \"summary\": \"We propose a novel joint framework by integrating super-resolution and\\nsegmentation, called JointSeg, which enables the generation of 1-meter ISA maps\\ndirectly from freely available Sentinel-2 imagery. JointSeg was trained on\\nmultimodal cross-resolution inputs, offering a scalable and affordable\\nalternative to traditional approaches. This synergistic design enables gradual\\nresolution enhancement from 10m to 1m while preserving fine-grained spatial\\ntextures, and ensures high classification fidelity through effective\\ncross-scale feature fusion. This method has been successfully applied to the\\nYangtze River Economic Belt (YREB), a region characterized by complex\\nurban-rural patterns and diverse topography. As a result, a comprehensive ISA\\nmapping product for 2021, referred to as ISA-1, was generated, covering an area\\nof over 2.2 million square kilometers. Quantitative comparisons against the 10m\\nESA WorldCover and other benchmark products reveal that ISA-1 achieves an\\nF1-score of 85.71%, outperforming bilinear-interpolation-based segmentation by\\n9.5%, and surpassing other ISA datasets by 21.43%-61.07%. In densely urbanized\\nareas (e.g., Suzhou, Nanjing), ISA-1 reduces ISA overestimation through\\nimproved discrimination of green spaces and water bodies. Conversely, in\\nmountainous regions (e.g., Ganzi, Zhaotong), it identifies significantly more\\nISA due to its enhanced ability to detect fragmented anthropogenic features\\nsuch as rural roads and sparse settlements, demonstrating its robustness across\\ndiverse landscapes. Moreover, we present biennial ISA maps from 2017 to 2023,\\ncapturing spatiotemporal urbanization dynamics across representative cities.\\nThe results highlight distinct regional growth patterns: rapid expansion in\\nupstream cities, moderate growth in midstream regions, and saturation in\\ndownstream metropolitan areas.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,eess.IV\", \"published\": \"2025-05-08T16:04:35Z\"}"}
