{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15716v1\", \"title\": \"DianJin-R1: Evaluating and Enhancing Financial Reasoning in Large\\n  Language Models\", \"summary\": \"Effective reasoning remains a core challenge for large language models (LLMs)\\nin the financial domain, where tasks often require domain-specific knowledge,\\nprecise numerical calculations, and strict adherence to compliance rules. We\\npropose DianJin-R1, a reasoning-enhanced framework designed to address these\\nchallenges through reasoning-augmented supervision and reinforcement learning.\\nCentral to our approach is DianJin-R1-Data, a high-quality dataset constructed\\nfrom CFLUE, FinQA, and a proprietary compliance corpus (Chinese Compliance\\nCheck, CCC), combining diverse financial reasoning scenarios with verified\\nannotations. Our models, DianJin-R1-7B and DianJin-R1-32B, are fine-tuned from\\nQwen2.5-7B-Instruct and Qwen2.5-32B-Instruct using a structured format that\\ngenerates both reasoning steps and final answers. To further refine reasoning\\nquality, we apply Group Relative Policy Optimization (GRPO), a reinforcement\\nlearning method that incorporates dual reward signals: one encouraging\\nstructured outputs and another rewarding answer correctness. We evaluate our\\nmodels on five benchmarks: three financial datasets (CFLUE, FinQA, and CCC) and\\ntwo general reasoning benchmarks (MATH-500 and GPQA-Diamond). Experimental\\nresults show that DianJin-R1 models consistently outperform their non-reasoning\\ncounterparts, especially on complex financial tasks. Moreover, on the\\nreal-world CCC dataset, our single-call reasoning models match or even surpass\\nthe performance of multi-agent systems that require significantly more\\ncomputational cost. These findings demonstrate the effectiveness of DianJin-R1\\nin enhancing financial reasoning through structured supervision and\\nreward-aligned learning, offering a scalable and practical solution for\\nreal-world applications.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI\", \"published\": \"2025-04-22T09:01:04Z\"}"}
