{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21579v1\", \"title\": \"Uncertainty, bias and the institution bootstrapping problem\", \"summary\": \"Institutions play a critical role in enabling communities to manage\\ncommon-pool resources and avert tragedies of the commons. However, a\\nfundamental issue arises: Individuals typically perceive participation as\\nadvantageous only after an institution is established, creating a paradox: How\\ncan institutions form if no one will join before a critical mass exists? We\\nterm this conundrum the institution bootstrapping problem and propose that\\nmisperception, specifically, agents' erroneous belief that an institution\\nalready exists, could resolve this paradox. By integrating well-documented\\npsychological phenomena, including cognitive biases, probability distortion,\\nand perceptual noise, into a game-theoretic framework, we demonstrate how these\\nfactors collectively mitigate the bootstrapping problem. Notably, unbiased\\nperceptual noise (e.g., noise arising from agents' heterogeneous physical or\\nsocial contexts) drastically reduces the critical mass of cooperators required\\nfor institutional emergence. This effect intensifies with greater diversity of\\nperceptions. We explain this counter-intuitive result through asymmetric\\nboundary conditions: proportional underestimation of low-probability sanctions\\nproduces distinct outcomes compared to equivalent overestimation. Furthermore,\\nthe type of perceptual distortion, proportional versus absolute, yields\\nqualitatively different evolutionary pathways. These findings challenge\\nconventional assumptions about rationality in institutional design,\\nhighlighting how \\\"noisy\\\" cognition can paradoxically enhance cooperation.\\nFinally, we contextualize these insights within broader discussions of\\nmulti-agent system design and collective action. Our analysis underscores the\\nimportance of incorporating human-like cognitive constraints, not just\\nidealized rationality, into models of institutional emergence and resilience.\", \"main_category\": \"cs.MA\", \"categories\": \"cs.MA,cs.CY,cs.GT\", \"published\": \"2025-04-30T12:36:06Z\"}"}
