{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13119v1\", \"title\": \"Object-Driven Narrative in AR: A Scenario-Metaphor Framework with VLM\\n  Integration\", \"summary\": \"Most adaptive AR storytelling systems define environmental semantics using\\nsimple object labels and spatial coordinates, limiting narratives to rigid,\\npre-defined logic. This oversimplification overlooks the contextual\\nsignificance of object relationships-for example, a wedding ring on a\\nnightstand might suggest marital conflict, yet is treated as just \\\"two objects\\\"\\nin space. To address this, we explored integrating Vision Language Models\\n(VLMs) into AR pipelines. However, several challenges emerged: First, stories\\ngenerated with simple prompt guidance lacked narrative depth and spatial usage.\\nSecond, spatial semantics were underutilized, failing to support meaningful\\nstorytelling. Third, pre-generated scripts struggled to align with AR\\nFoundation's object naming and coordinate systems. We propose a scene-driven AR\\nstorytelling framework that reimagines environments as active narrative agents,\\nbuilt on three innovations: 1. State-aware object semantics: We decompose\\nobject meaning into physical, functional, and metaphorical layers, allowing\\nVLMs to distinguish subtle narrative cues between similar objects. 2.\\nStructured narrative interface: A bidirectional JSON layer maps VLM-generated\\nmetaphors to AR anchors, maintaining spatial and semantic coherence. 3. STAM\\nevaluation framework: A three-part experimental design evaluates narrative\\nquality, highlighting both strengths and limitations of VLM-AR integration. Our\\nfindings show that the system can generate stories from the environment itself,\\nnot just place them on top of it. In user studies, 70% of participants reported\\nseeing real-world objects differently when narratives were grounded in\\nenvironmental symbolism. By merging VLMs' generative creativity with AR's\\nspatial precision, this framework introduces a novel object-driven storytelling\\nparadigm, transforming passive spaces into active narrative landscapes.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-17T17:37:49Z\"}"}
