{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15097v1\", \"title\": \"Multiwavelength Observations of the Precursors Before the Eruptive X4.9\\n  Limb Solar Flare on 25 February, 2014: Current Sheet, Eruptive Filament,\\n  Flare and Eruption Onset in the Frame of the Tether-Cutting Magnetic\\n  Reconnection Scenario\", \"summary\": \"We present multiwavelength analysis of the pre-flare phase and onset of the\\npowerful X4.9 near-limb eruptive solar flare on February 25, 2014, revealing\\nthe tether-cutting (TC) geometry. We aim at determining relationship between\\nthe region of pre-flare energy release with the regions where the flare started\\nto develop, and to investigate a detailed chronology of energy release during\\nthe pre-flare time interval and the beginning of the impulse phase. Using\\nX-ray, ultraviolet and radio microwave data we found that the pre-flare energy\\nrelease site was compact and localized in the vicinity of TC interaction of\\nmagnetic structures near the polarity inversion line. The analysis indicates\\nthat a pre-flare current sheet (CS) could be in this region. Good\\ncorrespondence between the location of the pre-flare and flare emission sources\\nvisible at the very beginning of the impulsive phase is shown. We found\\nrelationship between dynamics of the energy release in the pre-flare CS and\\nformation of the future flare eruptive structure. The growth of the magnetic\\nflux rope was associated with activation of plasma emissions, flows and an\\nincrease of UV radiation fluxes from the region where the pre-flare CS was\\nlocated. The eruptive flux rope gradually grew due to feeding by magnetized\\nplasma ejected from the reconnecting pre-flare CS. Finally, it is shown that\\nthe most probable trigger of the eruption was a local fast microflare-like\\nmagnetic reconnection in the pre-flare CS. Some local instability in the\\npre-flare sheet could lead to a transition from the slow to fast reconnection\\nregime. As a result, an ejection from the sheet was initiated and the eruptive\\nflux rope lost its stability. Then, the eruptive flux rope itself initiated\\nformation of the main reconnecting flare CS as in the Standard Flare Model\\nduring its movement, and intense emissions associated with the impulsive phase\\nwere observed.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-21T13:37:04Z\"}"}
