{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10389v1\", \"title\": \"Diversity-Fair Online Selection\", \"summary\": \"Online selection problems frequently arise in applications such as\\ncrowdsourcing and employee recruitment. Existing research typically focuses on\\ncandidates with a single attribute. However, crowdsourcing tasks often require\\ncontributions from individuals across various demographics. Further motivated\\nby the dynamic nature of crowdsourcing and hiring, we study the diversity-fair\\nonline selection problem, in which a recruiter must make real-time decisions to\\nfoster workforce diversity across many dimensions. We propose two scenarios for\\nthis problem. The fixed-capacity scenario, suited for short-term hiring for\\ncrowdsourced workers, provides the recruiter with a fixed capacity to fill\\ntemporary job vacancies. In contrast, in the unknown-capacity scenario,\\nrecruiters optimize diversity across recruitment seasons with increasing\\ncapacities, reflecting that the firm honors diversity consideration in a\\nlong-term employee acquisition strategy. By modeling the diversity over $d$\\ndimensions as a max-min fairness objective, we show that no policy can surpass\\na competitive ratio of $O(1/d^{1/3})$ for either scenario, indicating that any\\nachievable result inevitably decays by some polynomial factor in $d$. To this\\nend, we develop bilevel hierarchical randomized policies that ensure compliance\\nwith the capacity constraint. For the fixed-capacity scenario, leveraging\\nmarginal information about the arriving population allows us to achieve a\\ncompetitive ratio of $1/(4\\\\sqrt{d} \\\\lceil \\\\log_2 d \\\\rceil)$. For the\\nunknown-capacity scenario, we establish a competitive ratio of\\n$\\\\Omega(1/d^{3/4})$ under mild boundedness conditions. In both bilevel\\nhierarchical policies, the higher level determines ex-ante selection\\nprobabilities and then informs the lower level's randomized selection that\\nensures no loss in efficiency. Both policies prioritize core diversity and then\\nadjust for underrepresented dimensions.\", \"main_category\": \"econ.TH\", \"categories\": \"econ.TH,cs.DS,math.OC\", \"published\": \"2025-04-14T16:35:20Z\"}"}
