{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05450v1\", \"title\": \"Screened Axio-dilaton Cosmology: Novel Forms of Early Dark Energy\", \"summary\": \"We study the cosmology of multi-field Dark Energy, using a well-motivated\\naxio-dilaton model that contains the minimal number of fields to have the\\n2-derivative sigma-model interactions that power-counting arguments show\\nnaturally compete with General Relativity at low energies. Our analysis differs\\nfrom earlier, related, studies by treating the case where the dilaton's\\ncouplings to matter are large enough to require screening to avoid unacceptable\\ndilaton-mediated forces in the solar system. We use a recently proposed\\nscreening mechanism that exploits the interplay between\\nstronger-than-gravitational axion-matter couplings with the 2-derivative\\naxion-dilaton interactions to suppress the couplings of the dilaton to bulk\\nmatter. The required axion-matter couplings also modify cosmology, with the\\naxion's background energy density turning out to resemble early dark energy. We\\ncompute the properties of the axion fluid describing the rapid oscillations of\\nthe axion field around the time-dependent minimum of its matter-dependent\\neffective potential, extending the usual formalism to include nontrivial\\nkinetic sigma-model interactions. We explore the implications of these models\\nfor the Cosmic Microwave Background and the growth of structure and find that\\nfor dilaton potentials of the Albrecht-Skordis form (itself well-motivated by\\nUV physics), successful screening can be consistent with the early dark energy\\ntemporarily comprising as much as 10% of the total density in the past. We find\\nthat increasing the dilaton-matter coupling decreases the growth of structure\\ndue to enhanced Hubble friction, an effect that dominates the usual fifth-force\\neffects that amplify structure growth.\", \"main_category\": \"hep-th\", \"categories\": \"hep-th,astro-ph.CO,gr-qc,hep-ph\", \"published\": \"2025-05-08T17:39:37Z\"}"}
