{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04450v1\", \"title\": \"Effect of interplanetary shock waves on turbulence parameters\", \"summary\": \"We have performed an extensive statistical investigation of how\\ninterplanetary fast forward shocks affect certain turbulence parameters,\\nnamely, the cross-helicity, $\\\\sigma_c$, residual energy, $\\\\sigma_r$, and\\nmagnetic helicity, $\\\\sigma_m$. A total of 371 shocks detected by Wind at 1 au\\nand seven shocks by Solar Orbiter at 0.3-0.5 au have been analysed. We explore\\nhow the aforementioned turbulence parameters and their variation across the\\nshock depend on shock characteristics including the gas compression ratio,\\nupstream plasma beta, velocity jump and shock angle. In the shock vicinity,\\nfluctuations tend on average to show antisunward imbalance (measured as\\n$\\\\sigma_c>0$ when rectified to the Parker spiral direction), a dominance of\\nmagnetic energy ($\\\\sigma_r<0$) and zero $\\\\sigma_m$, all being typical solar\\nwind properties . Antisunward imbalance and equipartition ($\\\\sigma_r \\\\sim0$) in\\nthe upstream is increasingly prevalent with increasing shock velocity jump and\\ndecreasing upstream beta and shock angle. Shocks with large velocity jumps and\\ngas compression ratios have considerably more balanced ($\\\\sigma_c\\\\sim0$) and\\nmore magnetically dominated fluctuations downstream than upstream. From\\nupstream to downstream, we also find that the occurrence of time periods\\nfulfilling strict criteria for Alfv\\\\'enic fluctuations (AFs) usually decreases,\\nwhile those meeting the criteria for small-scale flux ropes (SFRs) increases.\\nThe occurrence of AF periods peaks for quasi-parallel shocks with large\\nvelocity jumps and small upstream beta. The occurrence of SFRs increases with\\nincreasing gas compression ratio and upstream beta. The shocks observed by\\nSolar Orbiter below 0.5 au display similar distributions of turbulence\\nparameters and upstream-to-downstream changes to those detected at 1 au. These\\nresults are relevant for understanding turbulence and charged-particle\\nacceleration at collisionless shocks.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,physics.plasm-ph\", \"published\": \"2025-05-07T14:20:09Z\"}"}
