{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21495v1\", \"title\": \"Consistency-aware Fake Videos Detection on Short Video Platforms\", \"summary\": \"This paper focuses to detect the fake news on the short video platforms.\\nWhile significant research efforts have been devoted to this task with notable\\nprogress in recent years, current detection accuracy remains suboptimal due to\\nthe rapid evolution of content manipulation and generation technologies.\\nExisting approaches typically employ a cross-modal fusion strategy that\\ndirectly combines raw video data with metadata inputs before applying a\\nclassification layer. However, our empirical observations reveal a critical\\noversight: manipulated content frequently exhibits inter-modal inconsistencies\\nthat could serve as valuable discriminative features, yet remain underutilized\\nin contemporary detection frameworks. Motivated by this insight, we propose a\\nnovel detection paradigm that explicitly identifies and leverages cross-modal\\ncontradictions as discriminative cues. Our approach consists of two core\\nmodules: Cross-modal Consistency Learning (CMCL) and Multi-modal Collaborative\\nDiagnosis (MMCD). CMCL includes Pseudo-label Generation (PLG) and Cross-modal\\nConsistency Diagnosis (CMCD). In PLG, a Multimodal Large Language Model is used\\nto generate pseudo-labels for evaluating cross-modal semantic consistency.\\nThen, CMCD extracts [CLS] tokens and computes cosine loss to quantify\\ncross-modal inconsistencies. MMCD further integrates multimodal features\\nthrough Multimodal Feature Fusion (MFF) and Probability Scores Fusion (PSF).\\nMFF employs a co-attention mechanism to enhance semantic interactions across\\ndifferent modalities, while a Transformer is utilized for comprehensive feature\\nfusion. Meanwhile, PSF further integrates the fake news probability scores\\nobtained in the previous step. Extensive experiments on established benchmarks\\n(FakeSV and FakeTT) demonstrate our model exhibits outstanding performance in\\nFake videos detection.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.MM\", \"published\": \"2025-04-30T10:26:04Z\"}"}
