{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12078v1\", \"title\": \"Single-shot Star-convex Polygon-based Instance Segmentation for\\n  Spatially-correlated Biomedical Objects\", \"summary\": \"Biomedical images often contain objects known to be spatially correlated or\\nnested due to their inherent properties, leading to semantic relations.\\nExamples include cell nuclei being nested within eukaryotic cells and colonies\\ngrowing exclusively within their culture dishes. While these semantic relations\\nbear key importance, detection tasks are often formulated independently,\\nrequiring multi-shot analysis pipelines. Importantly, spatial correlation could\\nconstitute a fundamental prior facilitating learning of more meaningful\\nrepresentations for tasks like instance segmentation. This knowledge has, thus\\nfar, not been utilised by the biomedical computer vision community. We argue\\nthat the instance segmentation of two or more categories of objects can be\\nachieved in parallel. We achieve this via two architectures HydraStarDist (HSD)\\nand the novel (HSD-WBR) based on the widely-used StarDist (SD), to take\\nadvantage of the star-convexity of our target objects. HSD and HSD-WBR are\\nconstructed to be capable of incorporating their interactions as constraints\\ninto account. HSD implicitly incorporates spatial correlation priors based on\\nobject interaction through a joint encoder. HSD-WBR further enforces the prior\\nin a regularisation layer with the penalty we proposed named Within Boundary\\nRegularisation Penalty (WBR). Both architectures achieve nested instance\\nsegmentation in a single shot. We demonstrate their competitiveness based on\\n$IoU_R$ and AP and superiority in a new, task-relevant criteria, Joint TP rate\\n(JTPR) compared to their baseline SD and Cellpose. Our approach can be further\\nmodified to capture partial-inclusion/-exclusion in multi-object interactions\\nin fluorescent or brightfield microscopy or digital imaging. Finally, our\\nstrategy suggests gains by making this learning single-shot and computationally\\nefficient.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,q-bio.QM\", \"published\": \"2025-04-16T13:41:02Z\"}"}
