{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00658v1\", \"title\": \"RIS Partitioning and User Clustering for Resilient Non-Orthogonal\\n  Multiple Access UAV Networks\", \"summary\": \"The integration of reconfigurable intelligent surfaces (RISs) and unmanned\\naerial vehicles (UAVs) has emerged as a promising solution for enhancing\\nconnectivity in future wireless networks. This paper designs well-connected and\\nresilient UAV networks by deploying and virtually partitioning multiple RISs to\\ncreate multiple RIS-aided links, focusing on a link-layer perspective. The\\nRIS-aided links are created to connect user equipment (UE) to blocked and\\nreliable UAVs, where multiple UEs can transmit to same UAV via RIS using\\nnon-orthogonal multiple access (NOMA), granting access to UEs and maximizing\\nnetwork connectivity. We first derive exact and approximated closed-form\\nexpressions for signal-to-interference plus noise ratio (SINR) based on aligned\\nand non-aligned RIS-aided beams. Then, we propose to formulate the problem of\\nmaximizing network connectivity that jointly considers (i) UE NOMA clustering,\\n(ii) RIS-aided link selection, and (ii) virtual RIS partitioning. This problem\\nis a computationally expensive combinatorial optimization. To tackle this\\nproblem, a two-step iterative approach, called RIS-aided NOMA, is proposed. In\\nthe first step, the UEs are clustered to the RISs according to their channel\\ngains, while UAVs are associated to those generated clusters based on their\\nreliability, which measures the criticality of UAVs. The second step optimally\\npartitions the RISs to support each of the cluster members. In this step, we\\nderive the closed-form equations for the optimal partitioning of RISs within\\nthe clusters. Simulation results demonstrate that the proposed RIS-aided NOMA\\nyields a gain of 30% to 40%, respectively, compared to UAV traditional scheme.\\nThe finding emphasizes the potential of integrating RIS with UAV communications\\nas a robust and reliable connectivity solution for future wireless\\ncommunication systems.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,eess.SP,math.IT\", \"published\": \"2025-05-01T17:00:50Z\"}"}
