{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14925v1\", \"title\": \"Metamorphic quantum dot arrays in twisted trilayer hexagonal boron\\n  nitride\", \"summary\": \"A large set of controlled quantum states with tunable spacing and\\ninteractions is crucial in understanding and engineering novel quantum\\nmaterials for quantum information processing. Such achievements have been\\nmostly confined to atomic physics, exemplified by ordered arrays of neutral\\natoms or trapped ions. In solid-state systems, well-ordered quantum dots (QDs),\\nin particular, also have significant potential for these applications. However,\\ntheir precise large-scale fabrication and on-demand reconfigurations remain\\nimportant challenges. Here, we predict that twisted trilayer hexagonal boron\\nnitride hosts well-defined QD arrays with spatial precision and symmetry\\ncontrol as well as exceptional dynamic repositioning. These arrays emerge\\nnaturally at ultrasmall twist angles, forming diverse domain configurations\\nincluding triangular, kagome and hexagram arrangements. The quantum states\\nwithin each dot exhibit high fidelity to quantum harmonic oscillator\\nwavefunctions, realizing uniform dot states as long as the moire-of-moire\\nlattice is well ordered. Uniquely, we demonstrate that these arrays can be\\ndynamically reconfigured via external electric fields coupled to local electric\\npolarizations, allowing continuous tuning between regimes of strong coupling\\nand complete isolation, and offering a pathway to long-ranged quantum\\ninformation shuttling. This tunability and uniformity distinguish our platform\\nfrom conventional implementations and suggest substantial potential for quantum\\napplications, from array-based single-photon sources to scalable quantum\\nprocessors, establishing twisted van der Waals systems as a promising platform\\nfor programmable quantum architectures with spatial and energetic control.\", \"main_category\": \"cond-mat.mes-hall\", \"categories\": \"cond-mat.mes-hall,cond-mat.mtrl-sci\", \"published\": \"2025-04-21T07:47:17Z\"}"}
