{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17641v1\", \"title\": \"PTCL: Pseudo-Label Temporal Curriculum Learning for Label-Limited\\n  Dynamic Graph\", \"summary\": \"Dynamic node classification is critical for modeling evolving systems like\\nfinancial transactions and academic collaborations. In such systems,\\ndynamically capturing node information changes is critical for dynamic node\\nclassification, which usually requires all labels at every timestamp. However,\\nit is difficult to collect all dynamic labels in real-world scenarios due to\\nhigh annotation costs and label uncertainty (e.g., ambiguous or delayed labels\\nin fraud detection). In contrast, final timestamp labels are easier to obtain\\nas they rely on complete temporal patterns and are usually maintained as a\\nunique label for each user in many open platforms, without tracking the history\\ndata. To bridge this gap, we propose PTCL(Pseudo-label Temporal Curriculum\\nLearning), a pioneering method addressing label-limited dynamic node\\nclassification where only final labels are available. PTCL introduces: (1) a\\ntemporal decoupling architecture separating the backbone (learning time-aware\\nrepresentations) and decoder (strictly aligned with final labels), which\\ngenerate pseudo-labels, and (2) a Temporal Curriculum Learning strategy that\\nprioritizes pseudo-labels closer to the final timestamp by assigning them\\nhigher weights using an exponentially decaying function. We contribute a new\\nacademic dataset (CoOAG), capturing long-range research interest in dynamic\\ngraph. Experiments across real-world scenarios demonstrate PTCL's consistent\\nsuperiority over other methods adapted to this task. Beyond methodology, we\\npropose a unified framework FLiD (Framework for Label-Limited Dynamic Node\\nClassification), consisting of a complete preparation workflow, training\\npipeline, and evaluation standards, and supporting various models and datasets.\\nThe code can be found at https://github.com/3205914485/FLiD.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-24T15:11:41Z\"}"}
