{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11362v1\", \"title\": \"$27 \\\\otimes 27$\", \"summary\": \"We study the decomposition into $SU(N)$ irreducible representations (irreps)\\nof the tensor product $27 \\\\otimes 27$, where $27$ is the highest-dimensional\\n$SU(N)$ irrep present in a two-gluon system, and explicitly construct all\\nHermitian projectors on these irreps, as well as transition operators between\\nthem. This yields an explicit basis of the complete $27\\\\otimes 27$ color space\\n(defined as the space of $27\\\\otimes 27\\\\to 27 \\\\otimes 27$ color maps) in terms\\nof orthogonal multiplets. This study shows that even complex color structures\\ncan be addressed, with the help of the birdtrack pictorial technique, using\\nonly elementary tools. In particular, we highlight the usefulness of the\\nquadratic Casimir operator, whose eigenspaces allow efficient filtering of all\\nprojectors and transition operators, and of the permutation operators that\\nfurther improve this filtering. The product $27\\\\otimes 27$ also has an\\ninteresting feature: three equivalent irreps $27$ appear in the decomposition,\\ntwo of which are symmetric and can therefore be distinguished neither by the\\nquadratic Casimir operator nor by their symmetry under permutation. In this\\ncase, it is convenient to use Clebsch-Gordan coefficients to derive the two\\nassociated, symmetric projectors. The latter are not uniquely determined (only\\ntheir sum is), and we give the set of all solutions. Finally, we explicitly\\nderive the soft anomalous dimension matrix associated with $27\\\\otimes 27\\\\to\\n27\\\\otimes 27$, whose block-diagonal main structure is easy to understand, but\\nwhose detailed spectrum properties remain intriguing. The approach presented\\nfor $27 \\\\otimes 27 \\\\to 27 \\\\otimes 27$ could in principle be applied to any\\nproduct of $SU(N)$ irreps, and eventually automated.\", \"main_category\": \"hep-ph\", \"categories\": \"hep-ph,hep-th\", \"published\": \"2025-04-15T16:28:10Z\"}"}
