{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11416v1\", \"title\": \"Deep Learning-based Bathymetry Retrieval without In-situ Depths using\\n  Remote Sensing Imagery and SfM-MVS DSMs with Data Gaps\", \"summary\": \"Accurate, detailed, and high-frequent bathymetry is crucial for shallow\\nseabed areas facing intense climatological and anthropogenic pressures. Current\\nmethods utilizing airborne or satellite optical imagery to derive bathymetry\\nprimarily rely on either SfM-MVS with refraction correction or Spectrally\\nDerived Bathymetry (SDB). However, SDB methods often require extensive manual\\nfieldwork or costly reference data, while SfM-MVS approaches face challenges\\neven after refraction correction. These include depth data gaps and noise in\\nenvironments with homogeneous visual textures, which hinder the creation of\\naccurate and complete Digital Surface Models (DSMs) of the seabed. To address\\nthese challenges, this work introduces a methodology that combines the\\nhigh-fidelity 3D reconstruction capabilities of the SfM-MVS methods with\\nstate-of-the-art refraction correction techniques, along with the spectral\\nanalysis capabilities of a new deep learning-based method for bathymetry\\nprediction. This integration enables a synergistic approach where SfM-MVS\\nderived DSMs with data gaps are used as training data to generate complete\\nbathymetric maps. In this context, we propose Swin-BathyUNet that combines\\nU-Net with Swin Transformer self-attention layers and a cross-attention\\nmechanism, specifically tailored for SDB. Swin-BathyUNet is designed to improve\\nbathymetric accuracy by capturing long-range spatial relationships and can also\\nfunction as a standalone solution for standard SDB with various training depth\\ndata, independent of the SfM-MVS output. Experimental results in two completely\\ndifferent test sites in the Mediterranean and Baltic Seas demonstrate the\\neffectiveness of the proposed approach through extensive experiments that\\ndemonstrate improvements in bathymetric accuracy, detail, coverage, and noise\\nreduction in the predicted DSM. The code is available at\\nhttps://github.com/pagraf/Swin-BathyUNet.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,eess.IV\", \"published\": \"2025-04-15T17:31:48Z\"}"}
