{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06998v1\", \"title\": \"A Krylov projection algorithm for large symmetric matrices with dense\\n  spectra\", \"summary\": \"We consider the approximation of $B^T (A+sI)^{-1} B$ for large s.p.d.\\n$A\\\\in\\\\mathbb{R}^{n\\\\times n}$ with dense spectrum and $B\\\\in\\\\mathbb{R}^{n\\\\times\\np}$, $p\\\\ll n$. We target the computations of Multiple-Input Multiple-Output\\n(MIMO) transfer functions for large-scale discretizations of problems with\\ncontinuous spectral measures, such as linear time-invariant (LTI) PDEs on\\nunbounded domains. Traditional Krylov methods, such as the Lanczos or CG\\nalgorithm, are known to be optimal for the computation of $(A+sI)^{-1}B$ with\\nreal positive $s$, resulting in an adaptation to the distinctively discrete and\\nnonuniform spectra. However, the adaptation is damped for matrices with dense\\nspectra. It was demonstrated in [Zimmerling, Druskin, Simoncini, Journal of\\nScientific Computing 103(1), 5 (2025)] that averaging Gau{\\\\ss} and Gau\\\\ss\\n-Radau quadratures computed using the block-Lanczos method significantly\\nreduces approximation errors for such problems. Here, we introduce an adaptive\\nKre\\\\u{i}n-Nudelman extension to the (block) Lanczos recursions, allowing\\nfurther acceleration at negligible $o(n)$ cost. Similar to the Gau\\\\ss -Radau\\nquadrature, a low-rank modification is applied to the (block) Lanczos matrix.\\nHowever, unlike the Gau\\\\ss -Radau quadrature, this modification depends on\\n$\\\\sqrt{s}$ and can be considered in the framework of the Hermite-Pad\\\\'e\\napproximants, which are known to be efficient for problems with branch-cuts,\\nthat can be good approximations to dense spectral intervals. Numerical results\\nfor large-scale discretizations of heat-diffusion and quasi-magnetostatic\\nMaxwell's operators in unbounded domains confirm the efficiency of the proposed\\napproach.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA\", \"published\": \"2025-04-09T16:09:34Z\"}"}
