{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15780v1\", \"title\": \"TrustGeoGen: Scalable and Formal-Verified Data Engine for Trustworthy\\n  Multi-modal Geometric Problem Solving\", \"summary\": \"Mathematical geometric problem solving (GPS) often requires effective\\nintegration of multimodal information and verifiable logical coherence. Despite\\nthe fast development of large language models in general problem solving, it\\nremains unresolved regarding with both methodology and benchmarks, especially\\ngiven the fact that exiting synthetic GPS benchmarks are often not\\nself-verified and contain noise and self-contradicted information due to the\\nillusion of LLMs. In this paper, we propose a scalable data engine called\\nTrustGeoGen for problem generation, with formal verification to provide a\\nprincipled benchmark, which we believe lays the foundation for the further\\ndevelopment of methods for GPS. The engine synthesizes geometric data through\\nfour key innovations: 1) multimodal-aligned generation of diagrams, textual\\ndescriptions, and stepwise solutions; 2) formal verification ensuring\\nrule-compliant reasoning paths; 3) a bootstrapping mechanism enabling\\ncomplexity escalation via recursive state generation and 4) our devised\\nGeoExplore series algorithms simultaneously produce multi-solution variants and\\nself-reflective backtracking traces. By formal logical verification,\\nTrustGeoGen produces GeoTrust-200K dataset with guaranteed modality integrity,\\nalong with GeoTrust-test testset. Experiments reveal the state-of-the-art\\nmodels achieve only 49.17\\\\% accuracy on GeoTrust-test, demonstrating its\\nevaluation stringency. Crucially, models trained on GeoTrust achieve OOD\\ngeneralization on GeoQA, significantly reducing logical inconsistencies\\nrelative to pseudo-label annotated by OpenAI-o1. Our code is available at\\nhttps://github.com/Alpha-Innovator/TrustGeoGen\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.CL\", \"published\": \"2025-04-22T10:45:23Z\"}"}
