{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15868v1\", \"title\": \"Geometry of regular semisimple Lusztig varieties\", \"summary\": \"Lusztig varieties are subvarieties in flag manifolds $G/B$ associated to an\\nelement $w$ in the Weyl group $W$ and an element $x$ in $G$, introduced in\\nLusztig's papers on character sheaves. We study the geometry of these varieties\\nwhen $x$ is regular semisimple.\\n  In the first part, we establish that they are normal, Cohen-Macaulay, of pure\\nexpected dimension and have rational singularities. We then show that the\\ncohomology of ample line bundles vanishes in positive degrees, in arbitrary\\ncharacteristic. This extends to nef line bundles when the base field has\\ncharacteristic zero or sufficiently large characteristic. Along the way, we\\nprove that Lusztig varieties are Frobenius split in positive characteristic and\\nthat their open cells are affine. We also prove that the open cells in\\nDeligne-Lusztig varieties are affine, settling a question that has been open\\nsince the foundational paper of Deligne and Lusztig.\\n  In the second part, we explore their relationship with regular semisimple\\nHessenberg varieties. Both varieties admit Tymoczko's dot action of $W$ on\\ntheir (intersection) cohomology. We associate to each element $w$ in $W$ a\\nHessenberg space using the tangent cone of the Schubert variety associated with\\n$w$, and show that the cohomology of the associated regular semisimple Lusztig\\nvarieties and Hessenberg varieties is isomorphic as graded $W$-representations\\nwhen they are smooth.\\n  This relationship extends to the level of varieties: we construct a flat\\ndegeneration of regular semisimple Lusztig varieties to regular semisimple\\nHessenberg varieties. In particular, this proves a conjecture of Abreu and\\nNigro on the homeomorphism types of regular semisimple Lusztig varieties in\\ntype $A$, and generalizes it to arbitrary Lie types.\", \"main_category\": \"math.AG\", \"categories\": \"math.AG,math.CO,math.RT\", \"published\": \"2025-04-22T13:10:36Z\"}"}
