{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17746v1\", \"title\": \"Flux tube clustering from magnetic coupling of adjacent type-I and -II\\n  superconductors in a neutron star: persistent gravitational radiation\", \"summary\": \"Adjacent type-I and -II proton superconductors in a rotation-powered pulsar\\nare predicted to exist in a metastable state containing macroscopic and\\nquantized flux tubes, respectively. Previous studies show that the type-I and\\n-II regions are coupled magnetically, when macroscopic flux tubes divide\\ndendritically into quantized flux tubes near the type-I-II interface, through a\\nprocess known as flux branching. The studies assume that the\\nnormal-superconducting boundary is sharp, and the quantized flux tubes do not\\nrepel mutually. Here the sharp-interface approximation is refined by accounting\\nfor magnetic repulsion. It is found that flux tubes in the same flux tree\\ncluster with a minimum-energy separation two to seven times less than that of\\nisolated flux tubes. Neutron vortices pin and cluster about flux trees. We find\\nthat the maximum characteristic wave strain $h_0$ of the current quadrupole\\ngravitational radiation emitted by a rectilinear array of clustered vortices\\nexceeds by $(1+N_{\\\\rm v,t})^{1/2}$ the strain $h_0 \\\\sim 10^{-32}(f/30 {\\\\rm\\nHz})^{5/2} (D/1 {\\\\rm kpc})^{-1}$ emitted by uniformly distributed vortices,\\nwhere $N_{\\\\rm v,t}$ is the mean number of pinned vortices per flux tree, $f$ is\\nthe star's spin frequency, and $D$ is the star's distance from Earth. The\\nfactor $(1 + N_{\\\\rm v,t})^{1/2}$ brings $h_0$ close to the sensitivity limit of\\nthe current generation of interferometric gravitational wave detectors under\\ncertain circumstances, specifically when flux branching forms relatively few\\n(and hence relatively large) flux trees.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,cond-mat.quant-gas,cond-mat.supr-con,gr-qc,nucl-th\", \"published\": \"2025-04-24T17:06:50Z\"}"}
