{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13097v1\", \"title\": \"Energy Landscape Plummeting in Variational Quantum Eigensolver: Subspace\\n  Optimization, Non-iterative Corrections and Generator-informed Initialization\\n  for Improved Quantum Efficiency\", \"summary\": \"Variational Quantum Eigensolver (VQE) faces significant challenges due to\\nhardware noise and the presence of barren plateaus and local traps in the\\noptimization landscape. To mitigate the detrimental effects of these issues, we\\nintroduce a general formalism that optimizes hardware resource utilization and\\naccuracy by projecting VQE optimizations on to a reduced-dimensional subspace,\\nfollowed by a set of posteriori corrections. Our method partitions the ansatz\\ninto a lower dimensional principal subspace and a higher-dimensional auxiliary\\nsubspace based on a conjecture of temporal hierarchy present among the\\nparameters during optimization. The adiabatic approximation exploits this\\nhierarchy, restricting optimization to the lower dimensional principal subspace\\nonly. This is followed by an efficient higher dimensional auxiliary space\\nreconstruction without the need to perform variational optimization. These\\nreconstructed auxiliary parameters are subsequently included in the\\ncost-function via a set of auxiliary subspace corrections (ASC) leading to a\\n\\\"plummeting effect\\\" in the energy landscape toward a more optimal minima\\nwithout utilizing any additional quantum hardware resources. Numerical\\nsimulations show that, when integrated with any chemistry-inspired ansatz, our\\nmethod can provide one to two orders of magnitude better estimation of the\\nminima. Additionally, based on the adiabatic approximation, we introduce a\\nnovel initialization strategy driven by unitary rotation generators for\\naccelerated convergence of gradient-informed dynamic quantum algorithms. Our\\nmethod shows heuristic evidences of alleviating the effects of local traps,\\nfacilitating convergence toward a more optimal minimum.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-17T17:07:09Z\"}"}
