{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21624v1\", \"title\": \"Multicut Problems in Almost-Planar Graphs: The Dependency of Complexity\\n  on the Demand Pattern\", \"summary\": \"Given a graph $G$, a set $T$ of terminal vertices, and a demand graph $H$ on\\n$T$, the \\\\textsc{Multicut} problem asks for a set of edges of minimum weight\\nthat separates the pairs of terminals specified by the edges of $H$.\\n  The \\\\textsc{Multicut} problem can be solved in polynomial time if the number\\nof terminals and the genus of the graph is bounded (Colin de Verdi\\\\`ere\\n[Algorithmica, 2017]).\\n  Focke et al.~[SoCG 2024] characterized which special cases of Multicut are\\nfixed-parameter tractable parameterized by the number of terminals on planar\\ngraphs. Moreover, they precisely determined how the parameter genus influences\\nthe complexity and presented partial results of this form for graphs that can\\nbe made planar by the deletion of $\\\\pi$ edges. We complete the picture on how\\nthis parameter $\\\\pi$ influences the complexity of different special cases and\\nprecisely determine the influence of the crossing number.\\n  Formally, let $\\\\mathcal{H}$ be any class of graphs (satisfying a mild closure\\nproperty) and let Multicut$(\\\\mathcal{H})$ be the special case when the demand\\ngraph $H$ is in $\\\\mathcal{H}$. Our fist main results is showing that if\\n$\\\\mathcal{H}$ has the combinatorial property of having bounded distance to\\nextended bicliques, then Multicut$(\\\\mathcal{H})$ on unweighted graphs is FPT\\nparameterized by the number $t$ of terminals and $\\\\pi$. For the case when\\n$\\\\mathcal{H}$ does not have this combinatorial property,\\n  Focke et al.~[SoCG 2024] showed that $O(\\\\sqrt{t})$ is essentially the best\\npossible exponent of the running time; together with our result, this gives a\\ncomplete understanding of how the parameter $\\\\pi$ influences complexity on\\nunweighted graphs.\\n  Our second main result is giving an algorithm whose existence shows that that\\nthe parameter crossing number behaves analogously if we consider weighted\\ngraphs.\", \"main_category\": \"cs.CC\", \"categories\": \"cs.CC\", \"published\": \"2025-04-30T13:26:46Z\"}"}
