{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16523v1\", \"title\": \"Alternately-optimized SNN method for acoustic scattering problem in\\n  unbounded domain\", \"summary\": \"In this paper, we propose a novel machine learning-based method to solve the\\nacoustic scattering problem in unbounded domain. We first employ the\\nDirichlet-to-Neumann (DtN) operator to truncate the physically unbounded domain\\ninto a computable bounded domain. This transformation reduces the original\\nscattering problem in the unbounded domain to a boundary value problem within\\nthe bounded domain. To solve this boundary value problem, we design a neural\\nnetwork with a subspace layer, where each neuron in this layer represents a\\nbasis function. Consequently, the approximate solution can be expressed by a\\nlinear combination of these basis functions. Furthermore, we introduce an\\ninnovative alternating optimization technique which alternately updates the\\nbasis functions and their linear combination coefficients respectively by\\ntraining and least squares methods. In our method, we set the coefficients of\\nbasis functions to 1 and use a new loss function each time train the subspace.\\nThese innovations ensure that the subspace formed by these basis functions is\\ntruly optimized. We refer to this method as the alternately-optimized subspace\\nmethod based on neural networks (AO-SNN). Extensive numerical experiments\\ndemonstrate that our new method can significantly reduce the relative $l^2$\\nerror to $10^{-7}$ or lower, outperforming existing machine learning-based\\nmethods to the best of our knowledge.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA\", \"published\": \"2025-04-23T08:46:22Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16539v1\", \"title\": \"Self-organized fractal architectures driven by motility-dependent\\n  chemotactic feedback\", \"summary\": \"Complex spatial patterns in biological systems often arise through\\nself-organization without a central coordination, guided by local interactions\\nand chemical signaling. In this study, we explore how motility-dependent\\nchemical deposition and concentration-sensitive feedback can give rise to\\nfractal-like networks, using a minimal agent-based model. Agents deposit\\nchemicals only while moving, and their future motion is biased by local\\nchemical gradients. This interaction generates a rich variety of self-organized\\nstructures resembling those seen in processes like early vasculogenesis and\\nepithelial cell dispersal. We identify a diverse phase diagram governed by the\\nrates of chemical deposition and decay, revealing transitions from uniform\\ndistributions to sparse and dense networks, and ultimately to full phase\\nseparation. At low chemical decay rates, agents form stable, system-spanning\\nnetworks; further reduction leads to re-entry into a uniform state. A continuum\\nmodel capturing the co-evolution of agent density and chemical fields confirms\\nthese transitions and reveals how linear stability criteria determine the\\nobserved phases. At low chemical concentrations, diffusion dominates and\\npromotes fractal growth, while higher concentrations favor nucleation and\\ncompact clustering. These findings unify a range of biological phenomena - such\\nas chemotaxis, tissue remodeling, and self-generated gradient navigation -\\nwithin a simple, physically grounded framework. Our results also offer insights\\ninto designing artificial systems with emergent collective behavior, including\\nrobotic swarms or synthetic active matter.\", \"main_category\": \"physics.bio-ph\", \"categories\": \"physics.bio-ph,cond-mat.soft,cond-mat.stat-mech\", \"published\": \"2025-04-23T09:09:29Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16555v1\", \"title\": \"Confidence Sequences for Generalized Linear Models via Regret Analysis\", \"summary\": \"We develop a methodology for constructing confidence sets for parameters of\\nstatistical models via a reduction to sequential prediction. Our key\\nobservation is that for any generalized linear model (GLM), one can construct\\nan associated game of sequential probability assignment such that achieving low\\nregret in the game implies a high-probability upper bound on the excess\\nlikelihood of the true parameter of the GLM. This allows us to develop a scheme\\nthat we call online-to-confidence-set conversions, which effectively reduces\\nthe problem of proving the desired statistical claim to an algorithmic\\nquestion. We study two varieties of this conversion scheme: 1) analytical\\nconversions that only require proving the existence of algorithms with low\\nregret and provide confidence sets centered at the maximum-likelihood estimator\\n2) algorithmic conversions that actively leverage the output of the online\\nalgorithm to construct confidence sets (and may be centered at other,\\nadaptively constructed point estimators). The resulting methodology recovers\\nall state-of-the-art confidence set constructions within a single framework,\\nand also provides several new types of confidence sets that were previously\\nunknown in the literature.\", \"main_category\": \"math.ST\", \"categories\": \"math.ST,cs.LG,stat.ML,stat.TH\", \"published\": \"2025-04-23T09:32:40Z\"}"}
