{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16814v1\", \"title\": \"Association-Based Track-Before-Detect with Object Contribution\\n  Probabilities\", \"summary\": \"Multiobject tracking provides situational awareness that enables new\\napplications for modern convenience, applied ocean sciences, public safety, and\\nhomeland security. In many multiobject tracking applications, including radar\\nand sonar tracking, after coherent prefiltering of the received signal,\\nmeasurement data is typically structured in cells, where each cell represent,\\ne.g., a different range and bearing value. While conventional detect-then-track\\n(DTT) multiobject tracking approaches convert the cell-structured data within a\\ndetection phase into so-called point measurements in order to reduce the amount\\nof data, track-before-detect (TBD) methods process the cell-structured data\\ndirectly, avoiding a potential information loss. However, many TBD tracking\\nmethods are computationally intensive and achieve a reduced tracking accuracy\\nwhen objects interact, i.e., when they come into close proximity. We here\\ncounteract these difficulties by introducing the concept of probabilistic\\nobject-to-cell contributions. As many conventional DTT methods, our approach\\nuses a probabilistic association of objects with data cells, and a new object\\ncontribution model with corresponding object contribution probabilities to\\nfurther associate cell contributions to objects that occupy the same data cell.\\nFurthermore, to keep the computational complexity and filter runtimes low, we\\nhere use an efficient Poisson multi-Bernoulli filtering approach in combination\\nwith the application of belief propagation for fast probabilistic data\\nassociation. We demonstrate numerically that our method achieves significantly\\nincreased tracking performance compared to state-of-the-art TBD tracking\\napproaches, where performance differences are particularly pronounced when\\nmultiple objects interact.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-23T15:32:11Z\"}"}
