{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10314v1\", \"title\": \"Universal Algebra and Effectful Computation\", \"summary\": \"Abstract clones serve as an algebraic presentation of the syntax of a simple\\ntype theory. From the perspective of universal algebra, they define algebraic\\ntheories like those of groups, monoids and rings. This link allows one to study\\nthe language of simple type theory from the viewpoint of universal algebra.\\n  Programming languages, however, are much more complicated than simple type\\ntheory. Many useful features like reading, writing, and exception handling\\ninvolve interacting with the environment; these are called side-effects.\\nAlgebraic presentations for languages with the appropriate syntax for handling\\neffects are given by premulticategories and effectful multicategories. We study\\nthese structures with the aim of defining a suitable notion of an algebra.\\n  To achieve this goal, we proceed in two steps. First, we define a tensor on\\n$[\\\\to,\\\\category{Set}]$, and show that this tensor along with the cartesian\\nproduct gives the category a duoidal structure. Secondly, we introduce the\\nnovel notion of a multicategory enriched in a duoidal category which generalize\\nthe traditional notion of a multicategory. Further, we prove that an effectful\\nmulticategory is the same as a multicategory enriched in the duoidal category\\n$[\\\\to,\\\\category{Set}]$. This result places multicategories and effectful\\nmulticategories on a similar footing, and provides a mechanism for transporting\\nconcepts from the theory of multicategories (which model pure computation) to\\nthe theory of effectful multicategories (which model effectful computation). As\\nan example of this, we generalize the definition of a 2-morphism for\\nmulticategories to the duoidally enriched case. Our equivalence result then\\ngives a natural definition of a 2-morphism for effectful multicategories, which\\nwe then use to define the notion of an algebra.\", \"main_category\": \"cs.PL\", \"categories\": \"cs.PL,math.CT\", \"published\": \"2025-04-14T15:23:06Z\"}"}
