{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15206v1\", \"title\": \"How Global Calibration Strengthens Multiaccuracy\", \"summary\": \"Multiaccuracy and multicalibration are multigroup fairness notions for\\nprediction that have found numerous applications in learning and computational\\ncomplexity. They can be achieved from a single learning primitive: weak\\nagnostic learning. Here we investigate the power of multiaccuracy as a learning\\nprimitive, both with and without the additional assumption of calibration. We\\nfind that multiaccuracy in itself is rather weak, but that the addition of\\nglobal calibration (this notion is called calibrated multiaccuracy) boosts its\\npower substantially, enough to recover implications that were previously known\\nonly assuming the stronger notion of multicalibration.\\n  We give evidence that multiaccuracy might not be as powerful as standard weak\\nagnostic learning, by showing that there is no way to post-process a\\nmultiaccurate predictor to get a weak learner, even assuming the best\\nhypothesis has correlation $1/2$. Rather, we show that it yields a restricted\\nform of weak agnostic learning, which requires some concept in the class to\\nhave correlation greater than $1/2$ with the labels. However, by also requiring\\nthe predictor to be calibrated, we recover not just weak, but strong agnostic\\nlearning.\\n  A similar picture emerges when we consider the derivation of hardcore\\nmeasures from predictors satisfying multigroup fairness notions. On the one\\nhand, while multiaccuracy only yields hardcore measures of density half the\\noptimal, we show that (a weighted version of) calibrated multiaccuracy achieves\\noptimal density.\\n  Our results yield new insights into the complementary roles played by\\nmultiaccuracy and calibration in each setting. They shed light on why\\nmultiaccuracy and global calibration, although not particularly powerful by\\nthemselves, together yield considerably stronger notions.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.CC\", \"published\": \"2025-04-21T16:22:44Z\"}"}
