{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12739v1\", \"title\": \"Mask Image Watermarking\", \"summary\": \"We present MaskMark, a simple, efficient and flexible framework for image\\nwatermarking. MaskMark has two variants: MaskMark-D, which supports global\\nwatermark embedding, watermark localization, and local watermark extraction for\\napplications such as tamper detection, and MaskMark-ED, which focuses on local\\nwatermark embedding and extraction with enhanced robustness in small regions,\\nenabling localized image protection. Built upon the classical Encoder-\\nDistortion-Decoder training paradigm, MaskMark-D introduces a simple masking\\nmechanism during the decoding stage to support both global and local watermark\\nextraction. A mask is applied to the watermarked image before extraction,\\nallowing the decoder to focus on selected regions and learn local extraction. A\\nlocalization module is also integrated into the decoder to identify watermark\\nregions during inference, reducing interference from irrelevant content and\\nimproving accuracy. MaskMark-ED extends this design by incorporating the mask\\ninto the encoding stage as well, guiding the encoder to embed the watermark in\\ndesignated local regions for enhanced robustness. Comprehensive experiments\\nshow that MaskMark achieves state-of-the-art performance in global watermark\\nextraction, local watermark extraction, watermark localization, and\\nmulti-watermark embedding. It outperforms all existing baselines, including the\\nrecent leading model WAM for local watermarking, while preserving high visual\\nquality of the watermarked images. MaskMark is also flexible, by adjusting the\\ndistortion layer, it can adapt to different robustness requirements with just a\\nfew steps of fine-tuning. Moreover, our approach is efficient and easy to\\noptimize, requiring only 20 hours on a single A6000 GPU with just 1/15 the\\ncomputational cost of WAM.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-17T08:29:00Z\"}"}
