{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19927v1\", \"title\": \"Dependence of the Radical Dynamics on the Beam Temporal Profile in FLASH\\n  Radiotherapy\", \"summary\": \"Purpose: This study aims to investigate the impact of the beam temporal\\nprofile on the radical dynamics and inter-track interactions of FLASH\\nradiotherapy, supporting parameter optimization for the equipment development\\nand clinical implementation. Methods: MonteCarlo simulations based on the IRT\\nmethod were performed to analyze the dynamics after irradiation, including\\nsingle-pulse or multi-pulses irradiation, pulse repetition rate, width and\\ndose. The physicochemical experiments were performed to measure the\\neaq-lifetimes for validation. The generation and recombination of OH and\\neaq-radicals were recorded under 6 MeV electron irradiation with varying beam\\ntemporal profiles. The radial distributions of the radicals were statistically\\nanalyzed, and the corresponding LETd and LETt were calculated. The inter-track\\ninteractions were assessed through a mathematical model. Results: The spatial\\ndistribution and temporal evolution of radicals were significantly affected by\\nthe beam time profiles. Compared with multi-pulses irradiation, single-pulse\\nmode with a width less than 1/10 of the radical lifetime, a repetition interval\\nlonger than the radical lifetime, and a dose exceeding 1 Gy/pulse can lead to\\nradicals rapid consumption, reducing the residual content. Instantaneous high\\ndose rates induced radical tracks overlaps. When the single-pulse dose exceeded\\n1 Gy, the overlap probability approached 100%, aligning with the threshold for\\nradical instantaneous combination. Conclusion: Under a low-duty cycle and high\\ninstantaneous dose-rate time profile, the radicals were rapidly consumed\\nthrough track overlap hence reduced damage to normal tissues, inducing FLASH\\neffect. The optimized time profile can be used to guide the development of\\nequipment and parameter settings in clinical practice to maximize the FLASH\\neffect, such as the laser accelerators and superconducting photocathode guns.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph,physics.acc-ph,physics.app-ph,physics.bio-ph\", \"published\": \"2025-04-28T16:01:26Z\"}"}
