{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11153v1\", \"title\": \"The interplay between Jahn-Teller distortions and structural degrees of\\n  freedom on pseudocubic states in manganite perovskites\", \"summary\": \"The average structure of the solid solution LaMn$_{1-x}$Ga$_x$O$_3$ (LMGO)\\nhas been investigated from a symmetry-motivated approach utilizing synchrotron\\nx-ray and neutron powder diffraction techniques. We show experimentally that a\\ntrilinear coupling term ($\\\\Gamma_5^+$M$_2^+$M$_3^+$) between shear strain,\\noctahedral rotation, and the $C$-type orbital ordering mode is responsible for\\ndriving the orthorhombic to pseudocubic phase transition occurring in the\\ncomposition range 0.5 $<$ $x$ $<$ 0.6. Our Monte Carlo simulations elucidate\\nthe macroscopic origin of this coupling to shear strain, and point to its\\nimportance with respect to controlling the orbital order-disorder transitions.\\nWe find that the emergence of the pseudocubic state can be rationalized by\\nconsidering the competition between this trilinear term and a linear-quadratic\\nterm of the out-of-phase octahedral tilting with strain\\n($\\\\Gamma_5^+$(R$_5^-$)$^2$). Illustrating the general nature of these results,\\nwe construct a simple function that captures the change in Landau free energy\\nat the order-disorder transition, in parameters that are trivial to relate to\\nthe concentration of Jahn--Teller active species, temperature, tolerance factor\\nand unit cell strain, for a broad range of manganite perovskites. Our results\\npoint to the fact that far from the pseudocubic state being a symptom of\\norbital disorder, it is in many cases more correctly to view it as a cause. The\\nresults have a broad impact on the study of orbital ordering physics in the\\nperovskite materials and on chemical and physical control parameters through\\nwhich to tune the richness of the intertwined physical properties.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el\", \"published\": \"2025-04-15T12:56:38Z\"}"}
