{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05999v1\", \"title\": \"Fluorine abundances in CEMP stars at the lowest metallicity: Hints on\\n  the nature of the first stars\", \"summary\": \"In the last decade, the available measurements of fluorine abundance have\\nincreased significantly, providing additional information on the chemical\\nevolution of our Galaxy and details on complex stellar nucleosynthesis\\nprocesses. However, the observational challenges to obtain stellar F abundances\\nfavor samples with higher metallicities, resulting in a scarcity of\\nmeasurements at low-metallicity ([Fe/H] $<-2.0$). We present F abundances and\\nupper limits in 7 carbon enhanced metal-poor (CEMP) stars observed with the\\nImmersion Grating Infrared Spectrometer (IGRINS), at the Gemini-South\\ntelescope. These new observations delivered high-resolution, high\\nsignal-to-noise ratio, infrared spectra allowing us to probe significantly\\ndeeper into the metal-poor regime and the cosmic origin of F. This work\\npresents the results of our observations, including two 2-sigma detections and\\nfive upper limits in a variety of CEMP stars. Arguably the most important\\nresult is for CS 29498-0043, a CEMP-no star at [Fe/H] = $-3.87$ with a F\\ndetection of [F/Fe] = $+2.0\\\\pm 0.4$, the lowest metallicity star (more than a\\nfactor of 10 lower in metallicity than the next detection) with observed F\\nabundance to date. This measurement allowed us to differentiate between two\\nzero metallicity Population III (Pop III) progenitors: one involving He-burning\\nwith primary N in Wolf-Rayet stars, and the other suggesting H-burning during\\nhypernova explosions. Our measured value is in better agreement with the latter\\nscenario. This detection represents a pilot, and pioneering study demonstrating\\nthe power of F to explore the nature and properties of the first chemical\\nenrichment from Pop III stars.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA\", \"published\": \"2025-04-08T13:05:58Z\"}"}
