{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17696v1\", \"title\": \"Hierarchical and Multimodal Data for Daily Activity Understanding\", \"summary\": \"Daily Activity Recordings for Artificial Intelligence (DARai, pronounced\\n\\\"Dahr-ree\\\") is a multimodal, hierarchically annotated dataset constructed to\\nunderstand human activities in real-world settings. DARai consists of\\ncontinuous scripted and unscripted recordings of 50 participants in 10\\ndifferent environments, totaling over 200 hours of data from 20 sensors\\nincluding multiple camera views, depth and radar sensors, wearable inertial\\nmeasurement units (IMUs), electromyography (EMG), insole pressure sensors,\\nbiomonitor sensors, and gaze tracker.\\n  To capture the complexity in human activities, DARai is annotated at three\\nlevels of hierarchy: (i) high-level activities (L1) that are independent tasks,\\n(ii) lower-level actions (L2) that are patterns shared between activities, and\\n(iii) fine-grained procedures (L3) that detail the exact execution steps for\\nactions. The dataset annotations and recordings are designed so that 22.7% of\\nL2 actions are shared between L1 activities and 14.2% of L3 procedures are\\nshared between L2 actions. The overlap and unscripted nature of DARai allows\\ncounterfactual activities in the dataset.\\n  Experiments with various machine learning models showcase the value of DARai\\nin uncovering important challenges in human-centered applications.\\nSpecifically, we conduct unimodal and multimodal sensor fusion experiments for\\nrecognition, temporal localization, and future action anticipation across all\\nhierarchical annotation levels. To highlight the limitations of individual\\nsensors, we also conduct domain-variant experiments that are enabled by DARai's\\nmulti-sensor and counterfactual activity design setup.\\n  The code, documentation, and dataset are available at the dedicated DARai\\nwebsite:\\nhttps://alregib.ece.gatech.edu/software-and-datasets/darai-daily-activity-recordings-for-artificial-intelligence-and-machine-learning/\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-24T16:04:00Z\"}"}
