{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07460v1\", \"title\": \"Measuring Cosmic Growth Rate with CSST Spectroscopic Survey and Fast\\n  Radio Burst\", \"summary\": \"The cosmic growth rate, which is related to peculiar velocity and is a\\nprimary scientific objective of galaxy spectroscopic surveys, can be inferred\\nfrom the Redshift Space Distortion effect and the kinetic Sunyaev-Zel'dovich\\neffect. However, the reconstruction noise power spectrum of the radial velocity\\nfield in kSZ is significantly dependent on the measurement of the small-scale\\ngalaxy-electron power spectrum $P_{ge}$. In this study, we thoroughly discuss\\nthe enhancement of cosmic growth rate measurements facilitated by Fast Radio\\nBursts, which probe the electron density of the universe along their\\npropagation paths to provide crucial additional information on $P_{ge}$.\\nSubsequently, we utilize future spectroscopic surveys from the Chinese Space\\nStation Telescope and the CMB-S4 experiment, combined with FRB dispersion\\nmeasures, to achieve precise measurements of the cosmic growth rate at\\nredshifts $z_g = 0.15,0.45,0.75$. Employing Fisher matrix forecasting analysis,\\nwe anticipate that constraints on $f\\\\sigma_8$ will reach a precision of 0.001\\nwith a sample size of $10^6$ FRBs. Furthermore, we perform a global analysis\\nusing Markov Chain Monte Carlo methods to constrain key parameters of three\\ndistinct dark energy models and a modified gravity model based on cosmic growth\\nrate measurements. The results demonstrate that these refined $f\\\\sigma_8$\\nmeasurements considerably enhance the constraints on relevant cosmological\\nparameters compared to those obtained from Planck. As the number of observed\\nFRBs increases, alongside more precise galaxy surveys and next-generation CMB\\nobservations, new opportunities will arise for constraining cosmological models\\nusing the kSZ effect and for developing novel cosmological applications of\\nFRBs.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-04-10T05:10:15Z\"}"}
