{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10165v1\", \"title\": \"WildLive: Near Real-time Visual Wildlife Tracking onboard UAVs\", \"summary\": \"Live tracking of wildlife via high-resolution video processing directly\\nonboard drones is widely unexplored and most existing solutions rely on\\nstreaming video to ground stations to support navigation. Yet, both autonomous\\nanimal-reactive flight control beyond visual line of sight and/or\\nmission-specific individual and behaviour recognition tasks rely to some degree\\non this capability. In response, we introduce WildLive -- a near real-time\\nanimal detection and tracking framework for high-resolution imagery running\\ndirectly onboard uncrewed aerial vehicles (UAVs). The system performs\\nmulti-animal detection and tracking at 17fps+ for HD and 7fps+ on 4K video\\nstreams suitable for operation during higher altitude flights to minimise\\nanimal disturbance. Our system is optimised for Jetson Orin AGX onboard\\nhardware. It integrates the efficiency of sparse optical flow tracking and\\nmission-specific sampling with device-optimised and proven YOLO-driven object\\ndetection and segmentation techniques. Essentially, computational resource is\\nfocused onto spatio-temporal regions of high uncertainty to significantly\\nimprove UAV processing speeds without domain-specific loss of accuracy.\\nAlongside, we introduce our WildLive dataset, which comprises 200k+ annotated\\nanimal instances across 19k+ frames from 4K UAV videos collected at the Ol\\nPejeta Conservancy in Kenya. All frames contain ground truth bounding boxes,\\nsegmentation masks, as well as individual tracklets and tracking point\\ntrajectories. We compare our system against current object tracking approaches\\nincluding OC-SORT, ByteTrack, and SORT. Our multi-animal tracking experiments\\nwith onboard hardware confirm that near real-time high-resolution wildlife\\ntracking is possible on UAVs whilst maintaining high accuracy levels as needed\\nfor future navigational and mission-specific animal-centric operational\\nautonomy.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-14T12:21:16Z\"}"}
