{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19992v1\", \"title\": \"Towards Non-Abelian Quantum Signal Processing: Efficient Control of\\n  Hybrid Continuous- and Discrete-Variable Architectures\", \"summary\": \"Robust quantum control is crucial for achieving operations below the quantum\\nerror correction threshold. Quantum Signal Processing (QSP) transforms a\\nunitary parameterized by $\\\\theta$ into one governed by a polynomial function\\n$f(\\\\theta)$, a feature that underpins key quantum algorithms. Originating from\\ncomposite pulse techniques in NMR, QSP enhances robustness against systematic\\ncontrol errors. We extend QSP to a new class, non-abelian QSP, which utilizes\\nnon-commuting control parameters, $\\\\hat\\\\theta_1, \\\\hat\\\\theta_2, \\\\dots$,\\nrepresenting quantum harmonic oscillator positions and momenta. We introduce a\\nfundamental non-abelian composite pulse sequence, the\\nGaussian-Controlled-Rotation (GCR), for entangling and disentangling a qubit\\nfrom an oscillator. This sequence achieves at least a $4.5\\\\times$ speedup\\ncompared to the state-of-the-art abelian QSP pulse BB1, while maintaining\\nperformance. Though quantum fluctuations in the control parameters are\\nunavoidable, the richer commutator algebra of non-abelian QSP enhances its\\npower and efficiency. Non-abelian QSP represents the highest tier of QSP\\nvariants tailored for hybrid oscillator-qubit architectures, unlocking new\\npossibilities for such systems. We demonstrate the utility of GCR in\\nhigh-fidelity preparation of continuous-variable oscillator states, including\\nsqueezed, Fock, cat, and GKP states, using fully analytical schemes that match\\nnumerically optimized methods in fidelity and depth while enabling mid-circuit\\nerror detection. Furthermore, we propose a high-fidelity QSP-based\\nend-of-the-line GKP readout and a measurement-free, error-corrected gate\\nteleportation protocol for logical operations on GKP bosonic qudits, bridging\\nthe gap between idealized theoretical and experimentally realistic versions of\\nthe GKP code. Finally, we showcase a GCR-based phase estimation algorithm for\\noscillator-based quantum computing.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-28T17:10:27Z\"}"}
