{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03172v1\", \"title\": \"Null Counterfactual Factor Interactions for Goal-Conditioned\\n  Reinforcement Learning\", \"summary\": \"Hindsight relabeling is a powerful tool for overcoming sparsity in\\ngoal-conditioned reinforcement learning (GCRL), especially in certain domains\\nsuch as navigation and locomotion. However, hindsight relabeling can struggle\\nin object-centric domains. For example, suppose that the goal space consists of\\na robotic arm pushing a particular target block to a goal location. In this\\ncase, hindsight relabeling will give high rewards to any trajectory that does\\nnot interact with the block. However, these behaviors are only useful when the\\nobject is already at the goal -- an extremely rare case in practice. A dataset\\ndominated by these kinds of trajectories can complicate learning and lead to\\nfailures. In object-centric domains, one key intuition is that meaningful\\ntrajectories are often characterized by object-object interactions such as\\npushing the block with the gripper. To leverage this intuition, we introduce\\nHindsight Relabeling using Interactions (HInt), which combines interactions\\nwith hindsight relabeling to improve the sample efficiency of downstream RL.\\nHowever because interactions do not have a consensus statistical definition\\ntractable for downstream GCRL, we propose a definition of interactions based on\\nthe concept of null counterfactual: a cause object is interacting with a target\\nobject if, in a world where the cause object did not exist, the target object\\nwould have different transition dynamics. We leverage this definition to infer\\ninteractions in Null Counterfactual Interaction Inference (NCII), which uses a\\n\\\"nulling'' operation with a learned model to infer interactions. NCII is able\\nto achieve significantly improved interaction inference accuracy in both simple\\nlinear dynamics domains and dynamic robotic domains in Robosuite, Robot Air\\nHockey, and Franka Kitchen and HInt improves sample efficiency by up to 4x.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-05-06T04:32:47Z\"}"}
