{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11016v1\", \"title\": \"Heating reduction as collective action: Impact on attitudes, behavior\\n  and energy consumption in a Polish field experiment\", \"summary\": \"Heating and hot water usage account for nearly 80% of household energy\\nconsumption in the European Union. In order to reach the EU New Deal goals, new\\npolicies to reduce heat energy consumption are indispensable. However, research\\ntargeting reductions concentrates either on technical building interventions\\nwithout considerations of people's behavior, or psychological interventions\\nwith no technical interference. Such interventions can be promising, but their\\ntrue potential for scaling up can only be realized by testing approaches that\\nintegrate behavioral and technical solutions in tandem rather than in\\nisolation. In this research, we study a mix of psychological and technical\\ninterventions targeting heating and hot water demand among students in Polish\\nuniversity dormitories. We evaluate effects on building energy consumption,\\nbehavioral spillovers and on social beliefs and attitudes in a pre-post\\nquasi-experimental mixed-method field study in three student dormitories. Our\\nfindings reveal that the most effective approaches to yield energy savings were\\na direct, collectively framed request to students to reduce thermostat settings\\nfor the environment, and an automated technical adjustment of the heating curve\\ntemperature. Conversely, interventions targeting domestic hot water had\\nunintended effects, including increased energy use and negative spillovers,\\nsuch as higher water consumption. Further, we find that informing students\\nabout their active, collective participation had a positive impact on perceived\\nsocial norms. Our findings highlight the importance of trialing interventions\\nin controlled real-world settings to understand the interplay between technical\\nsystems, behaviors, and social impacts to enable scalable, evidence-based\\npolicies driving an effective and sustainable energy transition.\", \"main_category\": \"cs.ET\", \"categories\": \"cs.ET,cs.CY\", \"published\": \"2025-04-15T09:41:37Z\"}"}
