{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01894v1\", \"title\": \"Multi-fidelity Parameter Estimation Using Conditional Diffusion Models\", \"summary\": \"We present a multi-fidelity method for uncertainty quantification of\\nparameter estimates in complex systems, leveraging generative models trained to\\nsample the target conditional distribution. In the Bayesian inference setting,\\ntraditional parameter estimation methods rely on repeated simulations of\\npotentially expensive forward models to determine the posterior distribution of\\nthe parameter values, which may result in computationally intractable\\nworkflows. Furthermore, methods such as Markov Chain Monte Carlo (MCMC)\\nnecessitate rerunning the entire algorithm for each new data observation,\\nfurther increasing the computational burden. Hence, we propose a novel method\\nfor efficiently obtaining posterior distributions of parameter estimates for\\nhigh-fidelity models given data observations of interest. The method first\\nconstructs a low-fidelity, conditional generative model capable of amortized\\nBayesian inference and hence rapid posterior density approximation over a\\nwide-range of data observations. When higher accuracy is needed for a specific\\ndata observation, the method employs adaptive refinement of the density\\napproximation. It uses outputs from the low-fidelity generative model to refine\\nthe parameter sampling space, ensuring efficient use of the computationally\\nexpensive high-fidelity solver. Subsequently, a high-fidelity, unconditional\\ngenerative model is trained to achieve greater accuracy in the target posterior\\ndistribution. Both low- and high- fidelity generative models enable efficient\\nsampling from the target posterior and do not require repeated simulation of\\nthe high-fidelity forward model. We demonstrate the effectiveness of the\\nproposed method on several numerical examples, including cases with multi-modal\\ndensities, as well as an application in plasma physics for a runaway electron\\nsimulation model.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-02T16:54:47Z\"}"}
