{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07956v1\", \"title\": \"VCR-Bench: A Comprehensive Evaluation Framework for Video\\n  Chain-of-Thought Reasoning\", \"summary\": \"The advancement of Chain-of-Thought (CoT) reasoning has significantly\\nenhanced the capabilities of large language models (LLMs) and large\\nvision-language models (LVLMs). However, a rigorous evaluation framework for\\nvideo CoT reasoning remains absent. Current video benchmarks fail to adequately\\nassess the reasoning process and expose whether failures stem from deficiencies\\nin perception or reasoning capabilities. Therefore, we introduce VCR-Bench, a\\nnovel benchmark designed to comprehensively evaluate LVLMs' Video\\nChain-of-Thought Reasoning capabilities. VCR-Bench comprises 859 videos\\nspanning a variety of video content and durations, along with 1,034\\nhigh-quality question-answer pairs. Each pair is manually annotated with a\\nstepwise CoT rationale, where every step is tagged to indicate its association\\nwith the perception or reasoning capabilities. Furthermore, we design seven\\ndistinct task dimensions and propose the CoT score to assess the entire CoT\\nprocess based on the stepwise tagged CoT rationals. Extensive experiments on\\nVCR-Bench highlight substantial limitations in current LVLMs. Even the\\ntop-performing model, o1, only achieves a 62.8% CoT score and an 56.7%\\naccuracy, while most models score below 40%. Experiments show most models score\\nlower on perception than reasoning steps, revealing LVLMs' key bottleneck in\\ntemporal-spatial information processing for complex video reasoning. A robust\\npositive correlation between the CoT score and accuracy confirms the validity\\nof our evaluation framework and underscores the critical role of CoT reasoning\\nin solving complex video reasoning tasks. We hope VCR-Bench to serve as a\\nstandardized evaluation framework and expose the actual drawbacks in complex\\nvideo reasoning task.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI,cs.CL\", \"published\": \"2025-04-10T17:59:03Z\"}"}
