{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16864v1\", \"title\": \"Common Functional Decompositions Can Mis-attribute Differences in\\n  Outcomes Between Populations\", \"summary\": \"In science and social science, we often wish to explain why an outcome is\\ndifferent in two populations. For instance, if a jobs program benefits members\\nof one city more than another, is that due to differences in program\\nparticipants (particular covariates) or the local labor markets (outcomes given\\ncovariates)? The Kitagawa-Oaxaca-Blinder (KOB) decomposition is a standard tool\\nin econometrics that explains the difference in the mean outcome across two\\npopulations. However, the KOB decomposition assumes a linear relationship\\nbetween covariates and outcomes, while the true relationship may be\\nmeaningfully nonlinear. Modern machine learning boasts a variety of nonlinear\\nfunctional decompositions for the relationship between outcomes and covariates\\nin one population. It seems natural to extend the KOB decomposition using these\\nfunctional decompositions. We observe that a successful extension should not\\nattribute the differences to covariates -- or, respectively, to outcomes given\\ncovariates -- if those are the same in the two populations. Unfortunately, we\\ndemonstrate that, even in simple examples, two common decompositions --\\nfunctional ANOVA and Accumulated Local Effects -- can attribute differences to\\noutcomes given covariates, even when they are identical in two populations. We\\nprovide a characterization of when functional ANOVA misattributes, as well as a\\ngeneral property that any discrete decomposition must satisfy to avoid\\nmisattribution. We show that if the decomposition is independent of its input\\ndistribution, it does not misattribute. We further conjecture that\\nmisattribution arises in any reasonable additive decomposition that depends on\\nthe distribution of the covariates.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME,cs.LG,econ.EM,stat.ML\", \"published\": \"2025-04-23T16:36:55Z\"}"}
