{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15623v1\", \"title\": \"RadioDiff-$k^2$: Helmholtz Equation Informed Generative Diffusion Model\\n  for Multi-Path Aware Radio Map Construction\", \"summary\": \"In this paper, we propose a novel physics-informed generative learning\\napproach, termed RadioDiff-$\\\\bm{k^2}$, for accurate and efficient\\nmultipath-aware radio map (RM) construction. As wireless communication evolves\\ntowards environment-aware paradigms, driven by the increasing demand for\\nintelligent and proactive optimization in sixth-generation (6G) networks,\\naccurate construction of RMs becomes crucial yet highly challenging.\\nConventional electromagnetic (EM)-based methods, such as full-wave solvers and\\nray-tracing approaches, exhibit substantial computational overhead and limited\\nadaptability to dynamic scenarios. Although, existing neural network (NN)\\napproaches have efficient inferencing speed, they lack sufficient consideration\\nof the underlying physics of EM wave propagation, limiting their effectiveness\\nin accurately modeling critical EM singularities induced by complex multipath\\nenvironments. To address these fundamental limitations, we propose a novel\\nphysics-inspired RM construction method guided explicitly by the Helmholtz\\nequation, which inherently governs EM wave propagation. Specifically, we\\ntheoretically establish a direct correspondence between EM singularities, which\\ncorrespond to the critical spatial features influencing wireless propagation,\\nand regions defined by negative wave numbers in the Helmholtz equation. Based\\non this insight, we design an innovative dual generative diffusion model (DM)\\nframework comprising one DM dedicated to accurately inferring EM singularities\\nand another DM responsible for reconstructing the complete RM using these\\nsingularities along with environmental contextual information. Our\\nphysics-informed approach uniquely combines the efficiency advantages of\\ndata-driven methods with rigorous physics-based EM modeling, significantly\\nenhancing RM accuracy, particularly in complex propagation environments\\ndominated by multipath effects.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.SY,eess.SY\", \"published\": \"2025-04-22T06:28:13Z\"}"}
