{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04277v1\", \"title\": \"Revolutionizing Newcomers' Onboarding Process in OSS Communities: The\\n  Future AI Mentor\", \"summary\": \"Onboarding newcomers is vital for the sustainability of open-source software\\n(OSS) projects. To lower barriers and increase engagement, OSS projects have\\ndedicated experts who provide guidance for newcomers. However, timely responses\\nare often hindered by experts' busy schedules. The recent rapid advancements of\\nAI in software engineering have brought opportunities to leverage AI as a\\nsubstitute for expert mentoring. However, the potential role of AI as a\\ncomprehensive mentor throughout the entire onboarding process remains\\nunexplored. To identify design strategies of this ``AI mentor'', we applied\\nDesign Fiction as a participatory method with 19 OSS newcomers. We investigated\\ntheir current onboarding experience and elicited 32 design strategies for\\nfuture AI mentor. Participants envisioned AI mentor being integrated into OSS\\nplatforms like GitHub, where it could offer assistance to newcomers, such as\\n``recommending projects based on personalized requirements'' and ``assessing\\nand categorizing project issues by difficulty''. We also collected\\nparticipants' perceptions of a prototype, named ``OSSerCopilot'', that\\nimplemented the envisioned strategies. They found the interface useful and\\nuser-friendly, showing a willingness to use it in the future, which suggests\\nthe design strategies are effective. Finally, in order to identify the gaps\\nbetween our design strategies and current research, we conducted a\\ncomprehensive literature review, evaluating the extent of existing research\\nsupport for this concept. We find that research is relatively scarce in certain\\nareas where newcomers highly anticipate AI mentor assistance, such as\\n``discovering an interested project''. Our study has the potential to\\nrevolutionize the current newcomer-expert mentorship and provides valuable\\ninsights for researchers and tool designers aiming to develop and enhance AI\\nmentor systems.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-05-07T09:27:41Z\"}"}
