{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21615v1\", \"title\": \"Rapid Spectral Evolution of SGR 1935+2154 During its 2022 Outburst\", \"summary\": \"During the 2022 outburst of SGR 1935+2154, a Fast-Radio-Burst-like event (FRB\\n20221014A) and X-ray activities occurred between two spin-up glitches,\\nsuggesting these glitches may connect to multiwavelength phenomenology.\\nHowever, the mechanisms altering the magnetar's magnetosphere to enable radio\\nemission remain unclear. This study presents high-cadence NICER and NuSTAR\\nobservations revealing spectral changes in burst and persistent emission.\\nHardness ratio and spectral analysis reveal significant changes during an\\n\\\"intermediate flare\\\" 2.5 hours before FRB 20221014A. This 80-second flare,\\nreleasing $>(6.3\\\\pm0.2)\\\\times10^{40}$ erg, coincides with a rapid spectral\\nsoftening in both burst and persistent emission and a notable decrease in burst\\noccurrence rate. The intermediate flare is bright enough to be detected if\\nplaced at a few Mpc, and would appear as a fast X-ray transient. This implies\\nthat the connection between magnetar X-ray activity and FRBs can be observed in\\nthe local Universe. Post-flare burst spectra peak near 5 keV, resembling the\\ncharacteristics of the FRB-associated X-ray burst of 2020. Such change\\npersisted for a few hours, implying magnetospheric evolution on similar\\ntimescales. However, no radio emission was detected from post-flare bursts,\\nsuggesting that FRB emission requires conditions beyond peculiar short bursts.\\nThe burst waiting times exhibit a broken power-law distribution, likely\\nresulting from contamination by enhanced persistent emission. Although the\\nbursts appear randomly distributed in the spin phase, the hardness ratio\\nprofile as a function of spin phase follows that of the persistent emission,\\nindicating that X-ray bursts originate at low altitudes.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-30T13:11:08Z\"}"}
