{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21826v1\", \"title\": \"An Underwater, Fault-Tolerant, Laser-Aided Robotic Multi-Modal Dense\\n  SLAM System for Continuous Underwater In-Situ Observation\", \"summary\": \"Existing underwater SLAM systems are difficult to work effectively in\\ntexture-sparse and geometrically degraded underwater environments, resulting in\\nintermittent tracking and sparse mapping. Therefore, we present Water-DSLAM, a\\nnovel laser-aided multi-sensor fusion system that can achieve uninterrupted,\\nfault-tolerant dense SLAM capable of continuous in-situ observation in diverse\\ncomplex underwater scenarios through three key innovations: Firstly, we develop\\nWater-Scanner, a multi-sensor fusion robotic platform featuring a self-designed\\nUnderwater Binocular Structured Light (UBSL) module that enables high-precision\\n3D perception. Secondly, we propose a fault-tolerant triple-subsystem\\narchitecture combining: 1) DP-INS (DVL- and Pressure-aided Inertial Navigation\\nSystem): fusing inertial measurement unit, doppler velocity log, and pressure\\nsensor based Error-State Kalman Filter (ESKF) to provide high-frequency\\nabsolute odometry 2) Water-UBSL: a novel Iterated ESKF (IESKF)-based tight\\ncoupling between UBSL and DP-INS to mitigate UBSL's degeneration issues 3)\\nWater-Stereo: a fusion of DP-INS and stereo camera for accurate initialization\\nand tracking. Thirdly, we introduce a multi-modal factor graph back-end that\\ndynamically fuses heterogeneous sensor data. The proposed multi-sensor factor\\ngraph maintenance strategy efficiently addresses issues caused by asynchronous\\nsensor frequencies and partial data loss. Experimental results demonstrate\\nWater-DSLAM achieves superior robustness (0.039 m trajectory RMSE and 100\\\\%\\ncontinuity ratio during partial sensor dropout) and dense mapping (6922.4\\npoints/m^3 in 750 m^3 water volume, approximately 10 times denser than existing\\nmethods) in various challenging environments, including pools, dark underwater\\nscenes, 16-meter-deep sinkholes, and field rivers. Our project is available at\\nhttps://water-scanner.github.io/.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-30T17:30:13Z\"}"}
