{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06234v1\", \"title\": \"Observing radio transients with Phased ALMA: Pulses from the Galactic\\n  Centre magnetar\", \"summary\": \"Radio transients, such as pulsars and Fast Radio Bursts (FRBs), are primarily\\ndetected at centimetre radio wavelengths, where higher luminosities are found.\\nHowever, observations of sources in dense environments are heavily affected by\\npropagation effects which may hinder a detection. Millimetre wave observations\\nbypass this complication but require the largest radio telescopes to compensate\\nfor the lower flux densities. When used in phased mode, the ALMA radio\\ntelescope provides an equivalent dish size of 84m, being the most sensitive\\ninstrument at mm/sub mm. With its high time resolution it offers a unique\\nopportunity to study radio transients in an unexplored window. We study the\\nGalactic Centre (GC) magnetar, PSR J1745$-$2900, as a laboratory for magnetars\\nin complex magneto-turbulent environments and to link with FRBs. We showcase\\nthe potential of ALMA in phased mode to observe radio transients and to\\nachieve, for some sources, the first ever detections outside the cm wave range.\\nWe studied the GC magnetar using ALMA archival data of Sgr A* at Band 3 from\\nthe 2017 GMVA campaign. We searched in intensity and classified the pulses\\nbased on their circular and linear polarisation properties and arrival phase.\\nWe detected eight pulses with energies in the range of 10$^{29}$ erg. We\\nconstructed its cumulative energy distribution and we fit a power law, where\\nthe event rate scales with energy as $R \\\\propto E^{\\\\gamma}$. The result is an\\nexponent of $\\\\gamma = -2.4 \\\\pm 0.1$. With the $\\\\gamma -$value and the system\\nproperties of phased ALMA, we estimate that over 160 known pulsars could be\\ndetected by ALMA. For repeating FRBs, observing during their peak activity\\nwindow could lead to several detections. We expect that ALMA's lower frequency\\nbands with polarisation capabilities, will serve as a pioneer on mm wave\\nsearches for pulsars and to study complex environments involving radio\\ntransients.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-08T17:32:05Z\"}"}
