{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20940v1\", \"title\": \"Energy-Based Coarse-Graining in Molecular Dynamics: A Flow-Based\\n  Framework Without Data\", \"summary\": \"Coarse-grained (CG) models offer an effective route to reducing the\\ncomplexity of molecular simulations, yet conventional approaches depend heavily\\non long all-atom molecular dynamics (MD) trajectories to adequately sample\\nconfigurational space. This data-driven dependence limits their accuracy and\\ngeneralizability, as unvisited configurations remain excluded from the\\nresulting CG model. We introduce a data-free generative framework for\\ncoarse-graining that directly targets the all-atom Boltzmann distribution. Our\\nmodel defines a structured latent space comprising slow collective variables,\\nwhich are statistically associated with multimodal marginal densities capturing\\nmetastable states, and fast variables, which represent the remaining degrees of\\nfreedom with simple, unimodal conditional distributions. A potentially\\nlearnable, bijective map from the full latent space to the all-atom\\nconfiguration space enables automatic and accurate reconstruction of molecular\\nstructures. The model is trained using an energy-based objective that minimizes\\nthe reverse Kullback-Leibler divergence, relying solely on the interatomic\\npotential rather than sampled trajectories. A tempering scheme is used to\\nstabilize training and promote exploration of diverse configurations. Once\\ntrained, the model can generate unbiased, one-shot equilibrium all-atom\\nsamples. We validate the method on two synthetic systems-a double-well\\npotential and a Gaussian mixture-as well as on the benchmark alanine dipeptide.\\nThe model captures all relevant modes of the Boltzmann distribution, accurately\\nreconstructs atomic configurations, and learns physically meaningful\\ncoarse-grained representations, all without any simulation data.\", \"main_category\": \"physics.chem-ph\", \"categories\": \"physics.chem-ph,cs.LG,physics.comp-ph\", \"published\": \"2025-04-29T17:05:27Z\"}"}
