{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12823v1\", \"title\": \"Trading Prophets: How to Trade Multiple Stocks Optimally\", \"summary\": \"In the single stock trading prophet problem formulated by Correa et al.\\\\\\n(2023), an online algorithm observes a sequence of prices of a stock. At each\\nstep, the algorithm can either buy the stock by paying the current price if it\\ndoesn't already hold the stock, or it can sell the currently held stock and\\ncollect the current price as a reward. The goal of the algorithm is to maximize\\nits overall profit.\\n  In this work, we generalize the model and the results of Correa et al.\\\\ by\\nallowing the algorithm to trade multiple stocks. First, we formulate the\\n$(k,\\\\ell,\\\\ell')$-Trading Prophet Problem, wherein there are $k$ stocks in the\\nmarket, and the online algorithm can hold up to $\\\\ell$ stocks at any time,\\nwhere $\\\\ell\\\\leq k$. The online algorithm competes against an offline algorithm\\nthat can hold at most $\\\\ell'\\\\leq\\\\ell$ stocks at any time. Under the assumption\\nthat prices of different stocks are independent, we show that, for any $\\\\ell$,\\n$\\\\ell'$, and $k$, the optimal competitive ratio of $(k,\\\\ell,\\\\ell')$-Trading\\nProphet Problem is $\\\\min(1/2,\\\\ell/k)$.\\n  We further introduce the more general $\\\\cal{M}$-Trading Prophet Problem over\\na matroid $\\\\cal{M}$ on the set of $k$ stocks, wherein the stock prices at any\\ngiven time are possibly correlated (but are independent across time). The\\nalgorithm is allowed to hold only a feasible subset of stocks at any time. We\\nprove a tight bound of $1/(1+d)$ on the competitive ratio of the\\n$\\\\cal{M}$-Trading Prophet Problem, where $d$ is the density of the matroid.\\n  We then consider the non-i.i.d.\\\\ random order setting over a matroid, wherein\\nstock prices drawn independently from $n$ potentially different distributions\\nare presented in a uniformly random order. In this setting, we achieve a\\ncompetitive ratio of at least $1/(1+d)-\\\\cal{O}(1/n)$, where $d$ is the density\\nof the matroid, matching the hardness result for i.i.d.\\\\ instances as $n$\\napproaches $\\\\infty$.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS\", \"published\": \"2025-04-17T10:34:37Z\"}"}
