{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12163v1\", \"title\": \"Pulsar Coherent Radio Emission from Solitons : Average Emission\\n  Properties\", \"summary\": \"Observations have established that coherent radio emission from pulsars arise\\nat few hundred kilometers above stellar surface. Recent polarization studies\\nhave further demonstrated that plasma instabilities are necessary for charge\\nbunching that gives rise to coherent emission. The formation of charged\\nsolitons in the electron-positron plasma is the only known bunching mechanism\\nthat can be realised at these heights. More than five decades of observations\\nhave revealed a number of emission features that should emerge from any valid\\nradio emission mechanism. We have carried out numerical calculations to find\\nthe features of average emission from curvature radiation due to charged\\nsolitons. The characteristic curvature radiation spectrum has been updated from\\nthe well known one-dimensional dependence into a general two-dimensional form,\\nand contribution from each soliton along observer's line of sight (LOS) has\\nbeen added to reproduce the pulsar emission. The outflowing plasma is formed by\\nsparking discharges above the stellar surface that are located within\\nconcentric rings resembling the core-cone emission beam, and uniform\\ndistribution of solitons along any LOS has been assumed. The observed effects\\nof radius to frequency mapping, where the lower frequency emission originates\\nfrom higher altitudes, is seen in this setup. The power law spectrum and\\nrelative steepening of the core spectra with respect to the cones also emerges.\\nThe estimated polarization position angle reflects the geometrical\\nconfiguration of pulsars as expected. These studies demonstrate the efficacy of\\ncoherent curvature radiation from charged solitons to reproduce the average\\nobservational features of pulsars.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-16T15:12:51Z\"}"}
