{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12007v1\", \"title\": \"Generative Recommendation with Continuous-Token Diffusion\", \"summary\": \"In recent years, there has been a significant trend toward using large\\nlanguage model (LLM)-based recommender systems (RecSys). Current research\\nprimarily focuses on representing complex user-item interactions within a\\ndiscrete space to align with the inherent discrete nature of language models.\\nHowever, this approach faces limitations due to its discrete nature: (i)\\ninformation is often compressed during discretization; (ii) the tokenization\\nand generation for the vast number of users and items in real-world scenarios\\nare constrained by a limited vocabulary. Embracing continuous data presents a\\npromising alternative to enhance expressive capabilities, though this approach\\nis still in its early stages. To address this gap, we propose a novel\\nframework, DeftRec, which incorporates \\\\textbf{de}noising di\\\\textbf{f}fusion\\nmodels to enable LLM-based RecSys to seamlessly support continuous\\n\\\\textbf{t}oken as input and target. First, we introduce a robust tokenizer with\\na masking operation and an additive K-way architecture to index users and\\nitems, capturing their complex collaborative relationships into continuous\\ntokens. Crucially, we develop a denoising diffusion model to process user\\npreferences within continuous domains by conditioning on reasoning content from\\npre-trained large language model. During the denoising process, we reformulate\\nthe objective to include negative interactions, building a comprehensive\\nunderstanding of user preferences for effective and accurate recommendation\\ngeneration. Finally, given a continuous token as output, recommendations can be\\neasily generated through score-based retrieval. Extensive experiments\\ndemonstrate the effectiveness of the proposed methods, showing that DeftRec\\nsurpasses competitive benchmarks, including both traditional and emerging\\nLLM-based RecSys.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR,cs.AI\", \"published\": \"2025-04-16T12:01:03Z\"}"}
