{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20694v1\", \"title\": \"The VMC survey -- LIII. Data release #7. Complete survey data and data\\n  from additional programmes\", \"summary\": \"The near-infrared YJKs Visual and Infrared Survey Telescope for Astronomy\\n(VISTA) survey of the Magellanic Clouds (VMC) is complete and there are also\\ndata from additional programmes enhancing its quality over the original\\nfootprint. This work presents the final data release of the VMC survey, which\\nincludes additional observations and provides an overview of the scientific\\nresults. The overall data quality has been revised and reprocessed standard\\ndata products, that already appeared in previous data releases, are made\\navailable together with new data products. These include individual stellar\\nproper motions, reddening towards red clump stars and source classifications.\\nSeveral data products, such as the parameters of some variable stars and of\\nbackground galaxies, from the VMC publications are associated to a data release\\nfor the first time. The data are processed using the VISTA Data Flow System and\\nadditional products, e.g. catalogues with point-spread function photometry or\\ntables with stellar proper motions, are obtained with software developed by the\\nsurvey team. This release supersedes all previous data releases of the VMC\\nsurvey for the combined (deepstacked) data products, whilst providing\\nadditional (complementary) images and catalogues of single observations per\\nfilter. Overall, it includes about 64 million detections, split nearly evenly\\nbetween sources with stellar or galaxy profiles. The VMC survey provides a\\nhomogeneous data set resulting from deep and multi-epoch YJKs-band imaging\\nobservations of the Large and Small Clouds, the Bridge and two fields in the\\nStream. The VMC data represent a valuable counterpart for sources detected at\\nother wavelengths for both stars and background galaxies.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-29T12:18:24Z\"}"}
