{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03707v1\", \"title\": \"Two-electron quantum walks probe entanglement and decoherence in an\\n  electron microscope\", \"summary\": \"Classical physics is often a good approximation for quantum systems composed\\nof many interacting particles, although wavepacket dispersion and scattering\\nprocesses continuously induce delocalization and entanglement. According to\\ndecoherence theory, an entangled ensemble can appear classical when only a\\nsubset of all particles is observed. This emergence of macroscopic phenomena\\nfrom quantum interactions is, for example, relevant for phase transitions,\\nquantum thermalization, hydrodynamics, spin liquids, or time crystals. However,\\nentanglement and decoherence in free electrons have not yet been explored,\\nalthough the electron is a fundamental elementary particle with extraordinary\\ntechnological relevance. Here, we investigate the degree of coherence and\\nentanglement in a free-space electron gas in the beam of an ultrafast electron\\nmicroscope. Inspired by the strong interaction of free electrons with laser\\nlight, we introduce a two-electron quantum walk that enables quantum state\\ntomography of entangled or partially entangled electron-electron pairs. We\\napply this novel diagnostic to study the creation and loss of entanglement in\\nshort pulses of hundreds of electrons. We observe high-contrast two-electron\\ninterferences and signs of small electron-electron entanglement that we explain\\nby competition between entangling Coulomb interactions and decoherence effects\\nfrom unmeasured reservoir electrons. The ability to characterize entangled\\nfree-electron quantum states will provide insight into the emergence of\\nclassical phenomena from quantum principles in the realm of particles with mass\\nand charge, and will have practical applications in low-dose electron\\nmicroscopy, ghost imaging, or quantum electron microscopy.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-05-06T17:27:36Z\"}"}
