{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12052v1\", \"title\": \"Bayesian dynamic borrowing considering semantic similarity between\\n  outcomes for disproportionality analysis in FAERS\", \"summary\": \"We present a Bayesian dynamic borrowing (BDB) approach to enhance the\\nquantitative identification of adverse events (AEs) in spontaneous reporting\\nsystems (SRSs). The method embeds a robust meta-analytic predictive (MAP) prior\\nwithin a Bayesian hierarchical model and incorporates semantic similarity\\nmeasures (SSMs) to enable weighted information sharing from MedDRA Preferred\\nTerms (PTs) that are clinical similar to the target PT. This continuous\\nsimilarity-based borrowing addresses limitation of rigid hierarchical grouping\\nin current disproportionality analysis (DPA).\\n  Using data from the FDA Adverse Event Reporting System (FAERS) between 2015\\nand 2019, we evalute this approach - termed IC SSM - against standard\\nInformation Component (IC) analysis and IC with borrowing at the MedDRA\\nhigh-level group term (HLGT) level. A novel references set (PVLens), derived\\nfrom FDA product label updates, enabled prospective evaluation of method\\nperformance in identifying AEs prior to official labeling.\\n  The IC SSM approach demonstrated improved sensitivity compared to both\\ntraditional IC and HLGT-based borrowing, with minor trade-offs in F1 scores and\\nYouden's index. IC SSM consistently identified more true positives and detected\\nsignals over 5 months sooner than traditional IC. Despite a marginally lower\\naggregate Youden's index, IC SSM showed higher performance in the early\\npost-marketing period, providing more stable and relevant estimates than\\nHLGT-based borrowing and traditional IC.\\n  These findings support the use of SSM-informed Bayesian borrowing as a\\nscalable and context-aware enhancement to traditional DPA methods. Future\\nresearch should validate this approach across other datasets and explore\\nadditional similarity metrics and Bayesian inference strategies using\\ncase-level data.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-04-16T13:06:24Z\"}"}
