{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15757v1\", \"title\": \"Retrieving day- and nightside atmospheric properties of the ultra-hot\\n  Jupiter TOI-2109b. Detection of Fe and CO emission lines and evidence for\\n  inefficient heat transport\", \"summary\": \"The ultra-hot Jupiter (UHJ) TOI-2109b marks the lower edge of the equilibrium\\ntemperature gap between 3500 K and 4500 K, an unexplored thermal regime that\\nseparates KELT-9b, the hottest planet yet discovered, from all other currently\\nknown gas giants. To study the structure of TOI-2109b's atmosphere, we obtained\\nhigh-resolution emission spectra of both the planetary day- and nightsides with\\nCARMENES and CRIRES$^+$. By applying the cross-correlation technique, we\\nidentified the emission signatures of Fe I and CO, as well as a thermal\\ninversion layer in the dayside atmosphere; no significant H$_2$O signal was\\ndetected from the dayside. None of the analyzed species were detectable from\\nthe nightside atmosphere. We applied a Bayesian retrieval framework that\\ncombines high-resolution spectroscopy with photometric measurements to\\nconstrain the dayside atmospheric parameters and derive upper limits for the\\nnightside hemisphere. The dayside thermal inversion extends from 3200 K to 4600\\nK, with an atmospheric metallicity consistent with that of the host star (0.36\\ndex). Only weak constraints could be placed on the C/O ratio ($>$ 0.15). The\\nretrieved spectral line broadening is consistent with tidally locked rotation,\\nindicating the absence of strong dynamical processes. An upper temperature\\nlimit of 2400 K and a maximum atmospheric temperature gradient of 700 K/log bar\\ncould be derived for the nightside. Comparison of the retrieved dayside T-p\\nprofile with theoretical models, the absence of strong atmospheric dynamics,\\nand significant differences in the thermal constraints between the day- and\\nnightside hemispheres suggest a limited heat transport efficiency across the\\nplanetary atmosphere. Overall, our results place TOI-2109b in a transitional\\nregime between the UHJs below the thermal gap, which show both CO and H$_2$O\\nemission lines, and KELT-9b, where molecular features are largely absent.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-22T10:10:02Z\"}"}
