{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01885v1\", \"title\": \"Observing Spatial Charge and Spin Correlations in a Strongly-Interacting\\n  Fermi Gas\", \"summary\": \"Two-dimensional correlated fermions constitute a cornerstone of quantum\\nmatter, covering a broad fundamental and technological scope, and have\\nattracted increasing interest with the emergence of modern materials such as\\nhigh-$T_{\\\\rm c}$ superconductors, graphene, topological insulators, and Moir\\\\'e\\nstructures. Atom-based quantum simulators provide a new pathway to understand\\nthe microscopic mechanisms occurring at the heart of such systems. In this\\nwork, we explore two-dimensional attractive Fermi gases at the microscopic\\nlevel by probing spatial charge and spin correlations in situ. Using\\natom-resolved continuum quantum gas microscopy, we directly observe fermion\\npairing and study the evolution of two- and three-point correlation functions\\nas inter-spin attraction is increased. The precision of our measurement allows\\nus to reveal a marked dip in the pair correlation function, fundamentally\\nforbidden by the mean-field result based on Bardeen-Cooper-Schrieffer (BCS)\\ntheory but whose existence we confirm in exact auxiliary-field quantum Monte\\nCarlo calculations. We demonstrate that the BCS prediction is critically\\ndeficient not only in the superfluid crossover regime but also deep in the\\nweakly attractive side. Guided by our measurements, we find a remarkable\\nrelation between two- and three-point correlations that establishes the\\ndominant role of pair-correlations. Finally, leveraging local single-pair\\nlosses, we independently characterize the short-range behavior of pair\\ncorrelations, via the measurement of Tan's Contact, and find excellent\\nagreement with numerical predictions. Our measurements provide an unprecedented\\nmicroscopic view into two-dimensional Fermi gases and constitute a paradigm\\nshift for future studies of strongly-correlated fermionic matter in the\\ncontinuum.\", \"main_category\": \"cond-mat.quant-gas\", \"categories\": \"cond-mat.quant-gas,cond-mat.str-el,quant-ph\", \"published\": \"2025-04-02T16:42:00Z\"}"}
