{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24131v1\", \"title\": \"A simple and general framework for the construction of exactly\\n  div-curl-grad compatible discontinuous Galerkin finite element schemes on\\n  unstructured simplex meshes\", \"summary\": \"We introduce a new family of discontinuous Galerkin (DG) finite element\\nschemes for the discretization of first order systems of hyperbolic partial\\ndifferential equations (PDE) on unstructured simplex meshes in two and three\\nspace dimensions that respect the two basic vector calculus identities exactly\\nalso at the discrete level, namely that the curl of the gradient is zero and\\nthat the divergence of the curl is zero. The key ingredient here is the\\nconstruction of two compatible discrete nabla operators, a primary one and a\\ndual one, both defined on general unstructured simplex meshes in multiple space\\ndimensions. Our new schemes extend existing cell-centered finite volume methods\\nbased on corner fluxes to arbitrary high order of accuracy in space. An\\nimportant feature of our new method is the fact that only two different\\ndiscrete function spaces are needed to represent the numerical solution, and\\nthe choice of the appropriate function space for each variable is related to\\nthe origin and nature of the underlying PDE. The first class of variables is\\ndiscretized at the aid of a discontinuous Galerkin approach, where the\\nnumerical solution is represented via piecewise polynomials of degree N and\\nwhich are allowed to jump across element interfaces. This set of variables is\\nrelated to those PDE which are mere consequences of the definitions, derived\\nfrom some abstract scalar and vector potentials, and for which involutions like\\nthe divergence-free or the curl-free property must hold if satisfied by the\\ninitial data. The second class of variables is discretized via classical\\ncontinuous Lagrange finite elements of approximation degree M=N+1 and is\\nrelated to those PDE which can be derived as the Euler-Lagrange equations of an\\nunderlying variational principle.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA\", \"published\": \"2025-03-31T14:17:11Z\"}"}
