{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04996v1\", \"title\": \"Inter-Diffusion Generation Model of Speakers and Listeners for Effective\\n  Communication\", \"summary\": \"Full-body gestures play a pivotal role in natural interactions and are\\ncrucial for achieving effective communication. Nevertheless, most existing\\nstudies primarily focus on the gesture generation of speakers, overlooking the\\nvital role of listeners in the interaction process and failing to fully explore\\nthe dynamic interaction between them. This paper innovatively proposes an\\nInter-Diffusion Generation Model of Speakers and Listeners for Effective\\nCommunication. For the first time, we integrate the full-body gestures of\\nlisteners into the generation framework. By devising a novel inter-diffusion\\nmechanism, this model can accurately capture the complex interaction patterns\\nbetween speakers and listeners during communication. In the model construction\\nprocess, based on the advanced diffusion model architecture, we innovatively\\nintroduce interaction conditions and the GAN model to increase the denoising\\nstep size. As a result, when generating gesture sequences, the model can not\\nonly dynamically generate based on the speaker's speech information but also\\nrespond in realtime to the listener's feedback, enabling synergistic\\ninteraction between the two. Abundant experimental results demonstrate that\\ncompared with the current state-of-the-art gesture generation methods, the\\nmodel we proposed has achieved remarkable improvements in the naturalness,\\ncoherence, and speech-gesture synchronization of the generated gestures. In the\\nsubjective evaluation experiments, users highly praised the generated\\ninteraction scenarios, believing that they are closer to real life human\\ncommunication situations. Objective index evaluations also show that our model\\noutperforms the baseline methods in multiple key indicators, providing more\\npowerful support for effective communication.\", \"main_category\": \"cs.GR\", \"categories\": \"cs.GR,cs.CV,cs.SD,eess.AS\", \"published\": \"2025-05-08T07:00:58Z\"}"}
