{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03206v1\", \"title\": \"Stable partial dislocation complexes in GaN as charge carrier lifetime\\n  modifiers for terahertz device applications by molecular dynamics and\\n  first-principle simulations\", \"summary\": \"Wurtzite GaN is a promising material for applications in photoconductive THz\\nradiation sources. For this purpose, the photogenerated charge carriers\\nlifetime of the order of tenths of picoseconds is required. A controllable\\nlifetime reduction may be considered to achieve by creating recombination\\nactive stable dislocation complexes formed by mobile basal-plane Shockley\\npartial dislocations (PDs). In this work, formation pathways and stability of\\nPD complexes in basal planes of wurzite GaN are studied by molecular dynamics\\n(MD) simulations. The simulations reveal the formation of stable complexes by\\nattractive interaction of two 30{\\\\deg} or two 90{\\\\deg} PDs with opposite\\nBurgers vectors located in consecutive (0001) planes. Ones formed, these\\ncomplexes change neither their positions, not the atomic configurations during\\nsimulated anneal at 1500 K up to the times of 5 ns. The MD results are used as\\nan input for density functional theory calculations to refine the atomic\\nstructures of the complex cores and to investigate their electronic properties.\\nThe calculated band structures of GaN with 30{\\\\deg}-30{\\\\deg} and\\n90{\\\\deg}-90{\\\\deg} dislocation complexes indicate localized energy levels in the\\nband gap near the top of the valence band and the conduction band bottom. The\\ncalculations of the partial electronic states density confirm the possibility\\nof electron-hole recombination between the states localized at the PD complex\\ncores. These recombination characteristics are distinctly reflected in the\\ncalculated absorption spectra. We conclude that creating such PD complexes in\\nrequired concentration may be a tool for tailoring the recombination properties\\nof wurtzite GaN for THz radiation generation applications.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-05-06T05:43:23Z\"}"}
