{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00445v1\", \"title\": \"Effect of Ti$_2$Pd(Ni) on the Transformation Behavior in Sputtered\\n  Ti-rich TiNiPd Shape Memory Alloys\", \"summary\": \"TiNiPd based shape memory alloys (SMAs) share similar microstructural\\nfeatures as TiNiCu-based SMAs known for their exceptional resistance to\\nfunctional fatigue due to their high crystallographic compatibility, nanometer\\nsized grains and coherent precipitates, making them an ideal system to further\\nexplore the critical factors influencing cyclic stability. In this study, we\\ninvestigate the effect of heat treatments (500 {\\\\deg}C, 600 {\\\\deg}C, 700\\n{\\\\deg}C and 800 {\\\\deg}C) on the cyclic stability and microstructure of\\nfree-standing, magnetron-sputtered Ti$_{53.6}$Ni$_{35.2}$Pd$_{11.2}$ films. All\\nheat treatments promote the formation of Ti$_2$Pd(Ni) precipitates and result\\nin a similar grain size (~1-4 $\\\\mu$m). Lower heat treatment temperatures\\nimprove the cyclic stability of the stress induced transformation while\\nreducing transformation temperatures and latent heat. Temperature dependent\\nX-ray diffraction reveals a complex microstructure for the martensite phase\\nwith Ti$_2$Pd(Ni), Ti$_2$Ni(Pd), TiNiPd(B2), B19/B19$'$ and R-phase. The\\nthermal phase transition changes from a distinct 1st order to a 2nd order like\\ntransition, accompanied by increasing amount of remanent austenite and R-phase,\\nwith nearly no change for the sample heat treated at 500 {\\\\deg}C. In situ\\nstress dependent X-ray diffraction demonstrates a significant difference\\nbetween the temperature and stress induced phase transformation for this heat\\ntreatment. The observed semi crystalline microstructure, featuring nano domains\\nof Ti$_2$Pd(Ni) precipitates in the sample heat-treated at 500 {\\\\deg}C, leads\\nto a mixture of long range martensitic and strain glass transition. This study\\nhighlights the impact of heat treatment and microstructure on the phase\\ntransformation behavior and functional fatigue in Ti-rich TiNiPd alloys.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-05-01T10:39:49Z\"}"}
