{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03306v1\", \"title\": \"Magnetic-field dependent VB- spin decoherence in hexagonal boron\\n  nitrides: A first-principles study\", \"summary\": \"The negatively charged boron vacancy (VB-) in h-BN operates as an optically\\naddressable spin qubit in two-dimensional materials. To further advance the\\nspin into a versatile qubit platform, it is imperative to understand its spin\\ndecoherence precisely, which is currently one of the major limiting factors for\\nthe VB- spin. In this study, we employ a first-principles quantum many-body\\nsimulation to investigate the decoherence of the VB- spin in dense nuclear spin\\nbaths as a function of magnetic field from 100 G to 3 T, revealing several\\nunique phenomena and their origin. We found that decoherence mechanism changes\\nat a specific magnetic field, which we refer to as the transition boundary\\n(TB). Below the TB, the decoherence occurs within submicrosecond and it is\\nprimarily governed by independent nuclear spin dynamics. Above the TB,\\npair-wise flip-flop transitions become the dominant decoherence source, leading\\nto the decoherence time of tens of microseconds. Building upon this\\nunderstanding, we developed a method to predict the TB depending on the\\nisotopic composition of h-BN, leading to TBs at 5020 G for h-10B14N and 2050 G\\nfor h-11B14N, which is in excellent agreement with our numerical results. We\\nshow that the larger TB in h-10BN derives from the larger nuclear spin of 10B\\nthan that of 11B, giving rise to strong nuclear modulation effects over a wider\\nrange of magnetic field in 10BN than in 11BN. We also explain the microscopic\\norigin of several unique features in the decoherence, such as magnetic-field\\ninsensitive fast modulation found below the TB. Our results provide essential\\ninsight on the role of the 100% dense nuclear spin environment with large\\nnuclear spins in the VB- decoherence, opening a new avenue for advancing the\\nspin qubit in h-BN as robust platform in quantum information science.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,physics.app-ph\", \"published\": \"2025-05-06T08:39:48Z\"}"}
