{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20519v1\", \"title\": \"Conversations with AI Chatbots Increase Short-Term Vaccine Intentions\\n  But Do Not Outperform Standard Public Health Messaging\", \"summary\": \"Large language model (LLM) based chatbots show promise in persuasive\\ncommunication, but existing studies often rely on weak controls or focus on\\nbelief change rather than behavioral intentions or outcomes. This\\npre-registered multi-country (US, Canada, UK) randomized controlled trial\\ninvolving 930 vaccine-hesitant parents evaluated brief (three-minute)\\nmulti-turn conversations with LLM-based chatbots against standard public health\\nmessaging approaches for increasing human papillomavirus (HPV) vaccine\\nintentions for their children. Participants were randomly assigned to: (1) a\\nweak control (no message), (2) a strong control reflecting the standard of care\\n(reading official public health materials), or (3 and 4) one of two chatbot\\nconditions. One chatbot was prompted to deliver short, conversational\\nresponses, while the other used the model's default output style (longer with\\nbullet points). While chatbot interactions significantly increased\\nself-reported vaccination intent (by 7.1-10.3 points on a 100-point scale)\\ncompared to no message, they did not outperform standard public health\\nmaterials, with the conversational chatbot performing significantly worse.\\nAdditionally, while the short-term effects of chatbot interactions faded during\\na 15-day follow-up, the effects of public health material persisted relative to\\nno message. These findings suggest that while LLMs can effectively shift\\nvaccination intentions in the short-term, their incremental value over existing\\npublic health communications is questionable, offering a more tempered view of\\ntheir persuasive capabilities and highlighting the importance of integrating\\nAI-driven tools alongside, rather than replacing, current public health\\nstrategies.\", \"main_category\": \"cs.CY\", \"categories\": \"cs.CY,cs.HC\", \"published\": \"2025-04-29T07:59:46Z\"}"}
