{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07861v1\", \"title\": \"Horizons, throats and bounces in hybrid metric-Palatini gravity with a\\n  non-zero potential\", \"summary\": \"This work conducts an in-depth exploration of exact electrically charged\\nsolutions, including traversable wormholes, black holes, and black bounces,\\nwithin the framework of the scalar-tensor representation of hybrid\\nmetric-Palatini gravity (HMPG) with a non-zero scalar potential. By integrating\\nprinciples from both the metric and Palatini formulations, HMPG provides a\\nflexible approach to addressing persistent challenges in General Relativity\\n(GR), such as the late-time cosmic acceleration and the nature of dark matter.\\nUnder the assumption of spherical symmetry, we employ an inverse problem\\ntechnique to derive exact solutions in both the Jordan and Einstein conformal\\nframes. This method naturally leads to configurations involving either\\ncanonical or phantom scalar fields. A thorough examination of horizon\\nstructures, throat conditions, asymptotic behaviour, and curvature regularity\\n(via the Kretschmann scalar) reveals the intricate causal structures permitted\\nby this theoretical model. The analysis uncovers a diverse range of geometric\\nconfigurations, with the phantom sector exhibiting a notably richer spectrum of\\nsolutions than the canonical case. These solutions encompass traversable\\nwormholes, black universe models, where the interior of a black hole evolves\\ninto an expanding cosmological phase rather than a singularity, as well as\\nblack bounce structures and multi-horizon black holes. The results demonstrate\\nthat introducing a non-zero scalar potential within HMPG significantly expands\\nthe array of possible gravitational solutions, yielding complex causal and\\ncurvature properties that go beyond standard GR. Consequently, HMPG stands out\\nas a powerful theoretical framework for modelling extreme astrophysical\\nenvironments, where deviations from classical gravity are expected to play a\\ncrucial role.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc,astro-ph.HE,hep-th\", \"published\": \"2025-04-10T15:37:06Z\"}"}
