{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01469v1\", \"title\": \"Mechanisms of Dual-Band Emission in Sb-Doped Rare-Earth Phosphates\\n  Revealed\", \"summary\": \"The Sb$^{3+}$ ion has garnered significant interest due to its effectiveness\\nin boosting the optical properties of host materials. Among the interesting\\nphenomena is the commonly observed dual-band emission, which has often been\\ninterpreted by adopting the phenomenological model that explains the dual-band\\nemission (``ultraviolet band'' and ``visible band'') in Sb-doped $L$PO$_{4}$\\n($L$ = Sc, Y, Lu). However, the model for Sb-doped $L$PO$_{4}$ series itself\\nhas not been well understood theoretically. In this work, we employ\\nfirst-principles calculations combined with group-theory analysis to clarify\\nthe underlying physical mechanism behind dual-band emission in Sb-doped\\n$L$PO$_{4}$ series. We demonstrate that the dual-band arises from two\\nexcited-state equilibrium structures, one exhibits a relatively small\\ndistortion with respect to the ground-state equilibrium structure, while the\\nother displays a significantly larger distortion, characteristic of an\\n``off-center'' configuration. The deviations from the ground-state\\nconfiguration are dominated by two distinct vibrational modes, $b_2$ and $e$\\nmodes, involving the Jahn-Teller effect and the pseudo Jahn-Teller effect,\\nrespectively. Furthermore, charge transition levels and energy barriers\\ncalculated using the climbing image nudged elastic band (CI-NEB) method have\\naided in understanding the relaxation between the two excited-state\\nconfigurations and the property changes across the Sc, Y, and Lu series. These\\ninsights provide a basis for understanding the exotic properties of Sb$^{3+}$\\nin other hosts and may facilitate the design of optical materials in a broader\\nrange of systems involving Sb$^{3+}$ ions.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-02T08:23:34Z\"}"}
