{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10911v1\", \"title\": \"Low-Overhead Channel Estimation Framework for Beyond Diagonal\\n  Reconfigurable Intelligent Surface Assisted Multi-User MIMO Communication\", \"summary\": \"Beyond diagonal reconfigurable intelligent surface (BD-RIS) refers to a\\nfamily of RIS architectures characterized by scattering matrices not limited to\\nbeing diagonal and enables higher wave manipulation flexibility and large\\nperformance gains over conventional (diagonal) RIS. To achieve those promising\\ngains, accurate channel state information (CSI) needs to be acquired in BD-RIS\\nassisted communication systems. However, the number of coefficients in the\\ncascaded channels to be estimated in BD-RIS assisted systems is significantly\\nlarger than that in conventional RIS assisted systems, because the channels\\nassociated with the off-diagonal elements of the scattering matrix have to be\\nestimated as well. Surprisingly, for the first time in the literature, this\\npaper rigorously shows that the uplink channel estimation overhead in BD-RIS\\nassisted systems is actually of the same order as that in the conventional RIS\\nassisted systems. This amazing result stems from a key observation: for each\\nuser antenna, its cascaded channel matrix associated with one reference BD-RIS\\nelement is a scaled version of that associated with any other BD-RIS element\\ndue to the common RIS-base station (BS) channel. In other words, the number of\\nindependent unknown variables is far less than it would seem at first glance.\\nBuilding upon this property, this paper manages to characterize the minimum\\noverhead to perfectly estimate all the channels in the ideal case without noise\\nat the BS, and propose a twophase estimation framework for the practical case\\nwith noise at the BS. Numerical results demonstrate outstanding channel\\nestimation overhead reduction over existing schemes in BD-RIS assisted systems.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP,cs.IT,math.IT\", \"published\": \"2025-04-15T06:48:08Z\"}"}
