{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04896v1\", \"title\": \"Understanding and Design of Interstitial Oxygen Conductors\", \"summary\": \"Highly efficient oxygen active materials that react with, absorb, and\\ntransport oxygen is essential for fuel cells, electrolyzers and related\\napplications. While vacancy mediated oxygen ion conductors have long been the\\nfocus of research, they are limited by high migration barriers at intermediate\\ntemperatures, which hinder their practical applications. In contrast,\\ninterstitial oxygen conductors exhibit significantly lower migration barriers\\nenabling faster ionic conductivity at lower temperatures. This review\\nsystematically examines both well established and recently identified families\\nof interstitial oxygen ion conductors, focusing on how their unique structural\\nmotifs such as corner sharing polyhedral frameworks, isolated polyhedral, and\\ncage like architectures, facilitate low migration barriers through interstitial\\nand interstitialcy diffusion mechanisms. A central discussion of this review\\nfocuses on the evolution of design strategies, from targeted donor doping,\\nelement screening, and physical intuition descriptor material discovery, which\\nleverage computational tools to explore vast chemical spaces in search of new\\ninterstitial conductors. The success of these strategies demonstrates that a\\nsignificant, largely unexplored space remains for discovering high performing\\ninterstitial oxygen conductors. Crucial features enabling high performance\\ninterstitial oxygen diffusion include the availability of electrons for oxygen\\nreduction and sufficient structural flexibility with accessible volume for\\ninterstitial accommodation. This review concludes with a forward looking\\nperspective, proposing a knowledge driven methodology that integrates current\\nunderstanding with data centric approaches to identify promising interstitial\\noxygen conductors outside traditional search paradigms.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-07T10:08:31Z\"}"}
