{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10257v1\", \"title\": \"Spectral estimation for high-dimensional linear processes\", \"summary\": \"We propose a novel estimation procedure for certain spectral distributions\\nassociated with a class of high dimensional linear time series. The processes\\nunder consideration are of the form $X_t = \\\\sum_{\\\\ell=0}^\\\\infty \\\\mathbf{A}_\\\\ell\\nZ_{t-\\\\ell}$ with iid innovations $(Z_t)$. The key structural assumption is that\\nthe coefficient matrices and the variance of the innovations are simultaneously\\ndiagonalizable in a common orthonormal basis. We develop a strategy for\\nestimating the joint spectral distribution of the coefficient matrices and the\\ninnovation variance by making use of the asymptotic behavior of the eigenvalues\\nof appropriately weighted integrals of the sample periodogram. Throughout we\\nwork under the asymptotic regime $p,n \\\\to \\\\infty$, such that $p/n\\\\to c \\\\in\\n(0,\\\\infty)$, where $p$ is the dimension and $n$ is the sample size. Under this\\nsetting, we first establish a weak limit for the empirical distribution of\\neigenvalues of the aforementioned integrated sample periodograms. This result\\nis proved using techniques from random matrix theory, in particular the\\ncharacterization of weak convergence by means of the Stieltjes transform of\\nrelevant distributions. We utilize this result to develop an estimator of the\\njoint spectral distribution of the coefficient matrices, by minimizing an\\n$L^\\\\kappa$ discrepancy measure, for $\\\\kappa \\\\geq 1$, between the empirical and\\nlimiting Stieltjes transforms of the integrated sample periodograms. This is\\naccomplished by assuming that the joint spectral distribution is a discrete\\nmixture of point masses. We also prove consistency of the estimator\\ncorresponding to the $L^2$ discrepancy measure. We illustrate the methodology\\nthrough simulations and an application to stock price data from the S\\\\&P 500\\nseries.\", \"main_category\": \"math.ST\", \"categories\": \"math.ST,stat.TH\", \"published\": \"2025-04-14T14:19:43Z\"}"}
