{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17744v1\", \"title\": \"Nearby open clusters with tidal features: golden sample selection and 3D\\n  structure\", \"summary\": \"Open clusters offer unique opportunities to study stellar dynamics and\\nevolution under the influence of their internal gravity, the Milky Way's\\ngravitational field, and the interactions with encounters. Using the Gaia DR3\\ndata for a catalog of open clusters within 500 parsecs that exhibit tidal\\nfeatures reported by the literature, we apply a novel method based on 3D\\nprincipal component analysis to select a ``golden sample'' of nearby open\\nclusters with minimal line-of-sight distortions. This approach ensures a\\nsystematic comparison of 3D and 2D structural parameters for tidally perturbed\\nclusters. The selected golden sample includes Blanco 1, Melotte 20, Melotte 22,\\nNGC 2632, NGC 7092, NGC 1662, Roslund 6 and Melotte 111. We analyze these\\nclusters by fitting both 2D and 3D King Profiles to their stellar density\\ndistributions. Our results reveal systematic discrepancies: most of the golden\\nsample clusters exhibit larger 3D tidal radii compared to their 2D\\ncounterparts, demonstrating that the 2D projection effects bias the measured\\ncluster size. Furthermore, the 3D density profiles show stronger deviations\\nfrom King profiles at the tidal radii ($\\\\Delta \\\\rho_{\\\\rm 3D} > \\\\Delta \\\\rho_{\\\\rm\\n2D}$), highlighting enhanced sensitivity to tidal disturbances. Additionally,\\nwe investigate the spatial distribution of cluster members relative to their\\nbulk motion in the Galactic plane. We find that some clusters exhibit tidal\\nfeatures oriented perpendicular to their direction of motion, which can be\\nattributed to the fact that the current surveys only detect the curved inner\\nregions of the tidal features. In conclusion, this work offers a golden sample\\nof nearby open clusters that are most reliable for 3D structure analysis and\\nunderscores the necessity of 3D analysis in characterizing OC morphological\\nasymmetries, determining cluster size, and identifying tidal features.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.SR\", \"published\": \"2025-04-24T17:02:37Z\"}"}
