{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05377v1\", \"title\": \"Salt-induced gelation of nonionic sucrose ester dispersions\", \"summary\": \"The dispersions of nonionic sucrose ester surfactants in water exhibit a\\nhighly negative zeta-potential, though its origin remains controversial. The\\naddition of electrolytes to these dispersions may influence their\\nzeta-potential, thus potentially affecting their physicochemical properties.\\nThe electrolyte- and pH- driven gelation of aqueous dispersions of commercial\\nsucrose stearate (S970) containing ca. 1:1 monoesters and diesters was studied\\nusing optical microscopy, rheological and zeta-potential measurements, and\\nsmall-angle X-ray scattering techniques. At low electrolyte concentrations and\\npH $\\\\gtrapprox$ 5, 0.5-5 wt. % S970 dispersions exhibited low viscosities and\\nbehaved as freely flowing liquids. The addition of electrolytes of low\\nconcentrations, e.g. 9 mM NaCl or 1.5 mM MgCl$_2$, induced the formation of a\\nnon-flowing gels. This sol-gel transition occurred due to the partial screening\\nof the diesters particles charge, allowing the formation of an attractive gel\\nnetwork, spanning across the dispersion volume. Complete charge screening,\\nhowever, led to a gel-sol transition and phase separation. Gel formation was\\nobserved also by pH variation without electrolyte addition, whereas the\\naddition of free fatty acids had negligible impact on dispersion properties.\\nThese findings support the hypothesis that the negative charge in sucrose ester\\ndispersions arises from hydroxyl anions adsorption on particles surfaces. Gels\\nwere formed using just 1.3 wt. % surfactant, and the critical electrolyte\\nconcentration for gelation was found to scale approximately with the square of\\nthe cation charge, in agreement with the low surface charge density theory. The\\nbiodegradable sucrose esters gels offer a sustainable alternative for\\nstructuring personal and home care products, replacing the wormlike micelles of\\nsynthetic surfactants typically used at much higher surfactant and salt\\nconcentrations.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-05-08T16:11:33Z\"}"}
