{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20905v1\", \"title\": \"Resonant inelastic X-ray scattering investigation of Hund's and\\n  spin-orbit coupling in $5d^2$ double perovskites\", \"summary\": \"$\\\\mathrm{B}$ site ordered $5d^2$ double perovskites ($\\\\mathrm{A_2BB'O_6,\\\\\\nB'}=5d^2)$ display a remarkable range of physical properties upon variation of\\nthe chosen $\\\\mathrm{B}$ and $\\\\mathrm{B'}$ site ions. This sensitivity to\\nchemical substitution reflects the delicate balance and profound impact of\\nstrong electronic correlation and spin-orbit coupling in such systems. We\\npresent rhenium $L_2$ and $L_3$ resonant inelastic X-ray scattering (RIXS)\\nmeasurements of two such physically dissimilar materials, Mott-insultating\\n$\\\\mathrm{Ba_2YReO_6}$ and semiconducting $\\\\mathrm{Sr_2CrReO_6}$. Despite these\\ndifferences, our RIXS results reveal similar energy scales of Hund's ($J_H$)\\nand spin-orbit coupling ($\\\\lambda$) in the two materials, with both systems\\nfirmly in the intermediate Hund's coupling regime\\n($\\\\mathcal{O}(J_H/\\\\lambda)\\\\sim 1$). However, there are clear differences in\\ntheir RIXS spectra. The conductive character of $\\\\mathrm{Sr_2CrReO_6}$ broadens\\nand obfuscates the atomic transitions within an electron-hole continuum, while\\nthe insulating character of $\\\\mathrm{Ba_2YReO_6}$ results in sharp atomic\\nexcitations. This contrast in their RIXS spectra despite their similar energy\\nscales reflects a difference in the itinerancy-promoting hopping integral and\\nillustrates the impact of the local crystal environment in double perovskites.\\nFinally, $L_2$ and $L_3$ edge analyses of the atomic excitations in\\n$\\\\mathrm{Ba_2YReO_6}$ reveal that the energy scales of Hund's and spin-orbit\\ncoupling are in fact inverted compared to previously reported values. We\\npresent exact diagonalization calculations of the RIXS spectra at both edges\\nwhich show good agreement with our results for new energy scales of\\n$\\\\lambda=0.290(5)$ eV and $J_H=0.38(2)$ eV ($J_H/\\\\lambda=1.30(5)$).\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el\", \"published\": \"2025-04-29T16:20:47Z\"}"}
