{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13061v1\", \"title\": \"ArtistAuditor: Auditing Artist Style Pirate in Text-to-Image Generation\\n  Models\", \"summary\": \"Text-to-image models based on diffusion processes, such as DALL-E, Stable\\nDiffusion, and Midjourney, are capable of transforming texts into detailed\\nimages and have widespread applications in art and design. As such, amateur\\nusers can easily imitate professional-level paintings by collecting an artist's\\nwork and fine-tuning the model, leading to concerns about artworks' copyright\\ninfringement. To tackle these issues, previous studies either add visually\\nimperceptible perturbation to the artwork to change its underlying styles\\n(perturbation-based methods) or embed post-training detectable watermarks in\\nthe artwork (watermark-based methods). However, when the artwork or the model\\nhas been published online, i.e., modification to the original artwork or model\\nretraining is not feasible, these strategies might not be viable.\\n  To this end, we propose a novel method for data-use auditing in the\\ntext-to-image generation model. The general idea of ArtistAuditor is to\\nidentify if a suspicious model has been finetuned using the artworks of\\nspecific artists by analyzing the features related to the style. Concretely,\\nArtistAuditor employs a style extractor to obtain the multi-granularity style\\nrepresentations and treats artworks as samplings of an artist's style. Then,\\nArtistAuditor queries a trained discriminator to gain the auditing decisions.\\nThe experimental results on six combinations of models and datasets show that\\nArtistAuditor can achieve high AUC values (> 0.937). By studying\\nArtistAuditor's transferability and core modules, we provide valuable insights\\ninto the practical implementation. Finally, we demonstrate the effectiveness of\\nArtistAuditor in real-world cases by an online platform Scenario. ArtistAuditor\\nis open-sourced at https://github.com/Jozenn/ArtistAuditor.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.CR,cs.LG\", \"published\": \"2025-04-17T16:15:38Z\"}"}
