{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00470v1\", \"title\": \"On the Distribution of the Sample Covariance from a Matrix Normal\\n  Population\", \"summary\": \"This paper discusses the joint distribution of sample variances and\\ncovariances, expressed in quadratic forms in a matrix population arising in\\ncomparing the differences among groups under homogeneity of variance. One major\\nconcern of this article is to compare $K$ different populations, by assuming\\nthat the mean values of $x_{11}^{(k)}, x_{12}^{(k)}, \\\\dots, x_{1p}^{(k)},\\nx_{21}^{(k)}, x_{22}^{(k)}, \\\\dots$, $x_{2p}^{(k)},\\\\dots,\\nx_{n1}^{(k)},x_{n2}^{(k)},\\\\dots,$ $x_{np}^{(k)}$ in each population are\\n$M^{(k)}$ ($n\\\\times p$), $k = 1,2,\\\\dots,K$ and $M$($n\\\\times p$) a fixed matrix,\\nwith this hypothesis $$H_0: M^{(1)} = M^{(2)} = \\\\dots = M^{(k)} = M,$$ when the\\ninter-group covariances are neglected and the intra-group covariances are\\nequal. The $N$ intra-group variances and $\\\\frac{1}{2} N (N - 1)$ intra-group\\ncovariances where $N = np$ are classified into four categories $T_{1}$,\\n$T_{1\\\\frac{1}{2}}$, $T_{2}$ and $T_{3}$ according to the spectral forms of the\\nprecision matrix. The joint distribution of the sample variances and\\ncovariances is derived under these four scenarios. Besides, the moment\\ngenerating function and the joint distribution of latent roots are explicitly\\ncalculated. %The distribution of non-central means with known covariance is\\ncalculated as an application to the one-sample analysis of variance, with its\\nexact power tabulated up to order two. As an application, we consider a\\nclassification problem in the discriminant analysis where the two populations\\nshould have different intra-group covariances. The distribution of the ratio of\\ntwo quadratic forms is considered both in the central and non-central cases,\\nwith their exact power tabulated for different $n$ and $p$.\", \"main_category\": \"math.ST\", \"categories\": \"math.ST,stat.ME,stat.TH\", \"published\": \"2025-05-01T11:49:04Z\"}"}
