{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19771v1\", \"title\": \"On Solving the Dynamics of Constrained Rigid Multi-Body Systems with\\n  Kinematic Loops\", \"summary\": \"This technical report provides an in-depth evaluation of both established and\\nstate-of-the-art methods for simulating constrained rigid multi-body systems\\nwith hard-contact dynamics, using formulations of Nonlinear Complementarity\\nProblems (NCPs). We are particularly interest in examining the simulation of\\nhighly coupled mechanical systems with multitudes of closed-loop bilateral\\nkinematic joint constraints in the presence of additional unilateral\\nconstraints such as joint limits and frictional contacts with restitutive\\nimpacts. This work thus presents an up-to-date literature survey of the\\nrelevant fields, as well as an in-depth description of the approaches used for\\nthe formulation and solving of the numerical time-integration problem in a\\nmaximal coordinate setting. More specifically, our focus lies on a version of\\nthe overall problem that decomposes it into the forward dynamics problem\\nfollowed by a time-integration using the states of the bodies and the\\nconstraint reactions rendered by the former. We then proceed to elaborate on\\nthe formulations used to model frictional contact dynamics and define a set of\\nsolvers that are representative of those currently employed in the majority of\\nthe established physics engines. A key aspect of this work is the definition of\\na benchmarking framework that we propose as a means to both qualitatively and\\nquantitatively evaluate the performance envelopes of the set of solvers on a\\ndiverse set of challenging simulation scenarios. We thus present an extensive\\nset of experiments that aim at highlighting the absolute and relative\\nperformance of all solvers on particular problems of interest as well as\\naggravatingly over the complete set defined in the suite.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-28T13:16:57Z\"}"}
