{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10292v1\", \"title\": \"Electron-Phonon Coupling Mediated by Fr\\u00f6hlich Interaction in Rb2SnBr6\\n  Perovskite\", \"summary\": \"Due to their well-suited optoelectronic properties, metal halide perovskites\\nare emerging semiconductor materials with potential applications in solar\\ncells, detectors, and light-emitting diodes. Beyond the traditional 3D\\nperovskites, low-dimensional counterparts have more attractive effects such as\\nexcitonic emissions and quantum confinements that are enhanced by the reduced\\ndimensionality, which involve the Electron-Phonon Coupling (EPC). Such\\nphenomenon, which comprehends the interaction between charge carriers and\\nlattice vibrations, usually strongly impacts the photoluminescence (PL)\\nresponse in low-dimensional frameworks. In this paper, we investigated the\\nintrinsic EPC onto low-temperature PL of the zero-dimensional (0D) Rb2SnBr6\\nperovskite. Temperature-dependent PL measurements, complemented by various\\ncharacterization techniques and theoretical calculations, revealed broadband\\nemission with a significant Stokes shift attributed to self-trapped excitons\\n(STEs). The Fr\\\\\\\"ohlich mechanism, mediated by interactions between excitonic\\ncharge carriers and longitudinal optical (LO) phonons, primarily accounts for\\nthe emission broadening through phonon-assisted radiative recombination. The\\nEPC strength was evaluated through the Huang-Rhys factor S=34, confirming\\nstrong correlations between electronic and vibrational properties and\\nsupporting the STE emission assumption. The possible mechanism of STE formation\\nwas evaluated by the Fr\\\\\\\"ohlich parameter {\\\\alpha} of 1.94 for electrons and\\n4.73 for holes, which points out a major contribution of the hole-polaron\\nquasi-particle on exciton trapping. Our findings give insights regarding the\\ninfluence of EPC in 0D perovskites and STE formation, which leads to the\\nassessment of Rb2SnBr6 for light-harvesting applications.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-14T15:03:40Z\"}"}
