{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15093v1\", \"title\": \"Rethinking the Potential of Multimodality in Collaborative Problem\\n  Solving Diagnosis with Large Language Models\", \"summary\": \"Detecting collaborative and problem-solving behaviours from digital traces to\\ninterpret students' collaborative problem solving (CPS) competency is a\\nlong-term goal in the Artificial Intelligence in Education (AIEd) field.\\nAlthough multimodal data and advanced models are argued to have the potential\\nto detect complex CPS behaviours, empirical evidence on their value remains\\nlimited with some contrasting evidence. In this study, we investigated the\\npotential of multimodal data to improve model performance in diagnosing 78\\nsecondary school students' CPS subskills and indicators in authentic\\neducational settings. In particular, text embeddings from verbal data and\\nacoustic embeddings from audio data were used in a multimodal classification\\nmodel for CPS diagnosis. Both unimodal and multimodal transformer-based models\\noutperformed traditional models in detecting CPS classes. Although the\\ninclusion of multimodality did not improve the performance of traditional\\nunimodal models, its integration into transformer-based models demonstrated\\nimproved performance for diagnosing social-cognitive CPS classes compared to\\nunimodal transformer-based models. Based on the results, the paper argues that\\nmultimodality and the selection of a particular modelling technique should not\\nbe taken for granted to achieve the best performance in the automated detection\\nof every CPS subskill and indicator. Rather, their value is limited to certain\\ntypes of CPS indicators, affected by the complexity of the labels, and\\ndependent on the composition of indicators in the dataset. We conclude the\\npaper by discussing the required nuance when considering the value of LLMs and\\nmultimodality in automated CPS diagnosis, highlighting the need for human-AI\\ncomplementarity, and proposing the exploration of relevant model architectures\\nand techniques to improve CPS diagnosis in authentic educational contexts.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.AI,cs.LG\", \"published\": \"2025-04-21T13:25:55Z\"}"}
