{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16645v1\", \"title\": \"Preliminary design of a Cavity Tuner for Superconducting Radio-Frequency\\n  Cavity\", \"summary\": \"This paper introduces a newly designed cavity tuner for superconducting\\nradio-frequency (SRF) cavity. Aiming to overcome the drawbacks of traditional\\ntuning systems, like the limited tuning range of piezoelectric tuner and the\\nlow-speed tuning of stepper-motor-based tuner, this novel tuner is crafted to\\nimprove SRF cavity performance and stability via efficient and accurate\\nfrequency tuning. The design encompasses several key elements. The cavity\\nstructure includes a commonly used 1.3 GHz single-cell superconducting cavity\\nand a room-temperature coaxial tuner cavity. The coupling mechanism between the\\ntwo cavities, along with the coupling window design, ensures effective energy\\ntransfer while minimizing losses. The mechanical tuning system, driven by\\nelectromagnetic coils, enables precise adjustments, and the cooling mechanisms\\nfor both cavities guarantee stable operation. Functioning by coupling an\\nexternal resonant cavity to the superconducting one, this tuner can adjust\\nfrequencies through mechanical or electromagnetic methods. It realizes rapid\\ntuning, with a speed much faster than traditional mechanical tuner,\\nhigh-precision tuning down to the sub-mHz level, and a wide tuning range\\ncovering a broader frequency spectrum. Theoretical analysis and simulations\\nverify that the tuner can remarkably enhance tuning speed, precision, and\\nrange. It also has distinct advantages such as a simplified structure, which\\nreduces manufacturing and maintenance complexity, and enhanced reliability due\\nto its non-contact tuning operation. In particle accelerators, this cavity\\ntuner holds great potential. It represents a significant step forward in\\nsuperconducting accelerator technology, offering a novel way to optimize the\\nperformance and stability of SRF cavity.\", \"main_category\": \"physics.acc-ph\", \"categories\": \"physics.acc-ph\", \"published\": \"2025-04-23T12:05:34Z\"}"}
