{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11749v1\", \"title\": \"SkeletonX: Data-Efficient Skeleton-based Action Recognition via\\n  Cross-sample Feature Aggregation\", \"summary\": \"While current skeleton action recognition models demonstrate impressive\\nperformance on large-scale datasets, their adaptation to new application\\nscenarios remains challenging. These challenges are particularly pronounced\\nwhen facing new action categories, diverse performers, and varied skeleton\\nlayouts, leading to significant performance degeneration. Additionally, the\\nhigh cost and difficulty of collecting skeleton data make large-scale data\\ncollection impractical. This paper studies one-shot and limited-scale learning\\nsettings to enable efficient adaptation with minimal data. Existing approaches\\noften overlook the rich mutual information between labeled samples, resulting\\nin sub-optimal performance in low-data scenarios. To boost the utility of\\nlabeled data, we identify the variability among performers and the commonality\\nwithin each action as two key attributes. We present SkeletonX, a lightweight\\ntraining pipeline that integrates seamlessly with existing GCN-based skeleton\\naction recognizers, promoting effective training under limited labeled data.\\nFirst, we propose a tailored sample pair construction strategy on two key\\nattributes to form and aggregate sample pairs. Next, we develop a concise and\\neffective feature aggregation module to process these pairs. Extensive\\nexperiments are conducted on NTU RGB+D, NTU RGB+D 120, and PKU-MMD with various\\nGCN backbones, demonstrating that the pipeline effectively improves performance\\nwhen trained from scratch with limited data. Moreover, it surpasses previous\\nstate-of-the-art methods in the one-shot setting, with only 1/10 of the\\nparameters and much fewer FLOPs. The code and data are available at:\\nhttps://github.com/zzysteve/SkeletonX\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,I.4.9\", \"published\": \"2025-04-16T04:01:42Z\"}"}
