{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04585v1\", \"title\": \"Antenna-coupled integrated millimeterwave modulators and resonant\\n  electro-optic frequency combs\", \"summary\": \"The rapid growth of global data traffic is accelerating the need for\\nultra-broadband communication technologies, particularly in inter-data center\\nlinks and emerging 6G wireless systems. Applications such as optical computing\\nand quantum information processing further demand fast, scalable ways to\\ninterface optical and electronic signals. Integrated electro-optic modulators\\noffer a compact and efficient solution, but extending their operation into the\\nmillimeterwave (mmWave) and terahertz regimes is difficult. Key challenges\\ninclude high transmission line losses and bulky electrical packaging. Here, we\\ndemonstrate a wireless and wideband electro-optic modulation architecture that\\ndirectly interfaces wireless mmWave signals with optical ones, eliminating the\\nneed for impedance-matched mmWave probes and cables. By integrating an on-chip\\nantenna directly with a co-designed traveling-wave transmission line on\\nthin-film lithium niobate, we achieve spectrally flat phase modulation across\\nthe WR9.0 (82-125 GHz) and WR2.8 (240-380 GHz) bands. The wideband nature of\\nour modulator enables the device to function as a high-speed mmWave detector.\\nBy modulating the mmWave carrier at frequencies up to 6 GHz, we demonstrate the\\ndevice's flat and wide detection bandwidth-critical for 6G communication and\\nhigh-speed mmWave sensing. Beyond traveling-wave detection, our wireless\\nplatform enables resonant electro-optic frequency comb generation with mode\\nspacing of 123.2 GHz and 307.9 GHz. Extracted single-photon electro-optic\\ncoupling rates of $g_{eo} =2\\\\pi\\\\times 10.61$ kHz and 25.99 kHz, at 123.2 and\\n307.9 GHz, respectively, demonstrate favorable scaling with mmWave frequency.\\nThese results establish a new class of broadband, wireless electro-optic\\ndevices for high-speed modulation, detection, and frequency comb generation,\\nwith promising applications in communications, sensing, and quantum\\ntechnologies.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics\", \"published\": \"2025-05-07T17:26:38Z\"}"}
