{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20790v1\", \"title\": \"Charge Schedule Optimization and Infrastructure Planning for\\n  Solar-Integrated Electric Bus Transit Systems\", \"summary\": \"As urban transit systems transition towards electrification, using renewable\\nenergy sources (RES), such as solar, is essential to make them efficient and\\nsustainable. However, the intermittent nature of renewables poses a challenge\\nin deciding the solar panel requirements and battery energy storage system\\n(BESS) capacity at charging locations. To address these challenges, we propose\\na two-stage stochastic programming model that considers seasonality in solar\\nenergy generation while incorporating temperature-based variations in bus\\nenergy consumption and dynamic time-of-use electricity prices. Specifically, we\\nformulate the problem as a multi-scenario linear program (LP) where the\\nfirst-stage long-term variables determine the charging station power capacity,\\nBESS capacity, and the solar panel area at each charging location. The\\nsecond-stage scenario-specific variables prescribe the energy transferred to\\nbuses directly from the grid or the BESS during layovers. We demonstrate the\\neffectiveness of this framework using data from Durham Transit Network\\n(Ontario) and Action Buses (Canberra), where bus schedules and charging\\nlocations are determined using a concurrent scheduler-based heuristic. Solar\\nenergy data is collected from the National Renewable Energy Laboratory (NREL)\\ndatabase. We solved the multi-scenario LP using Benders' decomposition, which\\nperformed better than the dual simplex method, especially when the number of\\nscenarios was high. With solar energy production at the depots, our model\\nestimated a cost savings of 16.48% and 32.00% for the Durham and Canberra\\nnetworks, respectively. Our results also show that the scenario-based schedule\\nadapts better to seasonal variations than a schedule estimated from average\\ninput parameters.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC\", \"published\": \"2025-04-29T14:04:32Z\"}"}
