{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10242v1\", \"title\": \"CAT: A Conditional Adaptation Tailor for Efficient and Effective\\n  Instance-Specific Pansharpening on Real-World Data\", \"summary\": \"Pansharpening is a crucial remote sensing technique that fuses low-resolution\\nmultispectral (LRMS) images with high-resolution panchromatic (PAN) images to\\ngenerate high-resolution multispectral (HRMS) imagery. Although deep learning\\ntechniques have significantly advanced pansharpening, many existing methods\\nsuffer from limited cross-sensor generalization and high computational\\noverhead, restricting their real-time applications. To address these\\nchallenges, we propose an efficient framework that quickly adapts to a specific\\ninput instance, completing both training and inference in a short time. Our\\nframework splits the input image into multiple patches, selects a subset for\\nunsupervised CAT training, and then performs inference on all patches,\\nstitching them into the final output. The CAT module, integrated between the\\nfeature extraction and channel transformation stages of a pre-trained network,\\ntailors the fused features and fixes the parameters for efficient inference,\\ngenerating improved results. Our approach offers two key advantages: (1)\\n$\\\\textit{Improved Generalization Ability}$: by mitigating cross-sensor\\ndegradation, our model--although pre-trained on a specific dataset--achieves\\nsuperior performance on datasets captured by other sensors; (2)\\n$\\\\textit{Enhanced Computational Efficiency}$: the CAT-enhanced network can\\nswiftly adapt to the test sample using the single LRMS-PAN pair input, without\\nrequiring extensive large-scale data retraining. Experiments on the real-world\\ndata from WorldView-3 and WorldView-2 datasets demonstrate that our method\\nachieves state-of-the-art performance on cross-sensor real-world data, while\\nachieving both training and inference of $512\\\\times512$ image within\\n$\\\\textit{0.4 seconds}$ and $4000\\\\times4000$ image within $\\\\textit{3 seconds}$\\nat the fastest setting on a commonly used RTX 3090 GPU.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-14T14:04:55Z\"}"}
