{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09970v1\", \"title\": \"IsoSEL: Isometric Structural Entropy Learning for Deep Graph Clustering\\n  in Hyperbolic Space\", \"summary\": \"Graph clustering is a longstanding topic in machine learning. In recent\\nyears, deep learning methods have achieved encouraging results, but they still\\nrequire predefined cluster numbers K, and typically struggle with imbalanced\\ngraphs, especially in identifying minority clusters. The limitations motivate\\nus to study a challenging yet practical problem: deep graph clustering without\\nK considering the imbalance in reality. We approach this problem from a fresh\\nperspective of information theory (i.e., structural information). In the\\nliterature, structural information has rarely been touched in deep clustering,\\nand the classic definition falls short in its discrete formulation, neglecting\\nnode attributes and exhibiting prohibitive complexity. In this paper, we first\\nestablish a new Differentiable Structural Information, generalizing the\\ndiscrete formalism to continuous realm, so that the optimal partitioning tree,\\nrevealing the cluster structure, can be created by the gradient\\nbackpropagation. Theoretically, we demonstrate its capability in clustering\\nwithout requiring K and identifying the minority clusters in imbalanced graphs,\\nwhile reducing the time complexity to O(N) w.r.t. the number of nodes.\\nSubsequently, we present a novel IsoSEL framework for deep graph clustering,\\nwhere we design a hyperbolic neural network to learn the partitioning tree in\\nthe Lorentz model of hyperbolic space, and further conduct Lorentz Tree\\nContrastive Learning with isometric augmentation. As a result, the partitioning\\ntree incorporates node attributes via mutual information maximization, while\\nthe cluster assignment is refined by the proposed tree contrastive learning.\\nExtensive experiments on five benchmark datasets show the IsoSEL outperforms 14\\nrecent baselines by an average of +1.3% in NMI.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-14T08:21:41Z\"}"}
