{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06775v1\", \"title\": \"Variational Quantum Machine Learning with Quantum Error Detection\", \"summary\": \"Quantum machine learning (QML) is an emerging field that promises advantages\\nsuch as faster training, improved reliability and superior feature extraction\\nover classical counterparts. However, its implementation on quantum hardware is\\nchallenging due to the noise inherent in these systems, necessitating the use\\nof quantum error correction (QEC) codes. Current QML research remains primarily\\ntheoretical, often assuming noise-free environments and offering little insight\\ninto the integration of QEC with QML implementations. To address this, we\\ninvestigate the performance of a simple, parity-classifying Variational Quantum\\nClassifier (VQC) implemented with the [[4,2,2]] error-detecting stabiliser code\\nin a simulated noisy environment, marking the first study into the\\nimplementation of a QML algorithm with a QEC code. We invoke ancilla qubits to\\nlogically encode rotation gates, and classically simulate the logically-encoded\\nVQC under two simple noise models representing gate noise and environmental\\nnoise. We demonstrate that the stabiliser code improves the training accuracy\\nat convergence compared to noisy implementations without QEC. However, we find\\nthat the effectiveness and reliability of error detection is contingent upon\\nkeeping the ancilla qubit error rates below a specific threshold, due to the\\npropagation of ancilla errors to the physical qubits. Our results provide an\\nimportant insight: for QML implementations with QEC codes that both require\\nancilla qubits for logical rotations and cannot fully correct errors propagated\\nbetween ancilla and physical qubits, the maximum achievable accuracy of the QML\\nmodel is limited. This highlights the need for additional error correction or\\nmitigation strategies to support the practical implementation of QML algorithms\\nwith QEC on quantum devices.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-09T10:56:21Z\"}"}
