{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17745v1\", \"title\": \"Asymptotic attraction with algebraic rates toward fronts of\\n  dispersive-diffusive Burgers equations\", \"summary\": \"Burgers equation is a classic model, which arises in numerous applications.\\nAt its very core it is a simple conservation law, which serves as a toy model\\nfor various dynamics phenomena. In particular, it supports explicit\\nheteroclinic solutions, both fronts and backs. Their stability has been studied\\nin details. There has been substantial interest in considering dispersive\\nand/or diffusive modifications, which present novel dynamical paradigms in such\\nsimple setting. More specificaly, the KdV-Burgers model has been showed to\\nsupport unique fronts (not all of them monotone!) with fixed values at $\\\\pm\\n\\\\infty$. Many articles, among which \\\\cite{Pego}, \\\\cite{NS1}, \\\\cite{NS2}, have\\nstudied the question of stability of monotone (or close to monotone) fronts.\\n  In a breakthrough paper, \\\\cite{BBHY}, the authors have extended these results\\nin several different directions. They have considered a wider range of models.\\nThe fronts do not need to be monotone, but are subject of a spectral condition\\ninstead. Most importantly the method allows for large perturbations, as long as\\nthe heteroclinic conditions at $\\\\pm \\\\infty$ are met. That is, there is\\nasymptotic attraction to the said fronts or equivalently the limit set consist\\nof one point.\\n  The purpose of this paper is to extend the results of \\\\cite{BBHY} by\\nproviding explicit algebraic rates of convergence as $t\\\\to \\\\infty$. We\\nbootstrap these results from the results in \\\\cite{BBHY} using additional energy\\nestimates for two important examples namely KdV-Burgers and the fractional\\nBurgers problem. These rates are likely not optimal, but we conjecture that\\nthey are algebraic nonetheless.\", \"main_category\": \"math.AP\", \"categories\": \"math.AP\", \"published\": \"2025-04-24T17:05:50Z\"}"}
