{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16792v1\", \"title\": \"Preemption Aware Task Scheduling for Priority and Deadline Constrained\\n  DNN Inference Task Offloading in Homogeneous Mobile-Edge Networks\", \"summary\": \"This paper addresses the computational offloading of Deep Neural Networks\\n(DNNs) to nearby devices with similar processing capabilities, to avoid the\\nlarger communication delays incurred for cloud offloading. We present a\\npreemption aware scheduling approach for priority and deadline constrained task\\noffloading in homogeneous edge networks. Our scheduling approach consists of\\ntwo distinct scheduling algorithms, designed to accommodate the differing\\nrequirements of high and low priority tasks. To satisfy a task's deadline, our\\nscheduling approach considers the availability of both communication and\\ncomputational resources in the network when making placements in both the\\ncurrent time-slot and future time-slots. The scheduler implements a\\ndeadline-aware preemption mechanism to guarantee resource access to high\\npriority tasks. When low-priority tasks are selected for preemption, the\\nscheduler will attempt to reallocate them if possible before their deadline. We\\nimplement this scheduling approach into a task offloading system which we\\nevaluate empirically in the real-world on a network of edge devices composed of\\nfour Raspberry Pi 2 Model B's. We evaluate this system under against a version\\nwithout a task preemption mechanism as well as workstealing approaches to\\ncompare the impact on high priority task completion and the ability to complete\\noverall frames. These solutions are evaluated under a workload of 1296 frames.\\nOur findings show that our scheduling approach allows for 99\\\\% of high-priority\\ntasks to complete while also providing a 3 - 8\\\\% increase in the number of\\nframes fully classified end-to-end over both workstealing approaches and\\nsystems without a preemption mechanism.\", \"main_category\": \"cs.DC\", \"categories\": \"cs.DC\", \"published\": \"2025-04-23T15:10:55Z\"}"}
