{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03341v1\", \"title\": \"Electrically Reconfigurable NbOCl$_2$ Metasurface for Quantum\\n  Technologies\", \"summary\": \"Entangled photon-pair sources are foundational to advancing quantum\\ntechnologies, including secure communication, quantum sensing, and imaging. For\\ndeployment in space-constrained environments such as satellite-based quantum\\nnetworks or portable devices, compact, reconfigurable, and efficient\\nentanglement sources are essential. Here, we present an electrically tunable\\nentangled photon-pair source utilizing a nanostructured NbOCl$_2$ crystal,\\nengineered for operation in the telecommunication C-band. The inherent\\nnon-centrosymmetric lattice symmetry of NbOCl$_2$ enables direct generation of\\npolarization-entangled Bell states without the need for post-selection,\\nleveraging its exceptional second-order nonlinear susceptibility, which\\nsurpasses conventional nonlinear materials. By nanopatterning NbOCl$_2$ into a\\nhigh-quality-factor metasurface, we achieve three orders of magnitude\\nenhancement in photon-pair generation efficiency via resonant excitation of\\nbound states in the continuum resonance, which intensify light-matter\\ninteractions. Furthermore, we demonstrate in situ electrical tunability of the\\nphoton-pair emission wavelength over a 250 nm range from 1450 nm to 1700 nm by\\ndynamically modulating surrounding liquid crystal layer. Remarkably, the\\ndecoupling of photon-pair generation rate and spectral tunability ensures high\\nbrightness, above 10,000 coincidences, under active tuning. The air stability\\nand mechanical robustness of NbOCl$_2$ further enhance its practicality for\\nreal-world deployment. This work establishes NbOCl$_2$ as a superior material\\nfor scalable, on-chip quantum light sources, paving the way for integrated\\nquantum communication systems, adaptive sensors, and portable quantum devices.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics,quant-ph\", \"published\": \"2025-05-06T09:11:56Z\"}"}
