{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05452v1\", \"title\": \"RL-DAUNCE: Reinforcement Learning-Driven Data Assimilation with\\n  Uncertainty-Aware Constrained Ensembles\", \"summary\": \"Machine learning has become a powerful tool for enhancing data assimilation.\\nWhile supervised learning remains the standard method, reinforcement learning\\n(RL) offers unique advantages through its sequential decision-making framework,\\nwhich naturally fits the iterative nature of data assimilation by dynamically\\nbalancing model forecasts with observations. We develop RL-DAUNCE, a new\\nRL-based method that enhances data assimilation with physical constraints\\nthrough three key aspects. First, RL-DAUNCE inherits the computational\\nefficiency of machine learning while it uniquely structures its agents to\\nmirror ensemble members in conventional data assimilation methods. Second,\\nRL-DAUNCE emphasizes uncertainty quantification by advancing multiple ensemble\\nmembers, moving beyond simple mean-state optimization. Third, RL-DAUNCE's\\nensemble-as-agents design facilitates the enforcement of physical constraints\\nduring the assimilation process, which is crucial to improving the state\\nestimation and subsequent forecasting. A primal-dual optimization strategy is\\ndeveloped to enforce constraints, which dynamically penalizes the reward\\nfunction to ensure constraint satisfaction throughout the learning process.\\nAlso, state variable bounds are respected by constraining the RL action space.\\nTogether, these features ensure physical consistency without sacrificing\\nefficiency. RL-DAUNCE is applied to the Madden-Julian Oscillation, an\\nintermittent atmospheric phenomenon characterized by strongly non-Gaussian\\nfeatures and multiple physical constraints. RL-DAUNCE outperforms the standard\\nensemble Kalman filter (EnKF), which fails catastrophically due to the\\nviolation of physical constraints. Notably, RL-DAUNCE matches the performance\\nof constrained EnKF, particularly in recovering intermittent signals, capturing\\nextreme events, and quantifying uncertainties, while requiring substantially\\nless computational effort.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,math-ph,math.MP\", \"published\": \"2025-05-08T17:43:35Z\"}"}
