{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07530v1\", \"title\": \"TwinArch: A Digital Twin Reference Architecture\", \"summary\": \"Background. Digital Twins (DTs) are dynamic virtual representations of\\nphysical systems, enabled by seamless, bidirectional communication between the\\nphysical and digital realms. Among the challenges impeding the widespread\\nadoption of DTs is the absence of a universally accepted definition and a\\nstandardized DT Reference Architecture (RA). Existing state-of-the-art\\narchitectures remain largely domain-specific, primarily emphasizing aspects\\nlike modeling and simulation. Furthermore, they often combine structural and\\ndynamic elements into unified, all-in-one diagrams, which adds to the ambiguity\\nand confusion surrounding the concept of Digital Twins.\\n  Objective. To address these challenges, this work aims to contribute a\\ndomain-independent, multi-view Digital Twin Reference Architecture that can\\nhelp practitioners in architecting and engineering their DTs.\\n  Method. We adopted the design science methodology, structured into three\\ncycles: (i) an initial investigation conducting a Systematic Literature Review\\nto identify key architectural elements, (ii) preliminary design refined via\\nfeedback from practitioners, and (iii) final artifact development, integrating\\nknowledge from widely adopted DT development platforms and validated through an\\nexpert survey of 20 participants.\\n  Results. The proposed Digital Twin Reference Architecture is named TwinArch.\\nIt is documented using the Views and Beyond methodology by the Software\\nEngineering Institute. TwinArch website and replication package:\\nhttps://alessandrasomma28.github.io/twinarch/\\n  Conclusion. TwinArch offers practitioners practical artifacts that can be\\nutilized for designing and developing new DT systems across various domains. It\\nenables customization and tailoring to specific use cases while also supporting\\nthe documentation of existing DT systems.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE,cs.ET\", \"published\": \"2025-04-10T07:53:11Z\"}"}
