{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02719v1\", \"title\": \"The Myth of Immutability: A Multivocal Review on Smart Contract\\n  Upgradeability\", \"summary\": \"The immutability of smart contracts on blockchain platforms like Ethereum\\npromotes security and trustworthiness but presents challenges for updates, bug\\nfixes, or adding new features post-deployment. These limitations can lead to\\nvulnerabilities and outdated functionality, impeding the evolution and\\nmaintenance of decentralized applications. Despite various upgrade mechanisms\\nproposed in academic research and industry, a comprehensive analysis of their\\ntrade-offs and practical implications is lacking. This study aims to\\nsystematically identify, classify, and evaluate existing smart contract upgrade\\nmechanisms, bridging the gap between theoretical concepts and practical\\nimplementations. It introduces standardized terminology and evaluates the\\ntrade-offs of different approaches using software quality attributes. We\\nconducted a Multivocal Literature Review (MLR) to analyze upgrade mechanisms\\nfrom both academic research and industry practice. We first establish a unified\\ndefinition of smart contract upgradeability and identify core components\\nessential for understanding the upgrade process. Based on this definition, we\\nclassify existing methods into full upgrade and partial upgrade approaches,\\nintroducing standardized terminology to harmonize the diverse terms used in the\\nliterature. We then characterize each approach and assess its benefits and\\nlimitations using software quality attributes such as complexity, flexibility,\\nsecurity, and usability. The analysis highlights significant trade-offs among\\nupgrade mechanisms, providing valuable insights into the benefits and\\nlimitations of each approach. These findings guide developers and researchers\\nin selecting mechanisms tailored to specific project requirements.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-03T16:02:46Z\"}"}
