{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04247v1\", \"title\": \"A block preconditioner for thermo-poromechanics with frictional\\n  deformation of fractures\", \"summary\": \"The numerical modeling of fracture contact thermo-poromechanics is crucial\\nfor advancing subsurface engineering applications, including CO2 sequestration,\\nproduction of geo-energy resources, energy storage and wastewater disposal\\noperations. Accurately modeling this problem presents substantial challenges\\ndue to the complex physics involved in strongly coupled thermo-poromechanical\\nprocesses and the frictional contact mechanics of fractures. To resolve process\\ncouplings in the resulting mathematical model, it is common to apply fully\\nimplicit time stepping. This necessitates the use of an iterative linear solver\\nto run the model. The solver's efficiency primarily depends on a robust\\npreconditioner, which is particularly challenging to develop because it must\\nhandle the mutual couplings between linearized contact mechanics and energy,\\nmomentum, and mass balance. In this work, we introduce a preconditioner for the\\nproblem based on the nested approximations of Schur complements. To decouple\\nthe momentum balance, we utilize the fixed-stress approximation, extended to\\naccount for both the porous media and fracture subdomains. The singularity of\\nthe contact mechanics submatrix is resolved by a linear transformation. Two\\nvariations of the algorithm are proposed to address the coupled mass and energy\\nbalance submatrix: either the Constrained Pressure Residual or the System-AMG\\napproach. The preconditioner is evaluated through numerical experiments of\\nfluid injection into fractured porous media, which causes thermal contraction\\nand subsequent sliding and opening of fractures. The experiments show that the\\npreconditioner performs robustly for a wide range of simulation regimes\\ngoverned by various fracture states, friction coefficients and Peclet number.\\nThe grid refinement experiments demonstrate that the preconditioner scales well\\nin terms of GMRES iterations, in both two and three dimensions.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA\", \"published\": \"2025-05-07T08:49:49Z\"}"}
