{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23804v1\", \"title\": \"Get the Agents Drunk: Memory Perturbations in Autonomous Agent-based\\n  Recommender Systems\", \"summary\": \"Large language model-based agents are increasingly used in recommender\\nsystems (Agent4RSs) to achieve personalized behavior modeling. Specifically,\\nAgent4RSs introduces memory mechanisms that enable the agents to autonomously\\nlearn and self-evolve from real-world interactions. However, to the best of our\\nknowledge, how robust Agent4RSs are remains unexplored. As such, in this paper,\\nwe propose the first work to attack Agent4RSs by perturbing agents' memories,\\nnot only to uncover their limitations but also to enhance their security and\\nrobustness, ensuring the development of safer and more reliable AI agents.\\n  Given the security and privacy concerns, it is more practical to launch\\nattacks under a black-box setting, where the accurate knowledge of the victim\\nmodels cannot be easily obtained. Moreover, the practical attacks are often\\nstealthy to maximize the impact. To this end, we propose a novel practical\\nattack framework named DrunkAgent. DrunkAgent consists of a generation module,\\na strategy module, and a surrogate module. The generation module aims to\\nproduce effective and coherent adversarial textual triggers, which can be used\\nto achieve attack objectives such as promoting the target items. The strategy\\nmodule is designed to `get the target agents drunk' so that their memories\\ncannot be effectively updated during the interaction process. As such, the\\ntriggers can play the best role. Both of the modules are optimized on the\\nsurrogate module to improve the transferability and imperceptibility of the\\nattacks. By identifying and analyzing the vulnerabilities, our work provides\\ncritical insights that pave the way for building safer and more resilient\\nAgent4RSs. Extensive experiments across various real-world datasets demonstrate\\nthe effectiveness of DrunkAgent.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.CL,cs.IR,cs.MA\", \"published\": \"2025-03-31T07:35:40Z\"}"}
