{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05260v1\", \"title\": \"No Planet around the K Giant Star 42 Draconis\", \"summary\": \"Published radial velocity (RV) measurements of the K giant star 42 Dra reveal\\nvariations consistent with a 3.9 M_Jup mass companion in a 479-d orbit. This\\nexoplanet can be confirmed if these variations are long-lived and coherent.\\nContinued monitoring may also reveal other companions. We have acquired\\nadditional RV measurements of 42 Dra spanning fifteen years. Periodogram\\nanalyses were used to investigate the stability of the planet RV signal. We\\nalso investigated variations in the spectral line shapes using the bisector\\nvelocity span as well as infrared photometry from the COBE mission. The new RV\\nmeasurements do not follow the published planet orbit. An orbital solution\\nusing the 2004 - 2011 data yields a period and eccentricity consistent with the\\npublished values, but the RV amplitude has decreased by a factor of four from\\nthe earlier measurements. Including some additional RV measurements taken\\nbetween 2014 and 2018 reveal the presence of a second period at 530 d. The\\nbeating of this period with the one at 479-d may account for the observed\\namplitude variations. The planet hypothesis is conclusively ruled out by\\nCOBE/DIRBE 1.25 micron photometry that shows variations with the planet orbital\\nperiod as well as an additional 170 d period. The amplitude variations in the\\nRV as well the COBE/DIRBE photometry firmly establish that there is no giant\\nplanet around 42 Dra. The presence of multi-periodic variations suggests that\\nthese may be stellar oscillations, most likely oscillatory convection modes.\\nThese oscillations may account for some of the long period RV variations\\nattributed to planets around K giant stars. This may skew the statistics of\\nplanet occurrence around intermediate mass stars. Long-term monitoring with\\nexcellent sampling is required to exclude amplitude variations in the\\nlong-periods found in radial velocity of K giant stars.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,astro-ph.SR\", \"published\": \"2025-05-08T14:06:00Z\"}"}
