{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12799v1\", \"title\": \"TSGS: Improving Gaussian Splatting for Transparent Surface\\n  Reconstruction via Normal and De-lighting Priors\", \"summary\": \"Reconstructing transparent surfaces is essential for tasks such as robotic\\nmanipulation in labs, yet it poses a significant challenge for 3D\\nreconstruction techniques like 3D Gaussian Splatting (3DGS). These methods\\noften encounter a transparency-depth dilemma, where the pursuit of\\nphotorealistic rendering through standard $\\\\alpha$-blending undermines\\ngeometric precision, resulting in considerable depth estimation errors for\\ntransparent materials. To address this issue, we introduce Transparent Surface\\nGaussian Splatting (TSGS), a new framework that separates geometry learning\\nfrom appearance refinement. In the geometry learning stage, TSGS focuses on\\ngeometry by using specular-suppressed inputs to accurately represent surfaces.\\nIn the second stage, TSGS improves visual fidelity through anisotropic specular\\nmodeling, crucially maintaining the established opacity to ensure geometric\\naccuracy. To enhance depth inference, TSGS employs a first-surface depth\\nextraction method. This technique uses a sliding window over $\\\\alpha$-blending\\nweights to pinpoint the most likely surface location and calculates a robust\\nweighted average depth. To evaluate the transparent surface reconstruction task\\nunder realistic conditions, we collect a TransLab dataset that includes complex\\ntransparent laboratory glassware. Extensive experiments on TransLab show that\\nTSGS achieves accurate geometric reconstruction and realistic rendering of\\ntransparent objects simultaneously within the efficient 3DGS framework.\\nSpecifically, TSGS significantly surpasses current leading methods, achieving a\\n37.3% reduction in chamfer distance and an 8.0% improvement in F1 score\\ncompared to the top baseline. The code and dataset will be released at\\nhttps://longxiang-ai.github.io/TSGS/.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-17T10:00:09Z\"}"}
