{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03610v1\", \"title\": \"Learning Knowledge-based Prompts for Robust 3D Mask Presentation Attack\\n  Detection\", \"summary\": \"3D mask presentation attack detection is crucial for protecting face\\nrecognition systems against the rising threat of 3D mask attacks. While most\\nexisting methods utilize multimodal features or remote photoplethysmography\\n(rPPG) signals to distinguish between real faces and 3D masks, they face\\nsignificant challenges, such as the high costs associated with multimodal\\nsensors and limited generalization ability. Detection-related text descriptions\\noffer concise, universal information and are cost-effective to obtain. However,\\nthe potential of vision-language multimodal features for 3D mask presentation\\nattack detection remains unexplored. In this paper, we propose a novel\\nknowledge-based prompt learning framework to explore the strong generalization\\ncapability of vision-language models for 3D mask presentation attack detection.\\nSpecifically, our approach incorporates entities and triples from knowledge\\ngraphs into the prompt learning process, generating fine-grained, task-specific\\nexplicit prompts that effectively harness the knowledge embedded in pre-trained\\nvision-language models. Furthermore, considering different input images may\\nemphasize distinct knowledge graph elements, we introduce a visual-specific\\nknowledge filter based on an attention mechanism to refine relevant elements\\naccording to the visual context. Additionally, we leverage causal graph theory\\ninsights into the prompt learning process to further enhance the generalization\\nability of our method. During training, a spurious correlation elimination\\nparadigm is employed, which removes category-irrelevant local image patches\\nusing guidance from knowledge-based text features, fostering the learning of\\ngeneralized causal prompts that align with category-relevant local patches.\\nExperimental results demonstrate that the proposed method achieves\\nstate-of-the-art intra- and cross-scenario detection performance on benchmark\\ndatasets.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-06T15:09:23Z\"}"}
