{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21658v1\", \"title\": \"Approximation and regularity results for the Heston model and related\\n  processes\", \"summary\": \"This Ph.D. thesis explores approximations and regularity for the Heston\\nstochastic volatility model through three interconnected works.\\n  The first work focuses on developing high-order weak approximations for the\\nCox-Ingersoll-Ross (CIR) process, essential for financial modelling but\\nchallenging due to the square root diffusion term preventing standard methods.\\nBy employing the random grid technique (Alfonsi & Bally, 2021) built upon\\nAlfonsi's (2010) second-order scheme, the work proves that weak approximations\\nof any order can be achieved for smooth test functions. This holds under a\\ncondition that is less restrictive than the famous Feller's one. Numerical\\nresults confirm convergence for both CIR and Heston models and show significant\\ncomputational time improvements.\\n  The second work extends the random grid technique to the log-Heston process.\\nTwo second-order schemes are introduced (one using exact volatility simulation,\\nanother using Ninomiya-Victoir splitting under a the same restriction used\\nabove). Convergence to any desired order is rigorously proven. Numerical\\nexperiments validate the schemes' effectiveness for pricing European and Asian\\noptions and suggest potential applicability to multifactor/rough Heston models.\\n  The third work investigates the partial differential equation (PDE)\\nassociated with the log-Heston model. It extends classical solution results and\\nestablishes the existence and uniqueness of viscosity solutions without relying\\non the Feller condition. Uniqueness is proven even for certain discontinuous\\ninitial data, relevant for pricing instruments like digital options.\\nFurthermore, the convergence of a hybrid numerical scheme to the viscosity\\nsolution is shown under relaxed regularity (continuity) for the initial data.\\n  An appendix includes supplementary results for the CIR process.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA,math.AP,math.PR,q-fin.CP\", \"published\": \"2025-04-30T14:01:01Z\"}"}
