{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17599v1\", \"title\": \"Dynamical gauge invariance of statistical mechanics\", \"summary\": \"We investigate gauge invariance against phase space shifting in\\nnonequilibrium systems, as represented by time-dependent many-body Hamiltonians\\nthat drive an initial ensemble out of thermal equilibrium. The theory gives\\nrise to gauge correlation functions that characterize spatial and temporal\\ninhomogeneity with microscopic resolution on the one-body level. Analyzing the\\ndynamical gauge invariance allows one to identify a specific localized shift\\ngauge current as a fundamental nonequilibrium observable that characterizes\\nparticle-based dynamics. When averaged over the nonequilibrium ensemble, the\\nshift current vanishes identically, which constitutes an exact nonequilibrium\\nconservation law that generalizes the Yvon-Born-Green equilibrium balance of\\nthe vanishing sum of ideal, interparticle, and external forces. Any given\\nobservable is associated with a corresponding dynamical hyperforce density and\\nhypercurrent correlation function. An exact nonequilibrium sum rule\\ninterrelates these one-body functions, in generalization of the recent\\nhyperforce balance for equilibrium systems. We demonstrate the physical\\nconsequences of the dynamical gauge invariance using both harmonically confined\\nideal gas setups, for which we present analytical solutions, and molecular\\ndynamics simulations of interacting systems, for which we demonstrate the shift\\ncurrent and hypercurrent correlation functions to be accessible both via\\nfinite-difference methods and via trajectory-based automatic differentiation.\\nWe show that the theory constitutes a starting point for developing\\nnonequilibrium reduced-variance sampling algorithms and for investigating\\nthermally-activated barrier crossing.\", \"main_category\": \"cond-mat.stat-mech\", \"categories\": \"cond-mat.stat-mech,cond-mat.soft\", \"published\": \"2025-04-24T14:24:49Z\"}"}
