{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04978v1\", \"title\": \"Robust Model-Based In-Hand Manipulation with Integrated Real-Time\\n  Motion-Contact Planning and Tracking\", \"summary\": \"Robotic dexterous in-hand manipulation, where multiple fingers dynamically\\nmake and break contact, represents a step toward human-like dexterity in\\nreal-world robotic applications. Unlike learning-based approaches that rely on\\nlarge-scale training or extensive data collection for each specific task,\\nmodel-based methods offer an efficient alternative. Their online computing\\nnature allows for ready application to new tasks without extensive retraining.\\nHowever, due to the complexity of physical contacts, existing model-based\\nmethods encounter challenges in efficient online planning and handling modeling\\nerrors, which limit their practical applications. To advance the effectiveness\\nand robustness of model-based contact-rich in-hand manipulation, this paper\\nproposes a novel integrated framework that mitigates these limitations. The\\nintegration involves two key aspects: 1) integrated real-time planning and\\ntracking achieved by a hierarchical structure; and 2) joint optimization of\\nmotions and contacts achieved by integrated motion-contact modeling.\\nSpecifically, at the high level, finger motion and contact force references are\\njointly generated using contact-implicit model predictive control. The\\nhigh-level module facilitates real-time planning and disturbance recovery. At\\nthe low level, these integrated references are concurrently tracked using a\\nhand force-motion model and actual tactile feedback. The low-level module\\ncompensates for modeling errors and enhances the robustness of manipulation.\\nExtensive experiments demonstrate that our approach outperforms existing\\nmodel-based methods in terms of accuracy, robustness, and real-time\\nperformance. Our method successfully completes five challenging tasks in\\nreal-world environments, even under appreciable external disturbances.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-05-08T06:31:19Z\"}"}
