{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14993v1\", \"title\": \"Dual Utilization of Perturbation for Stream Data Publication under Local\\n  Differential Privacy\", \"summary\": \"Stream data from real-time distributed systems such as IoT, tele-health, and\\ncrowdsourcing has become an important data source. However, the collection and\\nanalysis of user-generated stream data raise privacy concerns due to the\\npotential exposure of sensitive information. To address these concerns, local\\ndifferential privacy (LDP) has emerged as a promising standard. Nevertheless,\\napplying LDP to stream data presents significant challenges, as stream data\\noften involves a large or even infinite number of values. Allocating a given\\nprivacy budget across these data points would introduce overwhelming LDP noise\\nto the original stream data.\\n  Beyond existing approaches that merely use perturbed values for estimating\\nstatistics, our design leverages them for both perturbation and estimation.\\nThis dual utilization arises from a key observation: each user knows their own\\nground truth and perturbed values, enabling a precise computation of the\\ndeviation error caused by perturbation. By incorporating this deviation into\\nthe perturbation process of subsequent values, the previous noise can be\\ncalibrated. Following this insight, we introduce the Iterative Perturbation\\nParameterization (IPP) method, which utilizes current perturbed results to\\ncalibrate the subsequent perturbation process. To enhance the robustness of\\ncalibration and reduce sensitivity, two algorithms, namely Accumulated\\nPerturbation Parameterization (APP) and Clipped Accumulated Perturbation\\nParameterization (CAPP) are further developed. We prove that these three\\nalgorithms satisfy $w$-event differential privacy while significantly improving\\nutility. Experimental results demonstrate that our techniques outperform\\nstate-of-the-art LDP stream publishing solutions in terms of utility, while\\nretaining the same privacy guarantee.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.DB\", \"published\": \"2025-04-21T09:51:18Z\"}"}
