{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23692v1\", \"title\": \"Superconductivity in High-Entropy Antimonide M$_{1-x}$Pt$_x$Sb (M =\\n  equimolar Ru, Rh, Pd, and Ir)\", \"summary\": \"The high-entropy concept was applied to the synthesis of transition-metal\\nantimonides, M1-xPtxSb (M = equimolar Ru, Rh, Pd, and Ir). High-entropy\\nantimonide samples crystallized in a pseudo-hexagonal NiAs-type crystal\\nstructure with a P63/mmc space group were successfully synthesized through a\\nconventional solid-state reaction and subsequent quenching. A detailed\\ninvestigation of the composition and equilibration conditions confirmed the\\nreversible phase transition between a multi-phase state at low temperature and\\nan entropy-driven single-phase solid solution at high temperatures. Electrical\\nresistivity, magnetization, and heat capacity measurements of single-phase\\nM1-xPtxSb (x = 0.2) samples revealed a bulk superconducting transition at\\n2.15(2) K. This study demonstrates that the high-entropy concept provides\\nnumerous opportunities for the discovery of new functional materials such as\\nsuperconductors.\", \"main_category\": \"cond-mat.supr-con\", \"categories\": \"cond-mat.supr-con,cond-mat.mtrl-sci,cond-mat.str-el\", \"published\": \"2025-03-31T03:44:44Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23710v1\", \"title\": \"Formation of the Little Red Dots from the Core-collapse of\\n  Self-interacting Dark Matter Halos\", \"summary\": \"We present a statistical study on the formation and growth of black holes\\n(BHs) seeded by gravothermal core-collapse of self-interacting dark matter\\n(SIDM) halos at high redshifts, using a semi-analytical framework based on\\nMonte-Carlo merger trees. We demonstrate that BH formation via gravothermal\\ncollapse naturally occurs in high-concentration halos at a characteristic mass\\nscale determined by the SIDM cross section, and only during the early Universe.\\nThis mechanism is particularly promising for explaining the abundance of little\\nred dots (LRDs) -- a population of early, apparently galaxy-less active\\ngalactic nuclei hosting supermassive BHs. By incorporating this seeding process\\nwith simplified models of BH growth and mergers, we successfully reproduce the\\nobserved LRD mass function for moderately large cross sections of $\\\\sigma_{0m}\\n\\\\sim 30 \\\\mathrm{cm^2\\\\,g^{-1}}$ and $\\\\omega \\\\sim 80\\\\,\\\\mathrm{km\\\\,s^{-1}}$,\\nintriguingly consistent with independent local constraints derived from galaxy\\nrotation curves. Our results highlight the potential of high-redshift BH\\nstatistics as a complementary probe for constraining SIDM models.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.CO\", \"published\": \"2025-03-31T04:15:20Z\"}"}
