{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21734v1\", \"title\": \"Thermoelectric Thomson coefficient of quark-gluon plasma in the presence\\n  of a time-varying magnetic field\", \"summary\": \"Heavy-ion collision experiments such as the Large Hadron Collider and the\\nRelativistic Heavy Ion Collider offer a unique platform to study several key\\nproperties of the quark-gluon plasma (QGP), a deconfined state of strongly\\ninteracting matter. Quarks, being the electrically charged particles, can\\ninduce an electric current in the medium in response to the temperature\\ngradients. Hence, the QGP medium can behave like a thermoelectric medium. The\\nthermoelectric coefficients, such as the Seebeck and Thomson coefficients, can\\nhelp us to understand the intricate transport phenomenon of the medium. In\\nperipheral collisions, the intense, transient, and time-dependent magnetic\\nfield created due to spectator protons significantly influences the\\nthermoelectric properties of the QGP medium, affecting the charge and heat\\ntransport. This work uses the quasi-particle model to calculate the Thomson\\ncoefficient in QGP. The Thomson effect, describing the continuous heating or\\ncooling of the charge-carrying medium in the presence of temperature gradients,\\nremains largely unexplored in QGP. The Seebeck effect, which relates\\ntemperature gradients to induced electric fields, has been widely studied in\\nthe literature. For the first time, we calculate the magneto-Thomson and\\ntransverse Thomson coefficients. We have studied their dependence on\\ntemperature, baryon chemical potential, center of mass energy, and\\ntime-dependent magnetic field with different decay parameters. The transverse\\nThomson effect originates due to the presence of the Nernst effect in the\\npresence of a magnetic field. Our results provide new insights into the\\nhigher-order thermoelectric transport properties of the QGP medium in the\\ncontext of heavy-ion collisions.\", \"main_category\": \"hep-ph\", \"categories\": \"hep-ph,hep-ex,hep-th,nucl-ex,nucl-th\", \"published\": \"2025-04-30T15:24:53Z\"}"}
