{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01896v1\", \"title\": \"Composition Design of Shape Memory Ceramics based on Gaussian Processes\", \"summary\": \"We present a Gaussian process machine learning model to predict the\\ntransformation temperature and lattice parameters of ZrO$_2$-based ceramics.\\nOur overall goal is to search for a shape memory ceramic with a reversible\\ntransformation and low hysteresis. The identification of a new low hysteresis\\ncomposition is based on design criteria that have been successful in metal\\nalloys: (1) $\\\\lambda_2 = 1$, where $\\\\lambda_2$ is the middle eigenvalue of the\\ntransformation stretch tensor, (2) minimizing the max$|q(f)|$, which measures\\nthe deviation from satisfying the cofactor conditions, (3) high transformation\\ntemperature, (4) low transformational volume change, and (5) solid solubility.\\nWe generate many synthetic compositions, and identify a promising composition,\\n31.75Zr-37.75Hf-14.5Y-14.5Ta-1.5Er, which closely satisfies all the design\\ncriteria based on predictions from machine learning. However, differential\\nthermal analysis reveals a relatively high thermal hysteresis of 137{\\\\deg}C for\\nthis composition, indicating that the proposed design criteria are not\\nuniversally applicable to all ZrO$_2$-based ceramics. We also explore reducing\\ntetragonality of the austenite phase by addition of Er$_2$O$_3$. The idea is to\\ntune the lattice parameters of austenite phase towards a cubic structure will\\nincrease the number of martensite variants, thus, allowing more flexibility for\\nthem to accommodate high strain during transformation. We find the effect of\\nEr$_2$O$_3$ on tetragonality is weak due to limited solubility. We conclude\\nthat a more effective dopant is needed to achieve significant tetragonality\\nreduction. Overall, Gaussian process machine learning models are shown to be\\nhighly useful for prediction of compositions and lattice parameters, but the\\ndiscovery of low hysteresis ceramic materials apparently involves other factors\\nnot relevant to phase transformations in metals.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,physics.data-an\", \"published\": \"2025-04-02T16:56:59Z\"}"}
