{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20562v1\", \"title\": \"Binding of native DNA to MoS$_{2}$ nanoflakes: the role of defects and\\n  edge atoms of MoS$_{2}$ nanostructures in their biofunctionalization\", \"summary\": \"In this work, the binding of native DNA to MoS$_{2}$ nanoflakes (FLs) was\\nstudied by using UV-visible absorption spectroscopy, thermal denaturation\\nmethod, transmission electron microscopy (TEM), temperature-dependent dynamic\\nlight scattering (DLS), and the DFT computational-chemistry method. Analysis of\\nthe experimental data: TEM images and thermal denaturation measurements showed\\nthe binding of the biopolymer with MoS$_{2}$ FLs. An increase in the melting\\ntemperature of DNA and a decrease in the hyperchromic coefficient at binding\\nwith MoS$_{2}$ FLs indicates the formation of the DNA:MoS$_{2}$ FL\\nnanoassemblies due primarily to the covalent interaction of the oxygen atoms of\\nthe phosphate groups of DNA with the MoS$_{2}$ FLs. Possible complexes of a\\nnucleotide fragment (ribose-phosphate group) with MoS$_{2}$ nanolayer are\\nconsidered and calculated employing the DFT method. Different structures of\\nthese complexes are optimized and the interaction energies between components\\nare determined. Special attention in calculations is focused on the binding of\\nthis nucleotide fragment with Mo atoms located at the edge of the MoS$_{2}$\\nnanolayer and with point structural defects of the MoS$_{2}$ surface containing\\nthe S vacancy. Based on this calculation and experimental observation, a\\nmechanism of binding of native DNA to MoS$_{2}$ FLs has been proposed, in which\\ntheir conjugation begins with point contacts of DNA phosphate groups with Mo\\natoms (at the edge or/and in defects) through the formation of a strong\\ncoordination bond. The results indicate the critical role of defects and edge\\natoms of MoS$_{2}$ FLs in their biofunctionalization.\", \"main_category\": \"physics.bio-ph\", \"categories\": \"physics.bio-ph\", \"published\": \"2025-04-29T09:05:58Z\"}"}
