{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15887v1\", \"title\": \"Real-fluid behavior in rapid compression machines: Does it matter?\", \"summary\": \"Rapid compression machines (RCMs) have been extensively used to quantify fuel\\nautoignition chemistry and validate chemical kinetic models. Historically, the\\nanalyses of experimental and modeling RCM autoignition data have been conducted\\nbased on the adiabatic core hypothesis where real-fluid behavior has been\\ncompletely overlooked, though this might be significant at common RCM test\\nconditions. This work presents a first-of-its-kind study that addresses two\\nsignificant questions for autoignition studies within RCMs in the fundamental\\ncombustion community: (i) can real-fluid behavior in RCMs affect interpretation\\nand analysis of RCM experimental data? and (ii) can real-fluid behavior in RCMs\\naffect RCM autoignition modeling and the validation of chemical kinetic models?\\nTo this end, theories for real-fluid isentropic change are newly proposed and\\nderived based on high-order Virial EoS, and are further incorporated into an\\neffective-volume real-fluid autoignition modeling framework newly developed for\\nRCMs. With detailed analyses, the strong real-fluid behavior in common RCM\\ntests is confirmed, which can greatly influence the interpretation of RCM\\nautoignition experiments, particularly the determination of end-of-compression\\ntemperature and evolution of the adiabatic core in the reaction chamber.\\nFurthermore, real-fluid RCM modeling results reveal that considerable error can\\nbe introduced into simulating RCM autoignition experiments when assuming\\nideal-gas behavior, leading to contradictory validation results of chemical\\nkinetic models. Therefore, we recommend the community adopt frameworks with\\nreal-fluid behavior fully accounted for to analyze and simulate past and future\\nRCM experiments, so as to avoid misinterpretation of RCM autoignition\\nexperiments and eliminate the errors that can be introduced into the simulation\\nresults with the existing RCM modeling frameworks.\", \"main_category\": \"physics.chem-ph\", \"categories\": \"physics.chem-ph,physics.comp-ph\", \"published\": \"2025-04-22T13:31:47Z\"}"}
