{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23856v1\", \"title\": \"Explodability criteria for the neutrino-driven supernova mechanism\", \"summary\": \"Massive stars undergoing iron core collapse at the end of their evolution\\nterminate their lives either in successful or failed supernovae (SNe). The\\nphysics of core collapse supernovae (CCSNe) is complex, and their understanding\\nrequires computationally expensive simulations. The sampling of large, densely\\nsampled parameter spaces of SN progenitors, as is needed e.g. for population\\nsynthesis studies, is thus not feasible. To remedy this situation, we present\\ncriteria that allow us to predict the final fates of stars by evaluating\\nmultiple explodability proxies derived from the stellar structure at the onset\\nof core collapse. These are formulated based on the outcomes of a semi-analytic\\nsupernova model, evaluated over a set of ~3,900 heterogeneous stellar\\nprogenitors (single stars, binary-stripped and accretor stars). Over these, the\\nexplodabiliy criteria achieve an accuracy of >99% agreement with the\\nsemi-analytic model. The criteria are tested on 29 state-of-the-art 3D CCSN\\nsimulation outcomes from two different groups. Furthermore, we find that all\\nexplodability proxies needed for our pre-SN criteria have two distinct peaks\\nand intervening valleys as a function of the carbon-oxygen (CO) core mass\\n$M_\\\\mathrm{CO}$, which coincide with failed and successful SNe, respectively.\\nThe CO core masses of explodability peaks shift systematically with\\nmetallicity, $Z$, and with the timing of hydrogen-rich envelope removal in\\nbinary-stripped stars. With these, we identify critical values in\\n$M_\\\\mathrm{CO}$ that define windows over which black holes form by direct\\ncollapse. The outcome is a CCSN recipe based on $M_\\\\mathrm{CO}$ and $Z$,\\napplicable for rapid binary population synthesis and other studies. Our\\nexplodability formalism is consistent with SN observations that constrain the\\nprogenitor $M_\\\\mathrm{CO}$ and partially addresses the missing red supergiant\\nproblem by direct black hole formation.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.HE\", \"published\": \"2025-03-31T09:04:10Z\"}"}
