{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03673v1\", \"title\": \"RoboOS: A Hierarchical Embodied Framework for Cross-Embodiment and\\n  Multi-Agent Collaboration\", \"summary\": \"The dawn of embodied intelligence has ushered in an unprecedented imperative\\nfor resilient, cognition-enabled multi-agent collaboration across\\nnext-generation ecosystems, revolutionizing paradigms in autonomous\\nmanufacturing, adaptive service robotics, and cyber-physical production\\narchitectures. However, current robotic systems face significant limitations,\\nsuch as limited cross-embodiment adaptability, inefficient task scheduling, and\\ninsufficient dynamic error correction. While End-to-end VLA models demonstrate\\ninadequate long-horizon planning and task generalization, hierarchical VLA\\nmodels suffer from a lack of cross-embodiment and multi-agent coordination\\ncapabilities. To address these challenges, we introduce RoboOS, the first\\nopen-source embodied system built on a Brain-Cerebellum hierarchical\\narchitecture, enabling a paradigm shift from single-agent to multi-agent\\nintelligence. Specifically, RoboOS consists of three key components: (1)\\nEmbodied Brain Model (RoboBrain), a MLLM designed for global perception and\\nhigh-level decision-making; (2) Cerebellum Skill Library, a modular,\\nplug-and-play toolkit that facilitates seamless execution of multiple skills;\\nand (3) Real-Time Shared Memory, a spatiotemporal synchronization mechanism for\\ncoordinating multi-agent states. By integrating hierarchical information flow,\\nRoboOS bridges Embodied Brain and Cerebellum Skill Library, facilitating robust\\nplanning, scheduling, and error correction for long-horizon tasks, while\\nensuring efficient multi-agent collaboration through Real-Time Shared Memory.\\nFurthermore, we enhance edge-cloud communication and cloud-based distributed\\ninference to facilitate high-frequency interactions and enable scalable\\ndeployment. Extensive real-world experiments across various scenarios,\\ndemonstrate RoboOS's versatility in supporting heterogeneous embodiments.\\nProject website: https://github.com/FlagOpen/RoboOS\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-05-06T16:11:49Z\"}"}
