{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10398v1\", \"title\": \"How well can we unravel the accreted constituents of the Milky Way\\n  stellar halo? A test on cosmological hydrodynamical simulations\", \"summary\": \"Context. One of the primary goals of Galactic Archaeology is to reconstruct\\nthe Milky Way's accretion history. To achieve this, significant efforts have\\nbeen dedicated to identifying signatures of past accretion events. In\\nparticular, the study of integrals-of-motion (IoM) space has proven to be\\nhighly insightful for uncovering these ancient mergers and understanding their\\nimpact on the Galaxy's evolution.\\n  Aims. This paper evaluates the effectiveness of a state-of-the-art method for\\ndetecting debris from accreted galaxies, by testing it on four Milky Way-like\\ngalaxies from the Auriga suite of cosmological magneto-hydrodynamical\\nsimulations.\\n  Methods. We employ the innovative method from L\\\\\\\"ovdal et al. (2022) to\\nidentify substructures in the integrals-of-motion space within the local\\nstellar halos of the four simulated galaxies. This approach enables us to\\nevaluate the method's performance by comparing the properties of the identified\\nclusters with the known populations of accreted galaxies in the simulations.\\nAdditionally, we investigate whether incorporating chemical abundances and\\nstellar age information can help to link distinct structures originating from\\nthe same accretion event.\\n  Results. This method is very effective in detecting debris from accretion\\nevents that occur less than 6-7 Gyr ago but struggles to detect most of the\\ndebris from older accretion. Furthermore, most of the detected structures\\nsuffer from significant contamination by in-situ stars. Our results also show\\nthat the method may also generate artificial detections.\\n  Conclusions. Our work show that the Milky Way's accretion history remains\\nuncertain, and question the reality of some detected structures in the Solar\\nvicinity.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-14T16:48:55Z\"}"}
