{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16877v1\", \"title\": \"Context-Enhanced Vulnerability Detection Based on Large Language Model\", \"summary\": \"Vulnerability detection is a critical aspect of software security. Accurate\\ndetection is essential to prevent potential security breaches and protect\\nsoftware systems from malicious attacks. Recently, vulnerability detection\\nmethods leveraging deep learning and large language models (LLMs) have garnered\\nincreasing attention. However, existing approaches often focus on analyzing\\nindividual files or functions, which limits their ability to gather sufficient\\ncontextual information. Analyzing entire repositories to gather context\\nintroduces significant noise and computational overhead. To address these\\nchallenges, we propose a context-enhanced vulnerability detection approach that\\ncombines program analysis with LLMs. Specifically, we use program analysis to\\nextract contextual information at various levels of abstraction, thereby\\nfiltering out irrelevant noise. The abstracted context along with source code\\nare provided to LLM for vulnerability detection. We investigate how different\\nlevels of contextual granularity improve LLM-based vulnerability detection\\nperformance. Our goal is to strike a balance between providing sufficient\\ndetail to accurately capture vulnerabilities and minimizing unnecessary\\ncomplexity that could hinder model performance. Based on an extensive study\\nusing GPT-4, DeepSeek, and CodeLLaMA with various prompting strategies, our key\\nfindings includes: (1) incorporating abstracted context significantly enhances\\nvulnerability detection effectiveness; (2) different models benefit from\\ndistinct levels of abstraction depending on their code understanding\\ncapabilities; and (3) capturing program behavior through program analysis for\\ngeneral LLM-based code analysis tasks can be a direction that requires further\\nattention.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-23T16:54:16Z\"}"}
