{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11166v1\", \"title\": \"Adjustable Molecular Cross-Linkage of MXene Layers for Tunable Charge\\n  Transport and VOC Sensing\", \"summary\": \"MXenes, two-dimensional transition metal carbides, nitrides or carbonitrides,\\nare emerging as highly promising materials due to their remarkable charge\\ntransport characteristics and their versatile surface chemistry. Herein, we\\ndemonstrate the tunability of interfaces and the inter-layer spacing between\\nTi$_3$C$_2$T$_X$ MXene flakes through molecular cross-linking via ligand\\nexchange with homologous diamines. Oleylamine was initially introduced as a\\nligand, to facilitate the delamination and stable dispersion of pristine\\nTi$_3$C$_2$T$_X$ flakes in chloroform. Subsequently, controlled cross-linkage\\nof the flakes was achieved using diamine ligands with varying aliphatic chain\\nlengths, enabling the precise tuning of the inter-layer spacing. Grazing\\nincidence X-ray scattering (GIXRD / GIWAXS) confirmed the correlation between\\nligand chain length and inter-layer spacing, which was further supported by\\nDensity Functional Theory (DFT) calculations. Furthermore, we investigated the\\ncharge transport properties of thin films consisting of these diamine\\ncross-linked MXenes and observed a strong dependence of the conductivity on the\\ninterlayer spacing. Finally, we probed chemiresistive vapor sensing properties\\nof the MXene composites and observed a pronounced sensitivity and selectivity\\ntowards water vapor, highlighting their potential for use in humidity sensors.\\nProviding significant insights into molecular cross-linking of MXenes to form\\nhybrid inorganic/organic composites and its consequences for charge transport,\\nthis study opens avenues for the development of next-generation MXene-based\\nelectronic devices.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,physics.app-ph\", \"published\": \"2025-04-15T13:14:32Z\"}"}
