{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15618v1\", \"title\": \"We Are What We Buy: Extracting urban lifestyles using large-scale\\n  delivery records\", \"summary\": \"Lifestyle has been used as a lens to characterize a society and its people\\nwithin, which includes their social status, consumption habits, values, and\\ncultural interests. Recently, the increasing availability of large-scale\\npurchasing records, such as credit card transaction data, has enabled\\ndata-driven studies to capture lifestyles through consumption behavior.\\nHowever, the lack of detailed information on individual purchases prevents\\nresearchers from constructing a precise representation of lifestyle structures\\nthrough the consumption pattern. Here, we extract urban lifestyle patterns as a\\ncomposition of fine-grained product categories that are significantly consumed\\ntogether. Leveraging 103,342,186 package delivery records from 2018 to 2022 in\\nSeoul, Republic of Korea, we construct a co-consumption network of detailed\\nproduct categories and systematically identify lifestyles as clusters in the\\nnetwork. Our results reveal five lifestyle clusters: 'Beauty lovers', 'Fashion\\nlovers', 'Work and life', 'Homemakers', and 'Baby and hobbyists', which\\nrepresent distinctive lifestyles while also being connected to each other.\\nMoreover, the geospatial distribution of lifestyle clusters aligns with\\nregional characteristics (business vs. residential areas) and is associated\\nwith multiple demographic characteristics of residents, such as income, birth\\nrate, and age. Temporal analysis further demonstrates that lifestyle patterns\\nevolve in response to external disruptions, such as COVID-19. As urban\\nsocieties become more multifaceted, our framework provides a powerful tool for\\nresearchers, policymakers, and businesses to understand the shifting dynamics\\nof contemporary lifestyles.\", \"main_category\": \"physics.soc-ph\", \"categories\": \"physics.soc-ph\", \"published\": \"2025-04-22T06:16:18Z\"}"}
