{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00423v1\", \"title\": \"Thermal evolution model from cometary nuclei to asteroids considering\\n  contraction associated with ice sublimation\", \"summary\": \"Comet--asteroid transition (CAT) objects are small solar system bodies in the\\nprocess of evolving from cometary nuclei into asteroids, as they gradually lose\\nvolatile substances due to solar heating. The volatile material is mainly water\\nice, and the time required for its complete depletion is called the desiccation\\ntime. Estimating the desiccation time is important for examining the formation\\nand evolution of small solar system bodies. Here, we propose a new theoretical\\nmodel for evaluating the desiccation time as a function of orbital elements,\\nconsidering the contraction of the entire cometary nucleus due to ice\\nsublimation. First, we performed numerical calculations of the thermal\\nevolution of a cometary nucleus in an eccentric orbit, considering the seasonal\\nvariation in the solar heating rate. Next, we derived the desiccation time\\nanalytically as a function of orbital elements based on a steady-state model\\nconsidering the solar heating rate averaged over the seasons. We compared the\\nnumerical solutions for the desiccation time with the analytical solutions and\\nclarified the conditions under which the analytical model can be applied.\\nAdditionally, based on the analytical model, we derived formulae for estimating\\nthe emission rates of water vapor and dust on the surface of the cometary\\nnucleus, the maximum size of the emitted dust, and the dust emission velocity,\\nby assuming the amount of ice remaining inside the nucleus. Using these\\nanalytical solutions, we considered the internal structure and evolution\\nprocess of typical CAT objects. Our analytical model was generally consistent\\nwith that of the results of earlier observations of these objects. Our model\\nprovides a theoretical guideline for discussing the evolution of cometary\\nnuclei and the possibility of retaining internal ice in asteroids.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-05-01T09:45:32Z\"}"}
