{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21675v1\", \"title\": \"Elimination Distance to Dominated Clusters\", \"summary\": \"In the Dominated Cluster Deletion problem we are given an undirected graph\\n$G$ and integers $k$ and $d$ and the question is to decide whether there exists\\na set of at most $k$ vertices whose removal results in a graph in which each\\nconnected component has a dominating set of size at most $d$. In the\\nElimination Distance to Dominated Clusters problem we are again given an\\nundirected graph $G$ and integers $k$ and $d$ and the question is to decide\\nwhether we can recursively delete vertices up to depth $k$ such that each\\nremaining connected component has a dominating set of size at most $d$. Bentert\\net al.~[Bentert et al., MFCS 2024] recently provided an almost complete\\nclassification of the parameterized complexity of Dominated Cluster Deletion\\nwith respect to the parameters $k$, $d$, $c$, and $\\\\Delta$, where $c$ and\\n$\\\\Delta$ are the degeneracy, and the maximum degree of the input graph,\\nrespectively. In particular, they provided a non-uniform algorithm with running\\ntime $f(k,d)\\\\cdot n^{O(d)}$. They left as an open problem whether the problem\\nis fixed-parameter tractable with respect to the parameter $k+d+c$. We provide\\na uniform algorithm running in time $f(k,d)\\\\cdot n^{O(d)}$ for both Dominated\\nCluster Deletion and Elimination Distance to Dominated Clusters. We furthermore\\nshow that both problems are FPT when parameterized by $k+d+\\\\ell$, where $\\\\ell$\\nis the semi-ladder index of the input graph, a parameter that is upper bounded\\nand may be much smaller than the degeneracy $c$, positively answering the open\\nquestion of Bentert et al. We almost complete the picture by providing an\\nalmost full classification for the parameterized complexity and kernelization\\ncomplexity of Elimination Distance to Dominated Clusters. The one difficult\\nbase case that remains open is whether treedepth (the case $d=0$) is NP-hard on\\ngraphs of bounded maximum degree.\", \"main_category\": \"cs.DM\", \"categories\": \"cs.DM\", \"published\": \"2025-04-30T14:15:41Z\"}"}
