{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10267v1\", \"title\": \"Trade-offs in Privacy-Preserving Eye Tracking through Iris Obfuscation:\\n  A Benchmarking Study\", \"summary\": \"Recent developments in hardware, computer graphics, and AI may soon enable\\nAR/VR head-mounted displays (HMDs) to become everyday devices like smartphones\\nand tablets. Eye trackers within HMDs provide a special opportunity for such\\nsetups as it is possible to facilitate gaze-based research and interaction.\\nHowever, estimating users' gaze information often requires raw eye images and\\nvideos that contain iris textures, which are considered a gold standard\\nbiometric for user authentication, and this raises privacy concerns. Previous\\nresearch in the eye-tracking community focused on obfuscating iris textures\\nwhile keeping utility tasks such as gaze estimation accurate. Despite these\\nattempts, there is no comprehensive benchmark that evaluates state-of-the-art\\napproaches. Considering all, in this paper, we benchmark blurring, noising,\\ndownsampling, rubber sheet model, and iris style transfer to obfuscate user\\nidentity, and compare their impact on image quality, privacy, utility, and risk\\nof imposter attack on two datasets. We use eye segmentation and gaze estimation\\nas utility tasks, and reduction in iris recognition accuracy as a measure of\\nprivacy protection, and false acceptance rate to estimate risk of attack. Our\\nexperiments show that canonical image processing methods like blurring and\\nnoising cause a marginal impact on deep learning-based tasks. While\\ndownsampling, rubber sheet model, and iris style transfer are effective in\\nhiding user identifiers, iris style transfer, with higher computation cost,\\noutperforms others in both utility tasks, and is more resilient against spoof\\nattacks. Our analyses indicate that there is no universal optimal approach to\\nbalance privacy, utility, and computation burden. Therefore, we recommend\\npractitioners consider the strengths and weaknesses of each approach, and\\npossible combinations of those to reach an optimal privacy-utility trade-off.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-14T14:29:38Z\"}"}
