{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05090v1\", \"title\": \"Integrating Communication, Sensing, and Security: Progress and Prospects\\n  of PLS in ISAC Systems\", \"summary\": \"The sixth generation of wireless networks defined several key performance\\nindicators (KPIs) for assessing its networks, mainly in terms of reliability,\\ncoverage, and sensing. In this regard, remarkable attention has been paid\\nrecently to the integrated sensing and communication (ISAC) paradigm as an\\nenabler for efficiently and jointly performing communication and sensing using\\nthe same spectrum and hardware resources. On the other hand, ensuring\\ncommunication and data security has been an imperative requirement for wireless\\nnetworks throughout their evolution. The physical-layer security (PLS) concept\\npaved the way to catering to the security needs in wireless networks in a\\nsustainable way while guaranteeing theoretically secure transmissions,\\nindependently of the computational capacity of adversaries. Therefore, it is of\\nparamount importance to consider a balanced trade-off between communication\\nreliability, sensing, and security in future networks, such as the 5G and\\nbeyond, and the 6G. In this paper, we provide a comprehensive and system-wise\\nreview of designed secure ISAC systems from a PLS point of view. In particular,\\nthe impact of various physical-layer techniques, schemes, and wireless\\ntechnologies to ensure the sensing-security trade-off is studied from the\\nsurveyed work. Furthermore, the amalgamation of PLS and ISAC is analyzed in a\\nbroader impact by considering attacks targeting data confidentiality,\\ncommunication covertness, and sensing spoofing. The paper also serves as a\\ntutorial by presenting several theoretical foundations on ISAC and PLS, which\\nrepresent a practical guide for readers to develop novel secure ISAC network\\ndesigns.\", \"main_category\": \"cs.ET\", \"categories\": \"cs.ET,cs.CR,eess.SP\", \"published\": \"2025-05-08T09:40:14Z\"}"}
