{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03648v1\", \"title\": \"Binding threshold units with artificial oscillatory neurons\", \"summary\": \"Artificial Kuramoto oscillatory neurons were recently introduced as an\\nalternative to threshold units. Empirical evidence suggests that oscillatory\\nunits outperform threshold units in several tasks including unsupervised object\\ndiscovery and certain reasoning problems. The proposed coupling mechanism for\\nthese oscillatory neurons is heterogeneous, combining a generalized Kuramoto\\nequation with standard coupling methods used for threshold units. In this\\nresearch note, we present a theoretical framework that clearly distinguishes\\noscillatory neurons from threshold units and establishes a coupling mechanism\\nbetween them. We argue that, from a biological standpoint, oscillatory and\\nthreshold units realise distinct aspects of neural coding: roughly, threshold\\nunits model intensity of neuron firing, while oscillatory units facilitate\\ninformation exchange by frequency modulation. To derive interaction between\\nthese two types of units, we constrain their dynamics by focusing on dynamical\\nsystems that admit Lyapunov functions. For threshold units, this leads to\\nHopfield associative memory model, and for oscillatory units it yields a\\nspecific form of generalized Kuramoto model. The resulting dynamical systems\\ncan be naturally coupled to form a Hopfield-Kuramoto associative memory model,\\nwhich also admits a Lyapunov function. Various forms of coupling are possible.\\nNotably, oscillatory neurons can be employed to implement a low-rank correction\\nto the weight matrix of a Hopfield network. This correction can be viewed\\neither as a form of Hebbian learning or as a popular LoRA method used for\\nfine-tuning of large language models. We demonstrate the practical realization\\nof this particular coupling through illustrative toy experiments.\", \"main_category\": \"q-bio.NC\", \"categories\": \"q-bio.NC,cs.AI,cs.LG\", \"published\": \"2025-05-06T15:54:52Z\"}"}
