{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06251v1\", \"title\": \"Moir\\u00e9 enhanced flat band in rhombohedral graphene\", \"summary\": \"The fractional quantum anomalous Hall effect (FQAHE) is a fascinating\\nemergent quantum state characterized by fractionally charged excitations in the\\nabsence of magnetic field,which could arise from the intricate interplay\\nbetween electron correlation, nontrivial topology and spontaneous time-reversal\\nsymmetry breaking. Recently, FQAHE has been realized in aligned rhombohedral\\npentalayer graphene on BN superlattice (aligned R5G/BN), where the topological\\nflat band is modulated by the moir\\\\'e potential. However, intriguingly, the\\nFQAHE is observed only when electrons are pushed away from the moir\\\\'e\\ninterface. The apparently opposite implications from these experimental\\nobservations, along with different theoretical models, have sparked intense\\ndebates regarding the role of the moir\\\\'e potential. Unambiguous experimental\\nobservation of the topological flat band as well as moir\\\\'e bands with energy\\nand momentum resolved information is therefore critical to elucidate the\\nunderlying mechanism. Here by performing nanospot angle-resolved photoemission\\nspectroscopy (NanoARPES) measurements, we directly reveal the topological flat\\nband electronic structures of R5G, from which key hopping parameters essential\\nfor determining the fundamental electronic structure of rhombohedral graphene\\nare extracted. Moreover, a comparison of electronic structures between aligned\\nand non-aligned samples reveals that the moir\\\\'e potential plays a pivotal role\\nin enhancing the topological flat band in the aligned sample. Our study\\nprovides experimental guiding lines to narrow down the phase space of\\nrhombohedral graphene, laying an important foundation for understanding exotic\\nquantum phenomena in this emerging platform.\", \"main_category\": \"cond-mat.mes-hall\", \"categories\": \"cond-mat.mes-hall,cond-mat.str-el,cond-mat.supr-con\", \"published\": \"2025-04-08T17:56:35Z\"}"}
