{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04988v1\", \"title\": \"RS-RAG: Bridging Remote Sensing Imagery and Comprehensive Knowledge with\\n  a Multi-Modal Dataset and Retrieval-Augmented Generation Model\", \"summary\": \"Recent progress in VLMs has demonstrated impressive capabilities across a\\nvariety of tasks in the natural image domain. Motivated by these advancements,\\nthe remote sensing community has begun to adopt VLMs for remote sensing\\nvision-language tasks, including scene understanding, image captioning, and\\nvisual question answering. However, existing remote sensing VLMs typically rely\\non closed-set scene understanding and focus on generic scene descriptions, yet\\nlack the ability to incorporate external knowledge. This limitation hinders\\ntheir capacity for semantic reasoning over complex or context-dependent queries\\nthat involve domain-specific or world knowledge. To address these challenges,\\nwe first introduced a multimodal Remote Sensing World Knowledge (RSWK) dataset,\\nwhich comprises high-resolution satellite imagery and detailed textual\\ndescriptions for 14,141 well-known landmarks from 175 countries, integrating\\nboth remote sensing domain knowledge and broader world knowledge. Building upon\\nthis dataset, we proposed a novel Remote Sensing Retrieval-Augmented Generation\\n(RS-RAG) framework, which consists of two key components. The Multi-Modal\\nKnowledge Vector Database Construction module encodes remote sensing imagery\\nand associated textual knowledge into a unified vector space. The Knowledge\\nRetrieval and Response Generation module retrieves and re-ranks relevant\\nknowledge based on image and/or text queries, and incorporates the retrieved\\ncontent into a knowledge-augmented prompt to guide the VLM in producing\\ncontextually grounded responses. We validated the effectiveness of our approach\\non three representative vision-language tasks, including image captioning,\\nimage classification, and visual question answering, where RS-RAG significantly\\noutperformed state-of-the-art baselines.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-07T12:13:43Z\"}"}
