{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10387v1\", \"title\": \"Cosmological zoom-in simulation of fuzzy dark matter down to z = 0:\\n  tidal evolution of subhaloes in a Milky Way-sized halo\", \"summary\": \"Subhaloes are critical in distinguishing dark matter models, yet their\\nevolution within galactic haloes, particularly in the Fuzzy Dark Matter (FDM)\\nmodel, remains challenging to fully investigate in numerical simulations. In\\nthis work, we employ the fluid-wave hybrid scheme recently implemented in the\\nGAMER-2 code to perform a cosmological zoom-in simulation of a Milky Way-sized\\nhalo with an FDM particle mass of m = 2 x 10^(-23) eV. It simultaneously\\nresolves the solitonic core of the host halo and tracks the complex tidal\\nevolution of subhaloes down to redshift z = 0. We examine the internal\\nstructure of subhaloes by analyzing their density profiles, velocity\\ndispersions, and density power spectra across various redshifts. Our findings\\nshow that partially tidally stripped subhaloes deviate from the core-halo mass\\nrelation; their solitons remain intact and are enveloped by smaller granules\\npredominantly from the host halo. Furthermore, our simulation unravels a\\ncomplex tidal evolution of FDM subhaloes. On the one hand, we observe a subhalo\\ncore undergoing complete tidal disruption at z ~ 0.14, which later reemerges\\nnear the outskirts of the host halo around z ~ 0. This disruption event,\\ncharacterized by a core contaminated with interference fringes from the host\\nhalo's wave function, occurs earlier than previously predicted. On the other\\nhand, FDM subhaloes have denser cores before infall due to the presence of\\ncentral solitons, making them more resilient to tidal disruption than their\\nN-body counterparts. Our results demonstrate GAMER-2's capability to resolve\\nnon-linear FDM substructure down to z = 0, paving the way for future studies of\\nlarger FDM subhalo samples with heavier particle masses.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,astro-ph.GA\", \"published\": \"2025-04-14T16:28:54Z\"}"}
