{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15261v1\", \"title\": \"Leveraging Language Models for Automated Patient Record Linkage\", \"summary\": \"Objective: Healthcare data fragmentation presents a major challenge for\\nlinking patient data, necessitating robust record linkage to integrate patient\\nrecords from diverse sources. This study investigates the feasibility of\\nleveraging language models for automated patient record linkage, focusing on\\ntwo key tasks: blocking and matching. Materials and Methods: We utilized\\nreal-world healthcare data from the Missouri Cancer Registry and Research\\nCenter, linking patient records from two independent sources using\\nprobabilistic linkage as a baseline. A transformer-based model, RoBERTa, was\\nfine-tuned for blocking using sentence embeddings. For matching, several\\nlanguage models were experimented under fine-tuned and zero-shot settings,\\nassessing their performance against ground truth labels. Results: The\\nfine-tuned blocking model achieved a 92% reduction in the number of candidate\\npairs while maintaining near-perfect recall. In the matching task, fine-tuned\\nMistral-7B achieved the best performance with only 6 incorrect predictions.\\nAmong zero-shot models, Mistral-Small-24B performed best, with a total of 55\\nincorrect predictions. Discussion: Fine-tuned language models achieved strong\\nperformance in patient record blocking and matching with minimal errors.\\nHowever, they remain less accurate and efficient than a hybrid rule-based and\\nprobabilistic approach for blocking. Additionally, reasoning models like\\nDeepSeek-R1 are impractical for large-scale record linkage due to high\\ncomputational costs. Conclusion: This study highlights the potential of\\nlanguage models for automating patient record linkage, offering improved\\nefficiency by eliminating the manual efforts required to perform patient record\\nlinkage. Overall, language models offer a scalable solution that can enhance\\ndata integration, reduce manual effort, and support disease surveillance and\\nresearch.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.LG\", \"published\": \"2025-04-21T17:41:15Z\"}"}
