{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04916v1\", \"title\": \"Age-of-information minimization under energy harvesting and\\n  non-stationary environment\", \"summary\": \"This work focuses on minimizing the age of information for multiple energy\\nharvesting sources that sample data and transmit it to a sink node. At each\\ntime, the central scheduler selects one of the sources to probe the quality of\\nits channel to the sink node, and then the assessed channel quality is utilized\\nto determine whether a source will sample and send the packet. For a single\\nsource case, we assume that the probed channel quality is known at each time\\ninstant, model the problem of AoI minimization as a Markov decision process,\\nand prove the optimal sampling policy threshold structure. We then use this\\nthreshold structure and propose an AEC-SW-UCRL2 algorithm to handle unknown and\\ntime varying energy harvesting rate and channel statistics, motivated by the\\npopular SWUCRL2 algorithm for non stationary reinforcement learning. This\\nalgorithm is applicable when an upper bound is available for the total\\nvariation of each of these quantities over a time horizon. Furthermore, in\\nsituations where these variation budgets are not accessible, we introduce the\\nAEC-BORL algorithm, motivated by the well known BORL algorithm. For the\\nmultiple source case, we demonstrate that the AoI minimization problem can be\\nformulated as a constrained MDP, which can be relaxed using a Lagrange\\nmultiplier and decoupled into sub problems across source nodes. We also derive\\nWhittle index based source scheduling policy for probing and an optimal\\nthreshold policy for source sampling. We next leverage this Whittle index and\\nthreshold structure to develop the WIT-SW-UCRL2 algorithm for unknown time\\nvarying energy harvesting rates and channel statistics under their respective\\nvariation budgets. Moreover, we also proposed a Whittle index and threshold\\nbased bandit over reinforcement learning (WIT-BORL) algorithm for unknown\\nvariation budgets. Finally, we numerically demonstrate the efficacy of our\\nalgorithms.\", \"main_category\": \"eess.SY\", \"categories\": \"eess.SY,cs.SY\", \"published\": \"2025-04-07T10:53:53Z\"}"}
