{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00383v1\", \"title\": \"Prospects for Ultralow-Mass Nuclear Magnetic Resonance using Spin\\n  Defects in Hexagonal Boron Nitride\", \"summary\": \"Optically active quantum defects in solids, such as the nitrogen vacancy (NV)\\ncenter in diamond, are a leading modality for micron-scale and nanoscale\\n(ultralow-mass) nuclear magnetic resonance (NMR) spectroscopy and imaging under\\nambient conditions. However, the spin and optical properties of NV centers\\ndegrade when closer than about 10 nm from the diamond surface, limiting NMR\\nsensitivity as well as spectral and spatial resolution. Here we outline efforts\\nto develop an alternative nanoscale NMR sensor using the negatively charged\\nboron vacancy ($V_B^-$) in hexagonal boron nitride (hBN). As a van der Waals\\nmaterial, hBN's surface is free from dangling bonds and other sources of\\nparamagnetic noise that degrade the performance of near surface NVs, allowing\\nstable $V_B^-$ defects to exist $\\\\sim1\\\\,$nm from the material surface. We\\ndiscuss the properties of boron vacancies as they apply to narrowband (AC)\\nmagnetic field sensing and outline experimental designs optimized for this\\nsystem. We propose measurement protocols for $V_B^-$ NMR for both statistically\\nand uniformly polarized samples at the nano- and micron-scales, including\\nrelevant pulse sequences, sensitivity calculations, and sample confinement\\nstrategies; and compare the expected performance to NV-NMR. We estimate\\nback-action effects between the $V_B^-$ electronic spins and the sample nuclear\\nspins at the nanoscale; and account for unconventional diffusion dynamics in\\nthe flow-restricted nanoscale regime, calculating its effects on the expected\\n$V_B^-$ NMR signal. Lastly, we identify potential sample targets and\\noperational regimes best suited for both nanoscale and micron-scale $V_B^-$\\nNMR.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,physics.app-ph\", \"published\": \"2025-05-01T08:19:55Z\"}"}
