{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01948v1\", \"title\": \"PIMDAL: Mitigating the Memory Bottleneck in Data Analytics using a Real\\n  Processing-in-Memory System\", \"summary\": \"Database Management Systems (DBMSs) are crucial for efficient data management\\nand analytics, and are used in several different application domains. Due to\\nthe increasing volume of data a DBMS deals with, current processor-centric\\narchitectures (e.g., CPUs, GPUs) suffer from data movement bottlenecks when\\nexecuting key DBMS operations (e.g., selection, aggregation, ordering, and\\njoin). This happens mostly due to the limited memory bandwidth between compute\\nand memory resources. Data-centric architectures like Processing-in-Memory\\n(PIM) are a promising alternative for applications bottlenecked by data,\\nplacing compute resources close to where data resides. Previous works have\\nevaluated using PIM for data analytics. However, they either do not use\\nreal-world architectures or they consider only a subset of the operators used\\nin analytical queries. This work aims to fully evaluate a data-centric approach\\nto data analytics, by using the real-world UPMEM PIM system. To this end we\\nfirst present the PIM Data Analytics Library (PIMDAL), which implements four\\nmajor DB operators: selection, aggregation, ordering and join. Second, we use\\nhardware performance metrics to understand which properties of a PIM system are\\nimportant for a high-performance implementation. Third, we compare PIMDAL to\\nreference implementations on high-end CPU and GPU systems. Fourth, we use\\nPIMDAL to implement five TPC-H queries to gain insights into analytical\\nqueries. We analyze and show how to overcome the three main limitations of the\\nUPMEM system when implementing DB operators: (I) low arithmetic performance,\\n(II) explicit memory management and (III) limited communication between compute\\nunits. Our evaluation shows PIMDAL achieves 3.9x the performance of a high-end\\nCPU, on average across the five TPC-H queries.\", \"main_category\": \"cs.AR\", \"categories\": \"cs.AR,cs.DB,cs.DC\", \"published\": \"2025-04-02T17:54:33Z\"}"}
