{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04609v1\", \"title\": \"CAPERS-LRD-z9: A Gas Enshrouded Little Red Dot Hosting a Broad-line AGN\\n  at z=9.288\", \"summary\": \"We present CAPERS-LRD-z9, a little red dot (LRD) which we confirm to be a\\n$z=9.288$ broad-line AGN (BLAGN). First identified as a high-redshift LRD\\ncandidate from PRIMER NIRCam photometry, follow-up NIRSpec/PRISM spectroscopy\\nof CAPERS-LRD-z9 from the CANDELS-Area Prism Epoch of Reionization Survey\\n(CAPERS) has revealed a broad $3500$ km s$^{-1}$ H$\\\\beta$ emission line and\\nnarrow [O III]$\\\\lambda\\\\lambda4959,5007$ lines, indicative of a BLAGN. Based on\\nthe broad H$\\\\beta$ line, we compute a canonical black-hole mass of\\n$\\\\log(M_{\\\\textrm{BH}}/M_{\\\\odot})=7.58\\\\pm0.15$, although full consideration of\\nsystematic uncertainties yields a conservative range of\\n$6.65<\\\\log(M_{\\\\textrm{BH}}/M_{\\\\odot})<8.50$. These observations suggest that\\neither a massive black hole seed, or a lighter stellar remnant seed undergoing\\nperiods of super-Eddington accretion, is necessary to grow such a massive black\\nhole in $\\\\lesssim500$ Myr of cosmic time. CAPERS-LRD-z9 exhibits a strong\\nBalmer break, consistent with a central AGN surrounded by dense ($\\\\sim\\n10^{10}\\\\textrm{ cm}^{-3}$) neutral gas. We model CAPERS-LRD-z9 using CLOUDY to\\nfit the emission red-ward of the Balmer break with a dense gas-enshrouded AGN,\\nand bagpipes to fit the rest-ultraviolet emission as a host-galaxy stellar\\npopulation. This upper limit on the stellar mass of the host galaxy\\n($<10^9\\\\,{\\\\rm M_\\\\odot}$) implies that the black-hole to stellar mass ratio may\\nbe extremely large, possibly $>5\\\\%$ (although systematic uncertainties on the\\nblack-hole mass prevent strong conclusions). However, the shape of the UV\\ncontinuum differs from typical high-redshift star-forming galaxies, indicating\\nthat this UV emission may also be of AGN origin, and hence the true stellar\\nmass of the host may be still lower.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-05-07T17:53:48Z\"}"}
