{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01887v1\", \"title\": \"Dual mechanism of Anti-Seizure Medications in controlling seizure\\n  activity\", \"summary\": \"Background: Anti-seizure medications (ASMs) can reduce seizure duration, but\\ntheir precise modes of action are unclear. Specifically, it is unknown whether\\nASMs shorten seizures by simply compressing existing seizure activity into a\\nshorter time frame or by selectively suppressing certain seizure activity\\npatterns.\\n  Methods: We analysed intracranial EEG (iEEG) recordings of 457 seizures from\\n28 people with epilepsy undergoing ASM tapering. Beyond measuring seizure\\noccurrence and duration, we categorized distinct seizure activity patterns\\n(states) based on spatial and frequency power characteristics and related these\\nto different ASM levels.\\n  Results: We found that reducing ASM levels led to increased seizure frequency\\n(r = 0.87, p < 0.001) and longer seizure duration ($\\\\beta$ = -0.033, p <\\n0.001), consistent with prior research. Further analysis revealed two distinct\\nmechanisms in which seizures became prolonged:\\n  Emergence of new seizure patterns - In approx. 40% of patients, ASM tapering\\nunmasked additional seizure activity states, and seizures containing these\\n'taper-emergent states' were substantially longer (r = 0.49, p < 0.001).\\n  Prolongation of existing seizure patterns - Even in seizures without\\ntaper-emergent states, lower ASM levels still resulted in approx. 12-224%\\nlonger durations depending on the ASM dosage and tapering ($\\\\beta$ = -0.049, p\\n< 0.001).\\n  Conclusion: ASMs influence seizures through two mechanisms: they (i) suppress\\nspecific seizure activity patterns (states) in an all-or-nothing fashion and\\n(ii) curtail the duration of other seizure patterns. These findings highlight\\nthe complex role of ASMs in seizure modulation and could inform personalized\\ndosing strategies for epilepsy management. These findings may also have\\nimplications in understanding the effects of ASMs on cognition and mood.\", \"main_category\": \"q-bio.NC\", \"categories\": \"q-bio.NC\", \"published\": \"2025-04-02T16:44:51Z\"}"}
