{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21444v1\", \"title\": \"A Unified QoS-Aware Multiplexing Framework for Next Generation Immersive\\n  Communication with Legacy Wireless Applications\", \"summary\": \"Immersive communication, including emerging augmented reality, virtual\\nreality, and holographic telepresence, has been identified as a key service for\\nenabling next-generation wireless applications. To align with legacy wireless\\napplications, such as enhanced mobile broadband or ultra-reliable low-latency\\ncommunication, network slicing has been widely adopted. However, attempting to\\nstatistically isolate the above types of wireless applications through\\ndifferent network slices may lead to throughput degradation and increased queue\\nbacklog. To address these challenges, we establish a unified QoS-aware\\nframework that supports immersive communication and legacy wireless\\napplications simultaneously. Based on the Lyapunov drift theorem, we transform\\nthe original long-term throughput maximization problem into an equivalent\\nshort-term throughput maximization weighted by virtual queue length. Moreover,\\nto cope with the challenges introduced by the interaction between\\nlarge-timescale network slicing and short-timescale resource allocation, we\\npropose an adaptive adversarial slicing (Ad2S) scheme for networks with\\ninvarying channel statistics. To track the network channel variations, we also\\npropose a measurement extrapolation-Kalman filter (ME-KF)-based method and\\nrefine our scheme into Ad2S-non-stationary refinement (Ad2S-NR). Through\\nextended numerical examples, we demonstrate that our proposed schemes achieve\\n3.86 Mbps throughput improvement and 63.96\\\\% latency reduction with 24.36\\\\%\\nconvergence time reduction. Within our framework, the trade-off between total\\nthroughput and user service experience can be achieved by tuning systematic\\nparameters.\", \"main_category\": \"cs.NI\", \"categories\": \"cs.NI\", \"published\": \"2025-04-30T08:59:46Z\"}"}
