{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21804v1\", \"title\": \"Indian participation in the construction of the Facility for Antiproton\\n  and Ion Research (FAIR) at Darmstadt, Germany\", \"summary\": \"India is a founder-member country to participate in the construction of the\\ninternational multipurpose accelerator facility called the Facility for\\nAntiproton and Ion Research (FAIR) at Darmstadt, Germany. Bose Institute,\\nKolkata, has been designated as the Indian shareholder of the FAIR GmbH and the\\nnodal Indian Institution for co-ordinating Indian participation in the FAIR\\nprogramme.\\n  Indian participation in FAIR is twofold. Firstly, the advancement of\\nknowledge in nuclear astrophysics and reaction, high-energy nuclear physics,\\natomic \\\\& plasma physics and application through the participation of Indian\\nresearchers, engineers and students in various experiments planned at FAIR. In\\naddition to this, India is also contributing high-tech accelerator equipment as\\nin-kind contribution to FAIR.\\n  Our active involvement include the designing, manufacturing and supply of\\nin-kind accelerator items e.g. power converters, vacuum chamber, beam catchers,\\nIT diagnostic cables among them and coordinating the participation of Indian\\nscientists in the FAIR experiments including detector development, physics\\nsimulation, experimental data analysis.\\n  Indian researchers have been participating in the two major experiments at\\nFAIR, i.e. Nuclear Structure, Astrophysics and Reactions (NUSTAR) and\\nCompressed Baryonic Matter (CBM) and in particular Bose Institute is involved\\nin the CBM experiment, to study and characterize the matter created in the\\nrelativistic nucleus-nucleus collisions at high net baryon density and\\nrelatively moderate temperature.\\n  In this article a brief overview on the FAIR facility, the experiments at\\nFAIR and Indian participation are presented.\", \"main_category\": \"hep-ex\", \"categories\": \"hep-ex\", \"published\": \"2025-04-30T17:03:11Z\"}"}
