{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20423v1\", \"title\": \"Redox chemistry meets semiconductor defect physics\", \"summary\": \"Understanding how the electronic structure of electrodes influences\\nelectrocatalytic reactions has been a longstanding topic in the\\nelectrochemistry community, with predominant attention paid to metallic\\nelectrodes. In this work, we present a defect physics perspective on the effect\\nof semiconductor band structure on electrochemical redox reactions.\\nSpecifically, the Haldane-Anderson model, originally developed to study\\nmultiple charge states of transition-metal defects in semiconductors, is\\nextended to describe electrochemical redox reactions by incorporating the\\nsolvent effect, inspired by the Holstein model. The solvent coordinate and the\\nactual charge on the redox species in reduced and oxidized states are assumed\\nto be instant equilibrium, and the transitions between these states are defined\\nby the framework of Green's function. With these treatments, we treat the\\ncharge state transition in a self-consistent manner. We first confirm that this\\nself-consistent approach is essential to accurately depict the hybridization\\neffect of band structure by comparing the model-calculated ionization potential\\n(IP), electron affinity (EA), and redox potential of the species with those\\nobtained from density functional theory (DFT) calculations. Next, we illustrate\\nhow this self-consistent treatment enhances our understanding of the catalytic\\nactivities of semiconductor electrodes and the source of asymmetry in\\nreorganization energies, which is often observed in prior ab initio molecular\\ndynamics (AIMD) simulations. Additionally, we discuss how band structure\\nimpacts redox reactions in the strong coupling limit. Finally, we compare our\\nwork with other relevant studies in the literature.\", \"main_category\": \"physics.chem-ph\", \"categories\": \"physics.chem-ph\", \"published\": \"2025-04-29T04:38:55Z\"}"}
