{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15816v1\", \"title\": \"Toward optimal-scaling DFT: stochastic Hartree theory in the\\n  thermodynamic and complete basis set limits at arbitrary temperature\", \"summary\": \"We present the first mathematical analysis of stochastic density functional\\ntheory (DFT) in the context of the Hartree approximation. We motivate our\\nanalysis via the notion of nearly-optimal or $\\\\tilde{O}(n)$ scaling with\\nrespect to the number $n$ of computational degrees of freedom, independent of\\nthe number of electrons, in both the thermodynamic and complete basis set\\nlimits. Indeed, the promise of such scaling is the primary motivation for\\nstochastic DFT relative to conventional orbital-based approaches, as well as\\ndeterministic orbital-free alternatives. We highlight three key targets for\\nmathematical attention, which are synthesized in our algorithm and analysis.\\nFirst, we identify a particular stochastic estimator for the Hartree potential\\nwhose sample complexity is essentially independent of the discretization size.\\nSecond, we reformulate the self-consistent field iteration as a stochastic\\nmirror descent method where the Fermi-Dirac entropy plays the role of the\\nBregman potential, and we prove a nearly discretization-independent bound on\\nthe number of iterations needed to reach fixed accuracy. Third, motivated by\\nthe estimator, we introduce a novel pole expansion scheme for the square-root\\nFermi-Dirac operator, preserving $\\\\tilde{O}(n)$ cost per mirror descent\\niteration even in the complete basis set limit. Combining these ingredients, we\\nestablish nearly-optimal scaling in both limits of interest under reasonable\\nassumptions on the basis sets chosen for discretization. Extensive numerical\\nexperiments on problems with as many as $10^{6}$ degrees of freedom validate\\nour algorithm and support the theory of nearly-optimal scaling.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA\", \"published\": \"2025-04-22T11:58:01Z\"}"}
