{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12079v1\", \"title\": \"Massive Star Clusters in the Semi-Analytical Galaxy Formation Model\\n  L-Galaxies 2020\", \"summary\": \"It is established that there exists a direct link between the formation\\nhistory of star cluster populations and their host galaxies, however, our\\nlacking understanding of star cluster assembly prohibits us to make full use of\\ntheir ability to trace galaxy evolution. In this work we introduce a new\\nvariation of the 2020 version of the semi-analytical galaxy formation model\\n\\\"L-Galaxies\\\" that includes the formation of star clusters above 10^4 M_Sun and\\nprobes different physical assumptions that affect their evolution over cosmic\\ntime. We use properties of different galaxy components and localised star\\nformation to determine the bound fraction of star formation in disks. After\\nrandomly sampling masses from an environmentally-dependent star cluster initial\\nmass function, we assign to each object a half-mass radius, metallicity, and\\ndistance from the galaxy centre. We consider up to 2000 individual star\\nclusters per galaxy and evolve their properties over time taking into account\\nstellar evolution, two-body relaxation, tidal shocks, dynamical friction, and a\\nre-positioning during galaxy mergers. Our simulation successfully reproduces\\nseveral observational quantities, such as the empirical relationship between\\nthe absolute V -band magnitude of the brightest young star clusters and the\\nhost galaxy star formation rate, the mass function of young star clusters, or\\nmean metallicities of the star cluster distributions versus galaxy masses. The\\nsimulation reveals great complexity in the z = 0 star cluster population\\nresulting from differential destruction channels and origins, including in-situ\\npopulations in the disk, a major merger-induced heated component in the halo,\\nand accreted star clusters. Model variations point out the importance of e.g.\\nthe shape of the star cluster initial mass function or the relationship between\\nthe sound speed of cold gas and the star formation rate.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-16T13:41:34Z\"}"}
