{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10315v1\", \"title\": \"An energy optimization method based on mixed-integer model and\\n  variational quantum computing algorithm for faster IMPT\", \"summary\": \"Intensity-modulated proton therapy (IMPT) offers superior dose conformity\\nwith reduced exposure to surrounding healthy tissues compared to conventional\\nphoton therapy. Improving IMPT delivery efficiency reduces motion-related\\nuncertainties, enhances plan robustness, and benefits breath-hold techniques by\\nshortening treatment time. Among various factors, energy switching time plays a\\ncritical role, making energy layer optimization (ELO) essential. This work\\ndevelops an energy layer optimization method based on mixed integer model and\\nvariational quantum computing algorithm to enhance the efficiency of IMPT. The\\nenergy layer optimization problem is modeled as a mixed-integer program, where\\ncontinuous variables optimize the dose distribution and binary variables\\nindicate energy layer selection. To solve it, iterative convex relaxation\\ndecouples the dose-volume constraints, followed by the alternating direction\\nmethod of multipliers (ADMM) to separate mixed-variable optimization and the\\nminimum monitor unit (MMU) constraint. The resulting beam intensity subproblem,\\nsubject to MMU, either admits a closed-form solution or is efficiently solvable\\nvia conjugate gradient. The binary subproblem is cast as a quadratic\\nunconstrained binary optimization (QUBO) problem, solvable using variational\\nquantum computing algorithms. With nearly the same plan quality, the proposed\\nmethod noticeable reduces the number of the used energies. For example,\\ncompared to conventional IMPT, QC can reduce the number of energy layers from\\n61 to 35 in HN case, from 56 to 35 in lung case, and from 59 to 32 to abdomen\\ncase. The reduced number of energies also results in fewer delivery time, e.g.,\\nthe delivery time is reduced from 100.6, 232.0, 185.3 seconds to 90.7, 215.4,\\n154.0 seconds, respectively.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph,math.OC\", \"published\": \"2025-04-14T15:24:23Z\"}"}
