{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16583v1\", \"title\": \"Modulated honeycomb lattices and their magnetic properties\", \"summary\": \"We propose a family of modulated honeycomb lattices, a class of quasiperiodic\\ntilings characterized by the metallic mean. These lattices consist of six\\ndistinct hexagonal prototiles with two edge lengths, $\\\\ell$ and $s$, and can be\\nregarded as a continuous deformation of the honeycomb lattice. The structural\\nproperties are examined through their substitution rules. To study the\\nelectronic properties, we construct a tight-binding model on the tilings,\\nintroducing two types of hopping integrals, $t_L$ and $t_S$, corresponding to\\nthe two edge lengths, $\\\\ell$ and $s$, respectively. By diagonalizing the\\nHamiltonian on these quasiperiodic tilings, we compute the corresponding\\ndensity of states (DOS). Our analysis reveals that the introduction of\\nquasiperiodicity in the distribution of hopping integrals induces a spiky\\nstructure in the DOS at higher energies, while the linear DOS at low energies\\n($E\\\\sim 0$) remains robust. This contrasts with the smooth DOS in the\\ndisordered tight-binding model, where two types of hopping integrals are\\nrandomly distributed according to a given ratio. Furthermore, we study the\\nmagnetic properties of the Hubbard model on modulated honeycomb lattices by\\nmeans of real-space Hartree approximations. A magnetic phase transition occurs\\nat a finite interaction strength due to the absence of the noninteracting DOS\\nat the Fermi level. When $t_L\\\\sim t_S$, the phase transition point is primarily\\ngoverned by the linear DOS. However, far from the condition $t_L=t_S$, the\\nquasiperiodic structure plays a significant role in reducing the critical\\ninteraction strength, which is in contrast to the disordered system. Using\\nperpendicular space analysis, we demonstrate that sublattice asymmetry inherent\\nin the quasiperiodic tilings emerges in the magnetic profile, providing\\ninsights into the interplay between quasiperiodicity and electronic\\ncorrelations.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el\", \"published\": \"2025-04-23T10:05:26Z\"}"}
