{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10296v1\", \"title\": \"Siamese Network with Dual Attention for EEG-Driven Social Learning:\\n  Bridging the Human-Robot Gap in Long-Tail Autonomous Driving\", \"summary\": \"Robots with wheeled, quadrupedal, or humanoid forms are increasingly\\nintegrated into built environments. However, unlike human social learning, they\\nlack a critical pathway for intrinsic cognitive development, namely, learning\\nfrom human feedback during interaction. To understand human ubiquitous\\nobservation, supervision, and shared control in dynamic and uncertain\\nenvironments, this study presents a brain-computer interface (BCI) framework\\nthat enables classification of Electroencephalogram (EEG) signals to detect\\ncognitively demanding and safety-critical events. As a timely and motivating\\nco-robotic engineering application, we simulate a human-in-the-loop scenario to\\nflag risky events in semi-autonomous robotic driving-representative of\\nlong-tail cases that pose persistent bottlenecks to the safety performance of\\nsmart mobility systems and robotic vehicles. Drawing on recent advances in\\nfew-shot learning, we propose a dual-attention Siamese convolutional network\\npaired with Dynamic Time Warping Barycenter Averaging approach to generate\\nrobust EEG-encoded signal representations. Inverse source localization reveals\\nactivation in Broadman areas 4 and 9, indicating perception-action coupling\\nduring task-relevant mental imagery. The model achieves 80% classification\\naccuracy under data-scarce conditions and exhibits a nearly 100% increase in\\nthe utility of salient features compared to state-of-the-art methods, as\\nmeasured through integrated gradient attribution. Beyond performance, this\\nstudy contributes to our understanding of the cognitive architecture required\\nfor BCI agents-particularly the role of attention and memory mechanisms-in\\ncategorizing diverse mental states and supporting both inter- and intra-subject\\nadaptation. Overall, this research advances the development of cognitive\\nrobotics and socially guided learning for service robots in complex built\\nenvironments.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.HC,cs.LG\", \"published\": \"2025-04-14T15:06:17Z\"}"}
