{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07664v1\", \"title\": \"Data Requirement Goal Modeling for Machine Learning Systems\", \"summary\": \"Machine Learning (ML) has been integrated into various software and systems.\\nTwo main components are essential for training an ML model: the training data\\nand the ML algorithm. Given the critical role of data in ML system development,\\nit has become increasingly important to assess the quality of data attributes\\nand ensure that the data meets specific requirements before its utilization.\\nThis work proposes an approach to guide non-experts in identifying data\\nrequirements for ML systems using goal modeling. In this approach, we first\\ndevelop the Data Requirement Goal Model (DRGM) by surveying the white\\nliterature to identify and categorize the issues and challenges faced by data\\nscientists and requirement engineers working on ML-related projects. An initial\\nDRGM was built to accommodate common tasks that would generalize across\\nprojects. Then, based on insights from both white and gray literature, a\\ncustomization mechanism is built to help adjust the tasks, KPIs, and goals'\\nimportance of different elements within the DRGM. The generated model can aid\\nits users in evaluating different datasets using GRL evaluation strategies. We\\nthen validate the approach through two illustrative examples based on\\nreal-world projects. The results from the illustrative examples demonstrate\\nthat the data requirements identified by the proposed approach align with the\\nrequirements of real-world projects, demonstrating the practicality and\\neffectiveness of the proposed framework. The proposed dataset selection\\ncustomization mechanism and the proposed DRGM are helpful in guiding\\nnon-experts in identifying the data requirements for machine learning systems\\ntailored to a specific ML problem. This approach also aids in evaluating\\ndifferent dataset alternatives to choose the optimum dataset for the problem.\\nFor future work, we recommend implementing tool support to generate the DRGM\\nbased on a chatbot interface.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE,cs.LG\", \"published\": \"2025-04-10T11:30:25Z\"}"}
