{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12159v1\", \"title\": \"Deep Material Network: Overview, applications and current directions\", \"summary\": \"Deep Material Network (DMN) has emerged as a powerful framework for\\nmultiscale material modeling, enabling efficient and accurate predictions of\\nmaterial behavior across different length scales. Unlike traditional machine\\nlearning approaches, the trainable parameters in DMN have direct physical\\ninterpretations, capturing the geometric characteristics of the microstructure\\nrather than serving as purely statistical fitting parameters. Its hierarchical\\ntree structure effectively encodes microstructural interactions and deformation\\nmechanisms, allowing DMN to achieve a balance between accuracy and\\ncomputational efficiency. This physics-informed architecture significantly\\nreduces computational costs compared to direct numerical simulations while\\npreserving essential microstructural physics. Furthermore, DMN can be trained\\nsolely on a linear elastic dataset while effectively extrapolating nonlinear\\nresponses during online prediction, making it a highly efficient and scalable\\napproach for multiscale material modeling. This article provides a\\ncomprehensive review of DMN, detailing its motivation, underlying methodology,\\nand recent advancements. We discuss key modeling aspects, including its\\nhierarchical structure, training process, and the role of physics-based\\nconstraints in enhancing predictive accuracy. Furthermore, we highlight its\\napplications in component-scale multiscale analysis and inverse parameter\\nidentification, demonstrating its capability to bridge microscale material\\nbehavior with macroscale engineering predictions. Finally, we discuss\\nchallenges and future directions in improving DMN's generalization capabilities\\nand its potential extensions for broader applications in multiscale modeling.\", \"main_category\": \"cs.CE\", \"categories\": \"cs.CE\", \"published\": \"2025-04-16T15:05:25Z\"}"}
