{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11406v1\", \"title\": \"Multi-level Cellular Automata for FLIM networks\", \"summary\": \"The necessity of abundant annotated data and complex network architectures\\npresents a significant challenge in deep-learning Salient Object Detection\\n(deep SOD) and across the broader deep-learning landscape. This challenge is\\nparticularly acute in medical applications in developing countries with limited\\ncomputational resources. Combining modern and classical techniques offers a\\npath to maintaining competitive performance while enabling practical\\napplications. Feature Learning from Image Markers (FLIM) methodology empowers\\nexperts to design convolutional encoders through user-drawn markers, with\\nfilters learned directly from these annotations. Recent findings demonstrate\\nthat coupling a FLIM encoder with an adaptive decoder creates a flyweight\\nnetwork suitable for SOD, requiring significantly fewer parameters than\\nlightweight models and eliminating the need for backpropagation. Cellular\\nAutomata (CA) methods have proven successful in data-scarce scenarios but\\nrequire proper initialization -- typically through user input, priors, or\\nrandomness. We propose a practical intersection of these approaches: using FLIM\\nnetworks to initialize CA states with expert knowledge without requiring user\\ninteraction for each image. By decoding features from each level of a FLIM\\nnetwork, we can initialize multiple CAs simultaneously, creating a multi-level\\nframework. Our method leverages the hierarchical knowledge encoded across\\ndifferent network layers, merging multiple saliency maps into a high-quality\\nfinal output that functions as a CA ensemble. Benchmarks across two challenging\\nmedical datasets demonstrate the competitiveness of our multi-level CA approach\\ncompared to established models in the deep SOD literature.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-15T17:22:24Z\"}"}
