{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12261v1\", \"title\": \"Dependency Dilemmas: A Comparative Study of Independent and Dependent\\n  Artifacts in Maven Central Ecosystem\", \"summary\": \"The Maven Central ecosystem forms the backbone of Java dependency management,\\nhosting artifacts that vary significantly in their adoption, security, and\\necosystem roles. Artifact reuse is fundamental in software development, with\\necosystems like Maven Central facilitating this process. However, prior studies\\npredominantly analyzed popular artifacts with numerous dependencies, leaving\\nthose without incoming dependencies (independent artifacts) unexplored. In this\\nstudy, we analyzed 658,078 artifacts, of which 635,003 had at least one\\nrelease. Among these, 93,101 artifacts (15.4%) were identified as independent\\n(in-degree = 0), while the rest were classified as dependent. We looked at the\\nimpact of separate artifacts using PageRank and out-degree centrality and\\ndiscovered that they were very important to the ecosystem. Further analysis\\nacross 18 different metrics revealed several advantages and comparability of\\nindependent artifacts with dependent artifacts: comparable popularity (25.58\\nvs. 7.30), fewer vulnerabilities (60 CVEs vs. 179 CVEs), and zero propagated\\nvulnerabilities. Based on these results, it seems that independent artifacts\\nmake a big difference in the ecosystem and give developers a safe,\\nself-contained alternative to traditional dependencies. These findings suggest\\nthat independent artifacts might be a beneficial choice for dependencies but\\nhave some maintainability issues. Therefore, developers should carefully\\nincorporate independent artifacts into their projects, and artifact maintainers\\nshould prioritize this group of artifacts to mitigate the risk of transitive\\nvulnerability propagation and improve software sustainability.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-16T17:15:58Z\"}"}
