{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21674v1\", \"title\": \"Complexities of Well-Quasi-Ordered Substructural Logics\", \"summary\": \"Substructural logics are formal logical systems that omit familiar structural\\nrules of classical and intuitionistic logic such as contraction, weakening,\\nexchange (commutativity), and associativity. This leads to a resource-sensitive\\nlogical framework that has proven influential beyond mathematical logic and its\\nalgebraic semantics, across theoretical computer science, linguistics, and\\nphilosophical logic. The set of theorems of a substructural logic is\\nrecursively enumerable and, in many cases, recursive. These logics also possess\\nan intricate mathematical structure that has been the subject of research for\\nover six decades.\\n  We undertake a comprehensive study of substructural logics possessing an\\nunderlying well-quasi-order (wqo), using established ordinal-indexed\\nfast-growing complexity classes to classify the complexity of their\\ndeducibility (quasiequational) and provability (equational) problems. This\\nincludes substructural logics with weak variants of contraction and weakening,\\nand logics with weak or even no exchange. We further consider infinitely many\\naxiomatic extensions over the base systems.\\n  We establish a host of decidability and complexity bounds, many of them\\ntight, by developing new techniques in proof theory, well-quasi-order theory\\n(contributing new length theorems), the algebraic semantics of substructural\\nlogics via residuated lattices, algebraic proof theory, and novel encodings of\\ncounter machines. Classifying the computational complexity of substructural\\nlogics (and the complexity of the word problem and of the equational theory of\\ntheir algebraic semantics) reveals how subtle variations in their design\\ninfluence their algorithmic behavior, with the decision problems often reaching\\nAckermannian or even hyper-Ackermannian complexity.\", \"main_category\": \"cs.LO\", \"categories\": \"cs.LO,cs.CC,math.LO\", \"published\": \"2025-04-30T14:14:59Z\"}"}
