{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17310v1\", \"title\": \"An All-Optical Metro Network Architecture and QoS-Aware Wavelength\\n  Allocation Study for Converged Fixed, Mobile, and Edge Computing\\n  Multi-Granular Traffic\", \"summary\": \"In this paper, we introduce an all-optical metro network architecture, called\\nMOON, to serve converged multigranular traffic from fixed, mobile, and edge\\ncomputing services. Since traffic is characterized by high dynamicity and\\ndiverse access requirements, MOON uses network slicing to provide quality of\\nservice (QoS) aware wavelength allocation to fulfill the various applications\\ntraffic demands. MOON incorporates hybrid optical switching (HOS) combining\\noptical circuit switching (OCS) and optical time slotted switching (OTS)\\ncapabilities that appropriately maps different traffic types to them.\\nSpecifically, the OCS network slice explicitly serves aggregated traffic of\\nlong duration and high volume, while OTS network slice serves short bursty\\ntraffic. In order to provide flexibility, separate sets of wavelengths are used\\nfor OCS and OTS traffic service, both within a metro-access network (MAN)\\n(intra-MAN) and between different MANs (inter-MAN). We extensively study the\\nrequired number of wavelengths to efficiently serve OCS and OTS traffic for\\nintra- and inter-MAN communication scenarios, taking into account their\\nspecific traffic access requirements in an effort to optimize wavelengths\\nutilization. In our study, we assume nonblocking OCS communication for\\nimmediate access; therefore the number of required OCS wavelengths depends only\\non the number of nodes, while the number of required OTS wavelengths to obtain\\na desired QoS and latency level is independent from the number for OCS\\nwavelengths. Simulation results show that within an OTS intra-MAN we achieve\\nend-to-end (E2E) latency in submilliseconds scale, suitable for dynamic bursty\\ntraffic, while it is an decreasing function of the number of used OTS\\nwavelengths.\", \"main_category\": \"cs.NI\", \"categories\": \"cs.NI\", \"published\": \"2025-04-24T07:10:04Z\"}"}
