{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20722v1\", \"title\": \"Cosmology from LOFAR Two-metre Sky Survey Data Release 2:\\n  Cross-correlations with luminous red galaxies from eBOSS\", \"summary\": \"We cross-correlated galaxies from the LOw-Frequency ARray (LOFAR) Two-metre\\nSky Survey (LoTSS) second data release (DR2) radio source with the extended\\nBaryon Oscillation Spectroscopic Survey (eBOSS) luminous red galaxy (LRG)\\nsample to extract the baryon acoustic oscillation (BAO) signal and constrain\\nthe linear clustering bias of radio sources in LoTSS DR2.\\n  In the LoTSS DR2 catalogue, employing a flux density limit of $1.5$ mJy at\\nthe central LoTSS frequency of 144 MHz and a signal-to-noise ratio (S/N) of\\n$7.5$, additionally considering eBOSS LRGs with redshifts between 0.6 and 1, we\\nmeasured both the angular LoTSS-eBOSS cross-power spectrum and the angular\\neBOSS auto-power spectrum. These measurements were performed across various\\neBOSS redshift tomographic bins with a width of $\\\\Delta z=0.06$. By\\nmarginalising over the broadband shape of the angular power spectra, we\\nsearched for a BAO signal in cross-correlation with radio galaxies, and\\ndetermine the linear clustering bias of LoTSS radio sources for a constant-bias\\nand an evolving-bias model. Using the cross-correlation, we measured the\\nisotropic BAO dilation parameter as $\\\\alpha=1.01\\\\pm 0.11$ at $z_{\\\\rm\\neff}=0.63$. By combining four redshift slices at $z_{\\\\rm eff}=0.63, 0.69,\\n0.75$, and $0.81$, we determined a more constrained value of $\\\\alpha =\\n0.968^{+0.060}_{-0.095}$. For the entire redshift range of $z_{\\\\rm eff}=0.715$,\\nwe measured $b_C = 2.64 \\\\pm 0.20$ for the constant-bias model, $b(z)=b_C$, and\\nthen $b_D = 1.80 \\\\pm 0.13$ for the evolving-bias model, $b(z) = b_D / D(z)$,\\nwith $D(z)$ denoting the growth rate of linear structures. Additionally, we\\nmeasured the clustering bias for individual redshift bins.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-04-29T13:02:28Z\"}"}
