{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12782v1\", \"title\": \"Set You Straight: Auto-Steering Denoising Trajectories to Sidestep\\n  Unwanted Concepts\", \"summary\": \"Ensuring the ethical deployment of text-to-image models requires effective\\ntechniques to prevent the generation of harmful or inappropriate content. While\\nconcept erasure methods offer a promising solution, existing finetuning-based\\napproaches suffer from notable limitations. Anchor-free methods risk disrupting\\nsampling trajectories, leading to visual artifacts, while anchor-based methods\\nrely on the heuristic selection of anchor concepts. To overcome these\\nshortcomings, we introduce a finetuning framework, dubbed ANT, which\\nAutomatically guides deNoising Trajectories to avoid unwanted concepts. ANT is\\nbuilt on a key insight: reversing the condition direction of classifier-free\\nguidance during mid-to-late denoising stages enables precise content\\nmodification without sacrificing early-stage structural integrity. This\\ninspires a trajectory-aware objective that preserves the integrity of the\\nearly-stage score function field, which steers samples toward the natural image\\nmanifold, without relying on heuristic anchor concept selection. For\\nsingle-concept erasure, we propose an augmentation-enhanced weight saliency map\\nto precisely identify the critical parameters that most significantly\\ncontribute to the unwanted concept, enabling more thorough and efficient\\nerasure. For multi-concept erasure, our objective function offers a versatile\\nplug-and-play solution that significantly boosts performance. Extensive\\nexperiments demonstrate that ANT achieves state-of-the-art results in both\\nsingle and multi-concept erasure, delivering high-quality, safe outputs without\\ncompromising the generative fidelity. Code is available at\\nhttps://github.com/lileyang1210/ANT\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI,cs.CR,cs.LG\", \"published\": \"2025-04-17T09:29:30Z\"}"}
