{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16429v1\", \"title\": \"Give LLMs a Security Course: Securing Retrieval-Augmented Code\\n  Generation via Knowledge Injection\", \"summary\": \"Retrieval-Augmented Code Generation (RACG) leverages external knowledge to\\nenhance Large Language Models (LLMs) in code synthesis, improving the\\nfunctional correctness of the generated code. However, existing RACG systems\\nlargely overlook security, leading to substantial risks. Especially, the\\npoisoning of malicious code into knowledge bases can mislead LLMs, resulting in\\nthe generation of insecure outputs, which poses a critical threat in modern\\nsoftware development. To address this, we propose a security-hardening\\nframework for RACG systems, CodeGuarder, that shifts the paradigm from\\nretrieving only functional code examples to incorporating both functional code\\nand security knowledge. Our framework constructs a security knowledge base from\\nreal-world vulnerability databases, including secure code samples and root\\ncause annotations. For each code generation query, a retriever decomposes the\\nquery into fine-grained sub-tasks and fetches relevant security knowledge. To\\nprioritize critical security guidance, we introduce a re-ranking and filtering\\nmechanism by leveraging the LLMs' susceptibility to different vulnerability\\ntypes. This filtered security knowledge is seamlessly integrated into the\\ngeneration prompt. Our evaluation shows CodeGuarder significantly improves code\\nsecurity rates across various LLMs, achieving average improvements of 20.12\\\\%\\nin standard RACG, and 31.53\\\\% and 21.91\\\\% under two distinct poisoning\\nscenarios without compromising functional correctness. Furthermore, CodeGuarder\\ndemonstrates strong generalization, enhancing security even when the targeted\\nlanguage's security knowledge is lacking. This work presents CodeGuarder as a\\npivotal advancement towards building secure and trustworthy RACG systems.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.SE\", \"published\": \"2025-04-23T05:27:27Z\"}"}
