{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03154v1\", \"title\": \"StableMotion: Training Motion Cleanup Models with Unpaired Corrupted\\n  Data\", \"summary\": \"Motion capture (mocap) data often exhibits visually jarring artifacts due to\\ninaccurate sensors and post-processing. Cleaning this corrupted data can\\nrequire substantial manual effort from human experts, which can be a costly and\\ntime-consuming process. Previous data-driven motion cleanup methods offer the\\npromise of automating this cleanup process, but often require in-domain paired\\ncorrupted-to-clean training data. Constructing such paired datasets requires\\naccess to high-quality, relatively artifact-free motion clips, which often\\nnecessitates laborious manual cleanup. In this work, we present StableMotion, a\\nsimple yet effective method for training motion cleanup models directly from\\nunpaired corrupted datasets that need cleanup. The core component of our method\\nis the introduction of motion quality indicators, which can be easily annotated\\nthrough manual labeling or heuristic algorithms and enable training of\\nquality-aware motion generation models on raw motion data with mixed quality.\\nAt test time, the model can be prompted to generate high-quality motions using\\nthe quality indicators. Our method can be implemented through a simple\\ndiffusion-based framework, leading to a unified motion generate-discriminate\\nmodel, which can be used to both identify and fix corrupted frames. We\\ndemonstrate that our proposed method is effective for training motion cleanup\\nmodels on raw mocap data in production scenarios by applying StableMotion to\\nSoccerMocap, a 245-hour soccer mocap dataset containing real-world motion\\nartifacts. The trained model effectively corrects a wide range of motion\\nartifacts, reducing motion pops and frozen frames by 68% and 81%, respectively.\\nSee https://youtu.be/3Y7MMAH02B4 for more results.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI,cs.GR\", \"published\": \"2025-05-06T04:02:47Z\"}"}
