{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03257v1\", \"title\": \"Model Predictive Fuzzy Control: A Hierarchical Multi-Agent Control\\n  Architecture for Outdoor Search-and-Rescue Robots\", \"summary\": \"Autonomous robots deployed in unknown search-and-rescue (SaR) environments\\ncan significantly improve the efficiency of the mission by assisting in fast\\nlocalisation and rescue of the trapped victims. We propose a novel integrated\\nhierarchical control architecture, called model predictive fuzzy control\\n(MPFC), for autonomous mission planning of multi-robot SaR systems that should\\nefficiently map an unknown environment: We combine model predictive control\\n(MPC) and fuzzy logic control (FLC), where the robots are locally controlled by\\ncomputationally efficient FLC controllers, and the parameters of these local\\ncontrollers are tuned via a centralised MPC controller, in a regular or\\nevent-triggered manner. The proposed architecture provides three main\\nadvantages: (1) The control decisions are made by the FLC controllers, thus the\\nreal-time computation time is affordable. (2) The centralised MPC controller\\noptimises the performance criteria with a global and predictive vision of the\\nsystem dynamics, and updates the parameters of the FLC controllers accordingly.\\n(3) FLC controllers are heuristic by nature and thus do not take into account\\noptimality in their decisions, while the tuned parameters via the MPC\\ncontroller can indirectly incorporate some level of optimality in local\\ndecisions of the robots. A simulation environment for victim detection in a\\ndisaster environment was designed in MATLAB using discrete, 2-D grid-based\\nmodels. While being comparable from the point of computational efficiency, the\\nintegrated MPFC architecture improves the performance of the multi-robot SaR\\nsystem compared to decentralised FLC controllers. Moreover, the performance of\\nMPFC is comparable to the performance of centralised MPC for path planning of\\nSaR robots, whereas MPFC requires significantly less computational resources,\\nsince the number of the optimisation variables in the control problem are\\nreduced.\", \"main_category\": \"eess.SY\", \"categories\": \"eess.SY,cs.RO,cs.SY\", \"published\": \"2025-05-06T07:37:04Z\"}"}
