{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11918v1\", \"title\": \"Deep learning to improve the discovery of near-Earth asteroids in the\\n  Zwicky Transient Facility\", \"summary\": \"We present a novel pipeline that uses a convolutional neural network (CNN) to\\nimprove the detection capability of near-Earth asteroids (NEAs) in the context\\nof planetary defense. Our work aims to minimize the dependency on human\\nintervention of the current approach adopted by the Zwicky Transient Facility\\n(ZTF). The target NEAs have a high proper motion of up to tens of degrees per\\nday and thus appear as streaks of light in the images. We trained our CNNs to\\ndetect these streaks using three datasets: a set with real asteroid streaks, a\\nset with synthetic (i.e., simulated) streaks and a mixed set, and tested the\\nresultant models on real survey images. The results achieved were almost\\nidentical across the three models: $0.843\\\\pm0.005$ in completeness and\\n$0.820\\\\pm0.025$ in precision. The bias on streak measurements reported by the\\nCNNs was $1.84\\\\pm0.03$ pixels in streak position, $0.817\\\\pm0.026$ degrees in\\nstreak angle and $-0.048\\\\pm0.003$ in fractional bias in streak length (computed\\nas the absolute length bias over the streak length, with the negative sign\\nindicating an underestimation). We compared the performance of our CNN trained\\nwith a mix of synthetic and real streaks to that of the ZTF human scanners by\\nanalyzing a set of 317 streaks flagged as valid by the scanners. Our pipeline\\ndetected $80~\\\\%$ of the streaks found by the scanners and 697 additional\\nstreaks that were subsequently verified by the scanners to be valid streaks.\\nThese results suggest that our automated pipeline can complement the work of\\nthe human scanners at no cost for the precision and find more objects than the\\ncurrent approach. They also prove that the synthetic streaks were realistic\\nenough to be used for augmenting training sets when insufficient real streaks\\nare available or exploring the simulation of streaks with unusual\\ncharacteristics that have not yet been detected.\", \"main_category\": \"astro-ph.IM\", \"categories\": \"astro-ph.IM\", \"published\": \"2025-04-16T09:55:26Z\"}"}
