{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14908v1\", \"title\": \"The universality of filamentation-caused challenges of ultrafast laser\\n  energy deposition in semiconductors\", \"summary\": \"Light propagation in semiconductors is the cornerstone of emerging disruptive\\ntechnologies holding considerable potential to revolutionize\\ntelecommunications, sensors, quantum engineering, healthcare, and artificial\\nintelligence. Sky-high optical nonlinearities make these materials ideal\\nplatforms for photonic integrated circuits. The fabrication of such complex\\ndevices could greatly benefit from in-volume ultrafast laser writing for\\nmonolithic and contactless integration. Ironically, as exemplified for Si,\\nnonlinearities act as an efficient immune system self-protecting the material\\nfrom internal permanent modifications that ultrashort laser pulses could\\npotentially produce. While nonlinear propagation of high-intensity ultrashort\\nlaser pulses has been extensively investigated in Si, other semiconductors\\nremain uncharted. In this work, we demonstrate that filamentation universally\\ndictates ultrashort laser pulse propagation in various semiconductors. The\\neffective key nonlinear parameters obtained strongly differ from standard\\nmeasurements with low-intensity pulses. Furthermore, the temporal scaling laws\\nfor these key parameters are extracted. Temporal-spectral shaping is finally\\nproposed to optimize energy deposition inside semiconductors. The whole set of\\nresults lays the foundations for future improvements, up to the point where\\nsemiconductors can be selectively tailored internally by ultrafast laser\\nwriting, thus leading to countless applications for in-chip processing and\\nfunctionalization, and opening new markets in various sectors including\\ntechnology, photonics, and semiconductors.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics,nlin.AO,nlin.PS,physics.app-ph,physics.plasm-ph\", \"published\": \"2025-04-21T07:25:48Z\"}"}
