{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16685v1\", \"title\": \"Outer regions of galaxy clusters as a new probe to test modifications to\\n  gravity\", \"summary\": \"We apply the caustic technique to samples of galaxy clusters stacked in\\nredshift space to estimate the gravitational potential in the cluster's outer\\nregion and test modifications to the standard theory of gravity. We separate\\n122 galaxy clusters from the HeCS-SZ, HeCS-redMapper, and HeCS samples into\\nfour samples with increasing mass; we estimate four robust, highly constraining\\ncaustic profiles for these samples. The caustic masses of the four stacked\\nclusters agree within $ 10\\\\%$ with the corresponding median values of each\\ncluster sample. By adopting the NFW density profile to model the gravitational\\npotential, we recover the caustic profile $\\\\mathcal{A}(r)$ up to radius $r_{\\\\rm\\np} \\\\sim 4.0\\\\, {\\\\rm Mpc}$. This comparison is a first-order validation of the\\nmass-concentration relation for galaxy clusters expected in the $\\\\Lambda$CDM\\nmodel. We thus impose this correlation as a prior in our analysis. Based on our\\nstacked clusters, we estimate the value of the filling factor, which enters the\\ncaustic technique, $\\\\mathcal{F}_{\\\\beta} = 0.59\\\\pm 0.05$; we derive this value\\nusing real data alone and find it consistent with the value usually adopted in\\nthe literature. We then use the caustic profiles $\\\\mathcal{A}(r)$ of the\\nstacked clusters to constrain the chameleon gravity model. We find that the\\ncaustic profiles provide a stringent upper limit of $|f_{\\\\rm R0}| \\\\lesssim 4\\n\\\\times 10^{-6}$ at $95\\\\%$ C.L. limits in the $f(\\\\mathcal{R})$ scenario. The\\nformalism developed here shall be further refined to test modifications to\\ngravity in the extended outer weak gravitational regions of galaxy clusters.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,gr-qc\", \"published\": \"2025-04-23T13:14:47Z\"}"}
