{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12628v1\", \"title\": \"Enhancing NDAR with Delay-Gate-Induced Amplitude Damping\", \"summary\": \"The Noise-Directed Adaptive Remapping (NDAR) method utilizes amplitude\\ndamping noise to enhance the performance of quantum optimization algorithms.\\nNDAR alternates between exploration by sampling solutions from the quantum\\ncircuit and exploitation by transforming the cost Hamiltonian by changing the\\nsigns of its terms. Both exploration and exploitation are important components\\nin classical heuristic algorithm design. In this study, we examine how NDAR\\nperformance improves by adjusting the balance between these components. We\\ncontrol the degree of exploitation by varying the delay time to 0, 50, and\\n$100~\\\\mu\\\\text{s}$, and investigate exploration strategies using two quantum\\ncircuits, QAOA and a random circuit, on IBM's Heron processor. Our results show\\nthat increasing delay time in NDAR improves the best objective value found in\\neach iteration. In single-layer QAOA and random circuits applied to unweighted\\nMax-Cut problem with low edge density, both exploration strategies yield\\nsimilar objective value trajectories and provide competitive solution quality\\nto simulated annealing for the 80-node problem. Their similar performance\\nindicates that, in most cases, increasing amplitude damping noise via\\nadditional delay time results in information loss. On the other hand, QAOA\\noutperforms random circuits in specific cases, such as positive-negative\\nweighted Max-Cut on a fully connected graph. This suggests potential advantages\\nof QAOA in more complex settings. We further develop a classical NDAR to better\\nunderstand exploration strategies, demonstrating that controlling the Hamming\\nweight distribution of sampled bitstrings yields higher quality solutions. This\\nsuggests that identifying suitable quantum circuits for exploration could\\nenhance NDAR performance.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-17T04:09:11Z\"}"}
