{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05312v1\", \"title\": \"Constituent-quark-model based coupled-channels calculation of the\\n  $\\\\mathbf{bb\\\\bar c\\\\bar c}$ and $\\\\mathbf{bc\\\\bar b\\\\bar c}$ tetraquark systems\", \"summary\": \"We perform a coupled-channels study of the $bb\\\\bar c\\\\bar c$ and $bc\\\\bar b\\\\bar\\nc$ tetraquark systems in a molecular approach using a constituent quark model\\nwhich has been widely used to satisfactorily describe a broad range of\\nproperties of heavy quark hadron systems, either conventional or exotic. Within\\na molecular framework, the interaction in the heavy quark sector is governed by\\ngluon exchange or confinement forces that are inherently color-dependent. While\\nthe $B_c B_c$ system contains two identical quarks, enabling stronger\\ninteractions via exchange diagrams, the forces in the $B_c \\\\bar{B}_c$ and\\n$(c\\\\bar{c})-(b\\\\bar{b})$ systems are expected to be significantly weaker.\\nConsequently, the theoretical and experimental analysis of $B_c^{(*)}\\nB_c^{(*)}$, $B_c^{(*)} \\\\bar{B}_c^{(*)}$, and charmonium-bottomonium bound\\nstructures could play a crucial role in clarifying the dominant mechanisms\\nresponsible for the formation of fully-heavy tetraquarks. For the $bb\\\\bar c\\\\bar\\nc$ tetraquark sector, we find several resonance states with different\\nspin-parity quantum numbers. These resonances are characterized by their\\nproximity, but not too close, to the $B_c^{(\\\\ast)}B_c^{(\\\\ast)}$ thresholds and\\ntheir large total decay widths, indicating strong decay channels. In contrast,\\nour analysis of the $bc\\\\bar b\\\\bar c$ tetraquark sector reveals no bound states,\\nvirtual states, or resonances; suggesting that tetraquark states of the $(c\\\\bar\\nc)-(b\\\\bar b)$ or $B_c^{(\\\\ast)}\\\\bar B_c^{(\\\\ast)}$ molecular type are unlikely to\\nbe formed, within our model assumptions.\", \"main_category\": \"hep-ph\", \"categories\": \"hep-ph\", \"published\": \"2025-05-08T15:00:12Z\"}"}
