{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15688v1\", \"title\": \"Subject islands do not reduce to construction-specific discourse\\n  function\", \"summary\": \"The term islands in linguistics refers to phrases from which extracting an\\nelement results in ungrammaticality (Ross, 1967). Grammatical subjects are\\nconsidered islands because extracting a sub-part of a subject results in an\\nill-formed sentence, despite having a clear intended meaning (e.g., \\\"Which\\ntopic did the article about inspire you?\\\"). The generative tradition, which\\nviews syntax as autonomous of meaning and function, attributes this\\nungrammaticality to the abstract movement dependency between the wh-phrase and\\nthe subject-internal position with which it is associated for interpretation.\\nHowever, research on language that emphasizes its communicative function\\nsuggests instead that syntactic constraints, including islands, can be\\nexplained based on the way different constructions package information.\\nAccordingly, Abeill\\\\'e et al. (2020) suggest that the islandhood of subjects is\\nspecific to the information structure of wh-questions, and propose that\\nsubjects are not islands for movement, but for focusing, due to their\\ndiscourse-backgroundedness. This predicts that other constructions that differ\\nin their information structure from wh-questions, but still involve movement,\\nshould not create a subject island effect. We test this prediction in three\\nlarge-scale acceptability studies, using a super-additive design that singles\\nout subject island violations, in three different constructions: wh-questions,\\nrelative clauses, and topicalization. We report evidence for a subject island\\neffect in each construction type, despite only wh-questions introducing what\\nAbeill\\\\'e et al. (2020) call \\\"a clash in information structure.\\\" We argue that\\nthis motivates an account of islands in terms of abstract, syntactic\\nrepresentations, independent of the communicative function associated with the\\nconstructions.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-04-22T08:13:04Z\"}"}
