{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01863v1\", \"title\": \"Extending MovieLens-32M to Provide New Evaluation Objectives\", \"summary\": \"Offline evaluation of recommender systems has traditionally treated the\\nproblem as a machine learning problem. In the classic case of recommending\\nmovies, where the user has provided explicit ratings of which movies they like\\nand don't like, each user's ratings are split into test and train sets, and the\\nevaluation task becomes to predict the held out test data using the training\\ndata. This machine learning style of evaluation makes the objective to\\nrecommend the movies that a user has watched and rated highly, which is not the\\nsame task as helping the user find movies that they would enjoy if they watched\\nthem. This mismatch in objective between evaluation and task is a compromise to\\navoid the cost of asking a user to evaluate recommendations by watching each\\nmovie. As a resource available for download, we offer an extension to the\\nMovieLens-32M dataset that provides for new evaluation objectives. Our primary\\nobjective is to predict the movies that a user would be interested in watching,\\ni.e. predict their watchlist. To construct this extension, we recruited\\nMovieLens users, collected their profiles, made recommendations with a diverse\\nset of algorithms, pooled the recommendations, and had the users assess the\\npools. Notably, we found that the traditional machine learning style of\\nevaluation ranks the Popular algorithm, which recommends movies based on total\\nnumber of ratings in the system, in the middle of the twenty-two recommendation\\nruns we used to build the pools. In contrast, when we rank the runs by users'\\ninterest in watching movies, we find that recommending popular movies as a\\nrecommendation algorithm becomes one of the worst performing runs. It appears\\nthat by asking users to assess their personal recommendations, we can alleviate\\nthe popularity bias issues created by using information retrieval effectiveness\\nmeasures for the evaluation of recommender systems.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-04-02T16:15:46Z\"}"}
