{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04362v1\", \"title\": \"Adaptive Equilibration of Molecular Dynamics Simulations\", \"summary\": \"We present a systematic framework for shortening and automating molecular\\ndynamics equilibration through improved position initialization methods and\\nuncertainty quantification analysis, using the Yukawa one-component plasma as\\nan exemplar system. Our comprehensive evaluation of seven initialization\\napproaches (uniform random, uniform random with rejection, Halton and Sobol\\nsequences, perfect and perturbed lattices, and a Monte Carlo pair distribution\\nmethod) demonstrates that initialization significantly impacts equilibration\\nefficiency, with microfield distribution analysis providing diagnostic insights\\ninto thermal behaviors. Our results establish that initialization method\\nselection is relatively inconsequential at low coupling strengths, while\\nphysics-informed methods demonstrate superior performance at high coupling\\nstrengths, reducing equilibration time. We establish direct relationships\\nbetween temperature stability and uncertainties in transport properties\\n(diffusion coefficient and viscosity), comparing thermostating protocols\\nincluding ON-OFF versus OFF-ON duty cycles, Berendsen versus Langevin\\nthermostats, and thermostat coupling strengths. Our findings demonstrate that\\nweaker thermostat coupling generally requires fewer equilibration cycles, and\\nOFF-ON thermostating sequences outperform ON-OFF approaches for most\\ninitialization methods. The methodology implements temperature forecasting as a\\nquantitative metric for system thermalization, enabling users to determine\\nequilibration adequacy based on specified uncertainty tolerances in desired\\noutput properties, thus transforming equilibration from a heuristic process to\\na rigorously quantifiable procedure with clear termination criteria.\", \"main_category\": \"physics.comp-ph\", \"categories\": \"physics.comp-ph\", \"published\": \"2025-05-07T12:28:58Z\"}"}
