{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15194v1\", \"title\": \"Quantum phase discrimination with applications to quantum search on\\n  graphs\", \"summary\": \"We study the phase discrimination problem, in which we want to decide whether\\nthe eigenphase $\\\\theta\\\\in(-\\\\pi,\\\\pi]$ of a given eigenstate $|\\\\psi\\\\rangle$ with\\neigenvalue $e^{i\\\\theta}$ is zero or not, using applications of the unitary $U$\\nprovided as a black box oracle.We propose a quantum algorithm named {\\\\it\\nquantum phase discrimination(QPD)} for this task, with optimal query complexity\\n$\\\\Theta(\\\\frac{1}{\\\\lambda}\\\\log\\\\frac{1}{\\\\delta})$ to the oracle $U$, where\\n$\\\\lambda$ is the gap between zero and non-zero eigenphases and $\\\\delta$ the\\nallowed one-sided error. The quantum circuit is simple, consisting of only one\\nancillary qubit and a sequence of controlled-$U$ interleaved with single qubit\\n$Y$ rotations, whose angles are given by a simple analytical formula. Quantum\\nphase discrimination could become a fundamental subroutine in other quantum\\nalgorithms, as we present two applications to quantum search on graphs:\\n  i) Spatial search on graphs. Inspired by the structure of QPD, we propose a\\nnew quantum walk model, and based on them we tackle the spatial search problem,\\nobtaining a novel quantum search algorithm. For any graph with any number of\\nmarked vertices, the quantum algorithm that can find a marked vertex with\\nprobability $\\\\Omega(1)$ in total evolution time $ O(\\\\frac{1}{\\\\lambda\\n\\\\sqrt{\\\\varepsilon}})$ and query complexity $ O(\\\\frac{1}{\\\\sqrt{\\\\varepsilon}})$,\\nwhere $\\\\lambda$ is the gap between the zero and non-zero eigenvalues of the\\ngraph Laplacian and $\\\\varepsilon$ is a lower bound on the proportion of marked\\nvertices.\\n  ii) Path-finding on graphs.} By using QPD, we reduce the query complexity of\\na path-finding algorithm proposed by Li and Zur [arxiv: 2311.07372] from\\n$\\\\tilde{O}(n^{11})$ to $\\\\tilde{O}(n^8)$, in a welded-tree circuit graph with\\n$\\\\Theta(n2^n)$ vertices.\\n  Besides these two applications, we argue that more quantum algorithms might\\nbenefit from QPD.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-21T16:06:43Z\"}"}
