{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01877v1\", \"title\": \"Effects of Dynamic Bonds on the Kinetic Pathways of Supramolecular\\n  Diblock Copolymers Disorder-Order Transition\", \"summary\": \"Supramolecular block copolymers (SBC) consist of covalent polymer building\\nblocks that are connected into well-defined architectures via supramolecular\\nbonds. Assisted by the dynamic and reversible supramolecular interactions, it\\nis envisaged that SBC self-assemblies may exhibit more diverse morphologies,\\nstimuli-responsivity comparing to their covalent analogues. At the fundamental\\nlevel, these features are related to the free-energy landscape of\\nself-assemblies. It is therefore of central importance to understand the impact\\nof dynamic/reversible bonds on the free energy landscape during structure\\ntransitions. In this study, we first conduct smart Monte Carlo simulations to\\ncompare the kinetics of the disorder-order transition (DOT) of supramolecular\\ndiblock copolymers (SDBC) to that of covalent diblock copolymers (CDBC). The\\nstructural order parameter for CDBC exhibits a fast and smooth transition\\nprocess across different random number seeds and initial configurations. In\\ncontrast, the SDBC system shows more diverse transition pathways, which can be\\nclassified into three types. These results suggest that reversible\\nsupramolecular interactions complicate the pathways, and bring about various\\nintermediate structures. Next, we apply the string method to construct the\\nminimum free energy path of the transition, from which the transition state and\\nthe free energy barrier are evaluated. It is found that the transition free\\nenergy barrier strongly correlates with the fraction of supramolecules. By\\ndecomposing the free energy into A-B interaction energy and association energy,\\nwe found that the interplay of both two effects decide the kinetic pathway and\\nthe final equilibrium structures.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-04-02T16:33:17Z\"}"}
