{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05023v1\", \"title\": \"Split Matching for Inductive Zero-shot Semantic Segmentation\", \"summary\": \"Zero-shot Semantic Segmentation (ZSS) aims to segment categories that are not\\nannotated during training. While fine-tuning vision-language models has\\nachieved promising results, these models often overfit to seen categories due\\nto the lack of supervision for unseen classes. As an alternative to fully\\nsupervised approaches, query-based segmentation has shown great latent in ZSS,\\nas it enables object localization without relying on explicit labels. However,\\nconventional Hungarian matching, a core component in query-based frameworks,\\nneeds full supervision and often misclassifies unseen categories as background\\nin the setting of ZSS. To address this issue, we propose Split Matching (SM), a\\nnovel assignment strategy that decouples Hungarian matching into two\\ncomponents: one for seen classes in annotated regions and another for latent\\nclasses in unannotated regions (referred to as unseen candidates).\\nSpecifically, we partition the queries into seen and candidate groups, enabling\\neach to be optimized independently according to its available supervision. To\\ndiscover unseen candidates, we cluster CLIP dense features to generate pseudo\\nmasks and extract region-level embeddings using CLS tokens. Matching is then\\nconducted separately for the two groups based on both class-level similarity\\nand mask-level consistency. Additionally, we introduce a Multi-scale Feature\\nEnhancement (MFE) module that refines decoder features through residual\\nmulti-scale aggregation, improving the model's ability to capture spatial\\ndetails across resolutions. SM is the first to introduce decoupled Hungarian\\nmatching under the inductive ZSS setting, and achieves state-of-the-art\\nperformance on two standard benchmarks.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-08T07:56:30Z\"}"}
