{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03571v1\", \"title\": \"Crystal structural evolution of Ru$_3$Sn$_7$ under pressure and its\\n  implication on possible electronic changes\", \"summary\": \"Ru$_3$Sn$_7$, an intermetallic compound with advanced catalytic properties,\\nexhibits a complex crystal structure and intriguing electronic properties,\\nmaking it an attractive candidate for investigations under high-pressure (HP).\\nThe structural, vibrational and electronic band structure of this compound were\\ninvestigated at HP up to ~ 20 GPa using synchrotron x-ray powder diffraction,\\nmicro-Raman, and density functional theory (DFT), respectively. Despite the\\nlocal structural changes implied by a discernible reduction in the\\ncompressibility and distinct slope changes in the pressure evolution of the\\nsymmetric stretching vibrations of the Ru and Sn atoms around 8 GPa, the cubic\\nstructure is found to be stable throughout the pressure range. In support, our\\ncalculated phonon dispersion relation confirmed the stability of the cubic\\nphase till the highest pressures. A comprehensive analysis of the Raman\\nspectrum reveals the signatures of the pressure induced sudden strengthening of\\nelectron-phonon coupling as early as 3 GPa which is backed by a bounce in the\\nphonon and electron density of states (DoS). Electronic structure calculations\\ndemonstrate that the metallic nature of Ru$_3$Sn$_7$ is preserved in the\\nstudied pressure range with a minor redistribution of electronic DoS across the\\nFermi level (EF). The band structure calculations predict intriguing changes in\\nthe electronic structure, revealing the pressure induced dp hybridization\\nthrough the high symmetry point of the Brillouin zone which is largely\\nresponsible for the observed reduction in the compressibility and enhancement\\nof the electron-phonon coupling in Ru$_3$Sn$_7$.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-05-06T14:30:18Z\"}"}
