{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04917v1\", \"title\": \"Modeling the circumstellar interaction around SN 2004gq\", \"summary\": \"The relationship between the mass-loss history and final evolutionary stage\\nof massive stars and the properties of the observable supernova (SN) is still\\nunder debate. This is especially true for stripped-envelope (Type Ib/c) SNe,\\nwhere the progenitor ejects a considerably large amount of material during its\\nevolution, which can lead to a circumstellar medium relatively close to the\\nexploding star. Moreover, when the star explodes as a SN, this matter may\\ncontribute significantly to the generated luminosity because of the\\ninteraction. However, the trace of this circumstellar interaction can only be\\ninvestigated for a couple of Type Ib/c SNe, and the nature of a close (within\\naround $10^{15}$ cm) circumstellar matter (CSM) has also been largely\\nunexplored for these objects.\\n  Here, we present the results of our radio and bolometric light curve (LC)\\nanalysis related to SN 2004gq. We describe a combined model that explains the\\nunusual LC properties of this event and supports the circumstellar interaction\\nscenario. For that, we computed the quasi-bolometric LC of the SN and fit this\\nwith a multicomponent model to gain information on the progenitor and the\\nsurrounding circumstellar medium. We also analyzed the available radio LCs\\n(taken at 1.4,\\\\ 4.9 and 8.5 GHz) of SN 2004gq to verify our estimated average\\nmass-loss rate, which is one of the most crucial physical properties related to\\nCSM models.\\n  We infer reasonable parameters for SN 2004gq using radioactive decay and\\nmagnetar energy input. To power the entire LC, we must also add an extra energy\\nsource related to the CSM. We determine the most essential parameter of this\\nmedium: the average mass-loss rate from both LC and radio data fitting. We find\\nthat the suggested hidden circumstellar interaction is a viable mechanism that\\nprovides the required energy deficiency and that it can be estimated using a\\nsimple semi-analytic model.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.SR\", \"published\": \"2025-04-07T10:59:47Z\"}"}
