{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05183v1\", \"title\": \"PaniCar: Securing the Perception of Advanced Driving Assistance Systems\\n  Against Emergency Vehicle Lighting\", \"summary\": \"The safety of autonomous cars has come under scrutiny in recent years,\\nespecially after 16 documented incidents involving Teslas (with autopilot\\nengaged) crashing into parked emergency vehicles (police cars, ambulances, and\\nfiretrucks). While previous studies have revealed that strong light sources\\noften introduce flare artifacts in the captured image, which degrade the image\\nquality, the impact of flare on object detection performance remains unclear.\\nIn this research, we unveil PaniCar, a digital phenomenon that causes an object\\ndetector's confidence score to fluctuate below detection thresholds when\\nexposed to activated emergency vehicle lighting. This vulnerability poses a\\nsignificant safety risk, and can cause autonomous vehicles to fail to detect\\nobjects near emergency vehicles. In addition, this vulnerability could be\\nexploited by adversaries to compromise the security of advanced driving\\nassistance systems (ADASs). We assess seven commercial ADASs (Tesla Model 3,\\n\\\"manufacturer C\\\", HP, Pelsee, AZDOME, Imagebon, Rexing), four object detectors\\n(YOLO, SSD, RetinaNet, Faster R-CNN), and 14 patterns of emergency vehicle\\nlighting to understand the influence of various technical and environmental\\nfactors. We also evaluate four SOTA flare removal methods and show that their\\nperformance and latency are insufficient for real-time driving constraints. To\\nmitigate this risk, we propose Caracetamol, a robust framework designed to\\nenhance the resilience of object detectors against the effects of activated\\nemergency vehicle lighting. Our evaluation shows that on YOLOv3 and Faster\\nRCNN, Caracetamol improves the models' average confidence of car detection by\\n0.20, the lower confidence bound by 0.33, and reduces the fluctuation range by\\n0.33. In addition, Caracetamol is capable of processing frames at a rate of\\nbetween 30-50 FPS, enabling real-time ADAS car detection.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.LG\", \"published\": \"2025-05-08T12:33:48Z\"}"}
