{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15086v1\", \"title\": \"Configuration Requirements for 21-cm Forest Background Quasar Searches\\n  with the Moon-based Interferometer\", \"summary\": \"The 21-cm forest offers a powerful cosmological probe of the thermal history\\nand small-scale structure of the intergalactic medium during the Epoch of\\nReionization (EoR). Its success, however, critically depends on the\\navailability of high-redshift radio-loud quasars (HzRLQs) as background\\nsources. In this work, we investigate the configuration requirements for a\\nMoon-based low-frequency radio interferometer aimed at maximizing the detection\\nof HzRLQs for future 21-cm forest studies. Building upon a previously developed\\nquasar luminosity function (QLF), we forecast HzRLQ abundances under various\\narray configurations. Assuming a total survey area of $10^4\\\\,\\\\mathrm{deg}^2$\\nand 1 year of observation, we compare continuum surveys with 10 MHz bandwidth\\nand 21-cm forest surveys with 5 kHz resolution. Our results show that a minimum\\ncollecting area of $\\\\sim$6 500 m$^2$ enables detection at $z \\\\sim 6$, while\\nSKA-like arrays ($N_{\\\\mathrm{st}} = 512$) extend the detection limit to $z \\\\sim\\n10$ for 21-cm forest survey and $z \\\\sim 16$ for continuum survey. Larger arrays\\nwith $N_{\\\\mathrm{st}} = 2048$ can reach $z \\\\sim 11$ in 21-cm forest mode. We\\nalso explore configurations that maintain fixed collecting areas while\\nincreasing the number to enhance survey efficiency. This boosts source\\ndetection but significantly increases the data volume and computational\\ndemands. These results underscore the importance of optimizing array design for\\ndifferent survey goals and balancing sensitivity, spectral resolution, and data\\nmanagement. A well-designed Moon-based array could open a new observational\\nwindow on reionization and early cosmic structure formation.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO,gr-qc,hep-ph\", \"published\": \"2025-04-21T13:20:16Z\"}"}
