{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05776v1\", \"title\": \"Quantifying uncertainty in inverse scattering problems set in layered\\n  environments\", \"summary\": \"The attempt to solve inverse scattering problems often leads to optimization\\nand sampling problems that require handling moderate to large amounts of\\npartial differential equations acting as constraints. We focus here on\\ndetermining inclusions in a layered medium from the measurement of wave fields\\non the surface, while quantifying uncertainty and addressing the effect of wave\\nsolver quality. Inclusions are characterized by a few parameters describing\\ntheir material properties and shapes. We devise algorithms to estimate the most\\nlikely configurations by optimizing cost functionals with Bayesian\\nregularizations and wave constraints. In particular, we design an automatic\\nLevenberg-Marquardt-Fletcher type scheme based on the use of algorithmic\\ndifferentiation and adaptive finite element meshes for time dependent wave\\nequation constraints with changing inclusions. In synthetic tests with a single\\nfrequency, this scheme converges in few iterations for increasing noise levels.\\nTo attain a global view of other possible high probability configurations and\\nasymmetry effects we resort to parallelizable affine invariant Markov Chain\\nMonte Carlo methods, at the cost of solving a few million wave problems. This\\nforces the use of prefixed meshes. While the optimal configurations remain\\nsimilar, we encounter additional high probability inclusions influenced by the\\nprior information, the noise level and the layered structure, effect that can\\nbe reduced by considering more frequencies. We analyze the effect on the\\ncalculations of working with adaptive and fixed meshes, under a simple choice\\nof non-reflecting boundary conditions in truncated layered domains for which we\\nestablish wellposedness and convergence results.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA,math.OC,physics.comp-ph,physics.data-an,physics.geo-ph\", \"published\": \"2025-04-08T07:57:36Z\"}"}
