{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16845v1\", \"title\": \"An accreting dwarf star orbiting the S-type giant star pi1 Gru\", \"summary\": \"Aims. We aim to characterize the properties of the inner companion of the\\nS-type AGB star pi1 Gru, and to identify plausible future evolution scenarios\\nfor this triple system. Methods. We observed pi1 Gru with ALMA and VLT/SPHERE.\\nIn addition, we collected archival photometry data and used the Hipparcos-Gaia\\nproper motion anomaly. We derive the best orbital parameters from Bayesian\\ninference. Results. The inner companion, pi1 Gru C was located at 37.4 +/- 2.0\\nmas from the primary in June-July 2019 (projected separation of 6.05 +/- 0.55\\nau at 161.7 +/- 11.7 pc). The best orbital solution gives a companion mass of\\n0.86 (+0.22/-0.20) Msun (using the derived mass of the primary), and a\\nsemi-major axis of 7.05 (+0.54/-0.57) au. This leads to an orbital period of\\n11.0 (+1.7/-1.5) yr. The best solution is an elliptical orbit with eccentricity\\ne = 0.35 (+0.18/-0.17), but a circular orbit cannot be totally excluded. The\\nclose companion can either be a K1V (F9.5V/K7V) star or a white dwarf. The\\nultraviolet and millimeter continuum photometry are consistent with the\\npresence of an accretion disk around the close companion. The ultraviolet\\nemission could then either originate in hot spots in an overall cooler disk, or\\nalso from a hot disk in case the companion is a white dwarf. Conclusions.\\nThough the close companion and the AGB star are interacting, and an accretion\\ndisk is observed around the companion, the mass-accretion rate is too low to\\ncause a Ia supernova but could produce novae every ~900 yr. Short wavelength\\nspatially resolved observations are needed to further constrain the nature of\\nthe C companion. Searches for close-in companions similar to this system will\\nhelp to better understand the physics of mass- and angular-momentum transfer,\\nand orbital evolution in the late evolutionary stages.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-23T16:09:33Z\"}"}
