{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03385v1\", \"title\": \"Solar Flare Forecast: A Comparative Analysis of Machine Learning\\n  Algorithms for Solar Flare Class Prediction\", \"summary\": \"Solar flares are among the most powerful and dynamic events in the solar\\nsystem, resulting from the sudden release of magnetic energy stored in the\\nSun's atmosphere. These energetic bursts of electromagnetic radiation can\\nrelease up to 10^32 erg of energy, impacting space weather and posing risks to\\ntechnological infrastructure and therefore require accurate forecasting of\\nsolar flare occurrences and intensities. This study evaluates the predictive\\nperformance of three machine learning algorithms: Random Forest, k-Nearest\\nNeighbors (KNN), and Extreme Gradient Boosting (XGBoost) for classifying solar\\nflares into 4 categories (B, C, M, X). Using the dataset of 13 SHARP\\nparameters, the effectiveness of the models was evaluated in binary and\\nmulticlass classification tasks. The analysis utilized 8 principal components\\n(PC), capturing 95% of data variance, and 100 PCs, capturing 97.5% of variance.\\nOur approach uniquely combines binary and multiclass classification with\\ndifferent levels of dimensionality reduction, an innovative methodology not\\npreviously explored in the context of solar flare prediction. Employing a\\n10-fold stratified cross-validation and grid search for hyperparameter tuning\\nensured robust model evaluation. Our findings indicate that Random Forest and\\nXGBoost consistently demonstrate strong performance across all metrics,\\nbenefiting significantly from increased dimensionality. The insights of this\\nstudy enhance future research by optimizing dimensionality reduction techniques\\nand informing model selection for astrophysical tasks. By integrating this\\nnewly acquired knowledge into future research, more accurate space weather\\nforecasting systems can be developed, along with a deeper understanding of\\nsolar physics.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.IM,cs.LG,I.5.0\", \"published\": \"2025-05-06T10:08:41Z\"}"}
