{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20693v1\", \"title\": \"Microcanonical ensemble out of equilibrium\", \"summary\": \"Introduced by Boltzmann under the name \\\"monode,\\\" the microcanonical ensemble\\nserves as the fundamental representation of equilibrium thermodynamics in\\nstatistical mechanics by counting all realizations of a system's states.\\nEnsemble theory connects this idea with probability and information theory,\\nleading to the notion of Shannon-Gibbs entropy and, ultimately, to the\\nprinciple of maximum caliber describing trajectories of systems in and out of\\nequilibrium. While the latter generalization reproduces many results of\\nnonequilibrium thermodynamics, given a proper choice of observables, its\\nphysical justification remains an open area of research. What is the\\nmicroscopic origin and physical interpretation of this variational approach?\\nWhat guides the choice of relevant observables? We address these questions by\\nextending Boltzmann's method to a microcanonical caliber principle and counting\\nrealizations of a system's trajectories -- all assumed equally probable.\\nMaximizing the microcanonical caliber under the imposed macro- and micro-scopic\\nconstraints, we systematically develop generalized detailed-balance relations,\\nclarify the statistical origins of inhomogeneous transport, and provide an\\nindependent derivation of key equations underlying the theories of random walks\\nand stochastic thermodynamics. This approach introduces a dynamical ensemble\\ntheory for nonequilibrium steady states in spatially extended and active\\nsystems. While verifying the equivalence of ensembles, e.g. those of Norton and\\nThevenin, our theory highlights differences between nonequilibrium regimes not\\nevident in the traditional formulation of the maximum-caliber principle. We\\nvalidate our results by stochastic simulations. Our theory suggests further\\nconnections to the first principles of microscopic dynamics, which are critical\\nfor investigating systems where the conditions for thermodynamic behavior are\\nnot satisfied.\", \"main_category\": \"cond-mat.stat-mech\", \"categories\": \"cond-mat.stat-mech\", \"published\": \"2025-04-29T12:18:13Z\"}"}
