{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10881v1\", \"title\": \"A Nonparametric Bayesian Local-Global Model for Enhanced Adverse Event\\n  Signal Detection in Spontaneous Reporting System Data\", \"summary\": \"Spontaneous reporting system databases are key resources for post-marketing\\nsurveillance, providing real-world evidence (RWE) on the adverse events (AEs)\\nof regulated drugs or other medical products. Various statistical methods have\\nbeen proposed for AE signal detection in these databases, flagging\\ndrug-specific AEs with disproportionately high observed counts compared to\\nexpected counts under independence. However, signal detection remains\\nchallenging for rare AEs or newer drugs, which receive small observed and\\nexpected counts and thus suffer from reduced statistical power. Principled\\ninformation sharing on signal strengths across drugs/AEs is crucial in such\\ncases to enhance signal detection. However, existing methods typically ignore\\ncomplex between-drug associations on AE signal strengths, limiting their\\nability to detect signals. We propose novel local-global mixture Dirichlet\\nprocess (DP) prior-based nonparametric Bayesian models to capture these\\nassociations, enabling principled information sharing between drugs while\\nbalancing flexibility and shrinkage for each drug, thereby enhancing\\nstatistical power. We develop efficient Markov chain Monte Carlo algorithms for\\nimplementation and employ a false discovery rate (FDR)-controlled, false\\nnegative rate (FNR)-optimized hypothesis testing framework for AE signal\\ndetection. Extensive simulations demonstrate our methods' superior sensitivity\\n-- often surpassing existing approaches by a twofold or greater margin -- while\\nstrictly controlling the FDR. An application to FDA FAERS data on statin drugs\\nfurther highlights our methods' effectiveness in real-world AE signal\\ndetection. Software implementing our methods is provided as supplementary\\nmaterial.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME,stat.AP,stat.CO\", \"published\": \"2025-04-15T05:22:01Z\"}"}
