{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13037v1\", \"title\": \"Towards Cardiac MRI Foundation Models: Comprehensive Visual-Tabular\\n  Representations for Whole-Heart Assessment and Beyond\", \"summary\": \"Cardiac magnetic resonance imaging is the gold standard for non-invasive\\ncardiac assessment, offering rich spatio-temporal views of the cardiac anatomy\\nand physiology. Patient-level health factors, such as demographics, metabolic,\\nand lifestyle, are known to substantially influence cardiovascular health and\\ndisease risk, yet remain uncaptured by CMR alone. To holistically understand\\ncardiac health and to enable the best possible interpretation of an\\nindividual's disease risk, CMR and patient-level factors must be jointly\\nexploited within an integrated framework. Recent multi-modal approaches have\\nbegun to bridge this gap, yet they often rely on limited spatio-temporal data\\nand focus on isolated clinical tasks, thereby hindering the development of a\\ncomprehensive representation for cardiac health evaluation. To overcome these\\nlimitations, we introduce ViTa, a step toward foundation models that delivers a\\ncomprehensive representation of the heart and a precise interpretation of\\nindividual disease risk. Leveraging data from 42,000 UK Biobank participants,\\nViTa integrates 3D+T cine stacks from short-axis and long-axis views, enabling\\na complete capture of the cardiac cycle. These imaging data are then fused with\\ndetailed tabular patient-level factors, enabling context-aware insights. This\\nmulti-modal paradigm supports a wide spectrum of downstream tasks, including\\ncardiac phenotype and physiological feature prediction, segmentation, and\\nclassification of cardiac and metabolic diseases within a single unified\\nframework. By learning a shared latent representation that bridges rich imaging\\nfeatures and patient context, ViTa moves beyond traditional, task-specific\\nmodels toward a universal, patient-specific understanding of cardiac health,\\nhighlighting its potential to advance clinical utility and scalability in\\ncardiac analysis.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.AI,cs.CV\", \"published\": \"2025-04-17T15:46:19Z\"}"}
