{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10830v1\", \"title\": \"Radiation Footprint Control in Cell-Free Cooperative ISAC: Optimal Joint\\n  BS Activation and Beamforming Coordination\", \"summary\": \"Coordinated beamforming across distributed base stations (BSs) in cell-free\\narchitectures can efficiently support integrated sensing and communication\\n(ISAC) users by improving resource sharing and reducing conflicts in the\\nspatial domain. However, coordinating numerous BSs within the ISAC network\\nposes risks of generating substantial interference for other networks sharing\\nthe spectrum, while also increasing operational costs from power consumption\\nand signaling overhead. Therefore, in this paper, we propose an\\ninterference-suppressed and cost-optimized cell-free ISAC network by\\nopportunistically and cooperatively orchestrating distributed radio resources\\nto address competing sensing and communication (S\\\\&C) demands. Specifically, we\\nconceive a radiation footprint control mechanism that autonomously suppresses\\ninterference across the entire signal propagation space to safeguard other\\nnetworks without exchanging signaling. Then, we propose joint BS activation and\\nbeamforming coordination to dynamically activate appropriate BSs and\\norchestrate their spatial beams for service provisioning. Building upon this\\nframework, we formulate a cost-efficient utility maximization problem that\\nconsiders individual S\\\\&C demands and location-dependent radiation footprint\\nconstraints. Since this results in a non-convex optimization problem, we\\ndevelop a monotonic optimization embedded branch-and-bound (MO-BRB) algorithm\\nto find the optimal solution. Additionally, we apply a low-complexity iterative\\nmethod to obtain near-optimal solutions. Finally, simulation results validate\\nthe effectiveness of the proposed algorithms.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,eess.SP,math.IT\", \"published\": \"2025-04-15T03:14:05Z\"}"}
