{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15685v1\", \"title\": \"Monte Carlo simulation of GRB data to test Lorentz-invariance violation\", \"summary\": \"Lorentz-invariance violation (LV) at energy scales approaching the Planck\\nregime serves as a critical probe for understanding quantum gravity\\nphenomenology. Astrophysical observations of gamma-ray bursts (GRBs) present a\\npromising avenue for testing LV-induced spectral lag phenomena; however,\\ninterpretations are complicated by degeneracies between LV effects and\\nintrinsic emission delays. This study systematically investigates three\\ncompeting time delay models: Model A (LV delay combined with a constant\\nintrinsic delay), Model B (energy-dependent intrinsic delay without LV), and\\nModel C (LV delay combined with energy-dependent intrinsic delay). We utilize\\nmock GRB datasets generated under distinct delay mechanisms and employ Bayesian\\nparameter estimation on simulated observations of 10 GRBs. Our findings\\ndemonstrate that Model C consistently recovers input parameters across all\\ndatasets. In contrast, Models A and B struggle to reconcile data generated\\nunder alternative mechanisms, particularly when confronted with high-energy TeV\\nphotons from GRB 190114C and GRB 221009A. Our analysis confirms that the\\nincorporation of energy-dependent intrinsic delays in Model C is essential for\\nestablishing robust LV constraints, effectively resolving prior ambiguities in\\nthe interpretation of multi-GeV and TeV photon emissions. The results validate\\nModel C as a generalized framework for future LV searches, yielding a\\nsubluminal LV scale of \\\\(E_{\\\\rm LV} \\\\simeq 3 \\\\times 10^{17}\\\\) GeV based on\\nrealistic datasets. These findings are consistent with earlier constraints\\nderived from Fermi-LAT datasets. This work underscores the necessity for joint\\nmodeling of LV and astrophysical emission processes in next-generation LV\\nstudies utilizing observatories such as LHAASO and CTA.\", \"main_category\": \"hep-ph\", \"categories\": \"hep-ph,astro-ph.HE,gr-qc\", \"published\": \"2025-04-22T08:09:20Z\"}"}
