{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12630v1\", \"title\": \"Crystal growth, structure and physical properties of\\n  quasi-one-dimensional tellurides Fe$_{4-x}$VTe$_{4-y}$ ($x=1.01$, $y=0.74$)\\n  and V$_{4.64}$Te$_4$\", \"summary\": \"A new ternary compound Fe$_{4-x}$VTe$_{4-y}$ ($x=1.01$, $y=0.74$) with\\nTi5Te4-type structure is identified. Fe and V atoms tend to occupy different\\ncrystallographic positions and form quasi-one-dimensional (quasi-1D) Fe-V\\nchains along the c-axis. Millimeter-sized single crystal of\\nFe$_{2.99}$VTe$_{3.26}$ (FVT) with slender-stick shape could be grown by\\nchemical vapor transport method which reflects its quasi-1D crystal structure.\\nMagnetization measurements reveal that FVT orders antiferromagnetically below\\nT$_N$=93 K with strong easy ab-plane magnetic anisotropy. Although a weak\\nglassy-like behavior appears below 10 K, FVT is dominant by long-range\\nantiferromagnetic order in contrast to the spin-glass state in previously\\nreported isostructural Fe$_{5}$Te$_{4}$. We also synthesize V$_{4.64}$Te$_4$\\nwith similar quasi-1D V-chains and find it has weak anomalies at 144 K on both\\nresistivity and susceptibility curves. However, no clear evidence is found for\\nthe development of magnetic or charge order. X-ray photoelectron spectroscopy\\nand Curie-Weiss fit reveal that the effective moments for Fe$^{2+}$ and\\nV$^{4+}$ in both compounds have large deviations from the conventional local\\nmoment model, which may possibly result from the formation of Fe/V metal-metal\\nbondings. Furthermore the resistivity of both FVT and V$_{4.64}$Te$_4$ exhibits\\nsemiconducting-like temperature-dependent behavior but with average values\\nclose to typical bad metals, which resembles the transport behavior in the\\nnormal state of Fe-based superconductors. These quasi-1D compounds have shown\\ninteresting physical properties for future condensed matter physics research.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el,cond-mat.mtrl-sci,cond-mat.supr-con\", \"published\": \"2025-04-17T04:13:56Z\"}"}
