{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11256v1\", \"title\": \"Covering Approximate Shortest Paths with DAGs\", \"summary\": \"We define and study analogs of probabilistic tree embedding and tree cover\\nfor directed graphs. We define the notion of a DAG cover of a general directed\\ngraph $G$: a small collection $D_1,\\\\dots D_g$ of DAGs so that for all pairs of\\nvertices $s,t$, some DAG $D_i$ provides low distortion for $dist(s,t)$; i.e. $\\ndist_G(s, t) \\\\le \\\\min_{i \\\\in [g]} dist_{D_i}(s, t) \\\\leq \\\\alpha \\\\cdot dist_G(s,\\nt)$, where $\\\\alpha$ is the distortion.\\n  As a trivial upper bound, there is a DAG cover with $n$ DAGs and $\\\\alpha=1$\\nby taking the shortest-paths tree from each vertex. When each DAG is restricted\\nto be a subgraph of $G$, there is a matching lower bound (via a directed cycle)\\nthat $n$ DAGs are necessary, even to preserve reachability. Thus, we allow the\\nDAGs to include a limited number of additional edges not in the original graph.\\n  When $n^2$ additional edges are allowed, there is a simple upper bound of two\\nDAGs and $\\\\alpha=1$. Our first result is an almost-matching lower bound that\\neven for $n^{2-o(1)}$ additional edges, at least $n^{1-o(1)}$ DAGs are needed,\\neven to preserve reachability. However, the story is different when the number\\nof additional edges is $\\\\tilde{O}(m)$, a natural setting where the sparsity of\\nthe DAG collection nearly matches the original graph. Our main upper bound is\\nthat there is a near-linear time algorithm to construct a DAG cover with\\n$\\\\tilde{O}(m)$ additional edges, polylogarithmic distortion, and only $O(\\\\log\\nn)$ DAGs. This is similar to known results for undirected graphs: the\\nwell-known FRT probabilistic tree embedding implies a tree cover where both the\\nnumber of trees and the distortion are logarithmic. Our algorithm also extends\\nto a certain probabilistic embedding guarantee. Lastly, we complement our upper\\nbound with a lower bound showing that achieving a DAG cover with no distortion\\nand $\\\\tilde{O}(m)$ additional edges requires a polynomial number of DAGs.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS\", \"published\": \"2025-04-15T14:55:26Z\"}"}
