{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00564v1\", \"title\": \"X-ray illicit object detection using hybrid CNN-transformer neural\\n  network architectures\", \"summary\": \"In the field of X-ray security applications, even the smallest details can\\nsignificantly impact outcomes. Objects that are heavily occluded or\\nintentionally concealed pose a great challenge for detection, whether by human\\nobservation or through advanced technological applications. While certain Deep\\nLearning (DL) architectures demonstrate strong performance in processing local\\ninformation, such as Convolutional Neural Networks (CNNs), others excel in\\nhandling distant information, e.g., transformers. In X-ray security imaging the\\nliterature has been dominated by the use of CNN-based methods, while the\\nintegration of the two aforementioned leading architectures has not been\\nsufficiently explored. In this paper, various hybrid CNN-transformer\\narchitectures are evaluated against a common CNN object detection baseline,\\nnamely YOLOv8. In particular, a CNN (HGNetV2) and a hybrid CNN-transformer\\n(Next-ViT-S) backbone are combined with different CNN/transformer detection\\nheads (YOLOv8 and RT-DETR). The resulting architectures are comparatively\\nevaluated on three challenging public X-ray inspection datasets, namely EDS,\\nHiXray, and PIDray. Interestingly, while the YOLOv8 detector with its default\\nbackbone (CSP-DarkNet53) is generally shown to be advantageous on the HiXray\\nand PIDray datasets, when a domain distribution shift is incorporated in the\\nX-ray images (as happens in the EDS datasets), hybrid CNN-transformer\\narchitectures exhibit increased robustness. Detailed comparative evaluation\\nresults, including object-level detection performance and object-size error\\nanalysis, demonstrate the strengths and weaknesses of each architectural\\ncombination and suggest guidelines for future research. The source code and\\nnetwork weights of the models employed in this study are available at\\nhttps://github.com/jgenc/xray-comparative-evaluation.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-01T14:40:38Z\"}"}
