{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07622v1\", \"title\": \"A new quasar strongly-lensed candidate by the galaxy cluster WHJ0400-27\\n  with a $18''$ image-separation\", \"summary\": \"Time-delay cosmography (TDC) using multiply-lensed quasars (QSOs) by galaxies\\nhas recently emerged as an independent and competitive tool to measure the\\nvalue of the Hubble constant. Lens galaxy clusters hosting multiply-imaged\\nQSOs, when coupled with an accurate and precise knowledge of their total mass\\ndistribution, are equally powerful cosmological probes. However, less than ten\\nsuch systems have been identified to date. Our study aims to expand the limited\\nsample of cluster-lensed QSO systems by identifying new candidates within rich\\ngalaxy clusters. Starting from a sample of ~$10^5$ galaxy cluster candidates\\n(Wen & Han, 2022), built from Dark Energy Survey and Wide-field Infrared Survey\\nExplorer imaging data, and a highly-pure catalogue of over one million QSOs,\\nbased on Gaia DR3 data, we cross-correlate them to identify candidate lensed\\nQSOs near the core of massive galaxy clusters. Our search yielded 3 lensed\\ndouble candidates over an area of ~$5000$ sq. degree. In this work, we focus on\\nthe best candidate consisting of a double QSO with Gaia-based redshift of 1.35,\\nprojected behind a moderately rich cluster (WHJ0400-27) at $z_{phot}=0.65$.\\nBased on a first spectroscopic follow-up study, we confirm the two QSOs at\\n$z=1.345$, with indistinguishable spectra, and a brightest cluster galaxy at\\n$z=0.626$. These observations seem to support the strong lensing nature of this\\nsystem, although some tension emerges when the cluster mass from a preliminary\\nlens model is compared with that from other mass proxies. We also discuss the\\npossibility that such system is a rare physical association of two distinct\\nQSOs with a projected physical distance of ~$150$ kpc. If further spectroscopic\\nobservations confirm its lensing nature, such a rare lens system would exhibit\\none of the largest image separations observed to date\\n($\\\\Delta\\\\vartheta=17.8''$), opening interesting TDC applications.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-10T10:11:16Z\"}"}
