{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21416v1\", \"title\": \"Kolmogorov Cascade as the Governing Mechanism for Intervortex Spacing in\\n  Quantum Turbulence\", \"summary\": \"In this paper, we investigate inertially forced isothermal quantum turbulence\\n(coflow of normal and superfluid components) at temperatures of 1.6 and 2 K.\\nThe experiments are carried out in a large optical cryostat, where\\nquasi-isotropic, homogeneous turbulence is generated using a double oscillating\\ngrid. Turbulence intensity is tuned by varying the grid stroke and frequency.\\nThe flow is probed via 2D and 3D reconstructions of quasi-isodense microsphere\\ntrajectories, from which we extract the large-scale properties of the flow in\\nthe fully turbulent regime for different Reynolds numbers: the turbulent\\nvelocity fluctuations, the energy transfer rate, and the integral length scale.\\nAdditionally, we determine the mean vortex line density $\\\\mathcal{L}$ via\\nattenuation of a second sound standing wave across the entire measurement\\nvolume. Our results confirm with an improved accuracy that the intervortex\\nspacing $\\\\ell =1/\\\\sqrt{\\\\mathcal{L}}$ scales with the Reynolds number\\n$\\\\text{Re}_\\\\kappa$ (based on the quantum of circulation $\\\\kappa$) as\\n$\\\\ell\\\\propto \\\\text{Re}_\\\\kappa^{-3/4}$, with a well-defined numerical prefactor\\nand no observed temperature dependence. This scaling recalls that of the\\ndissipative length scale in classical Kolmogorov (K41) turbulence and it lead\\nprevious authors to interpret $\\\\ell$ as an effective dissipation length scale.\\nHowever, in our temperature range, this interpretation is not consistent with\\nthe apparent temperature independence of the prefactor. Based on those\\narguments, we propose an alternative interpretation that suggests that the\\ninter-vortex distance in coflow turbulence is the consequence of the quantum\\nrestricted depth of the superfluid component energy cascade.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-30T08:17:29Z\"}"}
