{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04967v1\", \"title\": \"Community and hyperedge inference in multiple hypergraphs\", \"summary\": \"Hypergraphs, capable of representing high-order interactions via hyperedges,\\nhave become a powerful tool for modeling real-world biological and social\\nsystems. Inherent relationships within these real-world systems, such as the\\nencoding relationship between genes and their protein products, drive the\\nestablishment of interconnections between multiple hypergraphs. Here, we\\ndemonstrate how to utilize those interconnections between multiple hypergraphs\\nto synthesize integrated information from multiple higher-order systems,\\nthereby enhancing understanding of underlying structures. We propose a model\\nbased on the stochastic block model, which integrates information from multiple\\nhypergraphs to reveal latent high-order structures. Real-world hyperedges\\nexhibit preferential attachment, where certain nodes dominate hyperedge\\nformation. To characterize this phenomenon, our model introduces hyperedge\\ninternal degree to quantify nodes' contributions to hyperedge formation. This\\nmodel is capable of mining communities, predicting missing hyperedges of\\narbitrary sizes within hypergraphs, and inferring inter-hypergraph edges\\nbetween hypergraphs. We apply our model to high-order datasets to evaluate its\\nperformance. Experimental results demonstrate strong performance of our model\\nin community detection, hyperedge prediction, and inter-hypergraph edge\\nprediction tasks. Moreover, we show that our model enables analysis of multiple\\nhypergraphs of different types and supports the analysis of a single hypergraph\\nin the absence of inter-hypergraph edges. Our work provides a practical and\\nflexible tool for analyzing multiple hypergraphs, greatly advancing the\\nunderstanding of the organization in real-world high-order systems.\", \"main_category\": \"cs.SI\", \"categories\": \"cs.SI,cs.LG\", \"published\": \"2025-05-08T05:52:41Z\"}"}
