{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02571v1\", \"title\": \"D$^{0}$-meson-tagged jet axes difference in proton-proton collisions at\\n  $\\\\mathbf{\\\\sqrt{\\\\textit{s}} = 5.02}$ TeV\", \"summary\": \"Heavy-flavor quarks produced in proton-proton (pp) collisions provide a\\nunique opportunity to investigate the evolution of quark-initiated parton\\nshowers from initial hard scatterings to final-state hadrons. By examining jets\\nthat contain heavy-flavor hadrons, this study explores the effects of both\\nperturbative and non-perturbative QCD on jet formation and structure. The\\nangular differences between various jet axes, $\\\\Delta R_{\\\\rm axis}$, offer\\ninsight into the radiation patterns and fragmentation of charm quarks. The\\nfirst measurement of D$^{0}$-tagged jet axes differences in pp collisions at\\n$\\\\sqrt{s}=5.02$ TeV by the ALICE experiment at the LHC is presented for jets\\nwith transverse momentum $p_{\\\\rm T}^{\\\\rm ch~jet} \\\\geq 10$ ${\\\\rm GeV}/c$ and\\nD$^0$ mesons with $p_{\\\\rm T}^{\\\\rm D^{0}} \\\\geq 5$ ${\\\\rm GeV}/c$. In this\\nD$^0$-meson-tagged jet measurement, three jet axis definitions, each with\\ndifferent sensitivities to soft, wide-angle radiation, are used: the Standard\\naxis, Soft Drop groomed axis, and Winner-Takes-All axis. Measurements of the\\nradial distributions of D$^0$ mesons with respect to the jet axes, $\\\\Delta\\nR_{\\\\mathrm{axis-D^0}}$, are reported, along with the angle, $\\\\Delta\\nR_{\\\\mathrm{axis}}$, between the three jet axes. The D$^{0}$ meson emerges as\\nthe leading particle in these jets, closely aligning with the Winner-Takes-All\\naxis and diverging from the Standard jet axis. The results also examine how\\nvarying the sensitivity to soft radiation with grooming influences the\\norientation of the Soft Drop jet axis, and uncover that charm-jet structure is\\nmore likely to survive grooming when the Soft Drop axis is further from the\\nD$^{0}$ direction, providing further evidence of the dead-cone effect recently\\nmeasured by ALICE.\", \"main_category\": \"hep-ex\", \"categories\": \"hep-ex,nucl-ex\", \"published\": \"2025-04-03T13:37:15Z\"}"}
