{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03620v1\", \"title\": \"Active Learning for Predicting Polymer/Plasticizer Phase Behaviour\", \"summary\": \"Plasticisers (PLs) are small additives commonly incorporated into polymer\\ncomposites to enhance processability and improve mechanical properties. Their\\neffectiveness depends heavily on their miscibility within the polymer melt, yet\\nisolating the influence of plasticiser properties, such as flexibility and\\ngeometry, remains challenging. This difficulty stems from the time consuming\\nnature of experimental work and also from the presence of impurities and\\ninconsistencies that often arise during synthesis and testing. Atomistic\\nsimulations face similar difficulties as phase separation can occur over\\nmicrosecond timescales, which can be computationally expensive. In this work,\\nwe use a coarse-grained bead-and-spring model to screen plasticisers of varying\\nflexibilities and geometries to build a pool-based active learning procedure\\nwhich characterizes their design space and its effect on polymer/plasticiser\\nmiscibility. We perform an active learning cycle with a random forest model and\\nan uncertainty/random hybrid query strategy to determine the miscibility\\nbehaviour of queried molecules. This is evaluated through computationally\\nexpensive, coarse-grained polymer/plasticiser simulations of a\\ncis-(1,4)-polyisoprene melt filled with small hydrocarbon additives of varying\\nsizes and rigidities. Through this, we are able to efficiently improve model\\nperformance in order to make predictions on the entire PL design space. Such\\nfindings enable us to determine a new set of general plasticiser design rules,\\nsuitable for non-polar molecules, which expands on our previous work. To\\nfurther prove this, we perform atomistic simulations of\\npolyisoprene/plasticiser systems which are approximately back-mapped from their\\ncoarse-grained equivalents. Our findings indicate that the\\npolyisoprene/plasticiser phase behaviour, observed using the coarse-grained\\nmodel for PLs in the absence of side chains, is valid.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-05-06T15:18:20Z\"}"}
