{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03509v1\", \"title\": \"AnomalyMatch: Discovering Rare Objects of Interest with Semi-supervised\\n  and Active Learning\", \"summary\": \"Anomaly detection in large datasets is essential in fields such as astronomy\\nand computer vision; however, supervised methods typically require extensive\\nanomaly labelling, which is often impractical. We present AnomalyMatch, an\\nanomaly detection framework combining the semi-supervised FixMatch algorithm\\nusing EfficientNet classifiers with active learning. By treating anomaly\\ndetection as a semi-supervised binary classification problem, we efficiently\\nutilise limited labelled and abundant unlabelled images. We allow iterative\\nmodel refinement in a user interface for expert verification of high-confidence\\nanomalies and correction of false positives. Built for astronomical data,\\nAnomalyMatch generalises readily to other domains facing similar data\\nchallenges. Evaluations on the GalaxyMNIST astronomical dataset and the\\nminiImageNet natural-image benchmark under severe class imbalance (1% anomalies\\nfor miniImageNet) display strong performance: starting from five to ten\\nlabelled anomalies and after three active learning cycles, we achieve an\\naverage AUROC of 0.95 (miniImageNet) and 0.86 (GalaxyMNIST), with respective\\nAUPRC of 0.77 and 0.71. After active learning cycles, anomalies are ranked with\\n71% (miniImageNet) to 93% precision in the 1% of the highest-ranked images.\\nAnomalyMatch is tailored for large-scale applications, efficiently processing\\npredictions for 100 million images within three days on a single GPU.\\nIntegrated into ESAs Datalabs platform, AnomalyMatch facilitates targeted\\ndiscovery of scientifically valuable anomalies in vast astronomical datasets.\\nOur results underscore the exceptional utility and scalability of this approach\\nfor anomaly discovery, highlighting the value of specialised approaches for\\ndomains characterised by severe label scarcity.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,astro-ph.IM\", \"published\": \"2025-05-06T13:19:15Z\"}"}
