{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16528v1\", \"title\": \"Quantitative Strategy Templates\", \"summary\": \"This paper presents (permissive) \\\\emph{Quantitative Strategy Templates}\\n(QaSTels) to succinctly represent infinitely many winning strategies in\\ntwo-player energy and mean-payoff games. This transfers the recently introduced\\nconcept of \\\\emph{Permissive (qualitative) Strategy Templates} (PeSTels) for\\n$\\\\omega$-regular games to games with quantitative objectives. We provide the\\ntheoretical and algorithmic foundations of (i) QaSTel synthesis, and (ii) their\\n(incremental) combination with PeSTels for games with mixed quantitative and\\nqualitative objectives. Using a prototype implementation of our synthesis\\nalgorithms, we demonstrate empirically that QaSTels extend the advantageous\\nproperties of strategy templates over single winning strategies -- known from\\nPeSTels -- to games with (additional) quantitative objectives. This includes\\n(i) the enhanced robustness of strategies due to their runtime-adaptability,\\nand (ii) the compositionality of templates w.r.t. incrementally arriving\\nobjectives. We use control-inspired examples to illustrate these superior\\nproperties of QaSTels for CPS design.\", \"main_category\": \"cs.GT\", \"categories\": \"cs.GT\", \"published\": \"2025-04-23T08:53:10Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16544v1\", \"title\": \"On the zoology of 2d $\\\\mathcal{N}=(0,2)$ dualities gauge theories with\\n  antisymmetric matter\", \"summary\": \"In this paper we investigate and propose new dualities involving 2d gauge\\ntheories with $\\\\mathcal{N}=(0,2)$ supersymmetry. In the first part of the paper\\nwe focus on $\\\\mathrm{SU}(n)$ gauge theories with two antisymmetric chirals. The\\ngauge theories are non-anomalous if we consider, in addition to such matter\\ncontent, $n_f$ fundamental and $n_a$ antifundamental chirals, provided the\\nconstraint $n_f+n_a=4$. By exploring the five possibile scenarios arising from\\nthis constraint we provide in each case evidences of a dual LG description, by\\nmatching the 't Hooft anomalies and deriving the relation between the elliptic\\ngenera in terms of other more fundamental dualities. In the second part of the\\npaper we provide a 4d origin for a gauge/LG duality already stated in the\\nliterature, that does not descend from any known s-confining duality. In the\\nlast part of the paper we focus on dualities for $\\\\mathrm{SU}(n)$ and\\n$\\\\mathrm{USp}(2n)$ models with antisymmetric Fermi multiplets, obtained from\\ndimensional reduction of 4d parent dualities.\", \"main_category\": \"hep-th\", \"categories\": \"hep-th\", \"published\": \"2025-04-23T09:19:30Z\"}"}
