{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10140v1\", \"title\": \"The topology of synergy: linking topological and information-theoretic\\n  approaches to higher-order interactions in complex systems\", \"summary\": \"The study of irreducible higher-order interactions has become a core topic of\\nstudy in complex systems. Two of the most well-developed frameworks,\\ntopological data analysis and multivariate information theory, aim to provide\\nformal tools for identifying higher-order interactions in empirical data.\\nDespite similar aims, however, these two approaches are built on markedly\\ndifferent mathematical foundations and have been developed largely in parallel.\\nIn this study, we present a head-to-head comparison of topological data\\nanalysis and information-theoretic approaches to describing higher-order\\ninteractions in multivariate data; with the aim of assessing the similarities\\nand differences between how the frameworks define ``higher-order structures.\\\"\\nWe begin with toy examples with known topologies, before turning to\\nnaturalistic data: fMRI signals collected from the human brain. We find that\\nintrinsic, higher-order synergistic information is associated with\\nthree-dimensional cavities in a point cloud: shapes such as spheres are\\nsynergy-dominated. In fMRI data, we find strong correlations between\\nsynergistic information and both the number and size of three-dimensional\\ncavities. Furthermore, we find that dimensionality reduction techniques such as\\nPCA preferentially represent higher-order redundancies, and largely fail to\\npreserve both higher-order information and topological structure, suggesting\\nthat common manifold-based approaches to studying high-dimensional data are\\nsystematically failing to identify important features of the data. These\\nresults point towards the possibility of developing a rich theory of\\nhigher-order interactions that spans topological and information-theoretic\\napproaches while simultaneously highlighting the profound limitations of more\\nconventional methods.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT,q-bio.NC\", \"published\": \"2025-04-14T11:53:48Z\"}"}
