{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16741v1\", \"title\": \"Search Timelines: Visualizing Search History to Enable Cross-Session\\n  Exploratory Search\", \"summary\": \"Purpose: The timespan over which exploratory searching can occur, as well as\\nthe scope and volume of the search activities undertaken, can make it difficult\\nfor searchers to remember key details about their search activities. These\\ndifficulties are present both in the midst of searching as well as when\\nresuming a search that spans multiple sessions. In this paper, we present a\\nsearch interface designed to support cross-session exploratory search in a\\npublic digital library context. Methods: Search Timelines provides a\\nvisualization of current and past search activities via a dynamic timeline of\\nthe search activity (queries and saved resources). This timeline is presented\\nat two levels of detail. An overview timeline is provided alongside the search\\nresults in a typical search engine results page design. A detailed timeline is\\nprovided in the workspace, where searchers can review the history of their\\nsearch activities and their saved resources. A controlled laboratory study was\\nconducted to compare this approach to a baseline interface modelled after a\\ntypical public digital library search/workspace interface. Results:\\nParticipants who used Search Timelines reported higher levels of user\\nengagement, usability, and perceived knowledge gain, during an initial search\\nsession and when resuming the search after a 7-8 day interval. This came at the\\nexpense of the searchers taking more time to complete the search task, which we\\nview as positive evidence of engagement in cross-session exploratory search\\nprocesses. Conclusion: Search Timelines serves as an example of how lightweight\\nvisualization approaches can be used to enhance typical search interface\\ndesigns to support exploratory search. The results highlight the value of\\nproviding persistent representations of past search activities within the\\nsearch interface.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC,cs.IR\", \"published\": \"2025-04-23T14:10:36Z\"}"}
