{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01590v1\", \"title\": \"KTaO3(001) Preparation Methods in Vacuum: Effects on Surface\\n  Stoichiometry, Crystallography, and in-gap States\", \"summary\": \"KTaO3 single crystals with different orientations are used as substrates for\\nthe epitaxial growth of thin films and/or as hosts for two-dimensional electron\\ngases. Due to the polar nature of the KTaO3(001) surface, one can expect\\ndifficulties and challenges to arise in its preparation. Maintaining good\\ninsulating characteristics without adding undesirable in-gap electronic states,\\nobtaining good crystalline order up to the top surface layer, a sufficiently\\nflat surface, and complete cleanliness of the surface (without water, C or OH\\ncontaminants), are in general difficult conditions to accomplish\\nsimultaneously. Cleaving in vacuum is likely the best option for obtaining a\\nclean surface. However, since KTaO3 is cubic and lacks a well-defined cleavage\\nplane, this method is notsuitable for sample growth or reproducible device\\nfabrication. Here, we systematically evaluate the effect of typical preparation\\nmethods applied on the surfaces of KTaO3(001) single crystals. In particular,\\nwe used annealing in vacuum at different temperatures, light sputtering with\\nAr+ ions at low energy (500 eV) followed by annealing, heavy Ar+ ion\\nbombardment and annealing, and grazing Ar+ ion bombardment under continuous\\nazimuthal rotation combined with both annealing in vacuum and in O2 atmosphere.\\nPossible side effects after each treatment are evaluated by a combination of\\ntechniques, including low-energy ion scattering at forward angles, Auger\\nelectron spectroscopy, low-energy electron energy loss, X-ray photoelectron\\nspectroscopy, low-energy electron diffraction, and time of flightsecondary ion\\nmass spectrometry. Advantages and shortcomings of each preparation method are\\ndiscussed in detail.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-02T10:52:57Z\"}"}
