{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20815v1\", \"title\": \"A Teacher-Student MPC-PPO Coupled Reinforcement Learning Framework for\\n  Winter Temperature Control of Solar Greenhouses in Northern China\", \"summary\": \"Solar greenhouses are crucial infrastructure of modern agricultural\\nproduction in northern China. However, highly fluctuating temperature in winter\\nseason results in poor greenhouse temperature control, which affects crop\\ngrowth and increases energy consumption. To tackle these challenges, an\\nadvanced control system that can efficiently optimize multiple objectives under\\ndramatic climate conditions is essential. Therefore, this study propose a model\\npredictive control-coupled proximal policy optimization (MPC-PPO) control\\nframework. A teacher-student control framework is constructed in which the MPC\\ngenerating high-quality control experiences to guide the PPO agent's learning\\nprocess. An adaptive dynamic weighting mechanism is employed to balance the\\ninfluence of MPC experiences during PPO training. Evaluation conducted in solar\\ngreenhouses across three provinces in northern China (Beijing, Hebei, and\\nShandong) demonstrates that: (1) the MPC-PPO method achieved the highest\\ntemperature control performance (96.31 on a 100-point scale), with a 5.46-point\\nimprovement compared to the non-experience integration baseline, when reduced\\nstandard deviation by nearly half and enhanced exploration efficiency; (2) the\\nMPC-PPO method achieved a ventilation control reward of 99.19, optimizing\\nventilation window operations with intelligent time-differentiated strategies\\nthat reduced energy loss during non-optimal hours; (3) feature analysis reveals\\nthat historical window opening, air temperature, and historical temperature are\\nthe most influential features for effective control, i.e., SHAP values of\\n7.449, 4.905, and 4.747 respectively; and (4) cross-regional tests indicated\\nthat MPC-PPO performs best in all test regions, confirming generalization of\\nthe method.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC\", \"published\": \"2025-04-29T14:32:40Z\"}"}
