{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05423v1\", \"title\": \"TransProQA: an LLM-based literary Translation evaluation metric with\\n  Professional Question Answering\", \"summary\": \"The impact of Large Language Models (LLMs) has extended into literary\\ndomains. However, existing evaluation metrics prioritize mechanical accuracy\\nover artistic expression and tend to overrate machine translation (MT) as being\\nsuperior to experienced professional human translation. In the long run, this\\nbias could result in a permanent decline in translation quality and cultural\\nauthenticity. In response to the urgent need for a specialized literary\\nevaluation metric, we introduce TransProQA, a novel, reference-free, LLM-based\\nquestion-answering (QA) framework designed specifically for literary\\ntranslation evaluation. TransProQA uniquely integrates insights from\\nprofessional literary translators and researchers, focusing on critical\\nelements in literary quality assessment such as literary devices, cultural\\nunderstanding, and authorial voice. Our extensive evaluation shows that while\\nliterary-finetuned XCOMET-XL yields marginal gains, TransProQA substantially\\noutperforms current metrics, achieving up to 0.07 gain in correlation (ACC-EQ\\nand Kendall's tau) and surpassing the best state-of-the-art (SOTA) metrics by\\nover 15 points in adequacy assessments. Incorporating professional translator\\ninsights as weights further improves performance, highlighting the value of\\ntranslator inputs. Notably, TransProQA approaches human-level evaluation\\nperformance comparable to trained linguistic annotators. It demonstrates broad\\napplicability to open-source models such as LLaMA3.3-70b and Qwen2.5-32b,\\nindicating its potential as an accessible and training-free literary evaluation\\nmetric and a valuable tool for evaluating texts that require local processing\\ndue to copyright or ethical considerations.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.AI\", \"published\": \"2025-05-08T17:12:56Z\"}"}
