{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04526v1\", \"title\": \"DFVO: Learning Darkness-free Visible and Infrared Image Disentanglement\\n  and Fusion All at Once\", \"summary\": \"Visible and infrared image fusion is one of the most crucial tasks in the\\nfield of image fusion, aiming to generate fused images with clear structural\\ninformation and high-quality texture features for high-level vision tasks.\\nHowever, when faced with severe illumination degradation in visible images, the\\nfusion results of existing image fusion methods often exhibit blurry and dim\\nvisual effects, posing major challenges for autonomous driving. To this end, a\\nDarkness-Free network is proposed to handle Visible and infrared image\\ndisentanglement and fusion all at Once (DFVO), which employs a cascaded\\nmulti-task approach to replace the traditional two-stage cascaded training\\n(enhancement and fusion), addressing the issue of information entropy loss\\ncaused by hierarchical data transmission. Specifically, we construct a\\nlatent-common feature extractor (LCFE) to obtain latent features for the\\ncascaded tasks strategy. Firstly, a details-extraction module (DEM) is devised\\nto acquire high-frequency semantic information. Secondly, we design a hyper\\ncross-attention module (HCAM) to extract low-frequency information and preserve\\ntexture features from source images. Finally, a relevant loss function is\\ndesigned to guide the holistic network learning, thereby achieving better image\\nfusion. Extensive experiments demonstrate that our proposed approach\\noutperforms state-of-the-art alternatives in terms of qualitative and\\nquantitative evaluations. Particularly, DFVO can generate clearer, more\\ninformative, and more evenly illuminated fusion results in the dark\\nenvironments, achieving best performance on the LLVIP dataset with 63.258 dB\\nPSNR and 0.724 CC, providing more effective information for high-level vision\\ntasks. Our code is publicly accessible at https://github.com/DaVin-Qi530/DFVO.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-05-07T15:59:45Z\"}"}
