{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14884v1\", \"title\": \"Memory-Augmented Dual-Decoder Networks for Multi-Class Unsupervised\\n  Anomaly Detection\", \"summary\": \"Recent advances in unsupervised anomaly detection (UAD) have shifted from\\nsingle-class to multi-class scenarios. In such complex contexts, the increasing\\npattern diversity has brought two challenges to reconstruction-based\\napproaches: (1) over-generalization: anomalies that are subtle or share\\ncompositional similarities with normal patterns may be reconstructed with high\\nfidelity, making them difficult to distinguish from normal instances; and (2)\\ninsufficient normality reconstruction: complex normal features, such as\\nintricate textures or fine-grained structures, may not be faithfully\\nreconstructed due to the model's limited representational capacity, resulting\\nin false positives. Existing methods typically focus on addressing the former,\\nwhich unintentionally exacerbate the latter, resulting in inadequate\\nrepresentation of intricate normal patterns. To concurrently address these two\\nchallenges, we propose a Memory-augmented Dual-Decoder Networks (MDD-Net). This\\nnetwork includes two critical components: a Dual-Decoder Reverse Distillation\\nNetwork (DRD-Net) and a Class-aware Memory Module (CMM). Specifically, the\\nDRD-Net incorporates a restoration decoder designed to recover normal features\\nfrom synthetic abnormal inputs and an identity decoder to reconstruct features\\nthat maintain the anomalous semantics. By exploiting the discrepancy between\\nfeatures produced by two decoders, our approach refines anomaly scores beyond\\nthe conventional encoder-decoder comparison paradigm, effectively reducing\\nfalse positives and enhancing localization accuracy. Furthermore, the CMM\\nexplicitly encodes and preserves class-specific normal prototypes, actively\\nsteering the network away from anomaly reconstruction. Comprehensive\\nexperimental results across several benchmarks demonstrate the superior\\nperformance of our MDD-Net framework over current SoTA approaches in\\nmulti-class UAD tasks.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-21T06:29:04Z\"}"}
