{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17639v1\", \"title\": \"Hot Diggity Dog: A complete analysis of the extreme molecular gas and\\n  dust properties at kpc scales in the hyper-luminous hot, dust-obscured galaxy\\n  W2246-0526\", \"summary\": \"Hot dust-obscured galaxies (Hot DOGs), the most infrared (IR) luminous\\nobjects selected by the WISE all-sky mid-IR survey, have yielded a sample of\\nintrinsically luminous quasars (QSOs) with obscured nuclear activity and hot\\ndust temperatures. The molecular gas excitation properties have yet to be\\nexamined in detail under such extreme conditions. Here we study the most far-IR\\nluminous WISE Hot DOG W2246-0526, focusing on the central host galaxy. Multi-J\\nCO transition measurements at J=2-1, 5-4, 7-6, 12-11, and 17-16 provide the\\nmost well-sampled CO excitation ladder of any WISE Hot DOG to date, providing\\nthe first self-consistent modeling constraints on the molecular gas and dust\\nproperties. We implement a state-of-the-art TUrbulent Non-Equilibrium Radiative\\ntransfer model (TUNER) that simultaneously models both the line and dust\\ncontinuum measurements. Due to a combination of high molecular gas densities\\nand high kinetic temperatures, this extreme CO spectral line energy\\ndistribution peaks at J = 10 to 12, likely making this the most highly excited\\ngalaxy ever reported. We derive the alpha_CO conversion factors and conclude\\nthat (J=3-7) CO line luminosities trace the bulk of the molecular gas mass.\\nW2246-0526 is a rapidly evolving system, with a high value of the molecular gas\\nkinetic temperature versus dust temperature T_k / T_d ~ 3.9, reflecting\\npreviously reported shocks and outflows injecting kinetic energy within the\\ncentral kpc of this host. This first comprehensive simultaneous modeling of\\nboth the molecular gas and dust in any object within the WISE-selected Hot DOG\\nsample motivates obtaining well-sampled dust and line spectral energy\\ndistributions to better understand the conditions within these short-lived\\nepisodes in galaxy evolution that are associated with the most obscured\\nsupermassive black hole activity.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-24T15:10:43Z\"}"}
