{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07840v1\", \"title\": \"Understanding Learner-LLM Chatbot Interactions and the Impact of\\n  Prompting Guidelines\", \"summary\": \"Large Language Models (LLMs) have transformed human-computer interaction by\\nenabling natural language-based communication with AI-powered chatbots. These\\nmodels are designed to be intuitive and user-friendly, allowing users to\\narticulate requests with minimal effort. However, despite their accessibility,\\nstudies reveal that users often struggle with effective prompting, resulting in\\ninefficient responses. Existing research has highlighted both the limitations\\nof LLMs in interpreting vague or poorly structured prompts and the difficulties\\nusers face in crafting precise queries. This study investigates learner-AI\\ninteractions through an educational experiment in which participants receive\\nstructured guidance on effective prompting. We introduce and compare three\\ntypes of prompting guidelines: a task-specific framework developed through a\\nstructured methodology and two baseline approaches. To assess user behavior and\\nprompting efficacy, we analyze a dataset of 642 interactions from 107 users.\\nUsing Von NeuMidas, an extended pragmatic annotation schema for LLM interaction\\nanalysis, we categorize common prompting errors and identify recurring\\nbehavioral patterns. We then evaluate the impact of different guidelines by\\nexamining changes in user behavior, adherence to prompting strategies, and the\\noverall quality of AI-generated responses. Our findings provide a deeper\\nunderstanding of how users engage with LLMs and the role of structured\\nprompting guidance in enhancing AI-assisted communication. By comparing\\ndifferent instructional frameworks, we offer insights into more effective\\napproaches for improving user competency in AI interactions, with implications\\nfor AI literacy, chatbot usability, and the design of more responsive AI\\nsystems.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC,cs.AI,cs.CL\", \"published\": \"2025-04-10T15:20:43Z\"}"}
