{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20028v1\", \"title\": \"Textured growth and electrical characterization of Zinc Sulfide on\\n  back-end-of-the-line (BEOL) compatible substrates\", \"summary\": \"Scaling of transistors has enabled continuous improvements in logic device\\nperformance, especially through materials engineering. However, surpassing\\nhorizontal limitations in chip manufacturing requires a vertical, third\\ndimension. Three-dimensional integration of high-performance logic demands\\nsolving the challenge of low-temperature (less than 450{\\\\deg}C) synthesis of\\nhigh-mobility n-type and p-type semiconductor thin films for back-end-of-line\\n(BEOL) compatible transistors. Metal oxides, particularly indium oxides alloyed\\nwith gallium and tungsten, are promising n-type channel materials, but suitable\\np-type materials for BEOL remain scarce. Zinc sulfide (ZnS), a wide band-gap\\nsemiconductor, shows room-temperature p-type conductivity when doped with\\ncopper and crystallizes below 400{\\\\deg}C. Here, we report growth of crystalline\\nZnS thin films by pulsed laser deposition on amorphous and polycrystalline\\nsurfaces including silicon nitride, thermal silicon dioxide, yttrium oxide,\\nhafnium dioxide, sapphire, platinum, and titanium nitride. X-ray diffraction\\nreveals out-of-plane texturing across all surfaces, while grazing incidence\\nwide-angle X-ray scattering probes in-plane crystalline quality. Surface and\\ninterface properties are assessed using X-ray reflectivity and atomic force\\nmicroscopy. Electrical characterization via J-V measurements (ZnS on Pt) and\\nmetal-oxide-semiconductor capacitor (ZnS on silicon dioxide) measurements show\\nlow leakage current ($10^{-5} A/cm^2$ at 0.40 MV/cm) and bilayer capacitor\\nbehavior, suggesting ZnS is highly intrinsic with minimal electrically active\\ndefects. Further work on doping ZnS with copper or other p-type elements is\\nneeded to realize ZnS as a dopable wide band-gap semiconductor for BEOL\\nintegration. This work demonstrates a novel thin-film growth method for sulfide\\nsemiconductors under BEOL-compatible conditions.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,physics.app-ph\", \"published\": \"2025-04-28T17:51:54Z\"}"}
