{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04479v1\", \"title\": \"Spectroscopic investigations of a filament reconnecting with coronal\\n  loops during a two-ribbon solar flare\", \"summary\": \"In the standard 2D model of eruption, the eruption of a magnetic flux rope is\\nassociated with magnetic reconnection occurring beneath it. However, in 3D,\\nadditional reconnection geometries are possible, in particular the AR-RF, where\\nexternal reconnection involving the overlying arcades (A) and erupting flux\\nrope (R) turns into another arcade and a flare loop (F). This process results\\nin the drifting of the legs of the erupting flux rope. We investigated\\nspectroscopic signatures of such AR-RF reconnection occurring in an erupting\\nfilament reconnecting with coronal arcades during a two-ribbon flare. The\\nevolution of the erupting filament eruption is examined using observations by\\nthe Atmospheric Imaging Assembly (AIA) and the Interface Region Imaging\\nSpectrograph (IRIS). As the filament rises into the corona, it reconnects with\\nthe surrounding arcade of coronal loops with localized brightenings, resulting\\nin the disappearance of the coronal loops and formation of a hot flux rope,\\nshowing slipping motion of its footpoints extending to the previous footpoints\\nof the coronal loops (AR-RF reconnection) as predicted by the 3D extensions to\\nthe Standard solar flare model. These brightenings are accompanied by the\\npresence of strong blue-shifts in both the IRIS Si IV and Mg II lines, upto\\nabout 200 km/s. The lines are also extremely wide, with non-thermal widths\\nabove 100 km/s. Furthermore, a strongly non-Gaussian profile of the most\\nblue-shifted component is detected at the start of the AR-RF reconnection,\\nindicating the presence of accelerated particles and MHD turbulence, and\\nassociated with the appearance of hot plasma in the AIA 94 A passband. For the\\nfirst time, an observation has been reported in which the IRIS slit\\nsuccessfully captures AR-RF reconnection between a filament and overlying\\narcades, resulting in strong blue-shifts and very broad line profiles.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-05-07T14:49:55Z\"}"}
