{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07523v1\", \"title\": \"Lifetime-limited Gigahertz-frequency Mechanical Oscillators with\\n  Millisecond Coherence Times\", \"summary\": \"High-frequency mechanical oscillators with long coherence times are essential\\nto realizing a variety of high-fidelity quantum sensors, transducers, and\\nmemories. However, the unprecedented coherence times needed for quantum\\napplications require exquisitely sensitive new techniques to probe the material\\norigins of phonon decoherence and new strategies to mitigate decoherence in\\nmechanical oscillators. Here, we combine non-invasive laser spectroscopy\\ntechniques with materials analysis to identify key sources of phonon\\ndecoherence in crystalline media. Using micro-fabricated high-overtone bulk\\nacoustic-wave resonators ($\\\\mu$HBARs) as an experimental testbed, we identify\\nphonon-surface interactions as the dominant source of phonon decoherence in\\ncrystalline quartz; lattice distortion, subsurface damage, and high\\nconcentration of elemental impurities near the crystal surface are identified\\nas the likely causes. Removal of this compromised surface layer using an\\noptimized polishing process is seen to greatly enhance coherence times,\\nenabling $\\\\mu$HBARs with Q-factors of > 240 million at 12 GHz frequencies,\\ncorresponding to > 6 ms phonon coherence times and record-level f-Q products.\\nComplementary phonon linewidth and time-domain ringdown measurements, performed\\nusing a new Brillouin-based pump-probe spectroscopy technique, reveal\\nnegligible dephasing within these oscillators. Building on these results, we\\nidentify a path to > 100 ms coherence times as the basis for high-frequency\\nquantum memories. These findings clearly demonstrate that, with enhanced\\ncontrol over surfaces, dissipation and noise can be significantly reduced in a\\nwide range of quantum systems.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cond-mat.mtrl-sci\", \"published\": \"2025-04-10T07:41:47Z\"}"}
