{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06907v1\", \"title\": \"Thermodynamic phase transition and Joule-Thomson expansion of a quantum\\n  corrected black hole in anti-de Sitter spacetime\", \"summary\": \"The thermodynamics in the extended phase space of a quantum corrected black\\nhole (BH) proposed recently is presented in this work. Our study shows that the\\nphase transition behavior of the BH is analogous to that of conventional\\nSchwarzschild BH in anti-de Sitter (AdS) space; however, a critical temperature\\nexists such that when the BH temperature exceeds this critical value, the small\\nBH phase and the large BH phase become separated, and no phase transition\\noccurs. Due to the introduction of the quantum parameter $\\\\xi$, the BH equation\\nof state splits into two branches. One branch reduces to the Schwarzschild-AdS\\ncase as $\\\\xi\\\\to0$, with its phase transition pressure lower than the critical\\npressure; another branch's phase transition pressure is greater than the\\ncritical pressure. We further investigate the temperature curve and the\\nisobaric heat capacity of the BH. The results show that the $T-r_{+}$ phase\\ntransition and heat capacity behavior are very similar to those of the\\nSchwarzschild-AdS BH, with the small BH phase exhibiting a negative heat\\ncapacity (unstable phase) and the large BH phase exhibiting a positive heat\\ncapacity (stable phase). Furthermore, owing to the corrected first law, the\\nGibbs free energy curve becomes smooth near the phase transition point.\\nMoreover, we examine the Joule-Thomson expansion of the BH. The constant mass\\nexpansion process of the BH is divided into two stages: in the earlier stage,\\nthe BH pressure increases until it reaches a maximum; in the later stage, the\\npressure gradually decreases. Consequently, the inversion curve is also divided\\ninto two branches: one corresponding to the inversion point that may be\\nexperienced during the earlier stage and the other corresponding to the\\ninversion point during the later stage. In addition, each expansion stage has a\\nminimum inversion mass, below which any BH (in each respective stage) has no\\ninversion point.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc\", \"published\": \"2025-04-09T14:09:26Z\"}"}
