{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17474v1\", \"title\": \"Enhanced Sample Selection with Confidence Tracking: Identifying\\n  Correctly Labeled yet Hard-to-Learn Samples in Noisy Data\", \"summary\": \"We propose a novel sample selection method for image classification in the\\npresence of noisy labels. Existing methods typically consider small-loss\\nsamples as correctly labeled. However, some correctly labeled samples are\\ninherently difficult for the model to learn and can exhibit high loss similar\\nto mislabeled samples in the early stages of training. Consequently, setting a\\nthreshold on per-sample loss to select correct labels results in a trade-off\\nbetween precision and recall in sample selection: a lower threshold may miss\\nmany correctly labeled hard-to-learn samples (low recall), while a higher\\nthreshold may include many mislabeled samples (low precision). To address this\\nissue, our goal is to accurately distinguish correctly labeled yet\\nhard-to-learn samples from mislabeled ones, thus alleviating the trade-off\\ndilemma. We achieve this by considering the trends in model prediction\\nconfidence rather than relying solely on loss values. Empirical observations\\nshow that only for correctly labeled samples, the model's prediction confidence\\nfor the annotated labels typically increases faster than for any other classes.\\nBased on this insight, we propose tracking the confidence gaps between the\\nannotated labels and other classes during training and evaluating their trends\\nusing the Mann-Kendall Test. A sample is considered potentially correctly\\nlabeled if all its confidence gaps tend to increase. Our method functions as a\\nplug-and-play component that can be seamlessly integrated into existing sample\\nselection techniques. Experiments on several standard benchmarks and real-world\\ndatasets demonstrate that our method enhances the performance of existing\\nmethods for learning with noisy labels.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-24T12:07:14Z\"}"}
