{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11283v1\", \"title\": \"Influence of the magnetic activity cycle on mean density and acoustic\\n  radius inversions\", \"summary\": \"Asteroseismic modelling is crucial for upcoming missions like PLATO,\\nCubeSpec, and Roman. Despite significant progress, discrepancies between\\nobservations and theoretical predictions introduce biases in stellar\\ncharacterisation at the precision required by PLATO. Current models typically\\nignore magnetic activity, assuming its effects are hidden within surface\\neffects. However, recent studies have shown significant impacts of magnetic\\nactivity on the Sun's asteroseismic characterisation using forward modelling.\\nUsing GOLF and BiSON observations of two full solar activity cycles, we\\nquantified the impact of magnetic activity on solar mean density and acoustic\\nradius inversions. Observations were segmented into yearly overlapping\\nsnapshots, each offset by 91.25 days. Inversions were performed for each\\nsnapshot to determine mean density and acoustic radius, tracking their temporal\\nevolution and estimating systematic uncertainty due to magnetic activity. We\\nobserved a clear imprint of the magnetic activity cycle on solar mean density\\nand acoustic radius through helioseismic inversions, consistent across GOLF and\\nBiSON datasets. This imprint is the largest source of systematic uncertainty in\\nsolar asteroseismic characterisation. Including low radial-order modes\\nmitigates these effects more significantly than previously measured for other\\nstellar variables. We recommend asteroseismic values for solar mean density\\n(1.4104 \\\\pm 0.0051 g/cm3) and acoustic radius (3722.0 \\\\pm 4.1 s), averaged over\\ntwo activity cycles. These values account for major systematic errors,\\nachieving high precision (0.36% for mean density and 0.11% for acoustic\\nradius). These results are promising for high-precision characterisation of\\nSun-like stars, a better-constrained mean density being able to enhance the\\nprecision of stellar radius estimate, which is crucial for exoplanetary system\\ncharacterisation.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.EP\", \"published\": \"2025-04-15T15:22:51Z\"}"}
