{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11873v1\", \"title\": \"Transferable Deployment of Semantic Edge Inference Systems via\\n  Unsupervised Domain Adaption\", \"summary\": \"This paper investigates deploying semantic edge inference systems for\\nperforming a common image clarification task. In particular, each system\\nconsists of multiple Internet of Things (IoT) devices that first locally encode\\nthe sensing data into semantic features and then transmit them to an edge\\nserver for subsequent data fusion and task inference. The inference accuracy is\\ndetermined by efficient training of the feature encoder/decoder using labeled\\ndata samples. Due to the difference in sensing data and communication channel\\ndistributions, deploying the system in a new environment may induce high costs\\nin annotating data labels and re-training the encoder/decoder models. To\\nachieve cost-effective transferable system deployment, we propose an efficient\\nDomain Adaptation method for Semantic Edge INference systems (DASEIN) that can\\nmaintain high inference accuracy in a new environment without the need for\\nlabeled samples. Specifically, DASEIN exploits the task-relevant data\\ncorrelation between different deployment scenarios by leveraging the techniques\\nof unsupervised domain adaptation and knowledge distillation. It devises an\\nefficient two-step adaptation procedure that sequentially aligns the data\\ndistributions and adapts to the channel variations. Numerical results show\\nthat, under a substantial change in sensing data distributions, the proposed\\nDASEIN outperforms the best-performing benchmark method by 7.09% and 21.33% in\\ninference accuracy when the new environment has similar or 25 dB lower channel\\nsignal to noise power ratios (SNRs), respectively. This verifies the\\neffectiveness of the proposed method in adapting both data and channel\\ndistributions in practical transfer deployment applications.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.SY,eess.SY\", \"published\": \"2025-04-16T08:50:51Z\"}"}
