{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10130v1\", \"title\": \"A parametrized spin-precessing inspiral-merger-ringdown waveform model\\n  for tests of general relativity\", \"summary\": \"The coalescence of binary black holes (BBHs) provides a unique arena to test\\ngeneral relativity (GR) in the dynamical, strong-field regime. To this end, we\\npresent pSEOBNRv5PHM, a parametrized, multipolar, spin-precessing waveform\\nmodel for BBHs in quasicircular orbits, built within the effective-one-body\\nformalism. Compared to its predecessor, pSEOBNRv4HM, our model introduces\\nparametrized deviations from GR not only in the plunge-merger-ringdown stages,\\nbut also in the inspiral phase through modifications to the conservative\\ndynamics. Additionally, it incorporates, for the first time, spin-precession\\neffects. The free deviation parameters can be used to perform null tests of GR\\nusing current and future gravitational-wave observations. We validate\\npSEOBNRv5PHM through Bayesian parameter estimation, focusing on the\\nquasinormal-mode frequency and damping time of the $(\\\\ell,m,n) = (2,2,0)$ mode.\\nOur analysis of synthetic signals from numerical-relativity (NR) simulations of\\nhighly precessing BH mergers shows that, while pSEOBNRv5PHM correctly recovers\\nconsistency with GR, neglecting spin precession can lead to false detections of\\ndeviations from GR even at current detector sensitivity. Conversely, when\\nanalyzing a synthetic signal from a NR simulation of a binary boson-star\\nmerger, the model successfully identifies a deviation from a GR BBH signal.\\nFinally, we reanalyze 12 events from the third Gravitational-Wave Transient\\nCatalog. Using a hierarchical combination of these events, we constrain\\nfractional deviations in the frequency and damping time of the $(2,2,0)$\\nquasinormal-mode to $\\\\delta f_{220}=0.00_{-0.06}^{+0.06}$ and $\\\\delta\\n\\\\tau_{220}=0.15_{-0.24}^{+0.26}$ at 90% credibility. These results are\\nconsistent with those from the LIGO-Virgo-KAGRA Collaboration, which did not\\naccount for spin-precession effects.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc\", \"published\": \"2025-04-14T11:37:21Z\"}"}
