{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12213v1\", \"title\": \"Magnetically driven outflows in 3D common-envelope evolution of massive\\n  stars\", \"summary\": \"Recent three-dimensional magnetohydrodynamical simulations of the\\ncommon-envelope interaction revealed the self-consistent formation of bipolar\\nmagnetically driven outflows launched from a toroidal structure resembling a\\ncircumbinary disk. So far, the dynamical impact of bipolar outflows on the\\ncommon-envelope phase remains uncertain and we aim to quantify its importance.\\nWe illustrate the impact on common-envelope evolution by comparing two\\nsimulations -- one with magnetic fields and one without -- using the\\nthree-dimensional moving-mesh hydrodynamics code AREPO. We focus on the\\nspecific case of a $10 M_\\\\odot$ red supergiant star with a $5 M_\\\\odot$ black\\nhole companion. By the end of the magnetohydrodynamic simulations (after $\\\\sim\\n1220$ orbits of the core binary system), about $6.4 \\\\%$ of the envelope mass is\\nejected via the bipolar outflow, contributing to angular momentum extraction\\nfrom the disk structure and core binary. The resulting enhanced torques reduce\\nthe final orbital separation by about $24 \\\\%$ compared to the hydrodynamical\\nscenario, while the overall envelope ejection remains dominated by\\nrecombination-driven equatorial winds. We analyze field amplification and\\noutflow launching mechanisms, confirming consistency with earlier studies:\\nmagnetic fields are amplified by shear flows, and outflows are launched by a\\nmagneto-centrifugal process, supported by local shocks and magnetic pressure\\ngradients. These outflows originate from $\\\\sim 1.1$ times the orbital\\nseparation. We conclude that the magnetically driven outflows and their role in\\nthe dynamical interaction are a universal aspect, and we further propose an\\nadaptation of the $\\\\alpha_\\\\mathrm{CE}$-formalism by adjusting the final orbital\\nenergy with a factor of $1+ M_\\\\mathrm{out}/\\\\mu$, where $M_\\\\mathrm{out}$ is the\\nmass ejected through the outflows and $\\\\mu$ the reduced mass of the core\\nbinary. (abridged)\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.HE\", \"published\": \"2025-04-16T16:01:47Z\"}"}
