{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06699v1\", \"title\": \"Benchmarking Convolutional Neural Network and Graph Neural Network based\\n  Surrogate Models on a Real-World Car External Aerodynamics Dataset\", \"summary\": \"Aerodynamic optimization is crucial for developing eco-friendly, aerodynamic,\\nand stylish cars, which requires close collaboration between aerodynamicists\\nand stylists, a collaboration impaired by the time-consuming nature of\\naerodynamic simulations. Surrogate models offer a viable solution to reduce\\nthis overhead, but they are untested in real-world aerodynamic datasets. We\\npresent a comparative evaluation of two surrogate modeling approaches for\\npredicting drag on a real-world dataset: a Convolutional Neural Network (CNN)\\nmodel that uses a signed distance field as input and a commercial tool based on\\nGraph Neural Networks (GNN) that directly processes a surface mesh. In contrast\\nto previous studies based on datasets created from parameterized geometries,\\nour dataset comprises 343 geometries derived from 32 baseline vehicle\\ngeometries across five distinct car projects, reflecting the diverse, free-form\\nmodifications encountered in the typical vehicle development process. Our\\nresults show that the CNN-based method achieves a mean absolute error of 2.3\\ndrag counts, while the GNN-based method achieves 3.8. Both methods achieve\\napproximately 77% accuracy in predicting the direction of drag change relative\\nto the baseline geometry. While both methods effectively capture the broader\\ntrends between baseline groups (set of samples derived from a single baseline\\ngeometry), they struggle to varying extents in capturing the finer\\nintra-baseline group variations. In summary, our findings suggest that\\naerodynamicists can effectively use both methods to predict drag in under two\\nminutes, which is at least 600 times faster than performing a simulation.\\nHowever, there remains room for improvement in capturing the finer details of\\nthe geometry.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-09T09:04:59Z\"}"}
