{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04620v1\", \"title\": \"On Path to Multimodal Generalist: General-Level and General-Bench\", \"summary\": \"The Multimodal Large Language Model (MLLM) is currently experiencing rapid\\ngrowth, driven by the advanced capabilities of LLMs. Unlike earlier\\nspecialists, existing MLLMs are evolving towards a Multimodal Generalist\\nparadigm. Initially limited to understanding multiple modalities, these models\\nhave advanced to not only comprehend but also generate across modalities. Their\\ncapabilities have expanded from coarse-grained to fine-grained multimodal\\nunderstanding and from supporting limited modalities to arbitrary ones. While\\nmany benchmarks exist to assess MLLMs, a critical question arises: Can we\\nsimply assume that higher performance across tasks indicates a stronger MLLM\\ncapability, bringing us closer to human-level AI? We argue that the answer is\\nnot as straightforward as it seems. This project introduces General-Level, an\\nevaluation framework that defines 5-scale levels of MLLM performance and\\ngenerality, offering a methodology to compare MLLMs and gauge the progress of\\nexisting systems towards more robust multimodal generalists and, ultimately,\\ntowards AGI. At the core of the framework is the concept of Synergy, which\\nmeasures whether models maintain consistent capabilities across comprehension\\nand generation, and across multiple modalities. To support this evaluation, we\\npresent General-Bench, which encompasses a broader spectrum of skills,\\nmodalities, formats, and capabilities, including over 700 tasks and 325,800\\ninstances. The evaluation results that involve over 100 existing\\nstate-of-the-art MLLMs uncover the capability rankings of generalists,\\nhighlighting the challenges in reaching genuine AI. We expect this project to\\npave the way for future research on next-generation multimodal foundation\\nmodels, providing a robust infrastructure to accelerate the realization of AGI.\\nProject page: https://generalist.top/\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-07T17:59:32Z\"}"}
