{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20877v1\", \"title\": \"Preference-centric Bandits: Optimality of Mixtures and Regret-efficient\\n  Algorithms\", \"summary\": \"The objective of canonical multi-armed bandits is to identify and repeatedly\\nselect an arm with the largest reward, often in the form of the expected value\\nof the arm's probability distribution. Such a utilitarian perspective and focus\\non the probability models' first moments, however, is agnostic to the\\ndistributions' tail behavior and their implications for variability and risks\\nin decision-making. This paper introduces a principled framework for shifting\\nfrom expectation-based evaluation to an alternative reward formulation, termed\\na preference metric (PM). The PMs can place the desired emphasis on different\\nreward realization and can encode a richer modeling of preferences that\\nincorporate risk aversion, robustness, or other desired attitudes toward\\nuncertainty. A fundamentally distinct observation in such a PM-centric\\nperspective is that designing bandit algorithms will have a significantly\\ndifferent principle: as opposed to the reward-based models in which the optimal\\nsampling policy converges to repeatedly sampling from the single best arm, in\\nthe PM-centric framework the optimal policy converges to selecting a mix of\\narms based on specific mixing weights. Designing such mixture policies departs\\nfrom the principles for designing bandit algorithms in significant ways,\\nprimarily because of uncountable mixture possibilities. The paper formalizes\\nthe PM-centric framework and presents two algorithm classes (horizon-dependent\\nand anytime) that learn and track mixtures in a regret-efficient fashion. These\\nalgorithms have two distinctions from their canonical counterparts: (i) they\\ninvolve an estimation routine to form reliable estimates of optimal mixtures,\\nand (ii) they are equipped with tracking mechanisms to navigate arm selection\\nfractions to track the optimal mixtures. These algorithms' regret guarantees\\nare investigated under various algebraic forms of the PMs.\", \"main_category\": \"stat.ML\", \"categories\": \"stat.ML,cs.LG\", \"published\": \"2025-04-29T15:46:59Z\"}"}
