{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12121v1\", \"title\": \"Remote sensing colour image semantic segmentation of trails created by\\n  large herbivorous Mammals\", \"summary\": \"Detection of spatial areas where biodiversity is at risk is of paramount\\nimportance for the conservation and monitoring of ecosystems. Large terrestrial\\nmammalian herbivores are keystone species as their activity not only has deep\\neffects on soils, plants, and animals, but also shapes landscapes, as large\\nherbivores act as allogenic ecosystem engineers. One key landscape feature that\\nindicates intense herbivore activity and potentially impacts biodiversity is\\nthe formation of grazing trails. Grazing trails are formed by the continuous\\ntrampling activity of large herbivores that can produce complex networks of\\ntracks of bare soil. Here, we evaluated different algorithms based on machine\\nlearning techniques to identify grazing trails. Our goal is to automatically\\ndetect potential areas with intense herbivory activity, which might be\\nbeneficial for conservation and management plans.\\n  We have applied five semantic segmentation methods combined with fourteen\\nencoders aimed at mapping grazing trails on aerial images. Our results indicate\\nthat in most cases the chosen methodology successfully mapped the trails,\\nalthough there were a few instances where the actual trail structure was\\nunderestimated. The UNet architecture with the MambaOut encoder was the best\\narchitecture for mapping trails. The proposed approach could be applied to\\ndevelop tools for mapping and monitoring temporal changes in these landscape\\nstructures to support habitat conservation and land management programs. This\\nis the first time, to the best of our knowledge, that competitive image\\nsegmentation results are obtained for the detection and delineation of trails\\nof large herbivorous mammals.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-16T14:33:57Z\"}"}
