{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02752v1\", \"title\": \"Anomalous vortex Hall effect in a ferromagnet/superconductor\\n  heterostructure\", \"summary\": \"The coexistence of superconductivity and ferromagnetism is a fascinating and\\ncomplex phenomenon in condensed matter physics, as these two states are\\ntypically mutually exclusive due to their competing spin configurations.\\nHowever, the interplay between these two orders through the proximity effect\\nhas been a subject of intense research as it opens up possibilities for novel\\ntechnological applications. Here, we report the coexistence of\\nsuperconductivity and ferromagnetism in superconducting\\n{\\\\delta}-TaN/ferromagnetic CoFeB heterostructures grown by facing-target\\nsputtering. Superconducting states are comprehensively investigated, with\\nevidence of strong correlation between the superconducting and ferromagnetic\\norder parameters. In particular, we observed an anomalous Hall signal without\\nthe presence of the magnetic field in the mixed state of the superconducting\\ntransition near the critical temperature. Systematic characterizations of the\\nHall resistance under varying temperatures and magnetic fields attribute this\\nbehavior to the vortex Hall effect (VHE), whereby superconducting vortices in\\nthe mixed state undergo transverse motions near the critical temperature.\\nUnlike previously reported VHEs in conventional type-II superconductors, the\\nanomalous VHE in TaN is induced by the stray field in the underlying CoFeB\\nlayers. The concurrency of strong spin-orbit coupling, the superconductivity in\\nthe TaN layer, and the highly spin-polarized ferromagnetic ordering in the\\nCoFeB layer offers new insights into proximity-induced vortex dynamics and the\\ndesign of novel superconducting spintronic devices.\", \"main_category\": \"cond-mat.supr-con\", \"categories\": \"cond-mat.supr-con,cond-mat.mes-hall,cond-mat.mtrl-sci\", \"published\": \"2025-04-03T16:43:07Z\"}"}
