{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03644v1\", \"title\": \"Consequences of non-minimal coupling for mass mixing in spontaneous\\n  baryogenesis\", \"summary\": \"We investigate the impact of a non-minimal Yukawa-like coupling between\\ncurvature and inflaton field within the \\\\emph{spontaneous baryogenesis}\\nbackground. We demonstrate that this coupling leads to a significant\\nenhancement in particle production, even for small values of the coupling\\nconstant $\\\\xi$. Assuming a perfectly homogeneous and isotropic universe during\\nthe reheating phase, we study the inflaton decay into fermion-antifermion pairs\\nby means of a semiclassical approach, treating fermions as quantized fields and\\nconsidering the inflaton and the Ricci scalar as classical quantities. We adopt\\nthe simplest approach in which the inflaton is minimally coupled to baryons,\\nand non-minimally with gravity. In particular, we solve the equations of motion\\nfor the inflaton to first order in perturbation theory, with $\\\\xi$ serving as\\nperturbative parameter. Afterwards, we compute the difference in the number\\ndensities of baryons and antibaryons produced through the inflaton decay into\\nfermion-antifermion pairs. We show that the non-minimal coupling term \\\\emph{de\\nfacto} increases inflaton mass, letting fermion-antifermion decays be more\\nprobable, and thus enhancing the overall baryogenesis process. As a further\\noutcome, we find that the non-minimal Yukawa coupling also leads to a\\nrenormalization of the inflaton mass and weakly influences the bounds over the\\ngravitational constant. Finally, since the fermionic fields appear not to be\\nmass eigenstates, we specialize the mass-mixing between them only. To this end,\\nwe thus include the effects of mass-mixing and cosmic expansion into our\\ncalculations. Physical consequences of baryon production are therefore\\nexplored.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc,astro-ph.CO,hep-th\", \"published\": \"2025-05-06T15:51:13Z\"}"}
