{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21344v1\", \"title\": \"Vision-Language Model-Based Semantic-Guided Imaging Biomarker for Early\\n  Lung Cancer Detection\", \"summary\": \"Objective: A number of machine learning models have utilized semantic\\nfeatures, deep features, or both to assess lung nodule malignancy. However,\\ntheir reliance on manual annotation during inference, limited interpretability,\\nand sensitivity to imaging variations hinder their application in real-world\\nclinical settings. Thus, this research aims to integrate semantic features\\nderived from radiologists' assessments of nodules, allowing the model to learn\\nclinically relevant, robust, and explainable features for predicting lung\\ncancer. Methods: We obtained 938 low-dose CT scans from the National Lung\\nScreening Trial with 1,246 nodules and semantic features. The Lung Image\\nDatabase Consortium dataset contains 1,018 CT scans, with 2,625 lesions\\nannotated for nodule characteristics. Three external datasets were obtained\\nfrom UCLA Health, the LUNGx Challenge, and the Duke Lung Cancer Screening. We\\nfinetuned a pretrained Contrastive Language-Image Pretraining model with a\\nparameter-efficient fine-tuning approach to align imaging and semantic features\\nand predict the one-year lung cancer diagnosis. Results: We evaluated the\\nperformance of the one-year diagnosis of lung cancer with AUROC and AUPRC and\\ncompared it to three state-of-the-art models. Our model demonstrated an AUROC\\nof 0.90 and AUPRC of 0.78, outperforming baseline state-of-the-art models on\\nexternal datasets. Using CLIP, we also obtained predictions on semantic\\nfeatures, such as nodule margin (AUROC: 0.81), nodule consistency (0.81), and\\npleural attachment (0.84), that can be used to explain model predictions.\\nConclusion: Our approach accurately classifies lung nodules as benign or\\nmalignant, providing explainable outputs, aiding clinicians in comprehending\\nthe underlying meaning of model predictions. This approach also prevents the\\nmodel from learning shortcuts and generalizes across clinical settings.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI,q-bio.QM\", \"published\": \"2025-04-30T06:11:34Z\"}"}
