{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09898v1\", \"title\": \"The Milky Way Project MOBStIRS: Parametrizing Infrared Stellar-Wind Bow\\n  Shock Morphologies with Citizen Science\", \"summary\": \"Mass-loss influences stellar evolution, especially for massive stars with\\nstrong winds. Stellar wind bow shock nebulae driven by Galactic OB stars can be\\nused to measure mass-loss rates ($\\\\dot{M}$). The standoff distance ($R_{0}$)\\nbetween the star and the bow shock is set by momentum flux balance between the\\nstellar wind and the surrounding interstellar medium (ISM). We created the\\nMilky Way Project: MOBStIRS (Mass-loss rates for OB Stars driving IR bow\\nShocks) using the online Zooniverse citizen science platform. We enlisted\\nseveral hundred students to measure $R_0$ and two other projected shape\\nparameters for 764 cataloged IR bow shocks. MOBStIRS incorporated 1528 JPEG\\ncutout images produced from Spitzer GLIMPSE and MIPSGAL survey data.\\nMeasurements were aggregated to compute shape parameters for each bow shock\\nimage deemed high-quality by participants. The average statistical uncertainty\\non $R_0$ is $12.5\\\\%$ but varies from ${<}5\\\\%$ to ${\\\\sim}40\\\\%$ among individual\\nbow shocks, contributing significantly to the total error budget of $\\\\dot{M}$.\\nThe derived nebular morphologies agree well with (magneto)hydrodynamic\\nsimulations of bow shocks driven by the winds of OB stars moving at $V_a =\\n10-40~km~s^{-1}$ with respect to the ambient interstellar medium (ISM). A\\nsystematic correction to $R_0$ to account for viewing angle appears unnecessary\\nfor computing $\\\\dot{M}$. Slightly more than half of MOBStIRS bow shocks are\\nasymmetric, which could indicate anisotropic stellar winds, ISM clumping on\\nsub-pc scales, time-dependent instabilities, and/or misalignments between the\\nlocal ISM magnetic field and the star-bow shock axis.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.SR\", \"published\": \"2025-04-14T05:46:21Z\"}"}
