{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04588v1\", \"title\": \"ZeroSearch: Incentivize the Search Capability of LLMs without Searching\", \"summary\": \"Effective information searching is essential for enhancing the reasoning and\\ngeneration capabilities of large language models (LLMs). Recent research has\\nexplored using reinforcement learning (RL) to improve LLMs' search capabilities\\nby interacting with live search engines in real-world environments. While these\\napproaches show promising results, they face two major challenges: (1)\\nUncontrolled Document Quality: The quality of documents returned by search\\nengines is often unpredictable, introducing noise and instability into the\\ntraining process. (2) Prohibitively High API Costs: RL training requires\\nfrequent rollouts, potentially involving hundreds of thousands of search\\nrequests, which incur substantial API expenses and severely constrain\\nscalability. To address these challenges, we introduce ZeroSearch, a\\nreinforcement learning framework that incentivizes the search capabilities of\\nLLMs without interacting with real search engines. Our approach begins with\\nlightweight supervised fine-tuning to transform the LLM into a retrieval module\\ncapable of generating both relevant and noisy documents in response to a query.\\nDuring RL training, we employ a curriculum-based rollout strategy that\\nincrementally degrades the quality of generated documents, progressively\\neliciting the model's reasoning ability by exposing it to increasingly\\nchallenging retrieval scenarios. Extensive experiments demonstrate that\\nZeroSearch effectively incentivizes the search capabilities of LLMs using a 3B\\nLLM as the retrieval module. Remarkably, a 7B retrieval module achieves\\ncomparable performance to the real search engine, while a 14B retrieval module\\neven surpasses it. Furthermore, it generalizes well across both base and\\ninstruction-tuned models of various parameter sizes and is compatible with a\\nwide range of RL algorithms.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-05-07T17:30:22Z\"}"}
