{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11383v1\", \"title\": \"Accelerating Multiscale Modeling with Hybrid Solvers: Coupling FEM and\\n  Neural Operators with Domain Decomposition\", \"summary\": \"Numerical solvers for partial differential equations (PDEs) face challenges\\nbalancing computational cost and accuracy, especially in multiscale and dynamic\\nsystems. Neural operators can significantly speed up simulations; however, they\\noften face challenges such as error accumulation and limited generalization in\\nmultiphysics problems. This work introduces a novel hybrid framework that\\nintegrates physics-informed DeepONet with FEM through domain decomposition. The\\ncore innovation lies in adaptively coupling FEM and DeepONet subdomains via a\\nSchwarz alternating method. This methodology strategically allocates\\ncomputationally demanding regions to a pre-trained Deep Operator Network, while\\nthe remaining computational domain is solved through FEM. To address dynamic\\nsystems, we integrate the Newmark time-stepping scheme directly into the\\nDeepONet, significantly mitigating error accumulation in long-term simulations.\\nFurthermore, an adaptive subdomain evolution enables the ML-resolved region to\\nexpand dynamically, capturing emerging fine-scale features without remeshing.\\nThe framework's efficacy has been validated across a range of solid mechanics\\nproblems, including static, quasi-static, and dynamic regimes, demonstrating\\naccelerated convergence rates (up to 20% improvement compared to FE-FE\\napproaches), while preserving solution fidelity with error < 1%. Our case\\nstudies show that our proposed hybrid solver: (1) maintains solution continuity\\nacross subdomain interfaces, (2) reduces computational costs by eliminating\\nfine mesh requirements, (3) mitigates error accumulation in time-dependent\\nsimulations, and (4) enables automatic adaptation to evolving physical\\nphenomena. This work bridges the gap between numerical methods and AI-driven\\nsurrogates, offering a scalable pathway for high-fidelity simulations in\\nengineering and scientific applications.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-15T16:54:04Z\"}"}
