{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11239v1\", \"title\": \"Nondeterministic Polynomial-time Problem Challenge: An Ever-Scaling\\n  Reasoning Benchmark for LLMs\", \"summary\": \"Reasoning is the fundamental capability of large language models (LLMs). Due\\nto the rapid progress of LLMs, there are two main issues of current benchmarks:\\ni) these benchmarks can be crushed in a short time (less than 1 year), and ii)\\nthese benchmarks may be easily hacked. To handle these issues, we propose the\\never-scalingness for building the benchmarks which are uncrushable, unhackable,\\nauto-verifiable and general. This paper presents Nondeterministic\\nPolynomial-time Problem Challenge (NPPC), an ever-scaling reasoning benchmark\\nfor LLMs. Specifically, the NPPC has three main modules: i) npgym, which\\nprovides a unified interface of 25 well-known NP-complete problems and can\\ngenerate any number of instances with any levels of complexities, ii) npsolver:\\nwhich provides a unified interface to evaluate the problem instances with both\\nonline and offline models via APIs and local deployments, respectively, and\\niii) npeval: which provides the comprehensive and ready-to-use tools to analyze\\nthe performances of LLMs over different problems, the number of tokens, the aha\\nmoments, the reasoning errors and the solution errors. Extensive experiments\\nover widely-used LLMs demonstrate: i) NPPC can successfully decrease the\\nperformances of advanced LLMs' performances to below 10%, demonstrating that\\nNPPC is uncrushable, ii) DeepSeek-R1, Claude-3.7-Sonnet, and o1/o3-mini are the\\nmost powerful LLMs, where DeepSeek-R1 outperforms Claude-3.7-Sonnet and\\no1/o3-mini in most NP-complete problems considered, and iii) the numbers of\\ntokens, aha moments in the advanced LLMs, e.g., Claude-3.7-Sonnet and\\nDeepSeek-R1, are observed first to increase and then decrease when the problem\\ninstances become more and more difficult. We believe that NPPC is the first\\never-scaling reasoning benchmark, serving as the uncrushable and unhackable\\ntestbed for LLMs toward artificial general intelligence (AGI).\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.CL\", \"published\": \"2025-04-15T14:40:29Z\"}"}
