{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10220v1\", \"title\": \"Modeling the Thermal Structure of a Protoplanetary Disk Using Multiband\\n  Flux-Limited Diffusion Approximation\", \"summary\": \"This work continues the analysis of the model for calculating the thermal\\nstructure of an axisymmetric protoplanetary disk, initiated in the paper by\\nPavlyuchenkov (2024). The model is based on the well-known Flux-Limited\\nDiffusion (FLD) approximation with separate calculation of heating by direct\\nstellar radiation (hereinafter referred to as the FLD$^{\\\\rm s}$ method). In\\naddition to the previously described FLD$^{\\\\rm s}$ model with\\nwavelength-averaged opacities, we present a multiband model mFLD$^{\\\\rm s}$,\\nwhere the spectrum of thermal radiation is divided into several frequency\\nbands. The model is based on an implicit finite-difference scheme for the\\nequations of thermal radiation diffusion, which reduces to a system of linear\\nalgebraic equations written in hypermatrix form. A modified Gauss method for\\ninverting the sparse hypermatrix of the original system of linear equations is\\nproposed. The simulation results described in the article show that the\\nmidplane radial temperature profile obtained with the mFLD$^{\\\\rm s}$ method has\\na variable slope in accordance with the reference Monte Carlo radiative\\ntransfer simulations. The mFLD$^{\\\\rm s}$ model also qualitatively reproduces\\nthe non-isothermality of the temperature distribution along the angular\\ncoordinate near the midplane, which is not provided by the FLD$^{\\\\rm s}$\\nmethod. However, quantitative differences remain between the reference\\ntemperature values and the results of mFLD$^{\\\\rm s}$. These differences are\\nlikely due to the diffusive nature of the FLD approximation. It is also shown\\nthat the characteristic times for the disk to reach thermal equilibrium within\\nthe mFLD$^{\\\\rm s}$ model can be significantly shorter than in FLD$^{\\\\rm s}$.\\nThis property should be taken into account when modeling non-stationary\\nprocesses in protoplanetary disks within FLD-based models.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,astro-ph.SR\", \"published\": \"2025-04-14T13:37:19Z\"}"}
