{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15833v1\", \"title\": \"Eccentric or circular? A reanalysis of binary black hole gravitational\\n  wave events for orbital eccentricity signatures\", \"summary\": \"We present a reanalysis of 17 gravitational-wave events detected with\\nAdvanced LIGO and Advanced Virgo in their first three observing runs, using the\\nnew IMRPhenomTEHM model -- a phenomenological time-domain multipolar waveform\\nmodel for aligned-spin black-hole binaries in elliptical orbits with two\\neccentric parameters: eccentricity and mean anomaly. We also analyze all events\\nwith the underlying quasi-circular model IMRPhenomTHM to study the impact of\\nincluding eccentricity and compare the eccentric and quasi-circular binary\\nhypotheses. The high computational efficiency of IMRPhenomTEHM enables us to\\nexplore the impact of two different eccentricity priors -- uniform and\\nlog-uniform -- as well as different sampler and data settings. We find evidence\\nfor eccentricity in two publicly available LVK events, GW200129 and\\nGW200208_22, with Bayes factors favoring the eccentric hypothesis over the\\nquasi-circular aligned-spin scenario:\\n$\\\\log_{10}\\\\mathcal{B}_{\\\\mathrm{E/QC}}\\\\in\\\\left[1.30^{+0.15}_{-0.15},\\n5.14^{+0.15}_{-0.15}\\\\right]$ and\\n$\\\\log_{10}\\\\mathcal{B}_{\\\\mathrm{E/QC}}\\\\in\\\\left[0.49^{+0.08}_{-0.08},\\n1.14^{+0.08}_{-0.08}\\\\right]$, respectively. Additionally, the two high-mass\\nevents GW190701 and GW190929 exhibit potential eccentric features. For all four\\nevents, we conduct further analyses to study the impact of different sampler\\nsettings. We also investigate waveform systematics by exploring the support for\\nspin precession using IMRPhenomTPHM and NRSur7dq4, offering new insights into\\nthe formation channels of detected binaries. Our results highlight the\\nimportance of considering eccentric waveform models in future observing runs,\\nalongside precessing models, as they can help mitigate potential biases in\\nparameter estimation studies. This will be particularly relevant with the\\nexpected increase in the diversity of the binary black hole population with new\\ndetectors.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc,astro-ph.HE\", \"published\": \"2025-04-22T12:27:37Z\"}"}
