{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17767v1\", \"title\": \"Dynamic atmosphere and wind models of C-type asymptotic giant branch\\n  stars. Influences of dust optical data on mass loss and observables\", \"summary\": \"Mass loss through stellar winds governs the evolution of stars on the\\nasymptotic giant branch (AGB). In the case of carbon-rich AGB stars, the wind\\nis believed to be driven by radiation pressure on amorphous carbon (amC) dust\\nforming in the atmosphere. The choice of dust optical data will have a\\nsignificant impact on atmosphere and wind models of AGB stars. We compare two\\ncommonly used optical data sets of amC and investigate how the wind\\ncharacteristics and photometric properties resulting from dynamical models of\\ncarbon-rich AGB stars are influenced by the micro-physical properties of dust\\ngrains. We computed two extensive grids of carbon star atmosphere and wind\\nmodels with the DARWIN 1D radiation-hydrodynamical code. Each of the two grids\\nuses a different amC optical data set. The stellar parameters of the models\\nwere varied to cover a wide range of possible combinations. A posteriori\\nradiative transfer calculations were performed for a sub-set of the models,\\nresulting in photometric fluxes and colours. We find small, but systematic\\ndifferences in the predicted mass-loss rates for the two grids. The grain sizes\\nand photometric properties are affected by the different dust optical data\\nsets. Higher absorption efficiency leads to the formation of a greater number\\nof grains, which are smaller. Models that are obscured by dust exhibit\\ndifferences in terms of the covered colour range compared to observations,\\ndepending on the dust optical data used. An important motivation for this study\\nwas to investigate how strongly the predicted mass-loss rates depend on the\\nchoice of dust optical data, as these mass-loss values are more frequently used\\nin stellar evolution models. Based on the current results, we conclude that\\nmass-loss rates may typically differ by about a factor of two for DARWIN models\\nof C-type AGB stars for commonly used dust optical data sets.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-24T17:38:35Z\"}"}
