{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17262v1\", \"title\": \"Hilbert Transform Technique for Analyzing Mode I Crack Growth in an Pre-\\n  Stressed Monoclinic Crystalline Strip Under Punch Pressure\", \"summary\": \"The crux of the present study is to analyze the Mode I crack propagation\\nbehavior in a pre-stressed monoclinic crystalline strip of finite thickness and\\ninfinite extent. The investigation focuses on the effects of collinear Griffith\\ncracks and dynamic punch loading induced by plane wave propagation. The cracks\\nare assumed to be in motion, and a Galilean transformation is employed to\\nformulate the problem within a moving coordinate system. The boundary value\\nproblem is transformed into a system of coupled Cauchy-type singular integral\\nequations, which are solved analytically using the Hilbert transform method.\\nThis approach yields elegant closed-form solutions for both the stress\\nintensity factor and the crack opening displacement. The study considers two\\nmonoclinic crystalline materials, Lithium Niobate and Lithium Tantalate, and\\ncompares their behavior with that of an isotropic material to assess the role\\nof material anisotropy. Numerical simulations and graphical analysis are\\nperformed for the crystalline materials with monoclinic symmetry to evaluate\\nthe influence of crack velocity, punch loading, material anisotropy, initial\\nstress, and crack geometry on the fracture parameters. As a special case, the\\nsystem is analyzed under the action of point loading from the punch pressure,\\nand a comparative assessment is conducted between point loading and constant\\nnormal punch pressure. The results unveil critical insights into the dynamic\\nfracture behavior of anisotropic materials under localized loading. This\\nunderstanding enhances failure prediction in high-precision fields such as\\ngeomechanics, MEMS, surface acoustic devices, and biosensors.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-24T05:45:21Z\"}"}
