{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16722v1\", \"title\": \"PMG: Progressive Motion Generation via Sparse Anchor Postures Curriculum\\n  Learning\", \"summary\": \"In computer animation, game design, and human-computer interaction,\\nsynthesizing human motion that aligns with user intent remains a significant\\nchallenge. Existing methods have notable limitations: textual approaches offer\\nhigh-level semantic guidance but struggle to describe complex actions\\naccurately; trajectory-based techniques provide intuitive global motion\\ndirection yet often fall short in generating precise or customized character\\nmovements; and anchor poses-guided methods are typically confined to synthesize\\nonly simple motion patterns. To generate more controllable and precise human\\nmotions, we propose \\\\textbf{ProMoGen (Progressive Motion Generation)}, a novel\\nframework that integrates trajectory guidance with sparse anchor motion\\ncontrol. Global trajectories ensure consistency in spatial direction and\\ndisplacement, while sparse anchor motions only deliver precise action guidance\\nwithout displacement. This decoupling enables independent refinement of both\\naspects, resulting in a more controllable, high-fidelity, and sophisticated\\nmotion synthesis. ProMoGen supports both dual and single control paradigms\\nwithin a unified training process. Moreover, we recognize that direct learning\\nfrom sparse motions is inherently unstable, we introduce \\\\textbf{SAP-CL (Sparse\\nAnchor Posture Curriculum Learning)}, a curriculum learning strategy that\\nprogressively adjusts the number of anchors used for guidance, thereby enabling\\nmore precise and stable convergence. Extensive experiments demonstrate that\\nProMoGen excels in synthesizing vivid and diverse motions guided by predefined\\ntrajectory and arbitrary anchor frames. Our approach seamlessly integrates\\npersonalized motion with structured guidance, significantly outperforming\\nstate-of-the-art methods across multiple control scenarios.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-23T13:51:42Z\"}"}
