{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14877v1\", \"title\": \"Collaborative Enhancement Network for Low-quality Multi-spectral Vehicle\\n  Re-identification\", \"summary\": \"The performance of multi-spectral vehicle Re-identification (ReID) is\\nsignificantly degraded when some important discriminative cues in visible, near\\ninfrared and thermal infrared spectra are lost. Existing methods generate or\\nenhance missing details in low-quality spectra data using the high-quality one,\\ngenerally called the primary spectrum, but how to justify the primary spectrum\\nis a challenging problem. In addition, when the quality of the primary spectrum\\nis low, the enhancement effect would be greatly degraded, thus limiting the\\nperformance of multi-spectral vehicle ReID. To address these problems, we\\npropose the Collaborative Enhancement Network (CoEN), which generates a\\nhigh-quality proxy from all spectra data and leverages it to supervise the\\nselection of primary spectrum and enhance all spectra features in a\\ncollaborative manner, for robust multi-spectral vehicle ReID. First, to\\nintegrate the rich cues from all spectra data, we design the Proxy Generator\\n(PG) to progressively aggregate multi-spectral features. Second, we design the\\nDynamic Quality Sort Module (DQSM), which sorts all spectra data by measuring\\ntheir correlations with the proxy, to accurately select the primary spectra\\nwith the highest correlation. Finally, we design the Collaborative Enhancement\\nModule (CEM) to effectively compensate for missing contents of all spectra by\\ncollaborating the primary spectra and the proxy, thereby mitigating the impact\\nof low-quality primary spectra. Extensive experiments on three benchmark\\ndatasets are conducted to validate the efficacy of the proposed approach\\nagainst other multi-spectral vehicle ReID methods. The codes will be released\\nat https://github.com/yongqisun/CoEN.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-21T06:07:32Z\"}"}
