{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05140v1\", \"title\": \"Unifying Physics- and Data-Driven Modeling via Novel Causal\\n  Spatiotemporal Graph Neural Network for Interpretable Epidemic Forecasting\", \"summary\": \"Accurate epidemic forecasting is crucial for effective disease control and\\nprevention. Traditional compartmental models often struggle to estimate\\ntemporally and spatially varying epidemiological parameters, while deep\\nlearning models typically overlook disease transmission dynamics and lack\\ninterpretability in the epidemiological context. To address these limitations,\\nwe propose a novel Causal Spatiotemporal Graph Neural Network (CSTGNN), a\\nhybrid framework that integrates a Spatio-Contact SIR model with Graph Neural\\nNetworks (GNNs) to capture the spatiotemporal propagation of epidemics.\\nInter-regional human mobility exhibits continuous and smooth spatiotemporal\\npatterns, leading to adjacent graph structures that share underlying mobility\\ndynamics. To model these dynamics, we employ an adaptive static connectivity\\ngraph to represent the stable components of human mobility and utilize a\\ntemporal dynamics model to capture fluctuations within these patterns. By\\nintegrating the adaptive static connectivity graph with the temporal dynamics\\ngraph, we construct a dynamic graph that encapsulates the comprehensive\\nproperties of human mobility networks. Additionally, to capture temporal trends\\nand variations in infectious disease spread, we introduce a temporal\\ndecomposition model to handle temporal dependence. This model is then\\nintegrated with a dynamic graph convolutional network for epidemic forecasting.\\nWe validate our model using real-world datasets at the provincial level in\\nChina and the state level in Germany. Extensive studies demonstrate that our\\nmethod effectively models the spatiotemporal dynamics of infectious diseases,\\nproviding a valuable tool for forecasting and intervention strategies.\\nFurthermore, analysis of the learned parameters offers insights into disease\\ntransmission mechanisms, enhancing the interpretability and practical\\napplicability of our model.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,physics.soc-ph,q-bio.QM,stat.ML\", \"published\": \"2025-04-07T14:46:11Z\"}"}
