{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05975v1\", \"title\": \"A Corrector-aided Look-ahead Distance-based Guidance for Reference Path\\n  Following with an Efficient Midcourse Guidance Strategy\", \"summary\": \"Efficient path-following is crucial in most of the applications of autonomous\\nvehicles (UxV). Among various guidance strategies presented in literature,\\nlook-ahead distance ($L_1$)-based guidance method has received significant\\nattention due to its ease in implementation and ability to maintain a low\\ncross-track error while following simpler reference paths and generate bounded\\nlateral acceleration commands. However, the constant value of $L_1$ becomes\\nproblematic when the UxV is far away from the reference path and also produce\\nhigher cross-track error while following complex reference paths having high\\nvariation in radius of curvature. To address these challenges, the notion of\\nlook-ahead distance is leveraged in a novel way to develop a two-phase guidance\\nstrategy. Initially, when the UxV is far from the reference path, an optimized\\n$L_1$ selection strategy is developed to guide the UxV toward the reference\\npath in order to maintain minimal lateral acceleration command. Once the\\nvehicle reaches a close vicinity of the reference path, a novel notion of\\ncorrector point is incorporated in the constant $L_1$-based guidance scheme to\\ngenerate the lateral acceleration command that effectively reduces the root\\nmean square of the cross-track error thereafter. Simulation results demonstrate\\nthat this proposed corrector point and look-ahead point pair-based guidance\\nstrategy along with the developed midcourse guidance scheme outperforms the\\nconventional constant $L_1$ guidance scheme both in terms of feasibility and\\nmeasures of effectiveness like cross-track error and lateral acceleration\\nrequirements.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO,cs.SY,eess.SY\", \"published\": \"2025-04-08T12:31:19Z\"}"}
