{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11445v1\", \"title\": \"Pixel-level modelling of group-scale strong lens CASSOWARY 19\", \"summary\": \"We present the first high-precision model for the group-scale strong lensing\\nsystem CASSOWARY 19 (CSWA19), utilising images from the Hubble Space Telescope\\n(HST). Sixteen member galaxies identified via the red-sequence method, and the\\nmain halo, all modelled as the dual Pseudo Isothermal Elliptical profile\\n(dPIE), are incorporated into a parametric lens model alongside an external\\nshear field. To model the system, we adopt the PyAutoLens software package,\\nemploying a progressive search chain strategy for realizing the transition of\\nsource model from multiple S\\\\'ersic profiles to a brightness-adaptive\\npixelization, which uses 1000 pixels in the source plane to reconstruct the\\nbackground source corresponding to 177,144 image pixels in the image plane. Our\\nresults indicate that the total mass within the Einstein radius is\\n$M_{\\\\theta_\\\\mathrm{E}}$ $\\\\approx 1.41\\\\times10^{13}$M$_{\\\\odot}$ and the average\\nslope of the total mass density $\\\\rho (r)\\\\propto r^{-\\\\gamma}$ is\\n$\\\\tilde{\\\\gamma}=1.33$ within the effective radius. This slope is shallower than\\nthose measured in galaxies and groups but is closer to those of galaxy\\nclusters. In addition, our approach successfully resolves the two merging\\ngalaxies in the background source and yields a total magnification of\\n$\\\\mu=103.18^{+0.23}_{-0.19}$, which is significantly higher than the outcomes\\nfrom previous studies of CSWA19. In summary, our research demonstrates the\\neffectiveness of the brightness-adaptive pixelization source reconstruction\\ntechnique for modelling group-scale strong lensing systems. It can serve as a\\ntechnical reference for future investigations into pixel-level modelling of the\\ngroup- and cluster-scale strong lensing systems.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-15T17:56:11Z\"}"}
