{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16734v1\", \"title\": \"DYNUS: Uncertainty-aware Trajectory Planner in Dynamic Unknown\\n  Environments\", \"summary\": \"This paper introduces DYNUS, an uncertainty-aware trajectory planner designed\\nfor dynamic unknown environments. Operating in such settings presents many\\nchallenges -- most notably, because the agent cannot predict the ground-truth\\nfuture paths of obstacles, a previously planned trajectory can become unsafe at\\nany moment, requiring rapid replanning to avoid collisions.\\n  Recently developed planners have used soft-constraint approaches to achieve\\nthe necessary fast computation times; however, these methods do not guarantee\\ncollision-free paths even with static obstacles. In contrast, hard-constraint\\nmethods ensure collision-free safety, but typically have longer computation\\ntimes.\\n  To address these issues, we propose three key contributions. First, the DYNUS\\nGlobal Planner (DGP) and Temporal Safe Corridor Generation operate in\\nspatio-temporal space and handle both static and dynamic obstacles in the 3D\\nenvironment. Second, the Safe Planning Framework leverages a combination of\\nexploratory, safe, and contingency trajectories to flexibly re-route when\\npotential future collisions with dynamic obstacles are detected. Finally, the\\nFast Hard-Constraint Local Trajectory Formulation uses a variable elimination\\napproach to reduce the problem size and enable faster computation by\\npre-computing dependencies between free and dependent variables while still\\nensuring collision-free trajectories.\\n  We evaluated DYNUS in a variety of simulations, including dense forests,\\nconfined office spaces, cave systems, and dynamic environments. Our experiments\\nshow that DYNUS achieves a success rate of 100% and travel times that are\\napproximately 25.0% faster than state-of-the-art methods. We also evaluated\\nDYNUS on multiple platforms -- a quadrotor, a wheeled robot, and a quadruped --\\nin both simulation and hardware experiments.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-23T14:05:04Z\"}"}
