{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15847v1\", \"title\": \"CARE: Compatibility-Aware Incentive Mechanisms for Federated Learning\\n  with Budgeted Requesters\", \"summary\": \"Federated learning (FL) is a promising approach that allows requesters (\\\\eg,\\nservers) to obtain local training models from workers (e.g., clients). Since\\nworkers are typically unwilling to provide training services/models freely and\\nvoluntarily, many incentive mechanisms in FL are designed to incentivize\\nparticipation by offering monetary rewards from requesters. However, existing\\nstudies neglect two crucial aspects of real-world FL scenarios. First, workers\\ncan possess inherent incompatibility characteristics (e.g., communication\\nchannels and data sources), which can lead to degradation of FL efficiency\\n(e.g., low communication efficiency and poor model generalization). Second, the\\nrequesters are budgeted, which limits the amount of workers they can hire for\\ntheir tasks. In this paper, we investigate the scenario in FL where multiple\\nbudgeted requesters seek training services from incompatible workers with\\nprivate training costs. We consider two settings: the cooperative budget\\nsetting where requesters cooperate to pool their budgets to improve their\\noverall utility and the non-cooperative budget setting where each requester\\noptimizes their utility within their own budgets. To address efficiency\\ndegradation caused by worker incompatibility, we develop novel\\ncompatibility-aware incentive mechanisms, CARE-CO and CARE-NO, for both\\nsettings to elicit true private costs and determine workers to hire for\\nrequesters and their rewards while satisfying requester budget constraints. Our\\nmechanisms guarantee individual rationality, truthfulness, budget feasibility,\\nand approximation performance. We conduct extensive experiments using\\nreal-world datasets to show that the proposed mechanisms significantly\\noutperform existing baselines.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI\", \"published\": \"2025-04-22T12:42:45Z\"}"}
