{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02773v1\", \"title\": \"On Dual Mechanisms Limiting Density in the Negative Triangularity\\n  Tokamak\", \"summary\": \"Achieving high plasma density is essential for maximizing thermonuclear power\\nand thus crucial for realizing economically viable fusion energy; however, this\\nis often constrained by a fundamental density limit. This study investigates\\nthe L-mode density limit in negative triangularity (NT) plasmas on the DIII-D\\ntokamak, and the results provide novel insights into this long-standing\\nchallenge. We report sustained operations at densities up to 1.8 times the\\nconventional Greenwald limit with 13 MW of auxiliary heating power.\\nImportantly, systematic power scans reveal distinct power scaling relationships\\nfor core ($n_{e} \\\\propto P_{\\\\text{SOL}}^{0.27\\\\pm 0.03}$) and edge ($n_{e}\\n\\\\propto P_{\\\\text{SOL}}^{0.42\\\\pm 0.04}$) densities, which suggest different\\nlimiting mechanisms at play and point to a more nuanced picture than the\\ntraditional paradigm of a single, universal density limit. In this vein,\\ndetailed measurements were performed, revealing a complex interplay of\\nmacroscopic profiles, radiation patterns, and turbulent transport.\\nSpecifically, edge turbulent transport increased as density rose, leading to\\nenhanced divertor radiation and subsequent MARFE onset. The edge density\\nsaturated abruptly following MARFE formation. In contrast, the core density\\ncontinues to increase, ultimately limited by enhanced turbulence that exhibits\\ncharacteristics of avalanche-like transport. Consistent with enhanced\\nturbulence, toroidal rotation and the $E_r \\\\times B$ flow shear also collapsed\\napproaching the density limit. Taken together, these observations suggest that\\nMARFE dynamics primarily govern the edge density limit, while turbulence-driven\\ntransport dominates the core density limit. These results also indicate the\\nfeasibility of operations significantly beyond the Greenwald density in\\nhigh-power NT plasmas.\\n  This can potentially be attained through advanced control of core turbulence\\nand MARFEs.\", \"main_category\": \"physics.plasm-ph\", \"categories\": \"physics.plasm-ph\", \"published\": \"2025-04-03T17:14:44Z\"}"}
