{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19696v1\", \"title\": \"On the unique evolutionary mechanisms of massive quiescent galaxies in\\n  the epoch of reionisation\", \"summary\": \"We investigate the evolutionary histories of a population of high mass, high\\nredshift, quiescent galaxies in the cosmohydrodynamical simulation Thesan;\\nstudying the characteristic properties of their haloes and environments over\\nthe epoch of reionisation. Thesan employs a modified version of the Arepo\\nmoving-mesh code utilised in IllustrisTNG, whose explicit handling of ionising\\nradiation couples haloes and galaxies with cosmic reionisation. This results in\\na regime of rapid growth and quenching, producing nine massive quiescent\\ngalaxies at $z = 5.5$, in a $95.5\\\\text{cMpc}^3$ volume, with no counterpart in\\nIllustrisTNG. We find that the rapid assembly of stellar mass is attributed to\\nsmooth accretion of mass onto their haloes in dense environments, particularly\\nfrom massive neighbouring structures; while these galaxies exhibit fast-growing\\npotential wells hosting massive central black holes. With insignificant merger\\nactivity, we find AGN feedback to be the primary source of quenching. We find\\nmegaparsec-scale densities and halo masses to continue growing after quenching,\\nsuggesting that massive quiescent galaxies will be found in some of the largest\\nhaloes and densest regions of space by observations. With an unprecedented\\nplethora of massive quiescent galaxies found in JWST data, these reionisation\\nsimulations may provide the paradigm for the evolutionary histories of these\\ngalaxies, while constraining the relatively unknown physics of reionisation.\\nDespite the rarity of simulated massive quiescent galaxies, their\\nidentification in Thesan enables identification of halo and environmental\\nproperties most conducive to their quenching, hopefully guiding future efforts\\ninto the study of analogous systems in deep observational surveys and\\nlarge-volume N-body simulations.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.CO\", \"published\": \"2025-04-28T11:47:58Z\"}"}
