{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03382v1\", \"title\": \"Physics-informed neural network estimation of active material properties\\n  in time-dependent cardiac biomechanical models\", \"summary\": \"Active stress models in cardiac biomechanics account for the mechanical\\ndeformation caused by muscle activity, thus providing a link between the\\nelectrophysiological and mechanical properties of the tissue. The accurate\\nassessment of active stress parameters is fundamental for a precise\\nunderstanding of myocardial function but remains difficult to achieve in a\\nclinical setting, especially when only displacement and strain data from\\nmedical imaging modalities are available. This work investigates, through an\\nin-silico study, the application of physics-informed neural networks (PINNs)\\nfor inferring active contractility parameters in time-dependent cardiac\\nbiomechanical models from these types of imaging data. In particular, by\\nparametrising the sought state and parameter field with two neural networks,\\nrespectively, and formulating an energy minimisation problem to search for the\\noptimal network parameters, we are able to reconstruct in various settings\\nactive stress fields in the presence of noise and with a high spatial\\nresolution. To this end, we also advance the vanilla PINN learning algorithm\\nwith the use of adaptive weighting schemes, ad-hoc regularisation strategies,\\nFourier features, and suitable network architectures. In addition, we\\nthoroughly analyse the influence of the loss weights in the reconstruction of\\nactive stress parameters. Finally, we apply the method to the characterisation\\nof tissue inhomogeneities and detection of fibrotic scars in myocardial tissue.\\nThis approach opens a new pathway to significantly improve the diagnosis,\\ntreatment planning, and management of heart conditions associated with cardiac\\nfibrosis.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.NA,math.NA\", \"published\": \"2025-05-06T10:01:16Z\"}"}
