{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20405v1\", \"title\": \"SCOPE-MRI: Bankart Lesion Detection as a Case Study in Data Curation and\\n  Deep Learning for Challenging Diagnoses\", \"summary\": \"While deep learning has shown strong performance in musculoskeletal imaging,\\nexisting work has largely focused on pathologies where diagnosis is not a\\nclinical challenge, leaving more difficult problems underexplored, such as\\ndetecting Bankart lesions (anterior-inferior glenoid labral tears) on standard\\nMRIs. Diagnosing these lesions is challenging due to their subtle imaging\\nfeatures, often leading to reliance on invasive MRI arthrograms (MRAs). This\\nstudy introduces ScopeMRI, the first publicly available, expert-annotated\\ndataset for shoulder pathologies, and presents a deep learning (DL) framework\\nfor detecting Bankart lesions on both standard MRIs and MRAs. ScopeMRI includes\\n586 shoulder MRIs (335 standard, 251 MRAs) from 558 patients who underwent\\narthroscopy. Ground truth labels were derived from intraoperative findings, the\\ngold standard for diagnosis. Separate DL models for MRAs and standard MRIs were\\ntrained using a combination of CNNs and transformers. Predictions from\\nsagittal, axial, and coronal views were ensembled to optimize performance. The\\nmodels were evaluated on a 20% hold-out test set (117 MRIs: 46 MRAs, 71\\nstandard MRIs). The models achieved an AUC of 0.91 and 0.93, sensitivity of 83%\\nand 94%, and specificity of 91% and 86% for standard MRIs and MRAs,\\nrespectively. Notably, model performance on non-invasive standard MRIs matched\\nor surpassed radiologists interpreting MRAs. External validation demonstrated\\ninitial generalizability across imaging protocols. This study demonstrates that\\nDL models can achieve radiologist-level diagnostic performance on standard\\nMRIs, reducing the need for invasive MRAs. By releasing ScopeMRI and a modular\\ncodebase for training and evaluating deep learning models on 3D medical imaging\\ndata, we aim to accelerate research in musculoskeletal imaging and support the\\ndevelopment of new datasets for clinically challenging diagnostic tasks.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.AI,cs.CV,cs.LG\", \"published\": \"2025-04-29T04:02:44Z\"}"}
