{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16819v1\", \"title\": \"Using games and universal trees to characterise the nondeterministic\\n  index of tree languages\", \"summary\": \"The parity index problem of tree automata asks, given a regular tree language\\n$L$ and a set of priorities $J$, is $L$ $J$-feasible, that is, recognised by a\\nnondeterministic parity automaton with priorities $J$? This is a long-standing\\nopen problem, of which only a few sub-cases and variations are known to be\\ndecidable. In a significant but technically difficult step, Colcombet and\\nL\\\\\\\"oding reduced the problem to the uniform universality of distance-parity\\nautomata. In this article, we revisit the index problem using tools from the\\nparity game literature.\\n  We add some counters to Lehtinen's register game, originally used to solve\\nparity games in quasipolynomial time, and use this novel game to characterise\\n$J$-feasibility. This provides a alternative proof to Colcombet and L\\\\\\\"oding's\\nreduction.\\n  We then provide a second characterisation, based on the notion of attractor\\ndecompositions and the complexity of their structure, as measured by a\\nparameterised version of their Strahler number, which we call $n$-Strahler\\nnumber. Finally, we rephrase this result using the notion of universal tree\\nextended to automata: a guidable automaton recognises a $[1,2j]$-feasible\\nlanguage if and only if it admits a universal tree with $n$-Strahler number\\n$j$, for some $n$. In particular, a language recognised by a guidable automaton\\n$A$ is B\\\\\\\"uchi-feasible if and only if there is a uniform bound $n\\\\in\\n\\\\mathbb{N}$ such that all trees in the language admit an accepting run with an\\nattractor decomposition of width bounded by $n$, or, equivalently, if and only\\n$A$ admits a \\\\textit{finite} universal tree.\\n  While we do not solve the decidability of the index problem, our work makes\\nthe state-of-the-art more accessible and brings to light the deep relationships\\nbetween the $J$-feasibility of a language and attractor decompositions,\\nuniversal trees and Lehtinen's register game.\", \"main_category\": \"cs.FL\", \"categories\": \"cs.FL,F.4.3\", \"published\": \"2025-04-23T15:37:44Z\"}"}
