{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06113v1\", \"title\": \"Interplay between trimer structure and magnetic ground state in\\n  Ba5Ru3O12 probed by Neutron and muSR techniques\", \"summary\": \"We report a detailed inelastic neutron scattering (INS) and muon spin\\nrelaxation (muSR) investigations of a trimer Ruthenate Ba5Ru3O12 system, which\\nundergoes long-range antiferromagnetic ordering at TN = 60 K. The INS reveals\\ntwo distinct spin-wave excitations below TN : one around 5.6 meV and the other\\nat 10 to 15 meV. The coexistence of such excitations at both low and high\\nmomentum transfer regions is speculated to be strong electronic correlation and\\nspin-phonon coupling of Ruthenium. By accompanying the INS spectra based on a\\nlinear spin wave theory using SpinW software, we show that Ba5Ru3O12 exhibits\\nspin frustration due to competing exchange interactions between neighboring and\\nnext-neighboring Ru-moments, exchange anisotropy and strong spin-orbit\\ncoupling, which yields a non-collinear spin structure, in contrast to other\\nruthenate trimers in this series. Interestingly, these magnetic excitations\\ndoes not completely vanish even at high temperatures above TN , evidencing\\nshort-range magnetic correlations in this trimer system. This is further\\nsupported by muSR spectroscopy, which exhibits a gradual drop in the initial\\nasymmetry around the magnetic phase transition and is further verified through\\nmaximum entropy analysis. The results of muSR spectroscopy indicates a dynamic\\nnature of magnetic order, attributed to local magnetic anisotropy within the\\ntrimer as a result of local structural distortion and different hybridization,\\nconsistent with canted spin-structure. We predict the ground state of\\nRu3O12-isolated trimer through theoretical calculations which agree with the\\nexperimentally observed spin excitation.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el\", \"published\": \"2025-04-08T15:06:01Z\"}"}
