{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20853v1\", \"title\": \"Multiwavelength thermometry without a priori emissivity information:\\n  from promise to disillusionment\", \"summary\": \"Infrared (IR) thermography provides 2D radiance maps of the IR radiation\\nleaving the surfaces of a scene, based on preliminary calibration. Then, to\\nconvert radiance maps into temperature maps, we need to know the emissivity of\\neach element of the scene conjugated to each of the detector elements in the\\ncamera's focal plane. Compared to the single-band approach, can multispectral\\nthermography help solve the inverse temperature-emissivity separation problem?\\nMultiwavelength thermometry (MWT) is known to be an underdetermined problem\\nhaving a continuous infinity of solutions. For this reason, and right from the\\norigin of MWT, it appeared necessary to introduce information on emissivity to\\nassess temperature, for example, by means of an analytical model. Overlooking\\nthese recommendations, a number of papers appeared in the early 2000s exploring\\nthe idea that we could do without any a priori knowledge of emissivity. Growth\\nbecame exponential from 2020 onward, with the allegedly successful application\\nof neural networks, genetic algorithms, and other novel optimization methods.\\nThe aim of the present work is to recall the consequences of MWT as an\\nunderdetermined inverse problem, to highlight the errors made by ignoring them,\\nand to bring us back to harsh reality: we must introduce information on\\nemissivity in order to evaluate temperature accurately. Furthermore, this\\ninformation has to be fully consistent with the true spectral emissivity. To\\nthis end, we propose a new method for optimal selection of the emissivity\\nmodel. A series of blind tests was set up to benchmark different inversion\\nalgorithms. The results confirm the failure of the temperature-emissivity\\nseparation when no emissivity information is available, despite the\\nmultiwavelength approach, which in any case comes as no surprise.\", \"main_category\": \"physics.app-ph\", \"categories\": \"physics.app-ph,physics.ins-det,physics.optics\", \"published\": \"2025-04-29T15:22:39Z\"}"}
