{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01722v1\", \"title\": \"{GSR4B}: Biomass Map Super-Resolution with Sentinel-1/2 Guidance\", \"summary\": \"Accurate Above-Ground Biomass (AGB) mapping at both large scale and high\\nspatio-temporal resolution is essential for applications ranging from climate\\nmodeling to biodiversity assessment, and sustainable supply chain monitoring.\\nAt present, fine-grained AGB mapping relies on costly airborne laser scanning\\nacquisition campaigns usually limited to regional scales. Initiatives such as\\nthe ESA CCI map attempt to generate global biomass products from diverse\\nspaceborne sensors but at a coarser resolution. To enable global,\\nhigh-resolution (HR) mapping, several works propose to regress AGB from HR\\nsatellite observations such as ESA Sentinel-1/2 images. We propose a novel way\\nto address HR AGB estimation, by leveraging both HR satellite observations and\\nexisting low-resolution (LR) biomass products. We cast this problem as Guided\\nSuper-Resolution (GSR), aiming at upsampling LR biomass maps (sources) from\\n$100$ to $10$ m resolution, using auxiliary HR co-registered satellite images\\n(guides). We compare super-resolving AGB maps with and without guidance,\\nagainst direct regression from satellite images, on the public BioMassters\\ndataset. We observe that Multi-Scale Guidance (MSG) outperforms direct\\nregression both for regression ($-780$ t/ha RMSE) and perception ($+2.0$ dB\\nPSNR) metrics, and better captures high-biomass values, without significant\\ncomputational overhead. Interestingly, unlike the RGB+Depth setting they were\\noriginally designed for, our best-performing AGB GSR approaches are those that\\nmost preserve the guide image texture. Our results make a strong case for\\nadopting the GSR framework for accurate HR biomass mapping at scale. Our code\\nand model weights are made publicly available\\n(https://github.com/kaankaramanofficial/GSR4B).\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-02T13:28:27Z\"}"}
