{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09994v1\", \"title\": \"Physical Scales Matter: The Role of Receptive Fields and Advection in\\n  Satellite-Based Thunderstorm Nowcasting with Convolutional Neural Networks\", \"summary\": \"The focus of nowcasting development is transitioning from physically\\nmotivated advection methods to purely data-driven Machine Learning (ML)\\napproaches. Nevertheless, recent work indicates that incorporating advection\\ninto the ML value chain has improved skill for radar-based precipitation\\nnowcasts. However, the generality of this approach and the underlying causes\\nremain unexplored. This study investigates the generality by probing the\\napproach on satellite-based thunderstorm nowcasts for the first time. Resorting\\nto a scale argument, we then put forth an explanation when and why skill\\nimprovements can be expected. In essence, advection guarantees that\\nthunderstorm patterns relevant for nowcasting are contained in the receptive\\nfield at long lead times. To test our hypotheses, we train ResU-Nets solving\\nsegmentation tasks with lightning observations as ground truth. The input of\\nthe Baseline Neural Network (BNN) are short time series of multispectral\\nsatellite imagery and lightning observations, whereas the Advection-Informed\\nNeural Network (AINN) additionally receives the Lagrangian persistence nowcast\\nof all input channels at the desired lead time. Overall, we find only a minor\\nskill improvement of the AINN over the BNN when considering fully averaged\\nscores. However, assessing skill conditioned on lead time and wind speed, we\\ndemonstrate that our scale argument correctly predicts the onset of skill\\nimprovement of the AINN over the BNN after 2h lead time. We confirm that\\ngenerally advection becomes gradually more important with longer lead times and\\nhigher wind speeds. Our work accentuates the importance of considering and\\nincorporating the underlying physical scales when designing ML based\\nforecasting models.\", \"main_category\": \"physics.ao-ph\", \"categories\": \"physics.ao-ph,cs.LG\", \"published\": \"2025-04-14T08:57:59Z\"}"}
