{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21289v1\", \"title\": \"Orthogonal Factor-Based Biclustering Algorithm (BCBOF) for\\n  High-Dimensional Data and Its Application in Stock Trend Prediction\", \"summary\": \"Biclustering is an effective technique in data mining and pattern\\nrecognition. Biclustering algorithms based on traditional clustering face two\\nfundamental limitations when processing high-dimensional data: (1) The distance\\nconcentration phenomenon in high-dimensional spaces leads to data sparsity,\\nrendering similarity measures ineffective; (2) Mainstream linear dimensionality\\nreduction methods disrupt critical local structural patterns. To apply\\nbiclustering to high-dimensional datasets, we propose an orthogonal\\nfactor-based biclustering algorithm (BCBOF). First, we constructed orthogonal\\nfactors in the vector space of the high-dimensional dataset. Then, we performed\\nclustering using the coordinates of the original data in the orthogonal\\nsubspace as clustering targets. Finally, we obtained biclustering results of\\nthe original dataset. Since dimensionality reduction was applied before\\nclustering, the proposed algorithm effectively mitigated the data sparsity\\nproblem caused by high dimensionality. Additionally, we applied this\\nbiclustering algorithm to stock technical indicator combinations and stock\\nprice trend prediction. Biclustering results were transformed into fuzzy rules,\\nand we incorporated profit-preserving and stop-loss rules into the rule set,\\nultimately forming a fuzzy inference system for stock price trend predictions\\nand trading signals. To evaluate the performance of BCBOF, we compared it with\\nexisting biclustering methods using multiple evaluation metrics. The results\\nshowed that our algorithm outperformed other biclustering techniques. To\\nvalidate the effectiveness of the fuzzy inference system, we conducted virtual\\ntrading experiments using historical data from 10 A-share stocks. The\\nexperimental results showed that the generated trading strategies yielded\\nhigher returns for investors.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-30T03:49:08Z\"}"}
