{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21755v1\", \"title\": \"Test particle motion around a black hole dressed with a spherically\\n  symmetric stationary fluid\", \"summary\": \"We investigate the motion of a massive particle around a spherically\\nsymmetric black hole surrounded by a stationary and radial inflow of perfect\\nfluid. The background spacetime is modelled as a spherically symmetric solution\\nto the Einstein field equations, where the effect of the fluid on the geometry\\nis treated as a perturbation on the Schwarzschild background. The equation of\\nstate for the fluid is assumed to follow the linear relationship $p = w \\\\rho$,\\nwhere $p$ is the pressure, $\\\\rho$ is the energy density with $w$ being a\\nconstant. The stress-energy tensor is treated as a phenomenological model to\\ncapture deviations from the vacuum Einstein theory. We allow the parameter $w$\\nof the equation of state to take both positive and negative values accepting a\\nbroad range of scenarios including exotic ones. Specifically, we examine the\\ncases $w =2/3$, $1/3$, $-3/4$ and $-4/3$. For $\\\\rho\\\\geq0$, the former two cases\\nsatisfy all standard energy conditions while the case of $w=-3/4$ violates the\\nstrong energy condition and the case of $w=-4/3$ violates all standard energy\\nconditions. By solving the geodesic equations, we visualize the time-like\\ngeodesics around the black hole, focusing on the apsis shift of the orbit. To\\ngain further insight into the effects of accretion, we employ the method of\\nosculating orbital elements. Additionally, we analyze the observable effects on\\nspacetime by studying the redshift of the orbiting test particles as an example\\nof possible observables. We show that the difference in the particle orbits due\\nto the matter accretion may be probed by using the redshift observation of\\nstars orbiting around the black hole.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc\", \"published\": \"2025-04-30T15:51:14Z\"}"}
