{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11414v1\", \"title\": \"A magnetar powers the luminous supernova 2023pel, associated with a long\\n  gamma-ray burst\", \"summary\": \"We explore SN 2023pel, the most recent event associated with gamma-ray bursts\\n(GRBs), specifically GRB 230812B. SN 2023pel has a high luminosity and low\\nexpansion velocities compared to other GRB-SNe. These properties seem difficult\\nto reconcile with a single nickel power source. We searched for models that can\\nexplain the properties of this event. We calculated a grid of hydrodynamic\\nmodels based on pre-SN structures derived from evolutionary calculations. We\\ncompared our models with observations of SN~2023pel and selected our preferred\\nmodel using statistical analysis, taking both light curves and expansion\\nvelocities into account. This allowed us to derive a set of physical properties\\nfor SN~2023pel. Our models suggest that the most probable scenario involves a\\nmillisecond magnetar as the primary power source, supplemented by energy from\\nradioactive decay. Our preferred model has a spin period of P = 3.2 ms, a\\nmagnetic field of B = 28 x 10^14 G, an explosion energy of 2.3 foe, a nickel\\nmass of M_Ni= 0.24 solar masses, and an ejected mass of 3.4 solar masses.\\nAlternatively, we find that a purely nickel-powered model also provides a good\\nmatch with the observations, though M_Ni > 0.8 solar masses are always\\nrequired. However, the combination of such high values of M_Ni and low M_ej is\\ndifficult to reconcile, indicating that this scenario is less probable. We have\\nalso identified a specific region within the peak luminosity-velocity plane\\nwhere an additional energy source beyond nickel may be necessary to power SNe\\nwith characteristics similar to SN~2023pel. Our study indicates that an\\nadditional energy source beyond radioactive decay is essential to explain the\\nhigh brightness and relatively low expansion velocities of SN 2023pel. A\\nmagnetar-powered model, similar to the models proposed for the very luminous\\nGRB-SN 2011kl, aligns well with these characteristics.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.SR\", \"published\": \"2025-04-15T17:31:03Z\"}"}
