{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02394v1\", \"title\": \"Mass, Luminosity, and Stellar Age of Early-type Stars from the LAMOST\\n  Survey\", \"summary\": \"Mass ($M$) and luminosity ($L$) are fundamental parameters of stars but can\\nonly be measured indirectly. Typically, effective temperature ($T_{\\\\rm eff}$),\\nsurface gravity (${\\\\rm log}\\\\ g$) and metallicity ([M/H]) are derived from\\nstellar spectra, then $M$, $L$ and stellar age ($t$) can be obtained by\\ninterpolating in the grid of stellar evolutionary models. In this paper, we use\\nthe Random Forest (RF) in combination with the evolutionary grid from PARSEC\\n1.2S to determine $M$, $L$, $t$ and initial mass ($M_{\\\\rm i}$) for early-type\\nmain-sequence stars ($T_{\\\\rm eff}\\\\geq 7,000\\\\ {\\\\rm K}$) as identified from the\\nLAMOST survey. The convex hull algorithm is employed to select the\\nmain-sequence stars. The results demonstrate that the prediction precision is\\n$32\\\\%$ and $9\\\\%$ for $L$ and $M$, respectively, which is comparable to that\\nachieved by fitting evolutionary tracks. Furthermore, the predicted $L$ also\\naligns with Gaia's observations, with a relative difference of $36\\\\%$. The\\nprediction for $t$ is relatively less accurate, indicating a difference of 0.44\\nGyr for two components in wide binaries. This discrepancy is due to the\\ninconsistent metallicity measurements. For the two sets of atmospheric\\nparameters we used, the relative differences in $L$, $M$, $t$ and $M_{\\\\rm i}$\\nare $29\\\\%$, $7\\\\%$, $36\\\\%$ and $7\\\\%$, respectively. The influence of metallicity\\non these parameters is analyzed, with the conclusion that metallicity has the\\ngreatest impact on $t$. Consequently, two catalogs are presented, which would\\nbe useful for studying stellar populations such as the luminosity function and\\ninitial mass function of early-type stars.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA\", \"published\": \"2025-04-03T08:41:14Z\"}"}
