{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11826v1\", \"title\": \"When Should I Run My Application Benchmark?: Studying Cloud Performance\\n  Variability for the Case of Stream Processing Applications\", \"summary\": \"Performance benchmarking is a common practice in software engineering,\\nparticularly when building large-scale, distributed, and data-intensive\\nsystems. While cloud environments offer several advantages for running\\nbenchmarks, it is often reported that benchmark results can vary significantly\\nbetween repetitions -- making it difficult to draw reliable conclusions about\\nreal-world performance. In this paper, we empirically quantify the impact of\\ncloud performance variability on benchmarking results, focusing on stream\\nprocessing applications as a representative type of data-intensive,\\nperformance-critical system. In a longitudinal study spanning more than three\\nmonths, we repeatedly executed an application benchmark used in research and\\ndevelopment at Dynatrace. This allows us to assess various aspects of\\nperformance variability, particularly concerning temporal effects. With\\napproximately 591 hours of experiments, deploying 789 Kubernetes clusters on\\nAWS and executing 2366 benchmarks, this is likely the largest study of its kind\\nand the only one addressing performance from an end-to-end, i.e., application\\nbenchmark perspective. Our study confirms that performance variability exists,\\nbut it is less pronounced than often assumed (coefficient of variation of <\\n3.7%). Unlike related studies, we find that performance does exhibit a daily\\nand weekly pattern, although with only small variability (<= 2.5%). Re-using\\nbenchmarking infrastructure across multiple repetitions introduces only a\\nslight reduction in result accuracy (<= 2.5 percentage points). These key\\nobservations hold consistently across different cloud regions and machine types\\nwith different processor architectures. We conclude that for engineers and\\nresearchers focused on detecting substantial performance differences (e.g., >\\n5%) in...\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE,cs.DC,cs.PF\", \"published\": \"2025-04-16T07:22:44Z\"}"}
