{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07933v1\", \"title\": \"Geometric and Dosimetric Validation of Deformable Image Registration for\\n  Prostate MR-guided Adaptive Radiotherapy\", \"summary\": \"Objective: Quantify geometric and dosimetric accuracy of a novel prostate\\nMR-to-MR deformable image registration (DIR) approach to support MR-guided\\nadaptive radiation therapy dose accumulation.\\n  Approach: We evaluated DIR accuracy in 25 patients treated with 30 Gy in 5\\nfractions on a 1.5 T MR-linac using an adaptive workflow. A reference MR was\\nused for planning, with three images collected at each fraction: adapt MR for\\nadaptive planning, verify MR for pretreatment position verification and beam-on\\nfor capturing anatomy during radiation delivery. We assessed three DIR\\napproaches: intensity-based, intensity-based with controlling structures (CS)\\nand novel intensity based with controlling structures and points of interest\\n(CS+P). DIRs were performed between the reference and fraction images and\\nwithin fractions. We propagated CTV, bladder, and rectum contours using the\\nDIRs and compared to manual contours using Dice similarity coefficient, mean\\ndistance to agreement (DTAmean), and dose-volume metrics.\\n  Results: CS and CS+P improved geometric agreement between contours over\\nintensity-only DIR. DTAmean for reference-to-beam-on intensity-only DIR was\\n0.131+/-0.009cm (CTV), 0.46+/-0.08cm (bladder), and 0.154+/-0.013cm (rectum).\\nFor the CS, the values were 0.018+/-0.002cm, 0.388+/-0.14cm, and\\n0.036+/-0.013cm. For CS+P these values were 0.015+/-0.001cm, 0.025+/-0.004cm,\\nand 0.021+/-0.002cm. Dosimetrically, comparing CS and CS+P for reference to\\nbeam-on DIRs resulted in a change of CTV D98% from [-29cGy, 19cGy] to [-18cGy,\\n26cGy], rectum D1cc from [-106cGy, 72cGy] to [-52cGy, 74cGy], and bladder D5cc\\nfrom [-51cGy, 544cGy] to [-79cGy, 36cGy].\\n  Significance: CS improved geometric and dosimetric accuracy over\\nintensity-only DIR, with CS+P providing the most consistent performance.\\nHowever, session image segmentation remains a challenge, which may be addressed\\nwith automated contouring.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph\", \"published\": \"2025-04-10T17:47:47Z\"}"}
