{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06980v1\", \"title\": \"Coreset Strikes Back: Improved Parameterized Approximation Schemes for\\n  (Constrained) k-Median/Means\", \"summary\": \"Algorithmic scatter dimension is a notion of metric spaces introduced\\nrecently by Abbasi et al. (FOCS 2023), which unifies many well-known metric\\nspaces, including continuous Euclidean space, bounded doubling space, planar\\nand bounded treewidth metrics. Recently, Bourneuf and Pilipczuk (SODA 2025)\\nshowed that metrics induced by graphs from any fixed proper minor closed graph\\nclass have bounded scatter dimension. Abbasi et al. presented a unified\\napproach to obtain EPASes (i.e., $(1+\\\\epsilon)$-approximations running in time\\nFPT in $k$ and $\\\\epsilon$) for $k$-Clustering in metrics of bounded scatter\\ndimension. However, a seemingly inherent limitation of their approach was that\\nit could only handle clustering objectives where each point was assigned to the\\nclosest chosen center. They explicitly asked, if there exist EPASes for\\nconstrained $k$-Clustering in metrics of bounded scatter dimension.\\n  We present a unified framework which yields EPASes capacitated and fair\\n$k$-Median/Means in metrics of bounded algorithmic scatter dimension. Our\\nframework exploits coresets for such constrained clustering problems in a novel\\nmanner, and notably requires only coresets of size $(k\\\\log n/\\\\epsilon)^{O(1)}$,\\nwhich are usually constuctible even in general metrics. Note that due to\\nexisting lower bounds it is impossible to obtain such an EPAS for Capacitated\\n$k$-Center, thus essentially answering the complete spectrum of the question.\\n  Our results on capacitated and fair $k$-Median/Means provide the first EPASes\\nfor these problems in broad families of metric spaces. Earlier such results\\nwere only known in continuous Euclidean spaces due to Cohen-Addad & Li, (ICALP\\n2019), and Bandyapadhyay, Fomin & Simonov, (ICALP 2021; JCSS 2024),\\nrespectively. Along the way, we obtain faster EPASes for uncapacitated\\n$k$-Median/Means, improving upon the running time of the algorithm by Abbasi et\\nal.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS\", \"published\": \"2025-04-09T15:36:17Z\"}"}
