{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13045v1\", \"title\": \"Expert Kernel Generation Network Driven by Contextual Mapping for\\n  Hyperspectral Image Classification\", \"summary\": \"Deep neural networks face several challenges in hyperspectral image\\nclassification, including high-dimensional data, sparse distribution of ground\\nobjects, and spectral redundancy, which often lead to classification\\noverfitting and limited generalization capability. To more efficiently adapt to\\nground object distributions while extracting image features without introducing\\nexcessive parameters and skipping redundant information, this paper proposes\\nEKGNet based on an improved 3D-DenseNet model, consisting of a context-aware\\nmapping network and a dynamic kernel generation module. The context-aware\\nmapping module translates global contextual information of hyperspectral inputs\\ninto instructions for combining base convolutional kernels, while the dynamic\\nkernels are composed of K groups of base convolutions, analogous to K different\\ntypes of experts specializing in fundamental patterns across various\\ndimensions. The mapping module and dynamic kernel generation mechanism form a\\ntightly coupled system - the former generates meaningful combination weights\\nbased on inputs, while the latter constructs an adaptive expert convolution\\nsystem using these weights. This dynamic approach enables the model to focus\\nmore flexibly on key spatial structures when processing different regions,\\nrather than relying on the fixed receptive field of a single static\\nconvolutional kernel. EKGNet enhances model representation capability through a\\n3D dynamic expert convolution system without increasing network depth or width.\\nThe proposed method demonstrates superior performance on IN, UP, and KSC\\ndatasets, outperforming mainstream hyperspectral image classification\\napproaches.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-17T16:00:06Z\"}"}
