{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21852v1\", \"title\": \"Polka-dotted Stars: a Hierarchical Model for Mapping Stellar Surfaces\\n  Using Occultation Light Curves and the Case of TOI-3884\", \"summary\": \"We present StarryStarryProcess, a novel hierarchical Bayesian framework for\\nmapping stellar surfaces using exoplanet transit light curves. While previous\\nmethods relied solely on stellar rotational light curves--which contain limited\\ninformation about spot properties -- our approach leverages planetary transits\\nas probes of stellar surfaces. When a planet crosses a spot during transit, it\\ncreates a distinctive change in the light curve that directly reveals spot\\nproperties. Our model integrates planetary transit modeling with stellar\\nvariability analysis by combining the spherical harmonic surface map\\nrepresentation from starry, the probabilistic approach to spot properties of\\nStarryProcess, and a comprehensive transit model that accounts for\\nspot-crossing events during transits. We demonstrate through synthetic data\\nexperiments that our model successfully recovers spot distributions, stellar\\norientation, and spot physical properties. We extend the framework to handle\\nevolving stellar surfaces through time-dependent modeling. Applying our method\\nto TESS observations of TOI-3884, we find evidence for high-latitude spot\\nconcentrations and significant spin-orbit misalignment. The transit-based\\napproach overcomes fundamental limitations of previous models by providing\\nconstraints on spot properties that would remain hidden in the null space of\\nrotational light curves alone. This methodology enables more accurate exoplanet\\ncharacterization by disentangling stellar activity due to starspots from\\nplanetary signals while simultaneously providing insights into stellar magnetic\\nactivity patterns. The whole paper is reproducible, and can be found by\\nclicking the GitHub icon.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP,astro-ph.IM,astro-ph.SR\", \"published\": \"2025-04-30T17:58:54Z\"}"}
