{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23691v1\", \"title\": \"A Conceptual Framework for Human-AI Collaborative Genome Annotation\", \"summary\": \"Genome annotation is essential for understanding the functional elements\\nwithin genomes. While automated methods are indispensable for processing\\nlarge-scale genomic data, they often face challenges in accurately predicting\\ngene structures and functions. Consequently, manual curation by domain experts\\nremains crucial for validating and refining these predictions. These combined\\noutcomes from automated tools and manual curation highlight the importance of\\nintegrating human expertise with AI capabilities to improve both the accuracy\\nand efficiency of genome annotation. However, the manual curation process is\\ninherently labor-intensive and time-consuming, making it difficult to scale for\\nlarge datasets. To address these challenges, we propose a conceptual framework,\\nHuman-AI Collaborative Genome Annotation (HAICoGA), which leverages the\\nsynergistic partnership between humans and artificial intelligence to enhance\\nhuman capabilities and accelerate the genome annotation process. Additionally,\\nwe explore the potential of integrating Large Language Models (LLMs) into this\\nframework to support and augment specific tasks. Finally, we discuss emerging\\nchallenges and outline open research questions to guide further exploration in\\nthis area.\", \"main_category\": \"q-bio.GN\", \"categories\": \"q-bio.GN,cs.HC\", \"published\": \"2025-03-31T03:44:00Z\"}"}
{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23709v1\", \"title\": \"Expanding-and-Shrinking Binary Neural Networks\", \"summary\": \"While binary neural networks (BNNs) offer significant benefits in terms of\\nspeed, memory and energy, they encounter substantial accuracy degradation in\\nchallenging tasks compared to their real-valued counterparts. Due to the\\nbinarization of weights and activations, the possible values of each entry in\\nthe feature maps generated by BNNs are strongly constrained. To tackle this\\nlimitation, we propose the expanding-and-shrinking operation, which enhances\\nbinary feature maps with negligible increase of computation complexity, thereby\\nstrengthening the representation capacity. Extensive experiments conducted on\\nmultiple benchmarks reveal that our approach generalizes well across diverse\\napplications ranging from image classification, object detection to generative\\ndiffusion model, while also achieving remarkable improvement over various\\nleading binarization algorithms based on different architectures including both\\nCNNs and Transformers.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-03-31T04:13:33Z\"}"}
