{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16409v1\", \"title\": \"A Molecular Dynamics Study of Size Effects for Critical Resolved Shear\\n  Stress in Nickel Superalloys\", \"summary\": \"We present in this work a molecular dynamics study of a size effect relating\\nto the volume fraction of gamma-prime precipitate of edge dislocation motion in\\na simple model of Nickel superalloys. We model the superalloy as periodically\\nspaced cubic gamma-prime precipitates inside a uniform gamma matrix. We then\\nanalyze the motion of paired edge dislocations in the gamma phase when subject\\nto an external shear stress for various volume fractions of the gamma-prime\\nprecipitate for a wide range of temperatures, from 300 K to 700 K. While the\\nvariation of dislocation velocity is not significant, the critical resolved\\nshear stress is found to exhibit a power law dependence on the volume fraction\\nof the gamma-prime precipitate with two distinct regimes which have similar\\nexponent but markedly different prefactors; we also observe that this\\ntwo-regime behavior remains true across a wide range of temperatures. We\\npresent a detailed analysis of this behavior and reduce it to a linear\\ndependence of the critical resolved shear stress on the length of the\\ngamma-prime precipitate along the direction of dislocation motion. We further\\nidentify the critical length scale underlying the transition between the two\\nobserved regimes as the total core width of the paired dislocations in a pure\\ngamma-prime system, which includes in addition to the complex stacking fault\\nseparating the partials of the paired dislocations the width of the anti-phase\\nboundary that is formed between the super-dislocations. The results presented\\nin this work provides new details on the strengthening effect of gamma-prime\\nprecipitates in nickel superalloys and also has important implications for\\nlarger scale dislocation dynamics studies for nickel superalloys.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-23T04:24:03Z\"}"}
