{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14965v1\", \"title\": \"A Security Framework for General Blockchain Layer 2 Protocols\", \"summary\": \"Layer 2 (L2) solutions are the cornerstone of blockchain scalability,\\nenabling high-throughput and low-cost interactions by shifting execution\\noff-chain while maintaining security through interactions with the underlying\\nledger. Despite their common goals, the principal L2 paradigms -- payment\\nchannels, rollups, and sidechains -- differ substantially in architecture and\\nassumptions, making it difficult to comparatively analyze their security and\\ntrade-offs.\\n  To address this, we present the first general security framework for L2\\nprotocols. Our framework is based on the IITM-based Universal Composability\\n(iUC) framework, in which L2 protocols are modeled as stateful machines\\ninteracting with higher-level protocol users and the underlying ledger. The\\nmethodology defines a generic execution environment that captures ledger\\nevents, message passing, and adversarial scheduling, and characterizes security\\nthrough trace-based predicates parameterized by adversarial capabilities and\\ntiming assumptions. By abstracting away from protocol-specific details while\\npreserving critical interface and execution behavior, the framework enables\\nmodular, protocol-agnostic reasoning and composable security proofs across a\\nwide range of L2 constructions.\\n  To demonstrate its applicability, we analyze an example from each of the\\nthree dominant L2 scaling paradigms: a payment channel (Brick), a sidechain\\n(Liquid Network), and a rollup (Arbitrum). By instantiating each within our\\nframework, we derive their security properties and expose trade-offs. These\\ninclude the time for dispute resolution, distribution of off-chain storage and\\ncomputation, and varying trust assumptions (e.g., reliance on honest parties or\\ndata availability). Our framework unifies the analysis of diverse L2 designs\\nand pinpoints their strengths and limitations, providing a foundation for\\nsecure, systematic L2 development.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR\", \"published\": \"2025-04-21T08:48:24Z\"}"}
