{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12854v1\", \"title\": \"Versatile, Robust, and Explosive Locomotion with Rigid and Articulated\\n  Compliant Quadrupeds\", \"summary\": \"Achieving versatile and explosive motion with robustness against dynamic\\nuncertainties is a challenging task. Introducing parallel compliance in\\nquadrupedal design is deemed to enhance locomotion performance, which, however,\\nmakes the control task even harder. This work aims to address this challenge by\\nproposing a general template model and establishing an efficient motion\\nplanning and control pipeline. To start, we propose a reduced-order template\\nmodel-the dual-legged actuated spring-loaded inverted pendulum with trunk\\nrotation-which explicitly models parallel compliance by decoupling spring\\neffects from active motor actuation. With this template model, versatile\\nacrobatic motions, such as pronking, froggy jumping, and hop-turn, are\\ngenerated by a dual-layer trajectory optimization, where the singularity-free\\nbody rotation representation is taken into consideration. Integrated with a\\nlinear singularity-free tracking controller, enhanced quadrupedal locomotion is\\nachieved. Comparisons with the existing template model reveal the improved\\naccuracy and generalization of our model. Hardware experiments with a rigid\\nquadruped and a newly designed compliant quadruped demonstrate that i) the\\ntemplate model enables generating versatile dynamic motion; ii) parallel\\nelasticity enhances explosive motion. For example, the maximal pronking\\ndistance, hop-turn yaw angle, and froggy jumping distance increase at least by\\n25%, 15% and 25%, respectively; iii) parallel elasticity improves the\\nrobustness against dynamic uncertainties, including modelling errors and\\nexternal disturbances. For example, the allowable support surface height\\nvariation increases by 100% for robust froggy jumping.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-17T11:20:29Z\"}"}
