{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19872v1\", \"title\": \"The Cosmic Shoreline Revisited: A Metric for Atmospheric Retention\\n  Informed by Hydrodynamic Escape\", \"summary\": \"The \\\"cosmic shoreline\\\", a semi-empirical relation that separates airless\\nworlds from worlds with atmospheres as proposed by Zahnle & Catling (2017), is\\nnow guiding large-scale JWST surveys aimed at detecting rocky exoplanet\\natmospheres. We expand upon this framework by revisiting the shorelines using\\nexisting hydrodynamic escape models applied to Earth-like, Venus-like, and\\nsteam atmospheres for rocky exoplanets, and we estimate energy-limited escape\\nrates for CH4 atmospheres. We determine the critical instellation required for\\natmospheric retention by calculating time-integrated atmospheric mass loss. Our\\nanalysis introduces a new metric for target selection in the Rocky Worlds DDT\\nand refines expectations for rocky planet atmosphere searches in Cycle 4.\\nExploring initial volatile inventory ranging from 0.01% to 1% of planetary\\nmass, we find that its variation prevents the definition of a unique clear-cut\\nshoreline, though non-linear escape physics can reduce this sensitivity to\\ninitial conditions. Additionally, uncertain distributions of high-energy\\nstellar evolution and planet age further blur the critical instellations for\\natmospheric retention, yielding broad shorelines. Hydrodynamic escape models\\nfind atmospheric retention is markedly more favorable for higher-mass planets\\norbiting higher-mass stars, with carbon-rich atmospheres remaining plausible\\nfor 55 Cancri e despite its extreme instellation. Dedicated modeling efforts\\nare needed to better constrain the escape dynamics of secondary atmospheres,\\nsuch as the role of atomic line cooling, especially for Earth-sized planets.\\nFinally, we illustrate how density measurements can be used to statistically\\ntest the existence of the cosmic shorelines, emphasizing the need for more\\nprecise mass and radius measurements.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-28T15:03:56Z\"}"}
