{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23680v1\", \"title\": \"Modeling Framework to Predict Melting Dynamics at Microstructural\\n  Defects in TNT-HMX High Explosive Composites\", \"summary\": \"Many high explosive (HE) formulations are composite materials whose\\nmicrostructure is understood to impact functional characteristics. Interfaces\\nare known to mediate the formation of hot spots that control their safety and\\ninitiation. To study such processes at molecular scales, we developed all-atom\\nforce fields (FFs) for Octol, a prototypical HE formulation comprised of TNT\\n(2,4,6-trinitrotoluene) and HMX\\n(octahydro-1,3,5,7-tetranitro-1,3,5,7-tetrazocine). We extended a FF for TNT\\nand recasted it in a form that can be readily combined with a well-established\\nFF for HMX. The resulting FF was extensively validated against experimental\\nresults and density functional theory calculations. We applied the new combined\\nTNT-HMX FF to predict and rank surface and interface energies, which indicate\\nthat there is an energetic driver for coarsening of microstructural grains in\\nTNT-HMX composites. Finally, we assess the impact of several microstructural\\nenvironments on the dynamic melting of TNT crystal under ultrafast thermal\\nloading. We find that both free surfaces and planar material interfaces are\\neffective nucleation points for TNT melting. However, MD simulations show that\\nTNT crystal is prone to superheating by at least 50 K on sub-nanosecond\\ntimescales and that the degree of superheating is inversely correlated with\\nsurface and interface energy. The modeling framework presented here will enable\\nfuture studies on hot spot formation processes in accident scenarios that are\\ngoverned by strong coupling between microstructural interfaces, material\\nmechanics, momentum and energy transport, phase transitions, and chemistry.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-03-31T03:01:34Z\"}"}
