{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12139v1\", \"title\": \"Characterisation of single microdischarges during plasma electrolytic\\n  oxidation of aluminium and titanium\", \"summary\": \"Plasma electrolytic oxidation (PEO) is a technique used to create\\noxide-ceramic coatings on lightweight metals, such as aluminium, magnesium, and\\ntitanium. PEO is known for producing coatings with high corrosion resistance\\nand strong adhesion to the substrate. The process involves generating\\nshort-lived microdischarges on the material surface through anodic dielectric\\nbreakdown in a conductive aqueous solution. To investigate single\\nmicrodischarges during PEO, a single microdischarge setup was developed, where\\nthe active anode surface is reduced to the tip of a wire with a diameter of 1\\nmm. In this work the focus is on the effect of electrolyte concentration, anode\\nmaterial, and electrical parameters on the microdischarges. The electrolyte is\\ncomposed of distilled water with varying concentrations of potassium hydroxide\\n(0.5 - 4 g/l). High-speed optical measurements are conducted to gain insights\\ninto the formation and temporal evolution of individual microdischarges and the\\ninduced gas bubble formation. Optical emission spectroscopy is used to estimate\\nsurface and electron temperatures by fitting Bremsstrahlung and Planck's law to\\nthe continuum spectrum of the microdischarges. To evaluate the impact of the\\nmicrodischarges on coating morphology, the resulting oxide layers on the metal\\ntips are analysed using scanning electron microscopy. The study demonstrates\\nthat microdischarge behaviour is significantly influenced by the substrate\\nmaterial, treatment time, and electrolyte concentration, all of which impact\\nthe coating morphology. Under the conditions studied in this work, aluminium\\nexhibits longer microdischarge and bubble lifetimes, with fewer cracks on the\\ntop layer of the coating, whereas titanium showed faster, shorter-lived bubbles\\ndue to more rapid microdischarge events.\", \"main_category\": \"physics.plasm-ph\", \"categories\": \"physics.plasm-ph,cond-mat.mtrl-sci\", \"published\": \"2025-04-16T14:51:40Z\"}"}
