{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23774v1\", \"title\": \"Who is in Charge here? Understanding How Runtime Configuration Affects\\n  Software along with Variables&Constants\", \"summary\": \"Runtime misconfiguration can lead to software performance degradation and\\neven cause failure. Developers typically perform sanity checks during the\\nconfiguration parsing stage to prevent invalid parameter values. However, we\\ndiscovered that even valid values that pass these checks can also lead to\\nunexpected severe consequences. Our study reveals the underlying reason: the\\nvalue of runtime configuration parameters may interact with other constants and\\nvariables when propagated and used, altering its original effect on software\\nbehavior. Consequently, parameter values may no longer be valid when\\nencountering complex runtime environments and workloads. Therefore, it is\\nextremely challenging for users to properly configure the software before it\\nstarts running. This paper presents the first comprehensive and in-depth study\\n(to the best of our knowledge) on how configuration affects software at runtime\\nthrough the interaction with constants, and variables (PCV Interaction).\\nParameter values represent user intentions, constants embody developer\\nknowledge, and variables are typically defined by the runtime environment and\\nworkload. This interaction essentially illustrates how different roles jointly\\ndetermine software behavior. In this regard, we studied 705 configuration\\nparameters from 10 large-scale software systems. We reveal that a large portion\\nof configuration parameters interact with constants/variables after parsing. We\\nanalyzed the interaction patterns and their effects on software runtime\\nbehavior. Furthermore, we highlighted the risks of PCV interaction and\\nidentified potential issues behind specific interaction patterns. Our findings\\nexpose the \\\"double edge\\\" of PCV interaction, providing new insights and\\nmotivating the development of new automated techniques to help users configure\\nsoftware appropriately and assist developers in designing better\\nconfigurations.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE,cs.DC,cs.OS\", \"published\": \"2025-03-31T06:48:58Z\"}"}
