{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17349v1\", \"title\": \"DRC: Enhancing Personalized Image Generation via Disentangled\\n  Representation Composition\", \"summary\": \"Personalized image generation has emerged as a promising direction in\\nmultimodal content creation. It aims to synthesize images tailored to\\nindividual style preferences (e.g., color schemes, character appearances,\\nlayout) and semantic intentions (e.g., emotion, action, scene contexts) by\\nleveraging user-interacted history images and multimodal instructions. Despite\\nnotable progress, existing methods -- whether based on diffusion models, large\\nlanguage models, or Large Multimodal Models (LMMs) -- struggle to accurately\\ncapture and fuse user style preferences and semantic intentions. In particular,\\nthe state-of-the-art LMM-based method suffers from the entanglement of visual\\nfeatures, leading to Guidance Collapse, where the generated images fail to\\npreserve user-preferred styles or reflect the specified semantics.\\n  To address these limitations, we introduce DRC, a novel personalized image\\ngeneration framework that enhances LMMs through Disentangled Representation\\nComposition. DRC explicitly extracts user style preferences and semantic\\nintentions from history images and the reference image, respectively, to form\\nuser-specific latent instructions that guide image generation within LMMs.\\nSpecifically, it involves two critical learning stages: 1) Disentanglement\\nlearning, which employs a dual-tower disentangler to explicitly separate style\\nand semantic features, optimized via a reconstruction-driven paradigm with\\ndifficulty-aware importance sampling; and 2) Personalized modeling, which\\napplies semantic-preserving augmentations to effectively adapt the disentangled\\nrepresentations for robust personalized generation. Extensive experiments on\\ntwo benchmarks demonstrate that DRC shows competitive performance while\\neffectively mitigating the guidance collapse issue, underscoring the importance\\nof disentangled representation learning for controllable and effective\\npersonalized image generation.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.IR\", \"published\": \"2025-04-24T08:10:10Z\"}"}
