{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10956v1\", \"title\": \"The effects of asymptotically flat $R^2$ spacetime on black hole image\\n  of Sagittarius A*\", \"summary\": \"A new class of analytically expressible vacuum solutions has recently been\\ndiscovered for pure ${R}^2$ gravity, building upon Buchdahl's seminal work from\\n1962. These solutions, inspired by Buchdahl's framework, offer a promising\\navenue for testing ${R}^2$ gravity against astrophysical observations. Within a\\nsubset of asymptotically flat Buchdahl-inspired vacuum spacetimes, we introduce\\na free parameter $\\\\epsilon$ to characterize deviations from the Schwarzschild\\nmetric, which is recovered in the limit $\\\\epsilon = 0$. In this study, we\\nemploy the publicly available code \\\\textit{ipole} to simulate black hole images\\nunder the Buchdahl-inspired metric, with a focus on the black hole at the\\ncenter of the Milky Way, Sagittarius A* (Sgr A*). Our simulations show that\\nboth the shadow size and photon ring diameter decrease monotonically with\\nincreasing $\\\\epsilon$. By exploring a range of observational inclination\\nangles, we find that the photon ring diameter being a direct observable is only\\nweakly sensitive to the inclination angle. We further constrain the parameter\\n$\\\\epsilon$ by comparing our simulation results with the Event Horizon Telescope\\n(EHT) observations of Sgr A*. The obtained bounds are consistent with those\\npreviously derived from the orbital motion of the S2 star, but provide tighter\\nconstraints. In addition, we analyze the influence of the Buchdahl-inspired\\nspacetime on the polarization patterns near the black hole and find its impact\\nto be minimal. In contrast, the observational inclination angle has a\\nsubstantial effect on the observed polarization structure, highlighting the\\ndominant role of viewing geometry in shaping polarization features.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc\", \"published\": \"2025-04-15T08:02:35Z\"}"}
