{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24317v1\", \"title\": \"Thermodynamic Features of a Heat Engine Coupled with Exponentially\\n  Decreasing Temperature Across the Reaction Coordinate, as well as\\n  Perspectives on Nonequilibrium Thermodynamics\", \"summary\": \"In this study, we advance the understanding of non-equilibrium systems by\\nderiving thermodynamic relations for a heat engine operating under an\\nexponentially decreasing temperature profile. Such thermal configurations\\nclosely mimic spatially localized heating such as laser-induced thermal\\ngradients. Using exact analytical solutions, we show that this arrangement\\nresults in significantly higher velocity, entropy production, and extraction\\nrates than piecewise thermal profiles, while exhibiting reduced irreversibility\\nand complexity relative to linear or quadratic gradients. We further examine\\nthe thermodynamic behavior of the Brownian particles in the networks. Our study\\nreveals that the velocity and entropy production rates remain independent of\\nnetwork size; on the contrary, extensive quantities such as total entropy\\ndepend on the number of microstates. Additionally, we show that a Brownian\\nparticle in a ratchet potential with spatially varying temperature achieves\\ndirected motion, even without external forces driven by solely thermal\\nasymmetry. These findings highlight the critical role of temperature asymmetry\\nin controlling the transport processes and optimizing the particle dynamics.\\nThis in turn will have promising applications in microfluidic devices and\\nnanoscale sensors. Finally, we explore the influence of the system parameters\\non the efficiency and performance of the heat engine. The exponential\\ntemperature profiles enable faster velocities while simultaneously exhibiting\\nhigher efficiency compared with other thermal arrangements. Moreover, by\\naddressing key questions on entropy production, we provide insights into the\\ntransition between nonequilibrium and equilibrium systems and contribute tools\\nfor optimizing energy-efficient systems in both natural and engineered\\nsettings.\", \"main_category\": \"cond-mat.stat-mech\", \"categories\": \"cond-mat.stat-mech\", \"published\": \"2025-03-31T17:07:01Z\"}"}
