{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15996v1\", \"title\": \"Small-scale dynamic phenomena associated with interacting fan-spine\\n  topologies: quiet-Sun Ellerman bombs, UV brightenings, and chromospheric\\n  inverted-Y-shaped jets\", \"summary\": \"QSEBs are small-scale magnetic reconnection events in lower solar atmosphere.\\nSometimes, they exhibit transition region counterparts, known as UV\\nbrightenings. Magnetic field extrapolations suggest that QSEBs can occur at\\nvarious locations of a fan-spine topology, with UV brightening occurring at\\nnull point through a common reconnection process. We aim to understand how\\ncomplex magnetic configurations like interacting fan-spine topologies can cause\\nsmall-scale dynamic phenomena in lower atmosphere. QSEBs were detected using\\nk-means clustering on Hbeta observations from Swedish 1-m Solar Telescope\\n(SST). Further, chromospheric inverted-Y-shaped jets were identified in the\\nHbeta blue wing. Magnetic field topologies were determined through potential\\nfield extrapolations from photospheric magnetograms using the Fe I 6173 A line.\\nUV brightenings were detected in IRIS 1400 A SJI. We identify two distinct\\nmagnetic configurations associated with QSEBs, UV brightenings, and\\nchromospheric inverted-Y-shaped jets. The first involves a nested fan-spine\\nstructure where, due to flux emergence, an inner 3D null forms inside fan\\nsurface of an outer 3D null with some overlap. QSEBs occur at two footpoints\\nalong the shared fan surface, with UV brightening located near the outer 3D\\nnull point. The jet originates close to the two QSEBs and follows the path of\\nhigh squashing factor Q. We discuss a comparable scenario using a numerical\\nsimulation. In second case, two adjacent fan-spine topologies share fan\\nfootpoints at a common positive polarity patch, with the QSEB, along with a\\nchromospheric inverted-Y-shaped jet, occurring at the intersection having high\\nQ values. This study demonstrates through observational and modelling support\\nthat associated QSEBs, UV brightenings, and chromospheric inverted-Y-shaped\\njets share a common origin driven by magnetic reconnection between interacting\\nfan-spine topologies.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-22T16:01:37Z\"}"}
