{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05035v1\", \"title\": \"Divide-and-Conquer: Cold-Start Bundle Recommendation via Mixture of\\n  Diffusion Experts\", \"summary\": \"Cold-start bundle recommendation focuses on modeling new bundles with\\ninsufficient information to provide recommendations. Advanced bundle\\nrecommendation models usually learn bundle representations from multiple views\\n(e.g., interaction view) at both the bundle and item levels. Consequently, the\\ncold-start problem for bundles is more challenging than that for traditional\\nitems due to the dual-level multi-view complexity. In this paper, we propose a\\nnovel Mixture of Diffusion Experts (MoDiffE) framework, which employs a\\ndivide-and-conquer strategy for cold-start bundle recommendation and follows\\nthree steps:(1) Divide: The bundle cold-start problem is divided into\\nindependent but similar sub-problems sequentially by level and view, which can\\nbe summarized as the poor representation of feature-missing bundles in\\nprior-embedding models. (2) Conquer: Beyond prior-embedding models that\\nfundamentally provide the embedded representations, we introduce a\\ndiffusion-based method to solve all sub-problems in a unified way, which\\ndirectly generates diffusion representations using diffusion models without\\ndepending on specific features. (3) Combine: A cold-aware hierarchical Mixture\\nof Experts (MoE) is employed to combine results of the sub-problems for final\\nrecommendations, where the two models for each view serve as experts and are\\nadaptively fused for different bundles in a multi-layer manner. Additionally,\\nMoDiffE adopts a multi-stage decoupled training pipeline and introduces a\\ncold-start gating augmentation method to enable the training of gating for cold\\nbundles. Through extensive experiments on three real-world datasets, we\\ndemonstrate that MoDiffE significantly outperforms existing solutions in\\nhandling cold-start bundle recommendation. It achieves up to a 0.1027 absolute\\ngain in Recall@20 in cold-start scenarios and up to a 47.43\\\\% relative\\nimprovement in all-bundle scenarios.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-05-08T08:13:44Z\"}"}
