{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01632v1\", \"title\": \"Benchmarking the Spatial Robustness of DNNs via Natural and Adversarial\\n  Localized Corruptions\", \"summary\": \"The robustness of DNNs is a crucial factor in safety-critical applications,\\nparticularly in complex and dynamic environments where localized corruptions\\ncan arise. While previous studies have evaluated the robustness of semantic\\nsegmentation (SS) models under whole-image natural or adversarial corruptions,\\na comprehensive investigation into the spatial robustness of dense vision\\nmodels under localized corruptions remained underexplored. This paper fills\\nthis gap by introducing specialized metrics for benchmarking the spatial\\nrobustness of segmentation models, alongside with an evaluation framework to\\nassess the impact of localized corruptions. Furthermore, we uncover the\\ninherent complexity of characterizing worst-case robustness using a single\\nlocalized adversarial perturbation. To address this, we propose region-aware\\nmulti-attack adversarial analysis, a method that enables a deeper understanding\\nof model robustness against adversarial perturbations applied to specific\\nregions. The proposed metrics and analysis were evaluated on 15 segmentation\\nmodels in driving scenarios, uncovering key insights into the effects of\\nlocalized corruption in both natural and adversarial forms. The results reveal\\nthat models respond to these two types of threats differently; for instance,\\ntransformer-based segmentation models demonstrate notable robustness to\\nlocalized natural corruptions but are highly vulnerable to adversarial ones and\\nvice-versa for CNN-based models. Consequently, we also address the challenge of\\nbalancing robustness to both natural and adversarial localized corruptions by\\nmeans of ensemble models, thereby achieving a broader threat coverage and\\nimproved reliability for dense vision tasks.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-02T11:37:39Z\"}"}
