{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20944v1\", \"title\": \"Deep Learning Characterizes Depression and Suicidal Ideation from Eye\\n  Movements\", \"summary\": \"Identifying physiological and behavioral markers for mental health conditions\\nis a longstanding challenge in psychiatry. Depression and suicidal ideation, in\\nparticular, lack objective biomarkers, with screening and diagnosis primarily\\nrelying on self-reports and clinical interviews. Here, we investigate eye\\ntracking as a potential marker modality for screening purposes. Eye movements\\nare directly modulated by neuronal networks and have been associated with\\nattentional and mood-related patterns; however, their predictive value for\\ndepression and suicidality remains unclear. We recorded eye-tracking sequences\\nfrom 126 young adults as they read and responded to affective sentences, and\\nsubsequently developed a deep learning framework to predict their clinical\\nstatus. The proposed model included separate branches for trials of positive\\nand negative sentiment, and used 2D time-series representations to account for\\nboth intra-trial and inter-trial variations. We were able to identify\\ndepression and suicidal ideation with an area under the receiver operating\\ncurve (AUC) of 0.793 (95% CI: 0.765-0.819) against healthy controls, and\\nsuicidality specifically with 0.826 AUC (95% CI: 0.797-0.852). The model also\\nexhibited moderate, yet significant, accuracy in differentiating depressed from\\nsuicidal participants, with 0.609 AUC (95% CI 0.571-0.646). Discriminative\\npatterns emerge more strongly when assessing the data relative to response\\ngeneration than relative to the onset time of the final word of the sentences.\\nThe most pronounced effects were observed for negative-sentiment sentences,\\nthat are congruent to depressed and suicidal participants. Our findings\\nhighlight eye tracking as an objective tool for mental health assessment and\\nunderscore the modulatory impact of emotional stimuli on cognitive processes\\naffecting oculomotor control.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,eess.SP\", \"published\": \"2025-04-29T17:11:13Z\"}"}
