{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05202v1\", \"title\": \"Infinitely Divisible Noise for Differential Privacy: Nearly Optimal\\n  Error in the High $\\\\varepsilon$ Regime\", \"summary\": \"Differential privacy (DP) can be achieved in a distributed manner, where\\nmultiple parties add independent noise such that their sum protects the overall\\ndataset with DP. A common technique here is for each party to sample their\\nnoise from the decomposition of an infinitely divisible distribution. We\\nanalyze two mechanisms in this setting: 1) the generalized discrete Laplace\\n(GDL) mechanism, whose distribution (which is closed under summation) follows\\nfrom differences of i.i.d. negative binomial shares, and 2) the multi-scale\\ndiscrete Laplace (MSDLap) mechanism, a novel mechanism following the sum of\\nmultiple i.i.d. discrete Laplace shares at different scales.\\n  For $\\\\varepsilon \\\\geq 1$, our mechanisms can be parameterized to have\\n$O\\\\left(\\\\Delta^3 e^{-\\\\varepsilon}\\\\right)$ and $O\\\\left(\\\\min\\\\left(\\\\Delta^3\\ne^{-\\\\varepsilon}, \\\\Delta^2 e^{-2\\\\varepsilon/3}\\\\right)\\\\right)$ MSE,\\nrespectively, where $\\\\Delta$ denote the sensitivity; the latter bound matches\\nknown optimality results. We also show a transformation from the discrete\\nsetting to the continuous setting, which allows us to transform both mechanisms\\nto the continuous setting and thereby achieve the optimal $O\\\\left(\\\\Delta^2\\ne^{-2\\\\varepsilon / 3}\\\\right)$ MSE. To our knowledge, these are the first\\ninfinitely divisible additive noise mechanisms that achieve order-optimal MSE\\nunder pure DP, so our work shows formally there is no separation in utility\\nwhen query-independent noise adding mechanisms are restricted to infinitely\\ndivisible noise. For the continuous setting, our result improves upon the Arete\\nmechanism from [Pagh and Stausholm, ALT 2022] which gives an MSE of\\n$O\\\\left(\\\\Delta^2 e^{-\\\\varepsilon/4}\\\\right)$. Furthermore, we give an exact\\nsampler tuned to efficiently implement the MSDLap mechanism, and we apply our\\nresults to improve a state of the art multi-message shuffle DP protocol in the\\nhigh $\\\\varepsilon$ regime.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.DS\", \"published\": \"2025-04-07T15:50:46Z\"}"}
