{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06179v1\", \"title\": \"Plug and Play Distributed Control of Clustered Energy Hub Networks\", \"summary\": \"The transition to renewable energy is driving the rise of distributed\\nmulti-energy systems, in which individual energy hubs and prosumers (e.g.,\\nhomes, industrial campuses) generate, store, and trade energy. Economic Model\\nPredictive Control (MPC) schemes are widely used to optimize operation of\\nenergy hubs by efficiently dispatching resources and minimizing costs while\\nensuring operational constraints are met. Peer-to-peer (P2P) energy trading\\namong hubs enhances network efficiency and reduces costs but also increases\\ncomputational and privacy challenges, especially as the network scales.\\nAdditionally, current distributed control techniques require global\\nrecomputation whenever the network topology changes, limiting scalability. To\\naddress these challenges, we propose a clustering-based P2P trading framework\\nthat enables plug-and-play operation, allowing energy hubs to seamlessly join\\nor leave without requiring network-wide controller updates. The impact is\\nrestricted to the hubs within the affected cluster. The energy trading problem\\nis formulated as a bi-level bargaining game, where inter-cluster trading\\ncommitments are determined at the cluster level, while energy dispatch and\\ncost-sharing among hubs within a cluster are refined at the hub level. Both\\nlevels are solved in a distributed manner using ADMM, ensuring computational\\nfeasibility and privacy preservation. Moreover, we develop plug-and-play\\nprocedures to handle dynamic topology changes at both the hub and cluster\\nlevels, minimizing disruptions across the network. Simulation results\\ndemonstrate that the proposed bi-level framework reduces operational costs, and\\nenables scalable energy management under plug-and-play operation.\", \"main_category\": \"eess.SY\", \"categories\": \"eess.SY,cs.SY\", \"published\": \"2025-04-08T16:21:23Z\"}"}
