{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16802v1\", \"title\": \"Cyclic Zoom: Multi-scale GRMHD Modeling of Black Hole Accretion and\\n  Feedback\", \"summary\": \"We present a ``cyclic zoom'' method to capture the dynamics of accretion\\nflows onto black holes across a vast range of spatial and temporal scales in\\ngeneral relativistic magnetohydrodynamic (GRMHD) simulations. In this method,\\nwe cyclically zoom out (derefine) and zoom in (refine) the simulation domain\\nwhile using a central mask region containing a careful treatment of the\\ncoarsened fluid variables to preserve the small-scale physics, particularly the\\nmagnetic field dynamics. The method can accelerate GRMHD simulations by\\n$\\\\gtrsim 10^5$ times for problems with large scale separation. We demonstrate\\nthe validity of the technique using a series of tests, including spherically\\nsymmetric Bondi accretion, the Blandford-Znajek monopole, magnetized turbulent\\nBondi accretion, accretion of a magnetized rotating torus, and the long-term\\nevolution of an accreting torus about both Schwarzschild and Kerr black holes.\\nAs applications, we simulate Bondi and rotating torus accretion onto black\\nholes from galactic scales, covering an extremely large dynamic range. In Bondi\\naccretion, the accretion rate is suppressed relative to the Bondi rate by\\n$\\\\sim(10r_\\\\mathrm{g}/r_\\\\mathrm{B})^{1/2}$ with a feedback power of $\\\\sim 0.01\\n\\\\dot{M} c^2$ for vanishing spin, and $\\\\sim 0.1 \\\\dot{M} c^2$ for spin\\n$a\\\\approx0.9$. In the long-term evolution of a rotating torus, the accretion\\nrate decreases with time as $\\\\dot{M}\\\\propto t^{-2}$ on timescales much longer\\nthan the viscous timescale, demonstrating that our method can capture not only\\nquasi-steady problems but also secular evolution. Our new method likewise holds\\nsignificant promise for applications to many other problems that need to cover\\nvast spatial and temporal scales.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.GA\", \"published\": \"2025-04-23T15:21:34Z\"}"}
