{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16811v1\", \"title\": \"A novel method for measuring the attenuation length and the group\\n  velocity of transparent liquids in a variable length cavity\", \"summary\": \"The transparency of liquid scintillators or water is an important parameter\\nfor many detectors in particle and astroparticle physics. In this work, the\\nCavity Enhanced Long Light Path Attenuation Length Screening (CELLPALS) method\\nfor the determination of the attenuation length is presented for the first\\ntime. The method is based on an experimental setup similar to a Fabry-P\\\\'erot\\ninterferometer but adding up multiple-reflected intensities of a modulated\\nlight source. CELLPALS was developed to measure the attenuation length of\\nhighly transparent liquids (> 10 m) with significantly lower uncertainties than\\nwith UV-Vis spectroscopy, which is a standard method for determining the\\nattenuation length. In addition to the attenuation length, the group velocity\\nof light in the sample can also be derived from the free spectral range of the\\ncavity, which is not provided by any conventional method for determining the\\nattenuation length. In this work, the CELLPALS method, its achievable precision\\nand an experimental setup to demonstrate its feasibility are discussed. The\\nattenuation lengths and group velocities of several transparent liquids were\\nmeasured at wavelengths between 420 nm and 435 nm. In addition, the attenuation\\nlength and group velocity of linear alkylbenzene (LAB) samples after different\\npurification stages and a purified LAB-based liquid scintillator were measured\\nat a wavelength of 425 nm. The results confirmed the potential of CELLPALS to\\ndetermine the attenuation length with an uncertainty of ~ 2 %. The group\\nvelocity of light in the sample can be determined with an uncertainty of ~ 0.03\\n%.\", \"main_category\": \"physics.ins-det\", \"categories\": \"physics.ins-det,hep-ex\", \"published\": \"2025-04-23T15:30:04Z\"}"}
