{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19890v1\", \"title\": \"Dissipative particle dynamics models of encapsulated microbubbles and\\n  gas vesicles for biomedical ultrasound simulations\", \"summary\": \"Ultrasound-guided drug and gene delivery (usdg) enables controlled and\\nspatially precise delivery of drugs and macromolecules, encapsulated in\\nmicrobubbles (embs) and submicron gas vesicles (gvs), to target areas such as\\ncancer tumors. It is a non-invasive, high precision, low toxicity process with\\ndrastically reduced drug dosage. Rheological and acoustic properties of gvs and\\nembs critically affect the outcome of usdg and imaging. Detailed understanding\\nand modeling of their physical properties is thus essential for\\nultrasound-mediated therapeutic applications. State-of-the-art continuuum\\nmodels of shelled bodies cannot incorporate critical details such as varying\\nthickness of the encapsulating shell or specific interactions between its\\nconstituents and interior or exterior solvents. Such modeling approaches also\\ndo not allow for detailed modeling of chemical surface functionalizations,\\nwhich are crucial for tuning the gv-blood interactions. We develop a general\\nparticle-based modeling framework for encapsulated bodies that accurately\\ncaptures elastic and rheological properties of gvs and embs. We use dissipative\\nparticle dynamics to model the solvent, the gaseous phase in the capsid, and\\nthe triangulated surfaces of immersed objects. Their elastic behavior is\\nstudied and validated through stretching and buckling simulations, eigenmode\\nanalysis, shear flow simulations, and comparison of predicted gv buckling\\npressure with experimental data from the literature. The presented modeling\\napproach paves the way for large-scale simulations of encapsulated bodies,\\ncapturing their dynamics, interactions, and collective behavior.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft,physics.bio-ph,physics.comp-ph\", \"published\": \"2025-04-28T15:23:45Z\"}"}
