{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11298v1\", \"title\": \"Giant Magnetocaloric Effect in Spin Supersolid Candidate\\n  Na$_2$BaCo(PO$_4$)$_2$\", \"summary\": \"Supersolid, an exotic quantum state of matter that consists of particles\\nforming an incompressible solid structure while simultaneously showing\\nsuperfluidity of zero viscosity [1], is one of the long-standing pursuits in\\nfundamental research [2, 3]. Although the initial report of $^4$He supersolid\\nturned out to be an artifact [4], this intriguing quantum matter has inspired\\nenthusiastic investigations into ultracold quantum gases [5-8]. Nevertheless,\\nthe realization of supersolidity in condensed matter remains elusive. Here we\\nfind evidence for a quantum magnetic analogue of supersolid -- the spin\\nsupersolid -- in the recently synthesized triangular-lattice antiferromagnet\\nNa$_2$BaCo(PO$_4$)$_2$ [9]. Notably, a giant magnetocaloric effect related to\\nthe spin supersolidity is observed in the demagnetization cooling process,\\nmanifesting itself as two prominent valley-like regimes, with the lowest\\ntemperature attaining below 100 mK. Not only is there an experimentally\\ndetermined series of critical fields but the demagnetization cooling profile\\nalso shows excellent agreement with the theoretical simulations with an\\neasy-axis Heisenberg model. Neutron diffractions also successfully locate the\\nproposed spin supersolid phases by revealing the coexistence of\\nthree-sublattice spin solid order and interlayer incommensurability indicative\\nof the spin superfluidity. Thus, our results indicate a strong entropic effect\\nof the spin supersolid phase in a frustrated quantum magnet and open up a\\nviable and promising avenue for applications in sub-Kelvin refrigeration,\\nespecially in the context of persistent concerns about helium shortages [10,\\n11].\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el\", \"published\": \"2025-04-15T15:37:03Z\"}"}
