{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02457v1\", \"title\": \"Size and shape of the trans-Neptunian object (470316) 2007 OC10:\\n  Comparison with thermal data\", \"summary\": \"The shapes of only 12 trans-Neptunian objects have been directly measured,\\noffering crucial insights into their internal structure. These properties are\\nstrongly connected to the processes that shaped the early Solar System, and\\nprovide important clues about its evolution.\\n  The aim of the present work is to characterise the size, shape, geometric\\nalbedo, and beaming parameter of the TNO (470316) 2007 OC10 . We compared these\\nvalues to the effective diameter and geometric albedo obtained from thermal\\ndata by the TNOs are Cool survey. We also combined occultation and thermal data\\nto constrain the size of a putative unresolved satellite.\\n  We predicted an occultation of the star Gaia DR3 2727866328215869952 by 2007\\nOC10 on 2022 August 22. Four stations detected the occultation. We implemented\\nan elliptical shape model for the projection of 2007 OC10. Following a Bayesian\\napproach, we obtained the posterior probability density in the model parameter\\nspace using a Markov chain Monte Carlo method.\\n  The elliptical limb of 2007 OC10 has semi-axes of $ 215^{+10}_{-7} \\\\times 141\\n^{+24}_{-23}$ km, and thus the projected axis ratio is $b/a =\\n0.58^{+0.16}_{-0.16}$. The area-equivalent diameter is $330^{+56}_{-55}$,km.\\nFrom our own absolute magnitude value of $H_V = 5.40 \\\\pm 0.02$, the geometric\\nalbedo is $p_V = 11.2 ^{+2.1}_{-5.0}$ %. Combining the occultation results with\\nthermal data, we constrain the beaming parameter to $\\\\eta =\\n1.42^{+0.75}_{-0.58}$. Occultation data reveal that the star is double. The\\nsecondary star has a position angle with respect to the primary of\\n$56^{+3}_{-17}$ degrees, has an angular separation of $57^{+4}_{-11}$ mas, and\\nis $1.18^{+0.07}_{-0.07}$ magnitudes fainter than the primary.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-03T10:21:03Z\"}"}
