{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11928v1\", \"title\": \"The Jade Gateway to Trust: Exploring How Socio-Cultural Perspectives\\n  Shape Trust Within Chinese NFT Communities\", \"summary\": \"Today's world is witnessing an unparalleled rate of technological\\ntransformation. The emergence of non-fungible tokens (NFTs) has transformed how\\nwe handle digital assets and value. Despite their initial popularity, NFTs face\\ndeclining adoption influenced not only by cryptocurrency volatility but also by\\ntrust dynamics within communities. From a social computing perspective,\\nunderstanding these trust dynamics offers valuable insights for the development\\nof both the NFT ecosystem and the broader digital economy. China presents a\\ncompelling context for examining these dynamics, offering a unique intersection\\nof technological innovation and traditional cultural values. Through a content\\nanalysis of eight Chinese NFT-focused WeChat groups and 21 semi-structured\\ninterviews, we examine how socio-cultural factors influence trust formation and\\ndevelopment. We found that trust in Chinese NFT communities is significantly\\nmolded by local cultural values. To be precise, Confucian virtues, such as\\nbenevolence, propriety, and integrity, play a crucial role in shaping these\\ntrust relationships. Our research identifies three critical trust dimensions in\\nChina's NFT market: (1) technological, (2) institutional, and (3) social. We\\nexamined the challenges in cultivating each dimension. Based on these insights,\\nwe developed tailored trust-building guidelines for Chinese NFT stakeholders.\\nThese guidelines address trust issues that factor into NFT's declining\\npopularity and could offer valuable strategies for CSCW researchers,\\ndevelopers, and designers aiming to enhance trust in global NFT communities.\\nOur research urges CSCW scholars to take into account the unique socio-cultural\\ncontexts when developing trust-enhancing strategies for digital innovations and\\nonline interactions.\", \"main_category\": \"cs.CY\", \"categories\": \"cs.CY,cs.HC\", \"published\": \"2025-04-16T10:03:30Z\"}"}
