{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06118v1\", \"title\": \"Dynamical Dark Energy in light of the DESI DR2 Baryonic Acoustic\\n  Oscillations Measurements\", \"summary\": \"We investigate whether dark energy deviates from the cosmological constant\\n($\\\\Lambda$CDM) by analyzing baryon acoustic oscillation (BAO) measurements from\\nthe Data Release 1 (DR1) and Data Release 2 (DR2) of DESI observations, in\\ncombination with Type Ia supernovae (SNe) and cosmic microwave background (CMB)\\ndistance information. We find that with the larger statistical power and wider\\nredshift coverage of the DR2 dataset the preference for dynamical dark energy\\ndoes not decrease and remains at approximately the same statistical\\nsignificance as for DESI~DR1. Employing both a shape-function reconstruction\\nand non-parametric methods with a correlation prior derived from Horndeski\\ntheory, we consistently find that the dark energy equation of state $w(z)$\\nevolves with redshift. While DESI DR1 and DR2 BAO data alone provide modest\\nconstraints, combining them with independent SNe samples (PantheonPlus, Union3,\\nand the DES 5-year survey) and a CMB distance prior strengthens the evidence\\nfor dynamical dark energy. Bayesian model-selection tests show moderate support\\nfor dark energy dynamics when multiple degrees of freedom in $w(z)$ are\\nallowed, pointing to increasing tension with $\\\\Lambda$CDM at a level of roughly\\n$3\\\\sigma$ (or more in certain data combinations). Although the methodology\\nadopted in this work is different from those used in companion DESI papers, we\\nfind consistent results, demonstrating the complementarity of dark energy\\nstudies performed by the DESI collaboration. Although possible systematic\\neffects must be carefully considered, it currently seems implausible that\\n$\\\\Lambda$CDM will be rescued by future high-precision surveys, such as the\\ncomplete DESI, Euclid, and next-generation CMB experiments. These results\\ntherefore highlight the possibility of new physics driving cosmic acceleration\\nand motivate further investigation into dynamical dark energy models.\", \"main_category\": \"astro-ph.CO\", \"categories\": \"astro-ph.CO\", \"published\": \"2025-04-08T15:11:35Z\"}"}
