{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17463v1\", \"title\": \"Hemispheric Distribution of Solar Active Regions During Solar Cycles\\n  23-25\", \"summary\": \"Solar active regions (ARs) are crucial for understanding the long-term\\nevolution of solar activities and predicting eruptive phenomena, including\\nsolar flares and coronal mass ejections. However, the cycle-dependent\\nproperties in the north-south asymmetry of ARs have not been fully understood.\\nIn this study, we investigate the hemispheric distribution of ARs from\\nCarrington Rotation 1909 to 2278 (between 1996 May and 2023 November) by using\\nthree parameters that describe the magnetic field distribution of ARs: number,\\narea, and flux. The main findings are as follows: (1) The three AR parameters\\nshow significant hemispheric asymmetry in cycles 23-25. The strong correlation\\nbetween AR area and flux indicates that they can better reflect the intrinsic\\nproperties of solar magnetic field. (2) The correlation between sunspot\\nactivity and AR parameters varies in the two hemispheres across the different\\ncycles. The AR parameters provide additional information for the variations in\\nsunspot activity, which can better predict the intensity and cyclical changes\\nof solar activity. (3) The variation in the fitting slope sign of the asymmetry\\nindex for AR parameters reflects periodic changes in hemispheric ARs, providing\\nvaluable insights into the activity of other stars. (4) Both the dominant\\nhemisphere and the cumulative trend of AR parameters display a cycle-dependent\\nbehavior. Moreover, the trend variations of AR area and flux are similar,\\nreflecting the long-term evolutionary characteristics of solar magnetic field.\\nOur analysis results are relevant for understanding the hemispheric coupling of\\nsolar magnetic activity and its cyclic evolutionary patterns.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-24T11:53:48Z\"}"}
