{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09975v1\", \"title\": \"OctGPT: Octree-based Multiscale Autoregressive Models for 3D Shape\\n  Generation\", \"summary\": \"Autoregressive models have achieved remarkable success across various\\ndomains, yet their performance in 3D shape generation lags significantly behind\\nthat of diffusion models. In this paper, we introduce OctGPT, a novel\\nmultiscale autoregressive model for 3D shape generation that dramatically\\nimproves the efficiency and performance of prior 3D autoregressive approaches,\\nwhile rivaling or surpassing state-of-the-art diffusion models. Our method\\nemploys a serialized octree representation to efficiently capture the\\nhierarchical and spatial structures of 3D shapes. Coarse geometry is encoded\\nvia octree structures, while fine-grained details are represented by binary\\ntokens generated using a vector quantized variational autoencoder (VQVAE),\\ntransforming 3D shapes into compact \\\\emph{multiscale binary sequences} suitable\\nfor autoregressive prediction. To address the computational challenges of\\nhandling long sequences, we incorporate octree-based transformers enhanced with\\n3D rotary positional encodings, scale-specific embeddings, and token-parallel\\ngeneration schemes. These innovations reduce training time by 13 folds and\\ngeneration time by 69 folds, enabling the efficient training of high-resolution\\n3D shapes, e.g.,$1024^3$, on just four NVIDIA 4090 GPUs only within days.\\nOctGPT showcases exceptional versatility across various tasks, including text-,\\nsketch-, and image-conditioned generation, as well as scene-level synthesis\\ninvolving multiple objects. Extensive experiments demonstrate that OctGPT\\naccelerates convergence and improves generation quality over prior\\nautoregressive methods, offering a new paradigm for high-quality, scalable 3D\\ncontent creation.\", \"main_category\": \"cs.GR\", \"categories\": \"cs.GR,cs.CV\", \"published\": \"2025-04-14T08:31:26Z\"}"}
