{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03463v1\", \"title\": \"Nonperiodic dynamic CT reconstruction using backward-warping INR with\\n  regularization of diffeomorphism (BIRD)\", \"summary\": \"Dynamic computed tomography (CT) reconstruction faces significant challenges\\nin addressing motion artifacts, particularly for nonperiodic rapid movements\\nsuch as cardiac imaging with fast heart rates. Traditional methods struggle\\nwith the extreme limited-angle problems inherent in nonperiodic cases. Deep\\nlearning methods have improved performance but face generalization challenges.\\nRecent implicit neural representation (INR) techniques show promise through\\nself-supervised deep learning, but have critical limitations: computational\\ninefficiency due to forward-warping modeling, difficulty balancing DVF\\ncomplexity with anatomical plausibility, and challenges in preserving fine\\ndetails without additional patient-specific pre-scans. This paper presents a\\nnovel INR-based framework, BIRD, for nonperiodic dynamic CT reconstruction. It\\naddresses these challenges through four key contributions: (1) backward-warping\\ndeformation that enables direct computation of each dynamic voxel with\\nsignificantly reduced computational cost, (2) diffeomorphism-based DVF\\nregularization that ensures anatomically plausible deformations while\\nmaintaining representational capacity, (3) motion-compensated analytical\\nreconstruction that enhances fine details without requiring additional\\npre-scans, and (4) dimensional-reduction design for efficient 4D coordinate\\nencoding. Through various simulations and practical studies, including digital\\nand physical phantoms and retrospective patient data, we demonstrate the\\neffectiveness of our approach for nonperiodic dynamic CT reconstruction with\\nenhanced details and reduced motion artifacts. The proposed framework enables\\nmore accurate dynamic CT reconstruction with potential clinical applications,\\nsuch as one-beat cardiac reconstruction, cinematic image sequences for\\nfunctional imaging, and motion artifact reduction in conventional CT scans.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,physics.med-ph\", \"published\": \"2025-05-06T12:01:40Z\"}"}
