{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11402v1\", \"title\": \"Complex multiannual cycles of Mycoplasma pneumoniae: persistence and the\\n  role of stochasticity\", \"summary\": \"The epidemiological dynamics of Mycoplasma pneumoniae are characterized by\\ncomplex and poorly understood multiannual cycles, posing challenges for\\nforecasting. Using Bayesian methods to fit a seasonally forced transmission\\nmodel to long-term surveillance data from Denmark (1958-1995, 2010-2025), we\\ninvestigate the mechanisms driving recurrent outbreaks of M. pneumoniae. The\\nperiod of the multiannual cycles (predominantly approx. 5 years in Denmark) are\\nexplained as a consequence of the interaction of two time-scales in the system,\\none intrinsic and one extrinsic (seasonal). While it provides an excellent fit\\nto shorter time series (a few decades), we find that the deterministic model\\neventually settles into an annual cycle, failing to reproduce the observed\\n4-5-year periodicity long-term. Upon further analysis, the system is found to\\nexhibit transient chaos and thus high sensitivity to stochasticity. We show\\nthat environmental (but not purely demographic) stochasticity can sustain the\\nmulti-year cycles via stochastic resonance. The disruptive effects of COVID-19\\nnon-pharmaceutical interventions (NPIs) on M. pneumoniae circulation constitute\\na natural experiment on the effects of large perturbations. Consequently, the\\neffects of NPIs are included in the model and medium-term predictions are\\nexplored. Our findings highlight the intrinsic sensitivity of M. pneumoniae\\ndynamics to perturbations and interventions, underscoring the limitations of\\ndeterministic epidemic models for long-term prediction. More generally, our\\nresults emphasize the potential role of stochasticity as a driver of complex\\ncycles across endemic and recurring pathogens.\", \"main_category\": \"q-bio.PE\", \"categories\": \"q-bio.PE,nlin.CD\", \"published\": \"2025-04-15T17:18:10Z\"}"}
