{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15255v1\", \"title\": \"Population Models for Star Formation Timescales in Early Galaxies: The\\n  First Step Towards Solving Outshining in Star Formation History Inference\", \"summary\": \"JWST have revealed temporarily-quenched and ultraviolet-luminous galaxies in\\nthe early universe, suggesting enhanced star formation stochasticity. Verifying\\nthis hypothesis is critical, yet challenging; outshining, wherein light from\\nyoung stars dominates the spectral energy distribution, represents perhaps the\\ngreatest challenge in inferring the formation histories of unresolved galaxies.\\nIn this paper, we take a simple model of burstiness and show that\\nstate-of-the-art inference methods with flexible star formation histories\\n(SFHs) and neutral priors, while recovering average star formation rates (SFRs;\\n$\\\\sim0.1$ dex median offset), fail to recover the complexities of fluctuations\\non tens of Myr timescales, and typically underestimate masses in bursty systems\\n($\\\\sim0.15$ dex). Surprisingly, detailed SFH recovery is still sensitive to\\npriors even when data quality is optimal, e.g., including high signal-to-noise\\n($\\\\rm20~pixel^{-1}$) spectroscopy with wide coverage (rest-frame\\n$0.12-1.06~\\\\mu$m). Crucially, however, refitting the same data with a prior\\ncorrectly encoding the bursty expectation eliminates these biases: median\\noffsets in mass and SFRs decrease to $\\\\sim 0.04$ dex and $\\\\sim 0.05$ dex,\\nrespectively. Under the assumption that current population burstiness predicts\\npast SFH, the solution to outshining in modeling statistical samples is\\nempirically measuring recent galaxy SFHs with population modeling. A prototype\\nis H$\\\\alpha$/UV: while helpful, it is insufficient to constrain the expected\\ncomplex burstiness. To this end, we introduce a more complete, quantitative\\npopulation-level approach and demonstrate that it promises to recover the\\ntypical amplitude, timescale, and slope of the recent SFH to high accuracy.\\nThis approach thus has the strong potential to solve outshining using\\nobservations from JWST.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-21T17:34:55Z\"}"}
