{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10281v1\", \"title\": \"Zero-shot Autonomous Microscopy for Scalable and Intelligent\\n  Characterization of 2D Materials\", \"summary\": \"Characterization of atomic-scale materials traditionally requires human\\nexperts with months to years of specialized training. Even for trained human\\noperators, accurate and reliable characterization remains challenging when\\nexamining newly discovered materials such as two-dimensional (2D) structures.\\nThis bottleneck drives demand for fully autonomous experimentation systems\\ncapable of comprehending research objectives without requiring large training\\ndatasets. In this work, we present ATOMIC (Autonomous Technology for Optical\\nMicroscopy & Intelligent Characterization), an end-to-end framework that\\nintegrates foundation models to enable fully autonomous, zero-shot\\ncharacterization of 2D materials. Our system integrates the vision foundation\\nmodel (i.e., Segment Anything Model), large language models (i.e., ChatGPT),\\nunsupervised clustering, and topological analysis to automate microscope\\ncontrol, sample scanning, image segmentation, and intelligent analysis through\\nprompt engineering, eliminating the need for additional training. When\\nanalyzing typical MoS2 samples, our approach achieves 99.7% segmentation\\naccuracy for single layer identification, which is equivalent to that of human\\nexperts. In addition, the integrated model is able to detect grain boundary\\nslits that are challenging to identify with human eyes. Furthermore, the system\\nretains robust accuracy despite variable conditions including defocus, color\\ntemperature fluctuations, and exposure variations. It is applicable to a broad\\nspectrum of common 2D materials-including graphene, MoS2, WSe2, SnSe-regardless\\nof whether they were fabricated via chemical vapor deposition or mechanical\\nexfoliation. This work represents the implementation of foundation models to\\nachieve autonomous analysis, establishing a scalable and data-efficient\\ncharacterization paradigm that fundamentally transforms the approach to\\nnanoscale materials research.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,cond-mat.mes-hall,cs.AI,cs.CV,cs.LG\", \"published\": \"2025-04-14T14:49:45Z\"}"}
