{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04509v1\", \"title\": \"Cosmic reflections I: the structural diversity of simulated and observed\\n  low-mass galaxy analogues\", \"summary\": \"Dwarf galaxies serve as powerful laboratories for investigating the\\nunderlying physics of galaxy evolution including the impact of baryonic\\nfeedback processes and environmental influences. We compare the visual and\\nstructural properties of dwarf galaxies in ultra-deep HSC-SSP imaging of the\\nCOSMOS field with those measured from realistic HSC-like synthetic observations\\nof dwarfs generated by the Illustris TNG50 and NewHorizon simulations. Using\\nS\\\\'ersic profile fitting and non-parametric morphological metrics (Gini,\\n$M_{20}$, asymmetry, and concentration), we evaluate the diversity of\\nstructural properties in observed and simulated galaxies.\\n  Our analysis shows that NewHorizon and TNG50 galaxies lie at opposite\\nextremes of observed structural trends: NewHorizon produces diffuse, extended\\ngalaxies with shallow S\\\\'ersic indices, while TNG50 yields compact,\\nconcentrated systems with steep indices. Both simulations reproduce observed\\nstructural trends more closely at higher stellar masses ($M_{\\\\star}\\\\sim10^{9.5}\\n{\\\\rm M_{\\\\odot}}$) but fail to capture the full diversity of COSMOS dwarfs at\\nlower masses. Non-parametric metrics further show that NewHorizon galaxies\\nexhibit more uneven, clumpy light distributions while TNG50 galaxies have\\nsmoother but excessively concentrated profiles. These structural differences\\nreflect underlying differences in their physical prescriptions and are likely\\ndriven by differing approaches to ISM physics, supernova feedback and star\\nformation in addition to differences in numerical resolution.\\n  Our findings highlight the unique power of low-mass galaxies to constrain\\ndifferences in simulation physics, especially star formation and feedback.\\nUpcoming surveys from facilities like the Vera C. Rubin Observatory and Euclid\\nwill enable more rigorous comparisons with simulations, offering deeper\\ninsights into the physical processes shaping galaxy evolution.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-05-07T15:29:41Z\"}"}
