{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21328v1\", \"title\": \"Multi-level datasets training method in Physics-Informed Neural Networks\", \"summary\": \"Physics-Informed Neural Networks have emerged as a promising methodology for\\nsolving PDEs, gaining significant attention in computer science and various\\nphysics-related fields. Despite being demonstrated the ability to incorporate\\nthe physics of laws for versatile applications, PINNs still struggle with the\\nchallenging problems which are stiff to be solved and/or have high-frequency\\ncomponents in the solutions, resulting in accuracy and convergence issues. It\\nmay not only increase computational costs, but also lead to accuracy loss or\\nsolution divergence. In this study, an alternative approach is proposed to\\nmitigate the above-mentioned problems. Inspired by the multi-grid method in CFD\\ncommunity, the underlying idea of the current approach is to efficiently remove\\ndifferent frequency errors via training with different levels of training\\nsamples, resulting in a simpler way to improve the training accuracy without\\nspending time in fine-tuning of neural network structures, loss weights as well\\nas hyperparameters. To demonstrate the efficacy of current approach, we first\\ninvestigate canonical 1D ODE with high-frequency component and 2D\\nconvection-diffusion equation with V-cycle training strategy. Finally, the\\ncurrent method is employed for the classical benchmark problem of steady\\nLid-driven cavity flows at different Reynolds numbers, to investigate the\\napplicability and efficacy for the problem involved multiple modes of high and\\nlow frequency. By virtue of various training sequence modes, improvement\\nthrough predictions lead to 30% to 60% accuracy improvement. We also\\ninvestigate the synergies between current method and transfer learning\\ntechniques for more challenging problems (i.e., higher Re). From the present\\nresults, it also revealed that the current framework can produce good\\npredictions even for the case of Re=5000, demonstrating the ability to solve\\ncomplex high-frequency PDEs.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.CE,physics.flu-dyn\", \"published\": \"2025-04-30T05:30:27Z\"}"}
