{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15905v1\", \"title\": \"GraphEdge: Dynamic Graph Partition and Task Scheduling for GNNs\\n  Computing in Edge Network\", \"summary\": \"With the exponential growth of Internet of Things (IoT) devices, edge\\ncomputing (EC) is gradually playing an important role in providing\\ncost-effective services. However, existing approaches struggle to perform well\\nin graph-structured scenarios where user data is correlated, such as traffic\\nflow prediction and social relationship recommender systems. In particular,\\ngraph neural network (GNN)-based approaches lead to expensive server\\ncommunication cost. To address this problem, we propose GraphEdge, an efficient\\nGNN-based EC architecture. It considers the EC system of GNN tasks, where there\\nare associations between users and it needs to take into account the task data\\nof its neighbors when processing the tasks of a user. Specifically, the\\narchitecture first perceives the user topology and represents their data\\nassociations as a graph layout at each time step. Then the graph layout is\\noptimized by calling our proposed hierarchical traversal graph cut algorithm\\n(HiCut), which cuts the graph layout into multiple weakly associated subgraphs\\nbased on the aggregation characteristics of GNN, and the communication cost\\nbetween different subgraphs during GNN inference is minimized. Finally, based\\non the optimized graph layout, our proposed deep reinforcement learning (DRL)\\nbased graph offloading algorithm (DRLGO) is executed to obtain the optimal\\noffloading strategy for the tasks of users, the offloading strategy is\\nsubgraph-based, it tries to offload user tasks in a subgraph to the same edge\\nserver as possible while minimizing the task processing time and energy\\nconsumption of the EC system. Experimental results show the good effectiveness\\nand dynamic adaptation of our proposed architecture and it also performs well\\neven in dynamic scenarios.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-22T13:45:13Z\"}"}
