{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12985v1\", \"title\": \"Accurate Modeling of LEGO-like vdW Heterostructures: Integrating Machine\\n  Learned with Anisotropic Interlayer Potentials\", \"summary\": \"Accurately modeling the structural reconstruction and thermodynamic behavior\\nof van der Waals (vdW) heterostructures remains a significant challenge due to\\nthe limitations of conventional force fields in capturing their complex\\nmechanical, thermal, electronic, and tribological properties. To address these\\nlimitations, we develop a hybrid framework that combines single-layer\\nmachine-learned potential ($s$MLP) with physics-based anisotropic interlayer\\npotential (ILP), effectively decoupling intralayer and interlayer interactions.\\nThis $s$MLP+ILP approach modularizes the modeling of vdW heterostructures like\\nassembling LEGOs, reducing the required training configurations by at least an\\norder of magnitude compared to the pure MLP approach, while retaining\\npredictive accuracy and computational efficiency. We validate our framework by\\naccurately reproducing the mechanical properties of graphite, and resolving\\nintricate Moir\\\\'e patterns in graphene/$h$-BN bilayers and\\ngraphene/graphene/$h$-BN trilayer heterostructures, achieving excellent\\nagreement with experimental observations. Leveraging the developed $s$MLP+ILP\\napproach, we reveal the stacking order-dependent formation of Moir\\\\'e\\nsuperlattice in trilayer graphene/$h$-BN/MoS$_2$ heterostructures,\\ndemonstrating its ability to accurately model large-scale vdW systems\\ncomprising hundreds of thousands of atoms with near $ab$ $initio$ precision.\\nThese findings demonstrate that hybrid $s$MLP+ILP framework remarkably\\noutperforms existing pure machine-learned or empirical potentials, offering a\\nscalable and transferable solution for accurately and extensively modeling\\ncomplex vdW materials across diverse applications, including sliding\\nferroelectricity, thermal management, resistive switching, and superlubric\\nnanodevices.\", \"main_category\": \"physics.comp-ph\", \"categories\": \"physics.comp-ph\", \"published\": \"2025-04-17T14:47:59Z\"}"}
