{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04268v1\", \"title\": \"Sign competing sources of Berry curvature and anomalous Hall conductance\\n  humps in topological ferromagnets\", \"summary\": \"The use of Berry-phase concepts has established a strong link between the\\nanomalous Hall effect (AHE) and the topological character of the Hall currents.\\nHowever, the occurrence of sign competition in the Berry curvature often\\nhinders the topological origin of the observed anomalous Hall effects. Here, we\\nstudy a two-dimensional topological ferromagnet with coupled spin and orbital\\ndegrees of freedom to assess the anomalous Hall effects in the presence of\\nsign-competing sources of Berry curvature. We show that 2D itinerant\\ntopological ferromagnets described by t2g electronic states can generally lead\\nto topological metallic bands marked by a non-zero Chern number. We find that\\nthe resulting Berry curvature at the Fermi level exhibits a characteristic\\nanisotropic profile with a non-monotonous angular dependence when the\\nmagnetization is reversed. The sign change of the intrinsic contribution to the\\nanomalous Hall conductance can occur together with topological transitions or\\nbe driven by the population imbalance of the topological bands. The breaking of\\nthe inversion symmetry introduces the orbital Rashba coupling in the system.\\nThe interplay between the orbital Rashba and sign competing sources of Berry\\ncurvature leads to anomalies in the anomalous Hall conductance at values of\\nmagnetic fields for which the magnetization switches its orientation. The humps\\nin topological ferromagnets arise when the anomalous Hall conductivity is small\\nin absolute value and they can be detected only close to the sign-change of the\\nAHE and far from half-filling. This study could be relevant for the family of\\nthe topological 2D ferromagnets as well as Weyl ferromagnets, and can\\nparticularly account for the variety of unconventional behaviors observed in\\nultrathin films of SrRuO$_3$.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el,cond-mat.mes-hall\", \"published\": \"2025-05-07T09:19:25Z\"}"}
