{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24266v1\", \"title\": \"EP240414a: Off-axis View of a Jet-Cocoon System from an Expanded\\n  Progenitor Star\", \"summary\": \"When a relativistic jet is launched following the core-collapse of a star,\\nits interaction with the stellar envelope leads to the formation of a hot\\ncocoon, which produces various viewing-angle-dependent observational phenomena\\nfollowing the breakout from the surface. We study the observational signatures\\nof fast X-ray transient (FXT) EP240414a, which may originate from a jet-cocoon\\nsystem viewed slightly off-axis. In our model, (1) the prompt X-ray emission\\nlasting $\\\\sim\\\\! 100\\\\,{\\\\rm{s}}$ is attributed to the cooling emission from the\\ninner cocoon (shocked jet material); (2) the $\\\\sim\\\\! 0.1\\\\,{\\\\rm{d}}$ X-ray\\nemission comes from the inner cocoon's afterglow; (3) the $\\\\sim\\\\!\\n0.4\\\\,{\\\\rm{d}}$ thermal-dominated optical emission arises from the cooling of\\nthe outer cocoon (shocked stellar material); (4) the $\\\\sim\\\\! 3\\\\,{\\\\rm{d}}$\\nnon-thermal optical component and subsequent radio emission can be explained by\\nthe afterglow from a jet with a viewing angle of $10^{\\\\circ}\\\\lesssim\\n\\\\theta_{\\\\rm{v}}\\\\lesssim15^\\\\circ$; and (5) the associated broad-lined Type Ic\\nsupernova only dominates the optical emission after $\\\\sim\\\\! 7\\\\rm\\\\, d$. Both the\\njet inferred from the off-axis afterglow and the inner cocoon constrained by\\nthe cooling emission are found to have similar kinetic energies, on the order\\nof $10^{51}\\\\,{\\\\rm{erg}}$. We find that the progenitor's radius is\\n$\\\\sim3\\\\,R_\\\\odot$ as constrained by the { inner cocoon's} cooling emissions,\\nindicating that the pre-explosion star may be a massive helium star that is\\nslightly inflated. More FXTs associated with off-axis jets and supernovae will\\nbe further examined by the Einstein Probe, leading to a deeper understanding of\\njet-cocoon systems.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-03-31T16:12:46Z\"}"}
