{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03595v1\", \"title\": \"Anant-Net: Breaking the Curse of Dimensionality with Scalable and\\n  Interpretable Neural Surrogate for High-Dimensional PDEs\", \"summary\": \"High-dimensional partial differential equations (PDEs) arise in diverse\\nscientific and engineering applications but remain computationally intractable\\ndue to the curse of dimensionality. Traditional numerical methods struggle with\\nthe exponential growth in computational complexity, particularly on hypercubic\\ndomains, where the number of required collocation points increases rapidly with\\ndimensionality. Here, we introduce Anant-Net, an efficient neural surrogate\\nthat overcomes this challenge, enabling the solution of PDEs in high\\ndimensions. Unlike hyperspheres, where the internal volume diminishes as\\ndimensionality increases, hypercubes retain or expand their volume (for unit or\\nlarger length), making high-dimensional computations significantly more\\ndemanding. Anant-Net efficiently incorporates high-dimensional boundary\\nconditions and minimizes the PDE residual at high-dimensional collocation\\npoints. To enhance interpretability, we integrate Kolmogorov-Arnold networks\\ninto the Anant-Net architecture. We benchmark Anant-Net's performance on\\nseveral linear and nonlinear high-dimensional equations, including the Poisson,\\nSine-Gordon, and Allen-Cahn equations, demonstrating high accuracy and\\nrobustness across randomly sampled test points from high-dimensional space.\\nImportantly, Anant-Net achieves these results with remarkable efficiency,\\nsolving 300-dimensional problems on a single GPU within a few hours. We also\\ncompare Anant-Net's results for accuracy and runtime with other\\nstate-of-the-art methods. Our findings establish Anant-Net as an accurate,\\ninterpretable, and scalable framework for efficiently solving high-dimensional\\nPDEs.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-05-06T14:56:43Z\"}"}
