{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10939v1\", \"title\": \"Formation of Ba stars : impact of wind Roche lobe overflow and\\n  circumbinary disk in shaping the orbital parameters\", \"summary\": \"After more than three decades of investigation, the distribution of Ba stars\\nin the e-log P diagram still defies our understanding. Recent smooth particle\\nhydrodynamic simulations involving an asymptotic giant branch (AGB) primary\\nhave shown that a circumbinary disk (CB) can form around the binary and that\\nthe presence of dust in the wind of evolved low- and intermediate-mass stars\\ncan significantly affect the systemic angular momentum loss and mass accretion\\nonto the companion through the wind Roche lobe overflow (WRLOF) phase. We used\\nthe binary evolution code BINSTAR, where we updated the modeling of the\\nprogenitors of Ba stars including a CB disk, the WRLOF, tidally enhanced wind\\nmass loss, and non-conservative RLOF with their effects on the orbital\\nevolution. In our approach, we considered that a CB disk forms when WRLOF is\\nactivated. The coupling between the CB disk and the binary follows the standard\\nresonant interaction theory. We constructed grids of 2.0 + 1.0 $M_\\\\odot{}$ and\\n1.2 + 0.8 $M_\\\\odot{}$ binaries for initial orbital parameters that result in\\nWRLOF, and evolved these systems until the end of the primary's AGB phase.\\nWRLOF resulted in a significant shrinkage of the orbital separation during the\\nAGB phase, leading to binaries with initial periods on the order of $\\\\lesssim\\n12000$ d undergoing Roche lobe overflow (RLOF). The combination of WRLOF,\\neccentricity pumping from the CB disk, and/or tidally enhanced wind mass loss\\ncan lead to RLOF on eccentric orbits down to periods of $P_\\\\mathrm{orb} \\\\sim\\n3000$d. Non-conservative RLOF enabled a reduction of the period before\\ncircularization down to $\\\\sim 2000$d, provided at least 50 percent of the\\ntransferred mass left the system. Our models still cannot account for the\\neccentricity distribution of Ba stars with periods shorter than $P_\\\\mathrm{orb}\\n\\\\lesssim 2000$d, where a common envelope evolution appears unavoidable.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR\", \"published\": \"2025-04-15T07:39:51Z\"}"}
