{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03541v1\", \"title\": \"Defect analysis of the $\\u03b2$- to $\\u03b3$-Ga$_{2}$O$_{3}$ phase\\n  transition\", \"summary\": \"In this study, we investigate the ion-irradiation-induced phase transition in\\ngallium oxide (Ga2O3) from the $\\\\beta$ to the $\\\\gamma$ phase, the role of\\ndefects during the transformation, and the quality of the resulting crystal\\nstructure. Using a multi-method analysis approach including X-ray diffraction\\n(XRD), transmission electron microscopy (TEM), Rutherford backscattering\\nspectrometry in channeling mode (RBS/c), Doppler broadening variable energy\\npositron annihilation spectroscopy (DB-VEPAS) and variable energy positron\\nannihilation lifetime spectroscopy (VEPALS) supported by density functional\\ntheory (DFT) calculations, we have characterized defects at all the relevant\\nstages before, during, and after the phase transition. Reduction in\\nbackscattering yield was observed in RBS/c spectra after the transition to the\\n$\\\\gamma$ phase. This is corroborated by a significant decrease in the positron\\ntrapping center density due to generation of embedded vacancies intrinsic for\\nthe $\\\\gamma$-Ga2O3 but too shallow in order to trap positrons. A comparison of\\nthe observed positron lifetime of $\\\\gamma$-Ga2O3 with different theoretical\\nmodels shows good agreement with the three-site $\\\\gamma$ phase approach. A\\ncharacteristic increase in the effective positron diffusion length and the\\npositron lifetime at the transition point from $\\\\beta$-Ga2O3 to $\\\\gamma$-Ga2O3\\nenables visualization of the phase transition with positrons for the first\\ntime. Moreover, a subsequent reduction of these quantities with increasing\\nirradiation fluence was observed, which we attribute to further evolution of\\nthe $\\\\gamma$-Ga2O3 and changes in the gallium vacancy density as well as\\nrelative occupation in the crystal lattice.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-05-06T13:52:17Z\"}"}
