{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12204v1\", \"title\": \"Towards Realistic Low-Light Image Enhancement via ISP Driven Data\\n  Modeling\", \"summary\": \"Deep neural networks (DNNs) have recently become the leading method for\\nlow-light image enhancement (LLIE). However, despite significant progress,\\ntheir outputs may still exhibit issues such as amplified noise, incorrect white\\nbalance, or unnatural enhancements when deployed in real world applications. A\\nkey challenge is the lack of diverse, large scale training data that captures\\nthe complexities of low-light conditions and imaging pipelines. In this paper,\\nwe propose a novel image signal processing (ISP) driven data synthesis pipeline\\nthat addresses these challenges by generating unlimited paired training data.\\nSpecifically, our pipeline begins with easily collected high-quality\\nnormal-light images, which are first unprocessed into the RAW format using a\\nreverse ISP. We then synthesize low-light degradations directly in the RAW\\ndomain. The resulting data is subsequently processed through a series of ISP\\nstages, including white balance adjustment, color space conversion, tone\\nmapping, and gamma correction, with controlled variations introduced at each\\nstage. This broadens the degradation space and enhances the diversity of the\\ntraining data, enabling the generated data to capture a wide range of\\ndegradations and the complexities inherent in the ISP pipeline. To demonstrate\\nthe effectiveness of our synthetic pipeline, we conduct extensive experiments\\nusing a vanilla UNet model consisting solely of convolutional layers, group\\nnormalization, GeLU activation, and convolutional block attention modules\\n(CBAMs). Extensive testing across multiple datasets reveals that the vanilla\\nUNet model trained with our data synthesis pipeline delivers high fidelity,\\nvisually appealing enhancement results, surpassing state-of-the-art (SOTA)\\nmethods both quantitatively and qualitatively.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.MM\", \"published\": \"2025-04-16T15:53:53Z\"}"}
