{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11779v1\", \"title\": \"Multimodal Spatio-temporal Graph Learning for Alignment-free RGBT Video\\n  Object Detection\", \"summary\": \"RGB-Thermal Video Object Detection (RGBT VOD) can address the limitation of\\ntraditional RGB-based VOD in challenging lighting conditions, making it more\\npractical and effective in many applications.\\n  However, similar to most RGBT fusion tasks, it still mainly relies on\\nmanually aligned multimodal image pairs.\\n  In this paper, we propose a novel Multimodal Spatio-temporal Graph learning\\nNetwork (MSGNet) for alignment-free RGBT VOD problem by leveraging the robust\\ngraph representation learning model.\\n  Specifically, we first design an Adaptive Partitioning Layer (APL) to\\nestimate the corresponding regions of the Thermal image within the RGB image\\n(high-resolution), achieving a preliminary inexact alignment.\\n  Then, we introduce the Spatial Sparse Graph Learning Module (S-SGLM) which\\nemploys a sparse information passing mechanism on the estimated inexact\\nalignment to achieve reliable information interaction between different\\nmodalities.\\n  Moreover, to fully exploit the temporal cues for RGBT VOD problem, we\\nintroduce Hybrid Structured Temporal Modeling (HSTM), which involves a Temporal\\nSparse Graph Learning Module (T-SGLM) and Temporal Star Block (TSB). T-SGLM\\naims to filter out some redundant information between adjacent frames by\\nemploying the sparse aggregation mechanism on the temporal graph. Meanwhile,\\nTSB is dedicated to achieving the complementary learning of local spatial\\nrelationships.\\n  Extensive comparative experiments conducted on both the aligned dataset\\nVT-VOD50 and the unaligned dataset UVT-VOD2024 demonstrate the effectiveness\\nand superiority of our proposed method. Our project will be made available on\\nour website for free public access.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-16T05:32:59Z\"}"}
