{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07762v1\", \"title\": \"Millimeter emission from supermassive black hole coronae\", \"summary\": \"Active Galactic Nuclei (AGN) host accreting supermassive black holes (SMBHs).\\nThe accretion can lead to the formation of a hot, X-ray emitting corona close\\nto the SMBH capable of accelerating relativistic electrons. Observations in the\\nmillimetre (mm) band can probe its synchrotron emission. We provide a framework\\nto derive physical information of SMBH coronae by modelling their spectral\\nenergy distribution (SED) from radio to far infrared frequencies. We also\\nexplore the possibilities of deriving additional information from mm\\nobservations, such as the SMBH mass, and studying high-redshift lensed sources.\\nWe introduce a corona emission model based on a one-zone spherical region with\\na hybrid thermal and non-thermal plasma. We investigate in detail how the\\ncorona SED depends on different parameters such as size, opacity, and magnetic\\nfield strength. Other galactic emission components from dust, ionised gas and\\ndiffuse relativistic electrons are also included in the SED fitting scheme. We\\napply our code consistently to a sample of radio-quiet AGN with strong\\nindications of a coronal component in the mm. The detected mm emission from\\nSMBH coronae is consistent with having a non-thermal relativistic particle\\npopulation with an energy density that is ~0.5-10% of that in the thermal\\nplasma. This requires magnetic energy densities close to equipartition with the\\nthermal gas, and corona sizes of 60-250 gravitational radii. The model can also\\nreproduce the observed correlation between mm emission and SMBH mass when\\naccounting for uncertainties in the corona size. The mm band offers a unique\\nwindow into the physics of SMBH coronae, enabling the study of highly\\ndust-obscured sources and high-redshift lensed quasars. Gaining a deeper\\nunderstanding of the relativistic particle population in SMBH coronae can\\nprovide key insights into their potential multiwavelength and neutrino\\nemission.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-10T14:01:25Z\"}"}
