{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11375v1\", \"title\": \"Ring Artifacts Correction Based on Global-Local Features Interaction\\n  Guidance in the Projection Domain\", \"summary\": \"Ring artifacts are common artifacts in CT imaging, typically caused by\\ninconsistent responses of detector units to X-rays, resulting in stripe\\nartifacts in the projection data. Under circular scanning mode, such artifacts\\nmanifest as concentric rings radiating from the center of rotation, severely\\ndegrading image quality. In the Radon transform domain, even if the object's\\ndensity function is piecewise discontinuous in certain regions, the projection\\nimages remain nearly continuous in the angular direction, making the ideal\\nprojections exhibit a smooth global low-frequency characteristic. In practical\\nscanning, the local disturbances of the same detector unit at different\\nscanning angles lead to a prominent high-frequency locality of stripe\\nartifacts. Existing studies generally model ring artifacts disturbances as\\nfixed additive errors, which overlooks the dynamic variation of detector\\nresponses during practical scanning. However, the degree of detector response\\ninconsistency is a function of the projection values, as revealed in our\\nexperiments, thereby requiring consideration of the interaction between global\\nand local features in the process of stripe artifacts extraction and\\ncorrection. Therefore, we propose a CT ring artifacts correction method based\\non global and local features in the projection domain. We employ the VSS block\\nand Dense block to respectively correct the low-frequency sub-band, which\\ncapture the global correlations of the projection, and the high-frequency\\nsub-band, which contain local stripe artifacts after wavelet decomposition.\\nSpecifically, the accuracy of artifacts correction is enhanced by the\\ninteraction guidance between global and local features. Extensive experiments\\ndemonstrate that our method achieves superior performance in both quantitative\\nmetrics and visual quality, verifying its robustness and practical\\napplicability.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,I.4.5\", \"published\": \"2025-04-15T16:42:23Z\"}"}
