{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05412v1\", \"title\": \"Dynamic injection of a compressible gas into a confined porous layer\", \"summary\": \"Subsurface gas storage is a critical technology in global efforts to mitigate\\nclimate change. In particular, underground hydrogen storage offers a promising\\nsolution for integrating large-scale renewable energy into the power grid. When\\ninjected into the subsurface, hydrogen's low viscosity compared to the resident\\nbrine causes it to spread rapidly, forming a thin gas layer above the brine,\\ncomplicating recovery. In long aquifers, the large viscous pressure drop\\nbetween the source and the outlet induces significant pressure variations,\\nwhich may lead to substantial density changes in the injected gas. To examine\\nthe role of gas compressibility in the spreading dynamics, we use long-wave\\ntheory to derive coupled nonlinear evolution equations for the gas pressure and\\nliquid/gas interface height, focusing on the limit of long domains, weak gas\\ncompressibility and low liquid/gas mobility ratio. Simulations using these\\nequations are supplemented with a comprehensive asymptotic analysis of\\nparameter regimes. Unlike the near-incompressible limit, in which gas spreading\\nrates are dictated by the source strength and mobility ratio, and any\\ncompressive effects are transient, we show how, in general, compression of the\\nmain gas bubble can generate dynamic pressure changes that are coupled to those\\nin the thin gas layer that spreads over the liquid, with compressive effects\\nhaving a sustained influence along the layer. This allows compressibility to\\nreduce spreading rates and lower gas pressures. We characterise this behaviour\\nvia a set of low-order models that reveal dominant scalings, highlighting the\\nrole of compressibility in mediating the evolution of the gas layer.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-05-08T16:52:26Z\"}"}
