{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06705v1\", \"title\": \"Evolution of the Comptonizing medium of the black-hole candidate Swift\\n  J1727.8$-$1613 along the hard to hard-intermediate state transition using\\n  NICER\", \"summary\": \"We analyse the properties of the Comptonizing medium in the black-hole X-ray\\nbinary Swift J1727.8$-$1613 using the time-dependent Comptonization model\\nvkompth, using NICER observations of type-C QPOs in the hard and\\nhard-intermediate states. During the 2023 outburst of the source, we measure\\nthe rms and phase lags of the QPO across 45 observations as the QPO frequency,\\n$\\\\nu_{\\\\rm QPO}$, evolves from $\\\\sim 0.3$ Hz to $\\\\sim 7$ Hz. By simultaneously\\nfitting the time-averaged spectrum of the source and the rms and lag spectra of\\nthe QPO, we derive the evolution of the disk and corona parameters. At\\n$\\\\nu_{\\\\rm QPO} = 0.34$ Hz, the QPO phase lags are hard, with 10 keV photons\\nlagging 0.5 keV photons by $\\\\sim 0.5$ rad. As $\\\\nu_{\\\\rm QPO}$ increases, the\\nlags for the same energy bands decrease, reaching near zero at $\\\\nu_{\\\\rm QPO}\\n\\\\sim 1.2$ Hz, and then reverse to soft lags of $\\\\sim -1.1$ rad at $\\\\nu_{\\\\rm\\nQPO} \\\\sim 7$ Hz. Initially, the inner radius of the accretion disk is truncated\\nat $\\\\sim 30-40 R_g$ (assuming a 10 solar-mass black hole) and, as the QPO\\nfrequency increases, the truncation radius decreases down to $\\\\sim 10 R_g$.\\nInitially, two coronas of sizes of $\\\\sim 6.5 \\\\times 10^3$ km and $\\\\sim 2 \\\\times\\n10^3$ km, extend over the disk and are illuminated by different regions of the\\ndisk. As the QPO frequency increases, both the coronas shrink to $\\\\sim 2 \\\\times\\n10^3$ km at $\\\\nu_{\\\\rm QPO} = 2.5$ Hz. Following a data gap, one corona expands\\nagain, peaking at a size of $\\\\sim 2 \\\\times 10^4$ km. We interpret the evolution\\nof the coronal size in the context of accompanying radio observations,\\ndiscussing its implications for the interplay between the corona and the jet.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.GA,astro-ph.IM\", \"published\": \"2025-04-09T09:08:56Z\"}"}
