{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15795v1\", \"title\": \"Spontaneous stochasticity and the Armstrong-Vicol passive scalar\", \"summary\": \"Spontaneous stochasticity refers to the emergence of intrinsic randomness in\\ndeterministic systems under singular limits, a phenomenon conjectured to be\\nfundamental in turbulence. Armstrong and Vicol \\\\citep{AV23,AV24} recently\\nconstructed a deterministic, divergence-free multiscale vector field\\narbitrarily close to a weak Euler solution, proving that a passive scalar\\ntransported by this field exhibits anomalous dissipation and lacks a selection\\nprinciple in the vanishing diffusivity limit.\\n  {\\\\it This work aims to explain why this passive scalar exhibits both\\nLagrangian and Eulerian spontaneous stochasticity.}\\n  Part I provides a historical overview of spontaneous stochasticity, details\\nthe Armstrong-Vicol passive scalar model, and presents numerical evidence of\\nanomalous diffusion, along with a refined description of the Lagrangian flow\\nmap.\\n  In Part II, we develop a theoretical framework for Eulerian spontaneous\\nstochasticity. We define it mathematically, linking it to ill-posedness and\\nfinite-time trajectory splitting, and explore its measure-theoretic properties\\nand the connection to RG formalism. This leads us to a well-defined {\\\\it\\nmeasure selection principle} in the inviscid limit. This approach allows us to\\nrigorously classify universality classes based on the ergodic properties of\\nregularisations. To complement our analysis, we provide simple yet insightful\\nnumerical examples.\\n  Finally, we show that the absence of a selection principle in the\\nArmstrong-Vicol model corresponds to Eulerian spontaneous stochasticity of the\\npassive scalar. We also numerically compute the probability density of the\\neffective renormalised diffusivity in the inviscid limit. We argue that the\\nlack of a selection principle should be understood as a measure selection\\nprinciple over weak solutions of the inviscid system.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-22T11:15:21Z\"}"}
