{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07550v1\", \"title\": \"A search for periodic activity in multi-peaked long gamma-ray bursts\", \"summary\": \"A sizeable fraction of gamma-ray burst (GRB) light curves (LCs) features a\\nsequence of peaks, which holds information on the unknown way energy is\\ndissipated into gamma-rays over time. Traditional searches for periodic signals\\nin GRB LCs turned out to be inconclusive, partly because they are challenging\\nas a consequence of the short-lived, coloured-noise, and non-stationary nature\\nof the LCs themselves. Yet, recent claims have revived the issue. We searched\\nfor periodic components in GRB LCs through a new approach to GRBs, which\\nescapes most of the issues faced by traditional techniques. We identified peaks\\nthrough a well tested algorithm and selected GRBs with at least 10 peaks out of\\n5 GRB catalogues (Swift/BAT, CGRO/BATSE, Fermi/GBM, Insight-HXMT,\\nBeppoSAX/GRBM). Each GRB was simply treated as a discrete point process, whose\\nrealisation coincides with the sequence of peak times. We searched for possible\\nperiodic recurrences based on the multinomial distribution, after accounting\\nfor the clustering of peaks due to the non-stationarity of the GRB signals. The\\nbest candidate has a p-value of 3e-4 that there is no periodic recurrence.\\nHowever, accounting for the multiple trials of 555 searched GRBs, its\\nstatistical significance is demoted to 17%. The overall distribution of the\\np-values obtained for all GRBs is compatible with a uniform distribution in\\n[0,1]. We found no robust evidence for multi-peaked GRBs with periodic\\nrecurrences. We can exclude that a sizeable fraction (>~ 0.75) of peaks of each\\nGRB with at least 10 peaks are periodic. While our result does not necessarily\\nclash with claimed periodicities based on Fourier techniques, it constrains the\\nputative recurrent behaviour, which would not manifest itself through the\\nsequence of peaks, but, evidently, in a more elusive way.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-10T08:25:10Z\"}"}
