{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04770v1\", \"title\": \"Bidirectional Hierarchical Protein Multi-Modal Representation Learning\", \"summary\": \"Protein representation learning is critical for numerous biological tasks.\\nRecently, large transformer-based protein language models (pLMs) pretrained on\\nlarge scale protein sequences have demonstrated significant success in\\nsequence-based tasks. However, pLMs lack structural information. Conversely,\\ngraph neural networks (GNNs) designed to leverage 3D structural information\\nhave shown promising generalization in protein-related prediction tasks, but\\ntheir effectiveness is often constrained by the scarcity of labeled structural\\ndata. Recognizing that sequence and structural representations are\\ncomplementary perspectives of the same protein entity, we propose a multimodal\\nbidirectional hierarchical fusion framework to effectively merge these\\nmodalities. Our framework employs attention and gating mechanisms to enable\\neffective interaction between pLMs-generated sequential representations and\\nGNN-extracted structural features, improving information exchange and\\nenhancement across layers of the neural network. Based on the framework, we\\nfurther introduce local Bi-Hierarchical Fusion with gating and global\\nBi-Hierarchical Fusion with multihead self-attention approaches. Through\\nextensive experiments on a diverse set of protein-related tasks, our method\\ndemonstrates consistent improvements over strong baselines and existing fusion\\ntechniques in a variety of protein representation learning benchmarks,\\nincluding react (enzyme/EC classification), model quality assessment (MQA),\\nprotein-ligand binding affinity prediction (LBA), protein-protein binding site\\nprediction (PPBS), and B cell epitopes prediction (BCEs). Our method\\nestablishes a new state-of-the-art for multimodal protein representation\\nlearning, emphasizing the efficacy of BIHIERARCHICAL FUSION in bridging\\nsequence and structural modalities.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI,q-bio.MN\", \"published\": \"2025-04-07T06:47:49Z\"}"}
