{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23785v1\", \"title\": \"ObfusQate: Unveiling the First Quantum Program Obfuscation Framework\", \"summary\": \"This paper introduces ObfusQate, a novel tool that conducts obfuscations\\nusing quantum primitives to enhance the security of both classical and quantum\\nprograms. We have designed and implemented two primary categories of\\nobfuscations: quantum circuit level obfuscation and code level obfuscation,\\nencompassing a total of eight distinct methods. Quantum circuit-level\\nobfuscation leverages on quantum gates and circuits, utilizing strategies such\\nas quantum gate hiding and identity matrices to construct complex,\\nnon-intuitive circuits that effectively obscure core functionalities and resist\\nreverse engineering, making the underlying code difficult to interpret.\\nMeanwhile, code-level obfuscation manipulates the logical sequence of program\\noperations through quantum-based opaque predicates, obfuscating execution paths\\nand rendering program behavior more unpredictable and challenging to analyze.\\nAdditionally, ObfusQate can be used to obfuscate malicious code segments,\\nmaking them harder to detect and analyze. These advancements establish a\\nfoundational framework for further exploration into the potential and\\nlimitations of quantum-based obfuscation techniques, positioning ObfusQate as a\\nvaluable tool for future developers to enhance code security in the evolving\\nlandscape of software development. To the best of our knowledge, ObfusQate\\nrepresents the pioneering work in developing an automated framework for\\nimplementing obfuscations leveraging quantum primitives. Security evaluations\\nshow that obfuscations by ObfusQate maintain code behavior with polynomial\\noverheads in space and time complexities. We have also demonstrated an\\noffensive use case by embedding a keylogger into Shor's algorithm and\\nobfuscating it using ObfusQate. Our results show that current Large language\\nmodels like GPT 4o, GPT o3 mini and Grok 3 were not able to identify the\\nmalicious keylogger after obfuscation.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR,cs.ET\", \"published\": \"2025-03-31T07:02:25Z\"}"}
