{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15609v1\", \"title\": \"SonarT165: A Large-scale Benchmark and STFTrack Framework for Acoustic\\n  Object Tracking\", \"summary\": \"Underwater observation systems typically integrate optical cameras and\\nimaging sonar systems. When underwater visibility is insufficient, only sonar\\nsystems can provide stable data, which necessitates exploration of the\\nunderwater acoustic object tracking (UAOT) task. Previous studies have explored\\ntraditional methods and Siamese networks for UAOT. However, the absence of a\\nunified evaluation benchmark has significantly constrained the value of these\\nmethods. To alleviate this limitation, we propose the first large-scale UAOT\\nbenchmark, SonarT165, comprising 165 square sequences, 165 fan sequences, and\\n205K high-quality annotations. Experimental results demonstrate that SonarT165\\nreveals limitations in current state-of-the-art SOT trackers. To address these\\nlimitations, we propose STFTrack, an efficient framework for acoustic object\\ntracking. It includes two novel modules, a multi-view template fusion module\\n(MTFM) and an optimal trajectory correction module (OTCM). The MTFM module\\nintegrates multi-view feature of both the original image and the binary image\\nof the dynamic template, and introduces a cross-attention-like layer to fuse\\nthe spatio-temporal target representations. The OTCM module introduces the\\nacoustic-response-equivalent pixel property and proposes normalized pixel\\nbrightness response scores, thereby suppressing suboptimal matches caused by\\ninaccurate Kalman filter prediction boxes. To further improve the model\\nfeature, STFTrack introduces a acoustic image enhancement method and a\\nFrequency Enhancement Module (FEM) into its tracking pipeline. Comprehensive\\nexperiments show the proposed STFTrack achieves state-of-the-art performance on\\nthe proposed benchmark. The code is available at\\nhttps://github.com/LiYunfengLYF/SonarT165.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-22T06:02:32Z\"}"}
