{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15834v1\", \"title\": \"Causal machine learning for high-dimensional mediation analysis using\\n  interventional effects mapped to a target trial\", \"summary\": \"Causal mediation analysis examines causal pathways linking exposures to\\ndisease. The estimation of interventional effects, which are mediation\\nestimands that overcome certain identifiability problems of natural effects,\\nhas been advanced through causal machine learning methods, particularly for\\nhigh-dimensional mediators. Recently, it has been proposed interventional\\neffects can be defined in each study by mapping to a target trial assessing\\nspecific hypothetical mediator interventions. This provides an appealing\\nframework to directly address real-world research questions about the extent to\\nwhich such interventions might mitigate an increased disease risk in the\\nexposed. However, existing estimators for interventional effects mapped to a\\ntarget trial rely on singly-robust parametric approaches, limiting their\\napplicability in high-dimensional settings. Building upon recent developments\\nin causal machine learning for interventional effects, we address this gap by\\ndeveloping causal machine learning estimators for three interventional effect\\nestimands, defined by target trials assessing hypothetical interventions\\ninducing distinct shifts in joint mediator distributions. These estimands are\\nmotivated by a case study within the Longitudinal Study of Australian Children,\\nused for illustration, which assessed how intervening on high inflammatory\\nburden and other non-inflammatory adverse metabolomic markers might mitigate\\nthe adverse causal effect of overweight or obesity on high blood pressure in\\nadolescence. We develop one-step and (partial) targeted minimum loss-based\\nestimators based on efficient influence functions of those estimands,\\ndemonstrating they are root-n consistent, efficient, and multiply robust under\\ncertain conditions.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME\", \"published\": \"2025-04-22T12:28:27Z\"}"}
