{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11318v1\", \"title\": \"Mildly-Interacting Fermionic Unitaries are Efficiently Learnable\", \"summary\": \"Recent work has shown that one can efficiently learn fermionic Gaussian\\nunitaries, also commonly known as nearest-neighbor matchcircuits or\\nnon-interacting fermionic unitaries. However, one could ask a similar question\\nabout unitaries that are near Gaussian: for example, unitaries prepared with a\\nsmall number of non-Gaussian circuit elements. These operators find\\nsignificance in quantum chemistry and many-body physics, yet no algorithm\\nexists to learn them.\\n  We give the first such result by devising an algorithm which makes queries to\\na $n$-mode fermionic unitary $U$ prepared by at most $O(t)$ non-Gaussian gates\\nand returns a circuit approximating $U$ to diamond distance $\\\\varepsilon$ in\\ntime $\\\\textrm{poly}(n,2^t,1/\\\\varepsilon)$. This resolves a central open\\nquestion of Mele and Herasymenko under the strongest distance metric. In fact,\\nour algorithm is much more general: we define a property of unitary Gaussianity\\nknown as unitary Gaussian dimension and show that our algorithm can learn\\n$n$-mode unitaries of Gaussian dimension at least $2n - O(t)$ in time\\n$\\\\textrm{poly}(n,2^t,1/\\\\varepsilon)$. Indeed, this class subsumes unitaries\\nprepared by at most $O(t)$ non-Gaussian gates but also includes several\\nunitaries that require up to $2^{O(t)}$ non-Gaussian gates to construct.\\n  In addition, we give a $\\\\textrm{poly}(n,1/\\\\varepsilon)$-time algorithm to\\ndistinguish whether an $n$-mode unitary is of Gaussian dimension at least $k$\\nor $\\\\varepsilon$-far from all such unitaries in Frobenius distance, promised\\nthat one is the case. Along the way, we prove structural results about\\nnear-Gaussian fermionic unitaries that are likely to be of independent\\ninterest.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cs.DS,cs.LG\", \"published\": \"2025-04-15T15:59:32Z\"}"}
