{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16519v1\", \"title\": \"Exciton Basis Description of Ultrafast Triplet Separation in\\n  Pentacene-(Tetracene)2-Pentacene Intramolecular Singlet Fission Chromophore\", \"summary\": \"Precise understanding of the electronic structures of optically dark\\ntriplet-triplet multiexcitons that are the intermediate states in singlet\\nfission (SF) continues to be a challenge. This is particularly true for\\nintramolecular singlet fission (iSF) chromophores, that are oligomers of large\\nmonomer molecules. We have performed quantum many-body calculations of the\\ncomplete set of excited states relevant to iSF in\\nPentacene-(Tetracene)2-Pentacene oligomers, consisting of two terminal\\npentacene monomers linked by two tetracene monomers. Our computations use an\\nexciton basis that gives physical pictorial descriptions of all eigenstates,\\nand are performed over an active space of twenty-eight monomer molecular\\norbitals, including configuration interaction with all relevant quadruple\\nexcitations within the active space, thereby ensuring very high precision. We\\ndiscuss the many-electron structures of the optical predominantly intramonomer\\nspin-singlets, intermonomer charge-transfer excitations, and most importantly,\\nthe complete set of low energy covalent triplet-triplet multiexcitons. We are\\nable to explain the weak binding energy of the pentacene-tetracene\\ntriplet-triplet eigenstate that is generated following photoexcitation. We\\nexplain the increase in lifetime with increasing numbers of tetracene monomers\\nof the transient absorption associated with contiguous pentacene-tetracene\\ntriplet-triplet in this family of oligomers. We are consequently able to give a\\npictorial description of the triplet separation following generation of the\\ninitial triplet-triplet, leading to a state with individual triplets occupying\\nonly the two pentacene monomers. We expect many applications of our theoretical\\napproach to triplet separation.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-23T08:44:23Z\"}"}
