{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07720v1\", \"title\": \"Filtering through a topological lens: homology for point processes on\\n  the time-frequency plane\", \"summary\": \"We introduce a very general approach to the analysis of signals from their\\nnoisy measurements from the perspective of Topological Data Analysis (TDA).\\nWhile TDA has emerged as a powerful analytical tool for data with pronounced\\ntopological structures, here we demonstrate its applicability for general\\nproblems of signal processing, without any a-priori geometric feature. Our\\nmethods are well-suited to a wide array of time-dependent signals in different\\nscientific domains, with acoustic signals being a particularly important\\napplication. We invoke time-frequency representations of such signals, focusing\\non their zeros which are gaining salience as a signal processing tool in view\\nof their stability properties. Leveraging state-of-the-art topological\\nconcepts, such as stable and minimal volumes, we develop a complete suite of\\nTDA-based methods to explore the delicate stochastic geometry of these zeros,\\ncapturing signals based on the disruption they cause to this rigid,\\nhyperuniform spatial structure. Unlike classical spatial data tools, TDA is\\nable to capture the full spectrum of the stochastic geometry of the zeros,\\nthereby leading to powerful inferential outcomes that are underpinned by a\\nprincipled statistical foundation. This is reflected in the power and\\nversatility of our applications, which include competitive performance in\\nprocessing. a wide variety of audio signals (esp. in low SNR regimes),\\neffective detection and reconstruction of gravitational wave signals (a reputed\\nsignal processing challenge with non-Gaussian noise), and medical time series\\ndata from EEGs, indicating a wide horizon for the approach and methods\\nintroduced in this paper.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP,math.AT\", \"published\": \"2025-04-10T13:10:04Z\"}"}
