{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13133v1\", \"title\": \"Giant nematic response of the incommensurate charge density wave in the\\n  nickel-pnictide Ba$_{1-x}$Sr$_x$Ni$_2$As$_2$\", \"summary\": \"Electron nematicity-the breaking of rotational symmetry while preserving\\ntranslational symmetry-is the quantum analogue of classical nematic liquid\\ncrystals. First predicted in 1998, electronic nematicity has been established\\nin a variety of materials, including two-dimensional electron gases (2DEGs) in\\nmagnetic fields, copper-oxide superconductors, and Fe-based superconductors. A\\nlong-standing open question is what physical mechanisms drive electronic\\nnematic order. In BaFe$_2$As$_2$ and highly underdoped YBa$_2$Cu$_3$O$_{6+y}$,\\nstrong evidence suggests that nematicity arises from vestigial\\nspin-density-wave (SDW) order. However, evidence for nematicity associated with\\ncharge-density-wave (CDW) order has been less conclusive, particularly in\\nsystems near a superconducting state. Here, we present direct evidence for\\nCDW-driven nematic fluctuations in the pnictide superconductor\\nBa$_{1-x}$Sr$_x$Ni$_2$As$_2$ (BSNA), a Ni-based homologue of Fe-based\\nsuperconductors that exhibits CDW rather than SDW order. Previous\\nelastoresistance studies have shown that BSNA displays a large nematic\\nsusceptibility-linked to a six-fold enhancement of superconductivity-within a\\nregion of the phase diagram occupied by an incommensurate CDW. Using x-ray\\nscattering under uniaxial strain, we demonstrate that even minimal strain\\nlevels ($\\\\epsilon \\\\sim 10^{-4}$) significantly break the fourfold symmetry of\\nthe CDW. Within a Ginzburg-Landau framework, we define a nematic susceptibility\\nbased on the asymmetric response of symmetry-related CDW superlattice\\nreflections, showing strong agreement with elastoresistivity measurements. Our\\nstudy provides the first clear demonstration of a direct link between charge\\norder and a nematic state, offering key insights into the intertwined\\nsuperconducting phases of these materials.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el,cond-mat.mtrl-sci\", \"published\": \"2025-04-17T17:47:04Z\"}"}
