{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01899v1\", \"title\": \"Recovery Reductions in the Random Noise Model via Group Theory: Insights\\n  into NP-Complete and Fine-Grained Problems\", \"summary\": \"We introduce and initiate the study of a new model of reductions called the\\nrandom noise model. In this model, the truth table $T_f$ of the function $f$ is\\ncorrupted on a randomly chosen $\\\\delta$-fraction of instances. A randomized\\nalgorithm $A$ is a $\\\\left(t, \\\\delta, 1-\\\\varepsilon\\\\right)$-recovery reduction\\nfor $f$ if:\\n  1. With probability $1-\\\\varepsilon$ over the choice of $\\\\delta$-fraction\\ncorruptions, given access to the corrupted truth table, the algorithm $A$\\ncomputes $f(\\\\phi)$ correctly with probability at least $2/3$ on every input\\n$\\\\phi$.\\n  2. The algorithm $A$ runs in time $O(t)$.\\n  We believe this model, which is a natural relaxation of average-case\\ncomplexity, both has practical motivations and is mathematically interesting.\\n  Pointing towards this, we show the existence of robust deterministic\\npolynomial-time recovery reductions with the highest tolerable noise level for\\nmany of the canonical NP-complete problems - SAT, kSAT, kCSP, CLIQUE and more.\\nOur recovery reductions are optimal for non-adaptive algorithms under\\ncomplexity-theoretic assumptions. Notably, all our recovery reductions follow\\nas corollaries of one black box algorithm based on group theory and permutation\\ngroup algorithms. This suggests that recovery reductions in the random noise\\nmodel are important to the study of the structure of NP-completeness.\\n  Furthermore, we establish recovery reductions with optimal parameters for\\nOrthogonal Vectors and Parity $k$-Clique problems. These problems exhibit\\nstructural similarities to NP-complete problems, with Orthogonal Vectors\\nadmitting a $2^{0.5n}$-time reduction from kSAT on $n$ variables and Parity\\n$k$-Clique, a subexponential-time reduction from 3SAT. This further highlights\\nthe relevance of our model to the study of NP-completeness.\", \"main_category\": \"cs.CC\", \"categories\": \"cs.CC\", \"published\": \"2025-04-02T16:58:07Z\"}"}
