{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11023v1\", \"title\": \"An Inexact Variable Metric Proximal Gradient-subgradient Algorithm for a\\n  Class of Fractional Optimization Problems\", \"summary\": \"In this paper, we study a class of fractional optimization problems, in which\\nthe numerator of the objective is the sum of a convex function and a\\ndifferentiable function with a Lipschitz continuous gradient, while the\\ndenominator is a nonsmooth convex function. This model has broad applicability\\nand encompasses several important optimization problems in the literature. To\\naddress these problems, we propose an inexact variable metric proximal\\ngradient-subgradient algorithm (iVPGSA), which, to our knowledge, is the first\\ninexact proximal algorithm specifically designed for solving such type of\\nfractional problems. By incorporating a variable metric proximal term and\\nallowing for inexact solutions to the subproblem under a flexible error\\ncriterion, the proposed algorithm is highly adaptable to a broader range of\\nproblems while achieving favorable computational efficiency. Under mild\\nassumptions, we establish that any accumulation point of the sequence generated\\nby the iVPGSA is a critical point of the target problem. Moreover, we develop\\nan improved Kurdyka-{\\\\L}ojasiewicz (KL)-based analysis framework to prove the\\nglobal convergence of the entire sequence and characterize its convergence\\nrate, \\\\textit{without} requiring a strict sufficient descent property. Our\\nresults offer detailed insights into how the KL exponent and inexactness\\ninfluence the convergence rate. The proposed analysis framework also has the\\npotential to serve as a theoretical tool for studying the convergence rates of\\na wide range of inexact algorithms beyond the iVPGSA. Finally, some numerical\\nexperiments on the $\\\\ell_1/\\\\ell_2$ Lasso problem and the constrained\\n$\\\\ell_1/\\\\ell_2$ sparse optimization problem are conducted to show the superior\\nperformance of the iVPGSA in comparison to existing algorithms.\", \"main_category\": \"math.OC\", \"categories\": \"math.OC\", \"published\": \"2025-04-15T09:48:27Z\"}"}
