{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19631v1\", \"title\": \"Complex Organic Molecules towards the central molecular zone of NGC 253\", \"summary\": \"Interstellar complex organic molecules (iCOMs) may have a link to prebiotic\\nspecies, key building blocks for life. In Galactic star-forming (SF) regions,\\nspatial variations of iCOMs emission could reflect the source physical\\nstructure or different chemical formation pathways. Investigating iCOMs in\\nextragalactic SF regions may thus provide crucial information about these\\nregions. As an active extragalactic SF region, the central molecular zone (CMZ)\\nof the nearby galaxy NGC 253 provides an ideal template for studying iCOMs\\nunder more extreme conditions. We aim to investigate the emission of a few\\nselected iCOMs and understand if a difference between the iCOMs could reflect\\non the source's chemical or physical structure. Using the high angular\\nresolution ($\\\\sim 27$ pc) observations from the ALCHEMI ALMA large program, we\\nimaged the emission of selected iCOMs and precursors; CH$_3$CHO, C$_2$H$_5$OH,\\nNH$_2$CHO, CH$_2$NH, and CH$_3$NH$_2$. We estimated the iCOMs gas temperatures\\nand column densities using a rotational diagram analysis, and by performing a\\nnon-LTE analysis for CH$_2$NH.The iCOM emission concentrates mostly towards the\\ninner part of the CMZ of NGC 253 and can be reproduced with two gas components.\\nDifferent emission processes can explain iCOM emission towards the CMZ of NGC\\n253: at Giant Molecular Cloud (GMC) scales ($\\\\sim 27$ pc), the iCOMs could\\ntrace large-scale shocks whilst at smaller scales (few pc), both shock and\\nheating processes linked with ongoing star formation may be involved. Using\\ncolumn density correlation trends and known formation pathways, we find that\\nmore than one formation path could be involved to explain the iCOM emission.\\nFinally, we found chemical differences between the GMCs, such as a decrease of\\nabundance for the N-bearing species towards one of the GMCs or different\\nexcitation conditions for NH$_2$CHO and CH$_3$CHO towards two of the GMCs.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-28T09:43:37Z\"}"}
