{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03568v1\", \"title\": \"Familiarizing with Music: Discovery Patterns for Different Music\\n  Discovery Needs\", \"summary\": \"Humans have the tendency to discover and explore. This natural tendency is\\nreflected in data from streaming platforms as the amount of previously unknown\\ncontent accessed by users. Additionally, in domains such as that of music\\nstreaming there is evidence that recommending novel content improves users'\\nexperience with the platform. Therefore, understanding users' discovery\\npatterns, such as the amount to which and the way users access previously\\nunknown content, is a topic of relevance for both the scientific community and\\nthe streaming industry, particularly the music one. Previous works studied how\\nmusic consumption differs for users of different traits and looked at\\ndiversity, novelty, and consistency over time of users' music preferences.\\nHowever, very little is known about how users discover and explore previously\\nunknown music, and how this behavior differs for users of varying discovery\\nneeds. In this paper we bridge this gap by analyzing data from a survey\\nanswered by users of the major music streaming platform Deezer in combination\\nwith their streaming data. We first address questions regarding whether users\\nwho declare a higher interest in unfamiliar music listen to more diverse music,\\nhave more stable music preferences over time, and explore more music within a\\nsame time window, compared to those who declare a lower interest. We then\\ninvestigate which type of music tracks users choose to listen to when they\\nexplore unfamiliar music, identifying clear patterns of popularity and genre\\nrepresentativeness that vary for users of different discovery needs.\\n  Our findings open up possibilities to infer users' interest in unfamiliar\\nmusic from streaming data as well as possibilities to develop recommender\\nsystems that guide users in exploring music in a more natural way.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR,cs.HC\", \"published\": \"2025-05-06T14:26:00Z\"}"}
