{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17481v1\", \"title\": \"Optimizing chemoradiotherapy for malignant gliomas: a validated\\n  mathematical approach\", \"summary\": \"Malignant gliomas (MGs), particularly glioblastoma, are among the most\\naggressive brain tumors, with limited treatment options and a poor prognosis.\\nMaximal safe resection and the so-called Stupp protocol are the standard\\nfirst-line therapies. Despite combining radiotherapy and chemotherapy in an\\nintensive manner, it provides limited survival benefits over radiation therapy\\nalone, underscoring the need for innovative therapeutic strategies. Emerging\\nevidence suggests that alternative dosing schedules, such as less aggressive\\nregimens with extended intervals between consecutive treatment applications,\\nmay improve outcomes, enhancing survival, delaying the emergence of resistance,\\nand minimizing side effects. In this study, we develop, calibrate, and validate\\nin animal models a novel ordinary differential equation-based mathematical\\nmodel, using in vivo data to describe MG dynamics under combined\\nchemoradiotherapy. The proposed model incorporates key biological processes,\\nincluding cancer cell dormancy, phenotypic switching, drug resistance through\\npersister cells, and treatment-induced effects. Through in silico trials, we\\nidentified optimized combination treatment protocols that may outperform the\\nstandard Stupp protocol. Finally, we computationally extrapolated the results\\nobtained from the in vivo animal model to humans, showing up to a four-fold\\nincrease in median survival with protracted administration protocols in silico.\\nAlthough further experimental and clinical validation is required, our\\nframework provides a computational foundation to optimize and personalize\\ntreatment strategies for MG and potentially other cancers with similar\\nbiological mechanisms.\", \"main_category\": \"q-bio.PE\", \"categories\": \"q-bio.PE\", \"published\": \"2025-04-24T12:18:12Z\"}"}
