{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07449v1\", \"title\": \"Polarization Angle Orthogonal Jumps in Fast Radio Bursts\", \"summary\": \"Recently, polarization angle (PA) orthogonal jumps over millisecond timescale\\nwere discovered from three bursts of a repeating fast radio burst source FRB\\n20201124A by the FAST telescope. We investigate the physical implications of\\nthis phenomenon. In general, PA jumps can arise from the superposition of two\\nelectromagnetic waves, either coherently or incoherently, as the dominance of\\nthe two orthogonal modes switches. In the coherent case, PA jumps occur when\\nlinear polarization reaches a minimum and circular polarization peaks, with the\\ntotal polarization degree conserved. However, incoherent superposition can lead\\nto depolarization. The observations seem to be more consistent with incoherent\\nsuperposition. The amplitudes of the two orthogonal modes are required to be\\ncomparable when jumps occur, placing constraints on the intrinsic radiation\\nmechanisms. We provide general constraints on FRB emission and propagation\\nmechanisms based on the data. Physically, it is difficult to produce PA jumps\\nby generating two orthogonal modes within millisecond timescales, and a\\ngeometric effect due to sweeping line-of-sight is a more plausible reason. This\\nrequires the emission region to be within the magnetosphere of a spinning\\ncentral engine, likely a magnetar. The two orthogonal modes may be produced by\\nintrinsic radiation mechanisms or Alfv\\\\'en-O-mode transition. Plasma\\nbirefringence is not easy to achieve when the plasma is moving\\nrelativistically. Curvature radiation predicts $|E_{\\\\rm X}/E_{\\\\rm O}|\\\\gtrsim1$,\\nand is difficult to produce jumps; whereas inverse Compton scattering can\\nachieve the transition amplitude ratio $|E_{\\\\rm X}/E_{\\\\rm O}|=1$ to allow jumps\\nto occur under special geometric configurations.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-10T04:48:50Z\"}"}
