{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05917v1\", \"title\": \"Indexing Strings with Utilities\", \"summary\": \"Applications in domains ranging from bioinformatics to advertising feature\\nstrings that come with numerical scores (utilities). The utilities quantify the\\nimportance, interest, profit, or risk of the letters occurring at every\\nposition of a string. Motivated by the ever-increasing rate of generating such\\ndata, as well as by their importance in several domains, we introduce Useful\\nString Indexing (USI), a natural generalization of the classic String Indexing\\nproblem. Given a string $S$ (the text) of length $n$, USI asks for\\npreprocessing $S$ into a compact data structure supporting the following\\nqueries efficiently: given a shorter string $P$ (the pattern), return the\\nglobal utility $U(P)$ of $P$ in $S$, where $U$ is a function that maps any\\nstring $P$ to a utility score based on the utilities of the letters of every\\noccurrence of $P$ in $S$. Our work also makes the following contributions: (1)\\nWe propose a novel and efficient data structure for USI based on finding the\\ntop-$K$ frequent substrings of $S$. (2) We propose a linear-space data\\nstructure that can be used to mine the top-$K$ frequent substrings of $S$ or to\\ntune the parameters of the USI data structure. (3) We propose a novel\\nspace-efficient algorithm for estimating the set of the top-$K$ frequent\\nsubstrings of $S$, thus improving the construction space of the data structure\\nfor USI. (4) We show that popular space-efficient top-$K$ frequent item mining\\nstrategies employed by state-of-the-art algorithms do not smoothly translate\\nfrom items to substrings. (5) Using billion-letter datasets, we experimentally\\ndemonstrate that: (i) our top-$K$ frequent substring mining algorithms are\\naccurate and scalable, unlike two state-of-the-art methods; and (ii) our USI\\ndata structures are up to $15$ times faster in querying than $4$ nontrivial\\nbaselines while occupying the same space with them.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS,cs.DB\", \"published\": \"2025-04-08T11:13:53Z\"}"}
