{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21682v1\", \"title\": \"Visual Text Processing: A Comprehensive Review and Unified Evaluation\", \"summary\": \"Visual text is a crucial component in both document and scene images,\\nconveying rich semantic information and attracting significant attention in the\\ncomputer vision community. Beyond traditional tasks such as text detection and\\nrecognition, visual text processing has witnessed rapid advancements driven by\\nthe emergence of foundation models, including text image reconstruction and\\ntext image manipulation. Despite significant progress, challenges remain due to\\nthe unique properties that differentiate text from general objects. Effectively\\ncapturing and leveraging these distinct textual characteristics is essential\\nfor developing robust visual text processing models. In this survey, we present\\na comprehensive, multi-perspective analysis of recent advancements in visual\\ntext processing, focusing on two key questions: (1) What textual features are\\nmost suitable for different visual text processing tasks? (2) How can these\\ndistinctive text features be effectively incorporated into processing\\nframeworks? Furthermore, we introduce VTPBench, a new benchmark that\\nencompasses a broad range of visual text processing datasets. Leveraging the\\nadvanced visual quality assessment capabilities of multimodal large language\\nmodels (MLLMs), we propose VTPScore, a novel evaluation metric designed to\\nensure fair and reliable evaluation. Our empirical study with more than 20\\nspecific models reveals substantial room for improvement in the current\\ntechniques. Our aim is to establish this work as a fundamental resource that\\nfosters future exploration and innovation in the dynamic field of visual text\\nprocessing. The relevant repository is available at\\nhttps://github.com/shuyansy/Visual-Text-Processing-survey.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-30T14:19:29Z\"}"}
