{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05238v1\", \"title\": \"Federated Learning for Medical Image Classification: A Comprehensive\\n  Benchmark\", \"summary\": \"The federated learning paradigm is wellsuited for the field of medical image\\nanalysis, as it can effectively cope with machine learning on isolated\\nmulticenter data while protecting the privacy of participating parties.\\nHowever, current research on optimization algorithms in federated learning\\noften focuses on limited datasets and scenarios, primarily centered around\\nnatural images, with insufficient comparative experiments in medical contexts.\\nIn this work, we conduct a comprehensive evaluation of several state-of-the-art\\nfederated learning algorithms in the context of medical imaging. We conduct a\\nfair comparison of classification models trained using various federated\\nlearning algorithms across multiple medical imaging datasets. Additionally, we\\nevaluate system performance metrics, such as communication cost and\\ncomputational efficiency, while considering different federated learning\\narchitectures. Our findings show that medical imaging datasets pose substantial\\nchallenges for current federated learning optimization algorithms. No single\\nalgorithm consistently delivers optimal performance across all medical\\nfederated learning scenarios, and many optimization algorithms may underperform\\nwhen applied to these datasets. Our experiments provide a benchmark and\\nguidance for future research and application of federated learning in medical\\nimaging contexts. Furthermore, we propose an efficient and robust method that\\ncombines generative techniques using denoising diffusion probabilistic models\\nwith label smoothing to augment datasets, widely enhancing the performance of\\nfederated learning on classification tasks across various medical imaging\\ndatasets. Our code will be released on GitHub, offering a reliable and\\ncomprehensive benchmark for future federated learning studies in medical\\nimaging.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.DC\", \"published\": \"2025-04-07T16:22:18Z\"}"}
