{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17717v1\", \"title\": \"Early Detection of Multidrug Resistance Using Multivariate Time Series\\n  Analysis and Interpretable Patient-Similarity Representations\", \"summary\": \"Background and Objectives: Multidrug Resistance (MDR) is a critical global\\nhealth issue, causing increased hospital stays, healthcare costs, and\\nmortality. This study proposes an interpretable Machine Learning (ML) framework\\nfor MDR prediction, aiming for both accurate inference and enhanced\\nexplainability.\\n  Methods: Patients are modeled as Multivariate Time Series (MTS), capturing\\nclinical progression and patient-to-patient interactions. Similarity among\\npatients is quantified using MTS-based methods: descriptive statistics, Dynamic\\nTime Warping, and Time Cluster Kernel. These similarity measures serve as\\ninputs for MDR classification via Logistic Regression, Random Forest, and\\nSupport Vector Machines, with dimensionality reduction and kernel\\ntransformations improving model performance. For explainability, patient\\nsimilarity networks are constructed from these metrics. Spectral clustering and\\nt-SNE are applied to identify MDR-related subgroups and visualize high-risk\\nclusters, enabling insight into clinically relevant patterns.\\n  Results: The framework was validated on ICU Electronic Health Records from\\nthe University Hospital of Fuenlabrada, achieving an AUC of 81%. It outperforms\\nbaseline ML and deep learning models by leveraging graph-based patient\\nsimilarity. The approach identifies key risk factors -- prolonged antibiotic\\nuse, invasive procedures, co-infections, and extended ICU stays -- and reveals\\nclinically meaningful clusters. Code and results are available at\\n\\\\https://github.com/oscarescuderoarnanz/DM4MTS.\\n  Conclusions: Patient similarity representations combined with graph-based\\nanalysis provide accurate MDR prediction and interpretable insights. This\\nmethod supports early detection, risk factor identification, and patient\\nstratification, highlighting the potential of explainable ML in critical care.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-24T16:19:13Z\"}"}
