{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12195v1\", \"title\": \"Validating and monitoring bibliographic and citation data in\\n  OpenCitations collections\", \"summary\": \"Purpose. The increasing emphasis on data quantity in research infrastructures\\nhas highlighted the need for equally robust mechanisms ensuring data quality,\\nparticularly in bibliographic and citation datasets. This paper addresses the\\nchallenge of maintaining high-quality open research information within\\nOpenCitations, a community-guided Open Science Infrastructure, by introducing\\ntools for validating and monitoring bibliographic metadata and citation data.\\n  Methods. We developed a custom validation tool tailored to the OpenCitations\\nData Model (OCDM), designed to detect and explain ingestion errors from\\nheterogeneous sources, whether due to upstream data inconsistencies or internal\\nsoftware bugs. Additionally, a quality monitoring tool was created to track\\nknown data issues post-publication. These tools were applied in two scenarios:\\n(1) validating metadata and citations from Matilda, a potential future source,\\nand (2) monitoring data quality in the existing OpenCitations Meta dataset.\\n  Results. The validation tool successfully identified a variety of structural\\nand semantic issues in the Matilda dataset, demonstrating its precision. The\\nmonitoring tool enabled the detection of recurring problems in the\\nOpenCitations Meta collection, as well as their quantification. Together, these\\ntools proved effective in enhancing the reliability of OpenCitations' published\\ndata.\\n  Conclusion. The presented validation and monitoring tools represent a step\\ntoward ensuring high-quality bibliographic data in open research\\ninfrastructures, though they are limited to the data model adopted by\\nOpenCitations. Future developments are aimed at expanding to additional data\\nsources, with particular regard to crowdsourced data.\", \"main_category\": \"cs.DL\", \"categories\": \"cs.DL,H.3.7\", \"published\": \"2025-04-16T15:47:44Z\"}"}
