{"value":"{\"aid\": \"http://arxiv.org/abs/2503.24332v1\", \"title\": \"On Speedups for Convex Optimization via Quantum Dynamics\", \"summary\": \"We explore the potential for quantum speedups in convex optimization using\\ndiscrete simulations of the Quantum Hamiltonian Descent (QHD) framework, as\\nproposed by Leng et al., and establish the first rigorous query complexity\\nbounds. We develop enhanced analyses for quantum simulation of Schr\\\\\\\"odinger\\noperators with black-box potential via the pseudo-spectral method, providing\\nexplicit resource estimates independent of wavefunction assumptions. These\\nbounds are applied to assess the complexity of optimization through QHD. Our\\nfindings pertain to unconstrained convex optimization in $d$ dimensions. In\\ncontinuous time, we demonstrate that QHD, with suitable parameters, can achieve\\narbitrarily fast convergence rates. The optimization speed limit arises solely\\nfrom the discretization of the dynamics, mirroring a property of the classical\\ndynamics underlying QHD. Considering this cost, we show that a $G$-Lipschitz\\nconvex function can be optimized to an error of $\\\\epsilon$ with\\n$\\\\widetilde{\\\\mathcal{O}}(d^{1.5}G^2 R^2/\\\\epsilon^2)$ queries. Moreover, under\\nreasonable assumptions on the complexity of Hamiltonian simulation,\\n$\\\\widetilde{\\\\Omega}(d/\\\\epsilon^2)$ queries are necessary. Thus, QHD does not\\noffer a speedup over classical zeroth order methods with exact oracles.\\nHowever, we demonstrate that the QHD algorithm tolerates\\n$\\\\widetilde{\\\\mathcal{O}}(\\\\epsilon^3/d^{1.5}G^2 R^2)$ noise in function\\nevaluation. We show that QHD offers a super-quadratic query advantage over all\\nknown classical algorithms tolerating this level of evaluation noise in the\\nhigh-dimension regime. Additionally, we design a quantum algorithm for\\nstochastic convex optimization that provides a super-quadratic speedup over all\\nknown classical algorithms in the high-dimension regime. To our knowledge,\\nthese results represent the first rigorous quantum speedups for convex\\noptimization achieved through a dynamical algorithm.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cs.DS,math.OC\", \"published\": \"2025-03-31T17:21:12Z\"}"}
