{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21464v1\", \"title\": \"VR-FuseNet: A Fusion of Heterogeneous Fundus Data and Explainable Deep\\n  Network for Diabetic Retinopathy Classification\", \"summary\": \"Diabetic retinopathy is a severe eye condition caused by diabetes where the\\nretinal blood vessels get damaged and can lead to vision loss and blindness if\\nnot treated. Early and accurate detection is key to intervention and stopping\\nthe disease progressing. For addressing this disease properly, this paper\\npresents a comprehensive approach for automated diabetic retinopathy detection\\nby proposing a new hybrid deep learning model called VR-FuseNet. Diabetic\\nretinopathy is a major eye disease and leading cause of blindness especially\\namong diabetic patients so accurate and efficient automated detection methods\\nare required. To address the limitations of existing methods including dataset\\nimbalance, diversity and generalization issues this paper presents a hybrid\\ndataset created from five publicly available diabetic retinopathy datasets.\\nEssential preprocessing techniques such as SMOTE for class balancing and CLAHE\\nfor image enhancement are applied systematically to the dataset to improve the\\nrobustness and generalizability of the dataset. The proposed VR-FuseNet model\\ncombines the strengths of two state-of-the-art convolutional neural networks,\\nVGG19 which captures fine-grained spatial features and ResNet50V2 which is\\nknown for its deep hierarchical feature extraction. This fusion improves the\\ndiagnostic performance and achieves an accuracy of 91.824%. The model\\noutperforms individual architectures on all performance metrics demonstrating\\nthe effectiveness of hybrid feature extraction in Diabetic Retinopathy\\nclassification tasks. To make the proposed model more clinically useful and\\ninterpretable this paper incorporates multiple XAI techniques. These techniques\\ngenerate visual explanations that clearly indicate the retinal features\\naffecting the model's prediction such as microaneurysms, hemorrhages and\\nexudates so that clinicians can interpret and validate.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-30T09:38:47Z\"}"}
