{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01329v1\", \"title\": \"Flexible and Explainable Graph Analysis for EEG-based Alzheimer's\\n  Disease Classification\", \"summary\": \"Alzheimer's Disease is a progressive neurological disorder that is one of the\\nmost common forms of dementia. It leads to a decline in memory, reasoning\\nability, and behavior, especially in older people. The cause of Alzheimer's\\nDisease is still under exploration and there is no all-inclusive theory that\\ncan explain the pathologies in each individual patient. Nevertheless, early\\nintervention has been found to be effective in managing symptoms and slowing\\ndown the disease's progression. Recent research has utilized\\nelectroencephalography (EEG) data to identify biomarkers that distinguish\\nAlzheimer's Disease patients from healthy individuals. Prior studies have used\\nvarious machine learning methods, including deep learning and graph neural\\nnetworks, to examine electroencephalography-based signals for identifying\\nAlzheimer's Disease patients. In our research, we proposed a Flexible and\\nExplainable Gated Graph Convolutional Network (GGCN) with Multi-Objective\\nTree-Structured Parzen Estimator (MOTPE) hyperparameter tuning. This provides a\\nflexible solution that efficiently identifies the optimal number of GGCN blocks\\nto achieve the optimized precision, specificity, and recall outcomes, as well\\nas the optimized area under the Receiver Operating Characteristic (AUC). Our\\nfindings demonstrated a high efficacy with an over 0.9 Receiver Operating\\nCharacteristic score, alongside precision, specificity, and recall scores in\\ndistinguishing health control with Alzheimer's Disease patients in Moderate to\\nSevere Dementia using the power spectrum density (PSD) of\\nelectroencephalography signals across various frequency bands. Moreover, our\\nresearch enhanced the interpretability of the embedded adjacency matrices,\\nrevealing connectivity differences in frontal and parietal brain regions\\nbetween Alzheimer's patients and healthy individuals.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-02T03:29:12Z\"}"}
