{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07043v1\", \"title\": \"BIA Transmission in Rate Splitting-based Optical Wireless Networks\", \"summary\": \"Optical wireless communication (OWC) has recently received massive interest\\nas a new technology that can support the enormous data traffic increasing on\\ndaily basis. In particular, laser-based OWC networks can provide terabits per\\nsecond (Tbps) aggregate data rates. However, the emerging OWC networks require\\na high number of optical access points (APs), each AP corresponding to an\\noptical cell, to provide uniform coverage for multiple users. Therefore,\\ninter-cell interference (ICI) and multi-user interference (MUI) are crucial\\nissues that must be managed efficiently to provide high spectral efficiency. In\\nradio frequency (RF) networks, rate splitting (RS) is proposed as a\\ntransmission scheme to serve multiple users simultaneously following a certain\\nstrategy. It was shown that RS provides high data rates compared to orthogonal\\nand non-orthogonal interference management schemes. Considering the high\\ndensity of OWC networks, the application of RS within each optical cell might\\nnot be practical due to severe ICI. In this paper, a new strategy is derived\\nreferred to as blind interference alignment-rate splitting (BIA-RS) to fully\\ncoordinate the transmission among the optical APs, while determining the\\nprecoding matrices of multiple groups of users formed beforehand. Therefore, RS\\ncan be implemented within each group to manage MUI. The proposed BIA-RS scheme\\nrequires two layers of power allocation to achieve high performance. Given\\nthat, a max-min fractional optimization problem is formulated to optimally\\ndistribute the power budget among the groups and the messages intended to the\\nusers of each group. Finally, a power allocation algorithm is designed with\\nmultiple Lagrangian multipliers to provide practical and sub-optimal solutions.\\nThe results show the high performance of the proposed scheme compared to other\\ncounterpart schemes.\", \"main_category\": \"eess.SY\", \"categories\": \"eess.SY,cs.SY\", \"published\": \"2025-04-09T17:00:52Z\"}"}
