{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07707v1\", \"title\": \"Managing Security Issues in Software Containers: From Practitioners\\n  Perspective\", \"summary\": \"Software development industries are increasingly adopting containers to\\nenhance the scalability and flexibility of software applications. Security in\\ncontainerized projects is a critical challenge that can lead to data breaches\\nand performance degradation, thereby directly affecting the reliability and\\noperations of the container services. Despite the ongoing effort to manage the\\nsecurity issues in containerized projects in software engineering (SE)\\nresearch, more focused investigations are needed to explore the human\\nperspective of security management and the technical approaches to security\\nmanagement in containerized projects. This research aims to explore security\\nmanagement in containerized projects by exploring how SE practitioners perceive\\nthe security issues in containerized software projects and their approach to\\nmanaging such issues. A clear understanding of security management in\\ncontainerized projects will enable industries to develop robust security\\nstrategies that enhance software reliability and trust. To achieve this, we\\nconducted two separate semi-structured interview studies to examine how\\npractitioners approach security management. The first study focused on\\npractitioners perceptions of security challenges in containerized environments,\\nwhere we interviewed 15 participants between December 2022 and October 2023.\\nThe second study explored how to enhance container security, with 20\\nparticipants interviewed between October 2024 and December 2024. Analyzing the\\ndata from both studies reveals how SE practitioners address the various\\nsecurity challenges in containerized projects. Our analysis also identified the\\ntechnical and non-technical enablers that can be utilized to enhance security.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-10T12:49:00Z\"}"}
