{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00287v1\", \"title\": \"Avatar Communication Provides More Efficient Online Social Support Than\\n  Text Communication\", \"summary\": \"Online communication via avatars provides a richer online social experience\\nthan text communication. This reinforces the importance of online social\\nsupport. Online social support is effective for people who lack social\\nresources because of the anonymity of online communities. We aimed to\\nunderstand online social support via avatars and their social relationships to\\nprovide better social support to avatar users. Therefore, we administered a\\nquestionnaire to three avatar communication service users (Second Life, ZEPETO,\\nand Pigg Party) and three text communication service users (Facebook, X, and\\nInstagram) (N=8,947). There was no duplication of users for each service. By\\ncomparing avatar and text communication users, we examined the amount of online\\nsocial support, stability of online relationships, and the relationships\\nbetween online social support and offline social resources (e.g., offline\\nsocial support). We observed that avatar communication service users received\\nmore online social support, had more stable relationships, and had fewer\\noffline social resources than text communication service users. However, the\\npositive association between online and offline social support for avatar\\ncommunication users was more substantial than for text communication users.\\nThese findings highlight the significance of realistic online communication\\nexperiences through avatars, including nonverbal and real-time interactions\\nwith co-presence. The findings also highlighted avatar communication service\\nusers' problems in the physical world, such as the lack of offline social\\nresources. This study suggests that enhancing online social support through\\navatars can address these issues. This could help resolve social resource\\nproblems, both online and offline in future metaverse societies.\", \"main_category\": \"cs.SI\", \"categories\": \"cs.SI\", \"published\": \"2025-05-01T04:21:50Z\"}"}
