{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10362v1\", \"title\": \"Proteinoid spikes: from protocognitive to universal approximating agents\", \"summary\": \"Proteinoids, as soft matter fluidic systems, are computational substrates\\nthat have been recently proposed for their analog computing capabilities. Such\\nsystems exhibit oscillatory electrical activity because of cationic and anionic\\nexchange inside and outside such gels. It has also been recently shown that\\nthis (analog) electrical activity, when sampled at fixed time intervals, can be\\nused to reveal their underlying information-theoretic, computational code. This\\ncode, for instance, can be expressed in the (digital) language of Boolean gates\\nand QR codes. Though, this might seem as a good evidence that proteinoid\\nsubstrates have computing abilities when subjected to analog-to-digital\\ntransition, the leap from their underlying computational code to computing\\nabilities is not well explained yet. How can the electrical activity inside\\nproteinoids, whilst of chemical origin, be able them to perform computational\\ntasks at the first place? In addition, proteinoids are also hypothesised to be\\nthe chemical manifestation of the primordial soup, i.e., as potential entities\\nwith proto-cognitive abilities. In this work, we show that the proteinoid\\nsubstrate, owing to its chemical makeup and proto-cognitive abilities, can be\\ninterpreted as an universal approximator, thanks to a novel equivalence between\\nthe electrical activity exhibited by the substrate and a deep Rectified Linear\\nUnit (deep ReLU) network. We exemplify this equivalence by constructing a\\nprediction algorithm which acts as a binary classification model and extract\\n16-dimensional vector data from the proteinoid spike, in order to perform\\npredictions with 70.41\\\\% accuracy. We conclude by drawing an equivalence\\nbetween the the deep ReLU network and the Kolmogorov-Arnold representation\\ntheorem, whose origin can be traced back to Hilbert's thirteenth problem.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn,physics.chem-ph\", \"published\": \"2025-04-14T16:09:33Z\"}"}
