{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03332v1\", \"title\": \"AI-Driven Scholarly Peer Review via Persistent Workflow Prompting,\\n  Meta-Prompting, and Meta-Reasoning\", \"summary\": \"Critical peer review of scientific manuscripts presents a significant\\nchallenge for Large Language Models (LLMs), partly due to data limitations and\\nthe complexity of expert reasoning. This report introduces Persistent Workflow\\nPrompting (PWP), a potentially broadly applicable prompt engineering\\nmethodology designed to bridge this gap using standard LLM chat interfaces\\n(zero-code, no APIs). We present a proof-of-concept PWP prompt for the critical\\nanalysis of experimental chemistry manuscripts, featuring a hierarchical,\\nmodular architecture (structured via Markdown) that defines detailed analysis\\nworkflows. We develop this PWP prompt through iterative application of\\nmeta-prompting techniques and meta-reasoning aimed at systematically codifying\\nexpert review workflows, including tacit knowledge. Submitted once at the start\\nof a session, this PWP prompt equips the LLM with persistent workflows\\ntriggered by subsequent queries, guiding modern reasoning LLMs through\\nsystematic, multimodal evaluations. Demonstrations show the PWP-guided LLM\\nidentifying major methodological flaws in a test case while mitigating LLM\\ninput bias and performing complex tasks, including distinguishing claims from\\nevidence, integrating text/photo/figure analysis to infer parameters, executing\\nquantitative feasibility checks, comparing estimates against claims, and\\nassessing a priori plausibility. To ensure transparency and facilitate\\nreplication, we provide full prompts, detailed demonstration analyses, and logs\\nof interactive chats as supplementary resources. Beyond the specific\\napplication, this work offers insights into the meta-development process\\nitself, highlighting the potential of PWP, informed by detailed workflow\\nformalization, to enable sophisticated analysis using readily available LLMs\\nfor complex scientific tasks.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI\", \"published\": \"2025-05-06T09:06:18Z\"}"}
