{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17297v1\", \"title\": \"Knapsack on Graphs with Relaxed Neighborhood Constraints\", \"summary\": \"In the knapsack problems with neighborhood constraints that were studied\\nbefore, the input is a graph $\\\\mathcal{G}$ on a set $\\\\mathcal{V}$ of items,\\neach item $v \\\\in \\\\mathcal{V}$ has a weight $w_v$ and profit $p_v$, the size $s$\\nof the knapsack, and the demand $d$. The goal is to compute if there exists a\\nfeasible solution whose total weight is at most $s$ and total profit is at most\\n$d$. Here, feasible solutions are all subsets $\\\\mathcal{S}$ of the items such\\nthat, for every item in $\\\\mathcal{S}$, at least one of its neighbors in\\n$\\\\mathcal{G}$ is also in $\\\\mathcal{S}$ for \\\\hor, and all its neighbors in\\n$\\\\mathcal{G}$ are also in $\\\\mathcal{S}$ for\\n\\\\hand~\\\\cite{borradaile2012knapsack}. We study a relaxation of the above\\nproblems. Specifically, we allow all possible subsets of items to be feasible\\nsolutions. However, only those items for which we pick at least one or all of\\nits neighbor (out-neighbor for directed graph) contribute to profit whereas\\nevery item picked contribute to the weight; we call the corresponding problems\\n\\\\sor and \\\\sand. We show that both \\\\sor and \\\\sand are strongly \\\\NPC even on\\nundirected graphs. Regarding parameterized complexity, we show both \\\\sor and\\n\\\\hor are \\\\WTH parameterized by the size $s$ of the knapsack size.\\nInterestingly, both \\\\sand and \\\\hand are \\\\WOH parameterized by knapsack size,\\n$s$ plus profit demand, $d$ and also parameterized by solution size, $b$. For\\n\\\\sor and \\\\hor, we present a randomized color-coding-based pseudo-\\\\FPT\\nalgorithm, parameterized by the solution size $b$, and consequently by the\\ndemand $d$. We then consider the treewidth of the input graph as our parameter\\nand design pseudo fixed-parameter tractable (\\\\FPT) algorithm parameterized by\\ntreewidth, $\\\\text{tw}$ for all variants. Finally, we present an additive $1$\\napproximation for \\\\sor when both the weight and profit of every vertex is $1$.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS,cs.CC\", \"published\": \"2025-04-24T06:46:28Z\"}"}
