{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20567v1\", \"title\": \"Explanation format does not matter; but explanations do -- An Eggsbert\\n  study on explaining Bayesian Optimisation tasks\", \"summary\": \"Bayesian Optimisation (BO) is a family of methods for finding optimal\\nparameters when the underlying function to be optimised is unknown. BO is used,\\nfor example, for hyperparameter tuning in machine learning and as an expert\\nsupport tool for tuning cyberphysical systems. For settings where humans are\\ninvolved in the tuning task, methods have been developed to explain BO\\n(Explainable Bayesian Optimization, XBO). However, there is little guidance on\\nhow to present XBO results to humans so that they can tune the system\\neffectively and efficiently. In this paper, we investigate how the XBO\\nexplanation format affects users' task performance, task load, understanding\\nand trust in XBO. We chose a task that is accessible to a wide range of users.\\nSpecifically, we set up an egg cooking scenario with 6 parameters that\\nparticipants had to adjust to achieve a perfect soft-boiled egg. We compared\\nthree different explanation formats: a bar chart, a list of rules and a textual\\nexplanation in a between-subjects online study with 213 participants. Our\\nresults show that adding any type of explanation increases task success,\\nreduces the number of trials needed to achieve success, and improves\\ncomprehension and confidence. While explanations add more information for\\nparticipants to process, we found no increase in user task load. We also found\\nthat the aforementioned results were independent of the explanation format; all\\nformats had a similar effect.This is an interesting finding for practical\\napplications, as it suggests that explanations can be added to BO tuning tasks\\nwithout the burden of designing or selecting specific explanation formats. In\\nthe future, it would be interesting to investigate scenarios of prolonged use\\nof the explanation formats and whether they have different effects on users'\\nmental models of the underlying system.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-29T09:16:33Z\"}"}
