{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03549v1\", \"title\": \"Massive Acquisition of Ultraviolet Color Excess Information from GALEX\\n  and UVOT Bands\", \"summary\": \"This study employs stellar parameters from spectroscopic surveys and Zhang et\\nal. based on Gaia XP spectra, along with photometric data from GALEX, UVOT, and\\nGaia, to obtain extensive ultraviolet color excess information for the relevant\\nbands of GALEX and UVOT. By considering the impact of stellar parameters\\n(\\\\teff, \\\\feh, and \\\\logg) on intrinsic color indices, and utilizing the\\nblue-edge method combined with a random forest algorithm, an empirical\\nrelationship between stellar parameters and intrinsic ultraviolet color indices\\nis established. By combining observed color indices, the study derives color\\nexcesses for 11,624,802 and 65,531 stars in the GALEX/near-UV and far-UV bands,\\nand 336,633, 137,739, and 253,271 stars in the UVOT/\\\\uvwa, \\\\uvmb, and \\\\uvwb\\\\\\nbands, constructing corresponding ultraviolet extinction maps. Notably, the\\ncolor excess data for the GALEX/near-UV band shows a tenfold increase from\\nprevious results, with the extinction map covering approximately two-thirds of\\nthe sky at a resolution of 0.4$^{\\\\circ}$. The typical uncertainties in the\\nultraviolet color excesses are 0.21 mag, 0.30 mag, 0.19 mag, 0.24 mag, and 0.21\\nmag for \\\\enb, \\\\efb, \\\\ewab, \\\\embb, and \\\\ewbb, respectively. By comparing the\\nspatial distributions of \\\\rv\\\\ derived from ultraviolet and Gaia optical band\\nmeasurements with those obtained from infrared and optical data in previous\\nworks, it is evident that the \\\\rv\\\\ distributions based on the ultraviolet data\\nshow noticeable differences, with some regions even exhibiting opposite trends.\\nThis suggests that a single-parameter \\\\rv\\\\ extinction law may not be sufficient\\nto simultaneously characterize the extinction behavior across infrared,\\noptical, and ultraviolet bands.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.SR\", \"published\": \"2025-05-06T14:02:18Z\"}"}
