{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21462v1\", \"title\": \"High-Quality Ultra-Fast Total Scattering and Pair Distribution Function\\n  Data using an X-ray Free Electron Laser\", \"summary\": \"High-quality total scattering data, a key tool for understanding atomic-scale\\nstructure in disordered materials, require stable instrumentation and access to\\nhigh momentum transfers. This is now routine at dedicated synchrotron\\ninstrumentation using high-energy X-ray beams, but it is very challenging to\\nmeasure a total scattering dataset in less than a few microseconds. This limits\\ntheir effectiveness for capturing structural changes that occur at the much\\nfaster timescales of atomic motion. Current X-ray free-electron lasers (XFELs)\\nprovide femtosecond-pulsed X-ray beams with maximum energies of approximately\\n24 keV, giving the potential to measure total scattering and the attendant pair\\ndistribution functions (PDFs) on femtosecond timescales. Here, we show that\\nthis potential has been realised using the HED scientific instrument at the\\nEuropean XFEL and present normalised total scattering data for 0.35 \\\\r{A}-1 < Q\\n< 16.6 \\\\r{A}-1 and their PDFs from a broad spectrum of materials, including\\ncrystalline, nanocrystalline and amorphous solids, liquids, and clusters in\\nsolution. We analyse the data using a variety of methods, including Rietveld\\nrefinement, small-box PDF refinement, joint reciprocal-real space refinement,\\ncluster refinement, and Debye scattering analysis. The resolution function of\\nthe setup is also thoroughly characterised. We conclusively show that\\nhigh-quality data can be obtained from a single approximately 30 fs XFEL pulse.\\nOur efforts not only significantly increase the existing maximum reported\\nQ-range for an S(Q) measured at an XFEL but also mean that XFELs are now a\\nviable X-ray source for the broad community of people using reciprocal space\\ntotal scattering and PDF methods in their research.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-04-30T09:31:22Z\"}"}
