{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21838v1\", \"title\": \"Learning Universal User Representations Leveraging Cross-domain User\\n  Intent at Snapchat\", \"summary\": \"The development of powerful user representations is a key factor in the\\nsuccess of recommender systems (RecSys). Online platforms employ a range of\\nRecSys techniques to personalize user experience across diverse in-app\\nsurfaces. User representations are often learned individually through user's\\nhistorical interactions within each surface and user representations across\\ndifferent surfaces can be shared post-hoc as auxiliary features or additional\\nretrieval sources. While effective, such schemes cannot directly encode\\ncollaborative filtering signals across different surfaces, hindering its\\ncapacity to discover complex relationships between user behaviors and\\npreferences across the whole platform. To bridge this gap at Snapchat, we seek\\nto conduct universal user modeling (UUM) across different in-app surfaces,\\nlearning general-purpose user representations which encode behaviors across\\nsurfaces. Instead of replacing domain-specific representations, UUM\\nrepresentations capture cross-domain trends, enriching existing representations\\nwith complementary information. This work discusses our efforts in developing\\ninitial UUM versions, practical challenges, technical choices and modeling and\\nresearch directions with promising offline performance. Following successful\\nA/B testing, UUM representations have been launched in production, powering\\nmultiple use cases and demonstrating their value. UUM embedding has been\\nincorporated into (i) Long-form Video embedding-based retrieval, leading to\\n2.78% increase in Long-form Video Open Rate, (ii) Long-form Video L2 ranking,\\nwith 19.2% increase in Long-form Video View Time sum, (iii) Lens L2 ranking,\\nleading to 1.76% increase in Lens play time, and (iv) Notification L2 ranking,\\nwith 0.87% increase in Notification Open Rate.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR\", \"published\": \"2025-04-30T17:48:43Z\"}"}
