{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10126v1\", \"title\": \"Polarimetry of exoplanet-exomoon systems\", \"summary\": \"We investigated the potential of polarimetric observations in the optical\\nwavelength range for the detection of exomoons and the characterization of\\nexoplanet-exomoon systems. Using the three-dimensional Monte Carlo radiative\\ntransfer code POLARIS, we calculated flux and polarization phase curves of\\nEarth-like exoplanets with a satellite similar to Earth's moon. Of particular\\ninterest are mutual events, when one of the two bodies casts a shadow on the\\nother or transits in front of it. We find that the signatures of mutual events\\nin the polarization phase curve show significant variations depending on the\\ninclination of the lunar orbit. If the planet-satellite pair is spatially\\nresolved from the star but the satellite is spatially unresolved, the increase\\nin the degree of polarization during a transit of the exomoon in front of the\\ncenter of the exoplanet reaches $2.7\\\\%$ in our model system near quadrature.\\nHowever, the change is less than $0.5\\\\%$ if the orbit of the exomoon is\\ninclined such that it transits the planet noncentrally at the same phase\\nangles. The influence of an exomoon on the polarization phase curve of an\\nexoplanet-exomoon system is dependent on the lunar polarization phase curve.\\nObservations of full eclipses and occultations of the exomoon allow the\\ndetermination of separate polarization phase curves for the two bodies.\\nInformation about the lunar orbital inclination can be obtained with\\npolarimetric observations of shadows or transits. Measuring the influence of\\nlarge satellites not only on the total flux, but also on the polarization of\\nthe reflected stellar radiation during mutual events thus facilitates the\\nprediction of future mutual events and the verification of exomoon candidates.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-14T11:34:10Z\"}"}
