{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11856v1\", \"title\": \"Cross-Frequency Collaborative Training Network and Dataset for\\n  Semi-supervised First Molar Root Canal Segmentation\", \"summary\": \"Root canal (RC) treatment is a highly delicate and technically complex\\nprocedure in clinical practice, heavily influenced by the clinicians'\\nexperience and subjective judgment. Deep learning has made significant\\nadvancements in the field of computer-aided diagnosis (CAD) because it can\\nprovide more objective and accurate diagnostic results. However, its\\napplication in RC treatment is still relatively rare, mainly due to the lack of\\npublic datasets in this field. To address this issue, in this paper, we\\nestablished a First Molar Root Canal segmentation dataset called FMRC-2025.\\nAdditionally, to alleviate the workload of manual annotation for dentists and\\nfully leverage the unlabeled data, we designed a Cross-Frequency Collaborative\\ntraining semi-supervised learning (SSL) Network called CFC-Net. It consists of\\ntwo components: (1) Cross-Frequency Collaborative Mean Teacher (CFC-MT), which\\nintroduces two specialized students (SS) and one comprehensive teacher (CT) for\\ncollaborative multi-frequency training. The CT and SS are trained on different\\nfrequency components while fully integrating multi-frequency knowledge through\\ncross and full frequency consistency supervisions. (2) Uncertainty-guided\\nCross-Frequency Mix (UCF-Mix) mechanism enables the network to generate\\nhigh-confidence pseudo-labels while learning to integrate multi-frequency\\ninformation and maintaining the structural integrity of the targets. Extensive\\nexperiments on FMRC-2025 and three public dental datasets demonstrate that\\nCFC-MT is effective for RC segmentation and can also exhibit strong\\ngeneralizability on other dental segmentation tasks, outperforming\\nstate-of-the-art SSL medical image segmentation methods. Codes and dataset will\\nbe released.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-16T08:24:42Z\"}"}
