{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01627v1\", \"title\": \"Horizon Scans can be accelerated using novel information retrieval and\\n  artificial intelligence tools\", \"summary\": \"Introduction: Horizon scanning in healthcare assesses early signals of\\ninnovation, crucial for timely adoption. Current horizon scanning faces\\nchallenges in efficient information retrieval and analysis, especially from\\nunstructured sources like news, presenting a need for innovative tools.\\nMethodology: The study introduces SCANAR and AIDOC, open-source Python-based\\ntools designed to improve horizon scanning. SCANAR automates the retrieval and\\nprocessing of news articles, offering functionalities such as de-duplication\\nand unsupervised relevancy ranking. AIDOC aids filtration by leveraging AI to\\nreorder textual data based on relevancy, employing neural networks for semantic\\nsimilarity, and subsequently prioritizing likely relevant entries for human\\nreview. Results: Twelve internal datasets from horizon scans and four external\\nbenchmarking datasets were used. SCANAR improved retrieval efficiency by\\nautomating processes previously dependent on manual labour. AIDOC displayed\\nwork-saving potential, achieving around 62% reduction in manual review efforts\\nat 95% recall. Comparative analysis with benchmarking data showed AIDOC's\\nperformance was similar to existing systematic review automation tools, though\\nperformance varied depending on dataset characteristics. A smaller case-study\\non our news datasets shows the potential of ensembling large language models\\nwithin the active-learning process for faster detection of relevant articles\\nacross news datasets. Conclusion: The validation indicates that SCANAR and\\nAIDOC show potential to enhance horizon scanning efficiency by streamlining\\ndata retrieval and prioritisation. These tools may alleviate methodological\\nlimitations and allow broader, swifter horizon scans. Further studies are\\nsuggested to optimize these models and to design new workflows and validation\\nprocesses that integrate large language models.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR,cs.AI,cs.CL\", \"published\": \"2025-04-02T11:33:08Z\"}"}
