{"value":"{\"aid\": \"http://arxiv.org/abs/2504.06056v1\", \"title\": \"$L_\\\\textrm{dT}$: An ionospheric activity index based on distributions in\\n  GNSS-derived TEC rates of change\", \"summary\": \"Many aspects of our societies now depend upon satellite telecommunications,\\nsuch as those requiring Global Navigation Satellite Systems (GNSS). GNSS is\\nbased on radio waves that propagate through the ionosphere and experience\\ncomplicated propagation effects caused by inhomogeneities in its electron\\ndensity. The Earth's ionosphere forms part of the solar-terrestrial\\nenvironment, and its state is determined by the spatial distribution and\\ntemporal evolution of its electron density. It varies in response to the \\\"space\\nweather\\\" combination of solar activity and geomagnetic conditions. Notably, the\\nradio waves used in satellite telecommunications suffer due to the dispersive\\nnature of the ionospheric plasma.\\n  Scales and indices that summarise the state of the solar-terrestrial\\nenvironment due to solar activity and geomagnetic conditions already exist.\\nHowever, the response of the ionosphere to active geomagnetic conditions, its\\ngeoeffectiveness, and its likely impact on systems and services are not\\nencapsulated by these. This is due to the ionosphere's intrinsic day-to-day\\nvariability, persistent seasonal patterns, and because radio wave measurements\\nof the ionosphere depend upon many factors.\\n  Here we develop a novel index that describes the state of the ionosphere\\nduring specific space weather conditions. It is based on propagation\\ndisturbances in GNSS signals, and is able to characterise the spatio-temporal\\nevolution of ionospheric disturbances in near real time. This new scale\\nencapsulates day-to-day variability, seasonal patterns, and the geo-effective\\nresponse of the ionosphere to disturbed space weather conditions; and can be\\napplied to data from any GNSS network. It is intended that this new scale will\\nbe utilised by agencies providing space weather services, as well as by service\\noperators to appreciate the current conditions in the ionosphere, thus\\ninforming their operations.\", \"main_category\": \"physics.space-ph\", \"categories\": \"physics.space-ph\", \"published\": \"2025-04-08T14:00:14Z\"}"}
