{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03211v1\", \"title\": \"Noise sensitivity and variance lower bound for minimal left-right\\n  crossing of a square in first-passage percolation\", \"summary\": \"We study first-passage percolation on $\\\\mathbb Z ^2$ with independent and\\nidentically distributed weights, whose common distribution is uniform on\\n$\\\\{a,b\\\\}$ with $0<a<b<\\\\infty $.\\n  Following Ahlberg and De la Riva, we consider the passage time $\\\\tau (n,k)$\\nof the minimal left-right crossing of the square $[0,n]^2$, whose vertical\\nfluctuations are bounded by $k$. We prove that when $k\\\\le n^{1/2-\\\\epsilon}$,\\nthe event that $\\\\tau (n,k)$ is larger than its median is noise sensitive. This\\nimproves the main result of Ahlberg and De la Riva which holds when $k\\\\le\\nn^{1/22-\\\\epsilon }$.\\n  Under the additional assumption that the limit shape is not a polygon with a\\nsmall number of sides, we extend the result to all $k\\\\le n^{1-\\\\epsilon }$. This\\nextension follows unconditionally when $a$ and $b$ are sufficiently close.\\n  Under a stronger curvature assumption, we extend the result to all $k\\\\le n$.\\nThis in particular captures the noise sensitivity of the event that the minimal\\nleft-right crossing $T_n=\\\\tau (n,n)$ is larger than its median.\\n  Finally, under the curvature assumption, our methods give a lower bound of\\n$n^{1/4-\\\\epsilon }$ for the variance of the passage time $T_n$ of the minimal\\nleft-right crossing of the square. We prove the last bound also for absolutely\\ncontinuous weight distributions, generalizing a result of\\nDamron--Houdr\\\\'e--\\\\\\\"Ozdemir, which holds only for the exponential distribution.\\n  Our approach differs from the previous works mentioned above; the key idea is\\nto establish a small ball probability estimate in the tail by perturbing the\\nweights for tail events using a Mermin--Wagner type estimate.\", \"main_category\": \"math.PR\", \"categories\": \"math.PR\", \"published\": \"2025-05-06T05:58:13Z\"}"}
