{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15964v1\", \"title\": \"Quantum machine learning advantages beyond hardness of evaluation\", \"summary\": \"The most general examples of quantum learning advantages involve data labeled\\nby cryptographic or intrinsically quantum functions, where classical learners\\nare limited by the infeasibility of evaluating the labeling functions using\\npolynomial-sized classical circuits. While broad in scope, such results reveal\\nlittle about advantages arising from the learning process itself. In\\ncryptographic settings, further insight is possible via random-generatability -\\nthe ability to classically generate labeled data - enabling hardness proofs for\\nidentification tasks, where the goal is to identify the labeling function from\\na dataset, even when evaluation is classically intractable. These tasks are\\nparticularly relevant in quantum contexts, including Hamiltonian learning and\\nidentifying physically meaningful order parameters. However, for quantum\\nfunctions, random-generatability is conjectured not to hold, leaving no known\\nidentification advantages in genuinely quantum regimes.\\n  In this work, we give the first proofs of quantum identification learning\\nadvantages under standard complexity assumptions. We confirm that quantum-hard\\nfunctions are not random-generatable unless BQP is contained in the second\\nlevel of the polynomial hierarchy, ruling out cryptographic-style data\\ngeneration strategies. We then introduce a new approach: we show that\\nverifiable identification - solving the identification task for valid datasets\\nwhile rejecting invalid ones - is classically hard for quantum labeling\\nfunctions unless BQP is in the polynomial hierarchy. Finally, we show that, for\\na broad class of tasks, solving the identification problem implies verifiable\\nidentification in the polynomial hierarchy. This yields our main result: a\\nnatural class of quantum identification tasks solvable by quantum learners but\\nhard for classical learners unless BQP is in the polynomial hierarchy.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph\", \"published\": \"2025-04-22T15:04:46Z\"}"}
