{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07645v1\", \"title\": \"Prediction of Usage Probabilities of Shopping-Mall Corridors Using\\n  Heterogeneous Graph Neural Networks\", \"summary\": \"We present a method based on graph neural network (GNN) for prediction of\\nprobabilities of usage of shopping-mall corridors. The heterogeneous graph\\nnetwork of shops and corridor paths are obtained from floorplans of the malls\\nby creating vector layers for corridors, shops and entrances. These are\\nsubsequently assimilated into nodes and edges of graphs. The prediction of the\\nusage probability is based on the shop features, namely, the area and usage\\ncategories they fall into, and on the graph connecting these shops, corridor\\njunctions and entrances by corridor paths. Though the presented method is\\napplicable for training on datasets obtained from a field survey or from\\npedestrian-detecting sensors, the target data of the supervised deep-learning\\nwork flow in this work are obtained from a probability method. We also include\\na context-specific representation learning of latent features. The\\nusage-probability prediction is made on each edge, which is a connection by a\\nsection of corridor path between the adjacent nodes representing the shops or\\ncorridor points. To create a feature for each edge, the hidden-layer feature\\nvectors acquired in the message-passing GNN layers at the nodes of each edge\\nare averaged and concatenated with the vector obtained by their multiplication.\\nThese edge-features are then passed to multilayer perceptrons (MLP) to make the\\nfinal prediction of usage probability on each edge. The samples of synthetic\\nlearning dataset for each shopping mall are obtained by changing the shops'\\nusage and area categories, and by subsequently feeding the graph into the\\nprobability model.\\n  When including different shopping malls in a single dataset, we also propose\\nto consider graph-level features to inform the model with specific identifying\\nfeatures of each mall.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-10T10:48:36Z\"}"}
