{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03498v1\", \"title\": \"MRI motion correction via efficient residual-guided denoising diffusion\\n  probabilistic models\", \"summary\": \"Purpose: Motion artifacts in magnetic resonance imaging (MRI) significantly\\ndegrade image quality and impair quantitative analysis. Conventional mitigation\\nstrategies, such as repeated acquisitions or motion tracking, are costly and\\nworkflow-intensive. This study introduces Res-MoCoDiff, an efficient denoising\\ndiffusion probabilistic model tailored for MRI motion artifact correction.\\nMethods: Res-MoCoDiff incorporates a novel residual error shifting mechanism in\\nthe forward diffusion process, aligning the noise distribution with\\nmotion-corrupted data and enabling an efficient four-step reverse diffusion. A\\nU-net backbone enhanced with Swin-Transformer blocks conventional attention\\nlayers, improving adaptability across resolutions. Training employs a combined\\nl1+l2 loss, which promotes image sharpness and reduces pixel-level errors.\\nRes-MoCoDiff was evaluated on synthetic dataset generated using a realistic\\nmotion simulation framework and on an in-vivo dataset. Comparative analyses\\nwere conducted against established methods, including CycleGAN, Pix2pix, and\\nMT-DDPM using quantitative metrics such as peak signal-to-noise ratio (PSNR),\\nstructural similarity index measure (SSIM), and normalized mean squared error\\n(NMSE). Results: The proposed method demonstrated superior performance in\\nremoving motion artifacts across all motion severity levels. Res-MoCoDiff\\nconsistently achieved the highest SSIM and the lowest NMSE values, with a PSNR\\nof up to 41.91+-2.94 dB for minor distortions. Notably, the average sampling\\ntime was reduced to 0.37 seconds per batch of two image slices, compared with\\n101.74 seconds for conventional approaches.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,physics.med-ph\", \"published\": \"2025-05-06T13:02:40Z\"}"}
