{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12020v1\", \"title\": \"MixSignGraph: A Sign Sequence is Worth Mixed Graphs of Nodes\", \"summary\": \"Recent advances in sign language research have benefited from CNN-based\\nbackbones, which are primarily transferred from traditional computer vision\\ntasks (\\\\eg object identification, image recognition). However, these CNN-based\\nbackbones usually excel at extracting features like contours and texture, but\\nmay struggle with capturing sign-related features. In fact, sign language tasks\\nrequire focusing on sign-related regions, including the collaboration between\\ndifferent regions (\\\\eg left hand region and right hand region) and the\\neffective content in a single region. To capture such region-related features,\\nwe introduce MixSignGraph, which represents sign sequences as a group of mixed\\ngraphs and designs the following three graph modules for feature extraction,\\n\\\\ie Local Sign Graph (LSG) module, Temporal Sign Graph (TSG) module and\\nHierarchical Sign Graph (HSG) module. Specifically, the LSG module learns the\\ncorrelation of intra-frame cross-region features within one frame, \\\\ie focusing\\non spatial features. The TSG module tracks the interaction of inter-frame\\ncross-region features among adjacent frames, \\\\ie focusing on temporal features.\\nThe HSG module aggregates the same-region features from different-granularity\\nfeature maps of a frame, \\\\ie focusing on hierarchical features. In addition, to\\nfurther improve the performance of sign language tasks without gloss\\nannotations, we propose a simple yet counter-intuitive Text-driven CTC\\nPre-training (TCP) method, which generates pseudo gloss labels from text labels\\nfor model pre-training. Extensive experiments conducted on current five public\\nsign language datasets demonstrate the superior performance of the proposed\\nmodel. Notably, our model surpasses the SOTA models on multiple sign language\\ntasks across several datasets, without relying on any additional cues.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-16T12:23:30Z\"}"}
