{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19648v1\", \"title\": \"Gaia FGK Benchmark Stars: spectral library, metallicities and abundances\\n  of $\\u03b1$ and Fe-peak elements of the third version\", \"summary\": \"The accurate determination of chemical abundances in stars plays a pivotal\\nrole in understanding stellar structure and evolution, nucleosynthesis, and the\\nchemical enrichment history of the Milky Way. Benchmark stars with precise and\\naccurate atmospheric parameters and abundances are indispensable for\\ncalibrating spectroscopic surveys and testing stellar atmosphere models. This\\nstudy focuses on the compilation of high-quality spectra and the determination\\nof LTE chemical abundances of iron-peak and $\\\\alpha$ elements for the third\\nversion of the Gaia FGK Benchmark Stars (GBSv3). We compiled spectra of the\\nGBSv3 from public archives and complemented these with our own observations. We\\nuse fundamental atmospheric parameters from Soubiran et al. 2024 to derive the\\nchemical abundances and perform a spectroscopic analysis using the public code\\niSpec. We compile a homogeneous spectral library of high-resolution (42,000)\\nand high signal-to-noise ($>100$) normalised spectra for 202 stars: including\\nthe 192 GBSv3, 9 stars with indirect measurement of the angular diameter from\\nprevious GBS versions, and the Sun. Using four radiative transfer codes, we\\nderive chemical abundances of 13 chemical species (Fe I, Fe II, Mg I, Si I, Ca\\nI, Ti I, Ti II, Sc II, V I, Cr I, Mn I, Co I, Ni I). We make an in-depth study\\nof several sources of error. The GBSv3 contributes to the legacy samples of\\nspectroscopic reference stars with improved statistics and homogeneity. The\\ncompiled high-resolution spectral library and the determination of abundances\\nfor iron-peak and $\\\\alpha$ elements, together with an extensive discussion of\\nthe linked uncertainties, provides a sample of reference abundances to the\\ncommunity.\", \"main_category\": \"astro-ph.SR\", \"categories\": \"astro-ph.SR,astro-ph.GA\", \"published\": \"2025-04-28T10:06:02Z\"}"}
