{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10021v1\", \"title\": \"Masked Autoencoder Self Pre-Training for Defect Detection in\\n  Microelectronics\", \"summary\": \"Whereas in general computer vision, transformer-based architectures have\\nquickly become the gold standard, microelectronics defect detection still\\nheavily relies on convolutional neural networks (CNNs). We hypothesize that\\nthis is due to the fact that a) transformers have an increased need for data\\nand b) labelled image generation procedures for microelectronics are costly,\\nand labelled data is therefore sparse. Whereas in other domains, pre-training\\non large natural image datasets can mitigate this problem, in microelectronics\\ntransfer learning is hindered due to the dissimilarity of domain data and\\nnatural images. Therefore, we evaluate self pre-training, where models are\\npre-trained on the target dataset, rather than another dataset. We propose a\\nvision transformer (ViT) pre-training framework for defect detection in\\nmicroelectronics based on masked autoencoders (MAE). In MAE, a large share of\\nimage patches is masked and reconstructed by the model during pre-training. We\\nperform pre-training and defect detection using a dataset of less than 10.000\\nscanning acoustic microscopy (SAM) images labelled using transient thermal\\nanalysis (TTA). Our experimental results show that our approach leads to\\nsubstantial performance gains compared to a) supervised ViT, b) ViT pre-trained\\non natural image datasets, and c) state-of-the-art CNN-based defect detection\\nmodels used in the literature. Additionally, interpretability analysis reveals\\nthat our self pre-trained models, in comparison to ViT baselines, correctly\\nfocus on defect-relevant features such as cracks in the solder material. This\\ndemonstrates that our approach yields fault-specific feature representations,\\nmaking our self pre-trained models viable for real-world defect detection in\\nmicroelectronics.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-14T09:25:50Z\"}"}
