{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16907v1\", \"title\": \"BadVideo: Stealthy Backdoor Attack against Text-to-Video Generation\", \"summary\": \"Text-to-video (T2V) generative models have rapidly advanced and found\\nwidespread applications across fields like entertainment, education, and\\nmarketing. However, the adversarial vulnerabilities of these models remain\\nrarely explored. We observe that in T2V generation tasks, the generated videos\\noften contain substantial redundant information not explicitly specified in the\\ntext prompts, such as environmental elements, secondary objects, and additional\\ndetails, providing opportunities for malicious attackers to embed hidden\\nharmful content. Exploiting this inherent redundancy, we introduce BadVideo,\\nthe first backdoor attack framework tailored for T2V generation. Our attack\\nfocuses on designing target adversarial outputs through two key strategies: (1)\\nSpatio-Temporal Composition, which combines different spatiotemporal features\\nto encode malicious information; (2) Dynamic Element Transformation, which\\nintroduces transformations in redundant elements over time to convey malicious\\ninformation. Based on these strategies, the attacker's malicious target\\nseamlessly integrates with the user's textual instructions, providing high\\nstealthiness. Moreover, by exploiting the temporal dimension of videos, our\\nattack successfully evades traditional content moderation systems that\\nprimarily analyze spatial information within individual frames. Extensive\\nexperiments demonstrate that BadVideo achieves high attack success rates while\\npreserving original semantics and maintaining excellent performance on clean\\ninputs. Overall, our work reveals the adversarial vulnerability of T2V models,\\ncalling attention to potential risks and misuse. Our project page is at\\nhttps://wrt2000.github.io/BadVideo2025/.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-23T17:34:48Z\"}"}
