{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05427v1\", \"title\": \"Ultra-FineWeb: Efficient Data Filtering and Verification for\\n  High-Quality LLM Training Data\", \"summary\": \"Data quality has become a key factor in enhancing model performance with the\\nrapid development of large language models (LLMs). Model-driven data filtering\\nhas increasingly become a primary approach for acquiring high-quality data.\\nHowever, it still faces two main challenges: (1) the lack of an efficient data\\nverification strategy makes it difficult to provide timely feedback on data\\nquality; and (2) the selection of seed data for training classifiers lacks\\nclear criteria and relies heavily on human expertise, introducing a degree of\\nsubjectivity. To address the first challenge, we introduce an efficient\\nverification strategy that enables rapid evaluation of the impact of data on\\nLLM training with minimal computational cost. To tackle the second challenge,\\nwe build upon the assumption that high-quality seed data is beneficial for LLM\\ntraining, and by integrating the proposed verification strategy, we optimize\\nthe selection of positive and negative samples and propose an efficient data\\nfiltering pipeline. This pipeline not only improves filtering efficiency,\\nclassifier quality, and robustness, but also significantly reduces experimental\\nand inference costs. In addition, to efficiently filter high-quality data, we\\nemploy a lightweight classifier based on fastText, and successfully apply the\\nfiltering pipeline to two widely-used pre-training corpora, FineWeb and Chinese\\nFineWeb datasets, resulting in the creation of the higher-quality Ultra-FineWeb\\ndataset. Ultra-FineWeb contains approximately 1 trillion English tokens and 120\\nbillion Chinese tokens. Empirical results demonstrate that the LLMs trained on\\nUltra-FineWeb exhibit significant performance improvements across multiple\\nbenchmark tasks, validating the effectiveness of our pipeline in enhancing both\\ndata quality and training efficiency.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-05-08T17:15:20Z\"}"}
