{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19678v1\", \"title\": \"From LLM Reasoning to Autonomous AI Agents: A Comprehensive Review\", \"summary\": \"Large language models and autonomous AI agents have evolved rapidly,\\nresulting in a diverse array of evaluation benchmarks, frameworks, and\\ncollaboration protocols. However, the landscape remains fragmented and lacks a\\nunified taxonomy or comprehensive survey. Therefore, we present a side-by-side\\ncomparison of benchmarks developed between 2019 and 2025 that evaluate these\\nmodels and agents across multiple domains. In addition, we propose a taxonomy\\nof approximately 60 benchmarks that cover general and academic knowledge\\nreasoning, mathematical problem-solving, code generation and software\\nengineering, factual grounding and retrieval, domain-specific evaluations,\\nmultimodal and embodied tasks, task orchestration, and interactive assessments.\\nFurthermore, we review AI-agent frameworks introduced between 2023 and 2025\\nthat integrate large language models with modular toolkits to enable autonomous\\ndecision-making and multi-step reasoning. Moreover, we present real-world\\napplications of autonomous AI agents in materials science, biomedical research,\\nacademic ideation, software engineering, synthetic data generation, chemical\\nreasoning, mathematical problem-solving, geographic information systems,\\nmultimedia, healthcare, and finance. We then survey key agent-to-agent\\ncollaboration protocols, namely the Agent Communication Protocol (ACP), the\\nModel Context Protocol (MCP), and the Agent-to-Agent Protocol (A2A). Finally,\\nwe discuss recommendations for future research, focusing on advanced reasoning\\nstrategies, failure modes in multi-agent LLM systems, automated scientific\\ndiscovery, dynamic tool integration via reinforcement learning, integrated\\nsearch capabilities, and security vulnerabilities in agent protocols.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.LG\", \"published\": \"2025-04-28T11:08:22Z\"}"}
