{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13062v1\", \"title\": \"Seeing Beyond Dark-Field RGB Capabilities: Deep Spectral Extrapolation\\n  of Ultrasmall Plasmonic Nanogaps\", \"summary\": \"Localized surface plasmons can confine light within a deep-subwavelength\\nvolume comparable to the scale of atoms and molecules, enabling ultrasensitive\\nresponses to near-field variations. On the other hand, this extreme\\nlocalization also inevitably amplifies the unwanted noise from the response of\\nlocal morphological imperfections, leading to complex spectral variations and\\nreduced consistency across the plasmonic nanostructures. Seeking uniform\\noptical responses has therefore long been a sought-after goal in\\nnanoplasmonics. However, conventional probing techniques by dark-field (DF)\\nconfocal microscopy, such as image analysis or spectral measurements, can be\\ninaccurate and time-consuming, respectively. Here, we introduce SPARX, a\\ndeep-learning-powered paradigm that surpasses conventional imaging and\\nspectroscopic capabilities. In particular, SPARX can batch-predict broadband DF\\nspectra (e.g., 500-1000 nm) of numerous nanoparticles simultaneously from an\\ninformation-limited RGB image (i.e., below 700 nm). It achieves this\\nextrapolative inference beyond the camera's capture capabilities by learning\\nthe underlying physical relationships among multiple orders of optical\\nresonances. The spectral predictions only take milliseconds, achieving a\\nspeedup of three to four orders of magnitude compared to traditional spectral\\nacquisition, which may take from hours to days. As a proof-of-principle\\ndemonstration for screening identical resonances, the selection accuracy\\nachieved by SPARX is comparable to that of conventional spectroscopy\\ntechniques. This breakthrough paves the way for consistent plasmonic\\napplications and next-generation microscopies.\", \"main_category\": \"physics.optics\", \"categories\": \"physics.optics,cond-mat.dis-nn,cond-mat.mes-hall\", \"published\": \"2025-04-17T16:15:56Z\"}"}
