{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04443v1\", \"title\": \"Revisiting the structure of epitaxial Si3N4 on AlGaN/GaN via\\n  evolutionary structure search\", \"summary\": \"Gallium nitride (GaN)-based devices, such as high electron mobility\\ntransistors (HEMTs), benefit from the integration of a silicon nitride (Si3N4)\\ncap layer on the AlGaN barrier. Previous studies, relying on empirical methods\\nand the lack of systematic structure-searching tools, suggested a\\ndefect-wurtzite (DW-Si3N4) structure for Si3N4 on AlGaN. However, this\\nstructure, while plausible, is energetically much higher compared to\\nbeta-Si3N4. In a recent experiment (Appl. Phys. Lett. 125, 122109 (2024)), we\\nsynthesized a 2 nm thick crystalline Si3N4 layer on AlGaN. This finding\\nprompted a reexamination of its atomic configuration, given the discrepancies\\nbetween the previously proposed defect-wurtzite (DW) phase and experimental\\nobservations. To address this, we employed a systematic structure search to\\nidentify a more stable configuration, which we denote as Lam-Si3N4. This\\nstructure, characterized by a quasi-two-dimensional (Lamina) structure, is\\napproximately 60 meV/atom lower in energy than the DW-Si3N4 structure under the\\nin-plane lattice constant constraint matching AlGaN, and provides a better\\nmatch to experimental data. Furthermore, when fully relaxed (i.e., no external\\nstrain), both DW-Si3N4 and Lam-Si3N4 exhibit wide band gaps around 4~eV.\\nHowever, under the imposed AlGaN lattice constant constraint, the band gap of\\nDW-Si3N4 significantly shrinks, whereas Lam-Si3N4 retains a relatively larger\\ngap. The mechanical and phonon anisotropy in Lam-Si3N4 may lead to distinct\\ndirectional thermal conductivity and elastic behavior, which can be beneficial\\nfor high-frequency and high-power applications. These findings provide\\nimportant insights into the structure and properties of in situ grown Si3N4,\\npotentially guiding further optimization of cap layers for GaN-based devices.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci\", \"published\": \"2025-05-07T14:14:15Z\"}"}
