{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20498v1\", \"title\": \"Style-Adaptive Detection Transformer for Single-Source Domain\\n  Generalized Object Detection\", \"summary\": \"Single-source Domain Generalization (SDG) in object detection aims to develop\\na detector using only data from a source domain that can exhibit strong\\ngeneralization capability when applied to unseen target domains. Existing\\nmethods are built upon CNN-based detectors and primarily improve robustness by\\nemploying carefully designed data augmentation strategies integrated with\\nfeature alignment techniques. However, data augmentation methods have inherent\\ndrawbacks; they are only effective when the augmented sample distribution\\napproximates or covers the unseen scenarios, thus failing to enhance\\ngeneralization across all unseen domains. Furthermore, while the recent\\nDetection Transformer (DETR) has demonstrated superior generalization\\ncapability in domain adaptation tasks due to its efficient global information\\nextraction, its potential in SDG tasks remains unexplored. To this end, we\\nintroduce a strong DETR-based detector named the Style-Adaptive Detection\\nTransformer (SA-DETR) for SDG in object detection. Specifically, we present a\\ndomain style adapter that projects the style representation of the unseen\\ntarget domain into the training domain, enabling dynamic style adaptation.\\nThen, we propose an object-aware contrastive learning module to guide the\\ndetector in extracting domain-invariant features through contrastive learning.\\nBy using object-aware gating masks to constrain feature aggregation in both\\nspatial and semantic dimensions, this module achieves cross-domain contrast of\\ninstance-level features, thereby enhancing generalization. Extensive\\nexperiments demonstrate the superior performance and generalization capability\\nof SA-DETR across five different weather scenarios. Code is released at\\nhttps://github.com/h751410234/SA-DETR.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-29T07:38:37Z\"}"}
