{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10244v1\", \"title\": \"Towards contrast- and pathology-agnostic clinical fetal brain MRI\\n  segmentation using SynthSeg\", \"summary\": \"Magnetic resonance imaging (MRI) has played a crucial role in fetal\\nneurodevelopmental research. Structural annotations of MR images are an\\nimportant step for quantitative analysis of the developing human brain, with\\nDeep learning providing an automated alternative for this otherwise tedious\\nmanual process. However, segmentation performances of Convolutional Neural\\nNetworks often suffer from domain shift, where the network fails when applied\\nto subjects that deviate from the distribution with which it is trained on. In\\nthis work, we aim to train networks capable of automatically segmenting fetal\\nbrain MRIs with a wide range of domain shifts pertaining to differences in\\nsubject physiology and acquisition environments, in particular shape-based\\ndifferences commonly observed in pathological cases. We introduce a novel\\ndata-driven train-time sampling strategy that seeks to fully exploit the\\ndiversity of a given training dataset to enhance the domain generalizability of\\nthe trained networks. We adapted our sampler, together with other existing data\\naugmentation techniques, to the SynthSeg framework, a generator that utilizes\\ndomain randomization to generate diverse training data, and ran thorough\\nexperimentations and ablation studies on a wide range of training/testing data\\nto test the validity of the approaches. Our networks achieved notable\\nimprovements in the segmentation quality on testing subjects with intense\\nanatomical abnormalities (p < 1e-4), though at the cost of a slighter decrease\\nin performance in cases with fewer abnormalities. Our work also lays the\\nfoundation for future works on creating and adapting data-driven sampling\\nstrategies for other training pipelines.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.CV\", \"published\": \"2025-04-14T14:08:26Z\"}"}
