{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20392v1\", \"title\": \"Pair-Instability Gap Black Holes in Population III Star Clusters:\\n  Pathways, Dynamics, and Gravitational Wave Implications\", \"summary\": \"The detection of the gravitational wave (GW) event GW190521 raises questions\\nabout the formation of black holes within the pair-instability mass gap\\n(PIBHs). We propose that Population III (Pop III) star clusters significantly\\ncontribute to events similar to GW190521. We perform $N$-body simulations and\\nfind that PIBHs can form from stellar collisions or binary black hole (BBH)\\nmergers, with the latter accounting for 90\\\\% of the contributions. Due to GW\\nrecoil during BBH mergers, approximately 10-50% of PIBHs formed via BBH mergers\\nescape from clusters, depending on black hole spins and cluster escape\\nvelocities. The remaining PIBHs can participate in secondary and multiple BBH\\nformation events, contributing to GW events. Assuming Pop III stars form in\\nmassive clusters (initially 100,000 $M_\\\\odot$) with a top-heavy initial mass\\nfunction, the average merger rates for GW events involving PIBHs with 0% and\\n100% primordial binaries are $0.005$ and $0.017$ $\\\\text{yr}^{-1}\\n\\\\text{Gpc}^{-3}$, respectively, with maximum values of $0.030$ and $0.106$\\n$\\\\text{yr}^{-1} \\\\text{Gpc}^{-3}$. If Pop III stars form in low-mass clusters\\n(initial mass of $1000M_\\\\odot$ and $10000 M_\\\\odot$), the merger rate is\\ncomparable with a 100% primordial binary fraction but significantly lower\\nwithout primordial binaries. We also calculate the characteristic strains of\\nthe GW events in our simulations and find that about 43.4% (LISA) 97.8% (Taiji)\\nand 66.4% (Tianqin) of these events could potentially be detected by\\nspace-borne detectors, including LISA, Taiji, and TianQin. The next-generation\\nGW detectors such as DECIGO, ET, and CE can nearly cover all these signals.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE,astro-ph.GA\", \"published\": \"2025-04-29T03:26:25Z\"}"}
