{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16633v1\", \"title\": \"Interactions of mechanical rarefaction solitary waves\", \"summary\": \"Interactions between solitary waves have been pivotal to understanding\\nnonlinear phenomena across various disciplines. The dynamics of rarefaction\\nsolitary waves holds great potential, yet their fundamental characteristics and\\ninteractions remain only partially understood through experimental means in\\nmechanical metamaterials. Previous studies highlighted their existence and\\nproposed applications, such as waveguides, impact mitigation, and energy\\nharvesting. Challenges, including energy dissipation and a lack of precise\\nmeasurement techniques, have hindered deeper exploration, most notably of\\nsolitonic collisions. In this work, we provide a definitive platform for\\nexamining pure rarefaction solitons propagating through a strain-softening\\nmechanical lattice, addressing these challenges. Employing a theoretical\\nframework based on the Boussinesq approximation and multiple-scale analysis, we\\npredict soliton behavior, including phase shifts resulting from head-on\\ncollisions. These theoretical insights are corroborated through numerical\\nsimulations and systematic experiments designed to generate and measure pure\\nrarefaction solitons with high precision. Both symmetric and asymmetric\\ncollisions are examined, revealing practically elastic interaction behaviors\\nand amplitude-dependent phase shifts. Furthermore, collision dynamics, such as\\nspeed and phase shifts during rarefaction soliton collisions, from the\\nexperimental results show agreement with theoretical and numerical models.\\nThese results validate our experimental platform and findings, underscoring the\\npotential of mechanical rarefaction solitons as robust, controllable wave\\npackets. This suggests a robust paradigm for exploring nonlinear wave\\ninteractions in mechanical systems, opening new application avenues in\\nmechanical metamaterials, such as wave-based computing and advanced signal\\nprocessing.\", \"main_category\": \"nlin.PS\", \"categories\": \"nlin.PS\", \"published\": \"2025-04-23T11:49:30Z\"}"}
