{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02368v1\", \"title\": \"Electrical conductivities and low frequency opacities in the warm dense\\n  matter regime\", \"summary\": \"In this article, we examine different approaches for calculating low\\nfrequency opacities in the warm dense matter regime. The relevance of the\\naverage-atom approximation and of different models for calculating opacities,\\nsuch as the Ziman or Ziman-Evans models is discussed and the results compared\\nto \\\\textit{ab initio} simulations. We begin by recalling the derivation of the\\nZiman-Evans resistivity from Kubo's linear response theory, using the local\\napproximation to the solutions of the Lippmann-Schwinger equation. With the\\nhelp of this approximation, we explicitly introduce an ionic structure factor\\ninto the Ziman formula, without resorting to the Born approximation. Both\\napproaches involve the calculation of scattering phase shifts, which we\\nintegrate from Calogero equation with an adaptive step numerical scheme based\\non a Runge-Kutta-Merson solver. We show that if the atomic number $Z$ is not\\ntoo large, integrating the phase shifts in this way is more time-efficient than\\nusing a classical Numerov-type scheme to solve the radial Schr\\\\\\\"odinger\\nequation. Various approximations are explored for phase shifts to further\\nimprove computation time. For the Born approximation, we show that using Born\\nphase shifts directly in the scattering cross-section gives more accurate\\nresults than with the integral formula based on the Fourier transform of the\\nelectron-ion potential. We also compare an analytical formula based on a Yukawa\\nfit of the electron-ion potential to a numerical integration. The average-atom\\nresults are compared with DFT-based molecular dynamics simulations for aluminum\\nin the dilute regime and for copper, aluminum and gold at solid density and\\ndifferent temperatures.\", \"main_category\": \"physics.plasm-ph\", \"categories\": \"physics.plasm-ph\", \"published\": \"2025-04-03T08:00:17Z\"}"}
