{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21650v1\", \"title\": \"HoloTime: Taming Video Diffusion Models for Panoramic 4D Scene\\n  Generation\", \"summary\": \"The rapid advancement of diffusion models holds the promise of\\nrevolutionizing the application of VR and AR technologies, which typically\\nrequire scene-level 4D assets for user experience. Nonetheless, existing\\ndiffusion models predominantly concentrate on modeling static 3D scenes or\\nobject-level dynamics, constraining their capacity to provide truly immersive\\nexperiences. To address this issue, we propose HoloTime, a framework that\\nintegrates video diffusion models to generate panoramic videos from a single\\nprompt or reference image, along with a 360-degree 4D scene reconstruction\\nmethod that seamlessly transforms the generated panoramic video into 4D assets,\\nenabling a fully immersive 4D experience for users. Specifically, to tame video\\ndiffusion models for generating high-fidelity panoramic videos, we introduce\\nthe 360World dataset, the first comprehensive collection of panoramic videos\\nsuitable for downstream 4D scene reconstruction tasks. With this curated\\ndataset, we propose Panoramic Animator, a two-stage image-to-video diffusion\\nmodel that can convert panoramic images into high-quality panoramic videos.\\nFollowing this, we present Panoramic Space-Time Reconstruction, which leverages\\na space-time depth estimation method to transform the generated panoramic\\nvideos into 4D point clouds, enabling the optimization of a holistic 4D\\nGaussian Splatting representation to reconstruct spatially and temporally\\nconsistent 4D scenes. To validate the efficacy of our method, we conducted a\\ncomparative analysis with existing approaches, revealing its superiority in\\nboth panoramic video generation and 4D scene reconstruction. This demonstrates\\nour method's capability to create more engaging and realistic immersive\\nenvironments, thereby enhancing user experiences in VR and AR applications.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-30T13:55:28Z\"}"}
