{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14833v1\", \"title\": \"IoT-AMLHP: Aligned Multimodal Learning of Header-Payload Representations\\n  for Resource-Efficient Malicious IoT Traffic Classification\", \"summary\": \"Traffic classification is crucial for securing Internet of Things (IoT)\\nnetworks. Deep learning-based methods can autonomously extract latent patterns\\nfrom massive network traffic, demonstrating significant potential for IoT\\ntraffic classification tasks. However, the limited computational and spatial\\nresources of IoT devices pose challenges for deploying more complex deep\\nlearning models. Existing methods rely heavily on either flow-level features or\\nraw packet byte features. Flow-level features often require inspecting entire\\nor most of the traffic flow, leading to excessive resource consumption, while\\nraw packet byte features fail to distinguish between headers and payloads,\\noverlooking semantic differences and introducing noise from feature\\nmisalignment. Therefore, this paper proposes IoT-AMLHP, an aligned multimodal\\nlearning framework for resource-efficient malicious IoT traffic classification.\\nFirstly, the framework constructs a packet-wise header-payload representation\\nby parsing packet headers and payload bytes, resulting in an aligned and\\nstandardized multimodal traffic representation that enhances the\\ncharacterization of heterogeneous IoT traffic. Subsequently, the traffic\\nrepresentation is fed into a resource-efficient neural network comprising a\\nmultimodal feature extraction module and a multimodal fusion module. The\\nextraction module employs efficient depthwise separable convolutions to capture\\nmulti-scale features from different modalities while maintaining a lightweight\\narchitecture. The fusion module adaptively captures complementary features from\\ndifferent modalities and effectively fuses multimodal features.\", \"main_category\": \"cs.NI\", \"categories\": \"cs.NI,cs.CR\", \"published\": \"2025-04-21T03:24:14Z\"}"}
