{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10853v1\", \"title\": \"PT-Mark: Invisible Watermarking for Text-to-image Diffusion Models via\\n  Semantic-aware Pivotal Tuning\", \"summary\": \"Watermarking for diffusion images has drawn considerable attention due to the\\nwidespread use of text-to-image diffusion models and the increasing need for\\ntheir copyright protection. Recently, advanced watermarking techniques, such as\\nTree Ring, integrate watermarks by embedding traceable patterns (e.g., Rings)\\ninto the latent distribution during the diffusion process. Such methods disrupt\\nthe original semantics of the generated images due to the inevitable\\ndistribution shift caused by the watermarks, thereby limiting their\\npracticality, particularly in digital art creation. In this work, we present\\nSemantic-aware Pivotal Tuning Watermarks (PT-Mark), a novel invisible\\nwatermarking method that preserves both the semantics of diffusion images and\\nthe traceability of the watermark. PT-Mark preserves the original semantics of\\nthe watermarked image by gradually aligning the generation trajectory with the\\noriginal (pivotal) trajectory while maintaining the traceable watermarks during\\nwhole diffusion denoising process. To achieve this, we first compute the\\nsalient regions of the watermark at each diffusion denoising step as a spatial\\nprior to identify areas that can be aligned without disrupting the watermark\\npattern. Guided by the region, we then introduce an additional pivotal tuning\\nbranch that optimizes the text embedding to align the semantics while\\npreserving the watermarks. Extensive evaluations demonstrate that PT-Mark can\\npreserve the original semantics of the diffusion images while integrating\\nrobust watermarks. It achieves a 10% improvement in the performance of semantic\\npreservation (i.e., SSIM, PSNR, and LPIPS) compared to state-of-the-art\\nwatermarking methods, while also showing comparable robustness against\\nreal-world perturbations and four times greater efficiency.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR\", \"published\": \"2025-04-15T04:25:57Z\"}"}
