{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04161v1\", \"title\": \"Optimization of Infectious Disease Intervention Measures Based on\\n  Reinforcement Learning -- Empirical analysis based on UK COVID-19 epidemic\\n  data\", \"summary\": \"Globally, the outbreaks of infectious diseases have exerted an extremely\\nprofound and severe influence on health security and the economy. During the\\ncritical phases of epidemics, devising effective intervention measures poses a\\nsignificant challenge to both the academic and practical arenas. There is\\nnumerous research based on reinforcement learning to optimize intervention\\nmeasures of infectious diseases. Nevertheless, most of these efforts have been\\nconfined within the differential equation based on infectious disease models.\\nAlthough a limited number of studies have incorporated reinforcement learning\\nmethodologies into individual-based infectious disease models, the models\\nemployed therein have entailed simplifications and limitations, rendering it\\nincapable of modeling the complexity and dynamics inherent in infectious\\ndisease transmission. We establish a decision-making framework based on an\\nindividual agent-based transmission model, utilizing reinforcement learning to\\ncontinuously explore and develop a strategy function. The framework's validity\\nis verified through both experimental and theoretical approaches. Covasim, a\\ndetailed and widely used agent-based disease transmission model, was modified\\nto support reinforcement learning research. We conduct an exhaustive\\nexploration of the application efficacy of multiple algorithms across diverse\\naction spaces. Furthermore, we conduct an innovative preliminary theoretical\\nanalysis concerning the issue of \\\"time coverage\\\". The results of the experiment\\nrobustly validate the effectiveness and feasibility of the methodological\\nframework of this study. The coping strategies gleaned therefrom prove highly\\nefficacious in suppressing the expansion of the epidemic scale and safeguarding\\nthe stability of the economic system, thereby providing crucial reference\\nperspectives for the formulation of global public health security strategies.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.CY,cs.MA,physics.comp-ph\", \"published\": \"2025-05-07T06:23:26Z\"}"}
