{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12767v1\", \"title\": \"Out of Sight Out of Mind, Out of Sight Out of Mind: Measuring Bias in\\n  Language Models Against Overlooked Marginalized Groups in Regional Contexts\", \"summary\": \"We know that language models (LMs) form biases and stereotypes of minorities,\\nleading to unfair treatments of members of these groups, thanks to research\\nmainly in the US and the broader English-speaking world. As the negative\\nbehavior of these models has severe consequences for society and individuals,\\nindustry and academia are actively developing methods to reduce the bias in\\nLMs. However, there are many under-represented groups and languages that have\\nbeen overlooked so far. This includes marginalized groups that are specific to\\nindividual countries and regions in the English speaking and Western world, but\\ncrucially also almost all marginalized groups in the rest of the world. The UN\\nestimates, that between 600 million to 1.2 billion people worldwide are members\\nof marginalized groups and in need for special protection. If we want to\\ndevelop inclusive LMs that work for everyone, we have to broaden our\\nunderstanding to include overlooked marginalized groups and low-resource\\nlanguages and dialects.\\n  In this work, we contribute to this effort with the first study investigating\\noffensive stereotyping bias in 23 LMs for 270 marginalized groups from Egypt,\\nthe remaining 21 Arab countries, Germany, the UK, and the US. Additionally, we\\ninvestigate the impact of low-resource languages and dialects on the study of\\nbias in LMs, demonstrating the limitations of current bias metrics, as we\\nmeasure significantly higher bias when using the Egyptian Arabic dialect versus\\nModern Standard Arabic. Our results show, LMs indeed show higher bias against\\nmany marginalized groups in comparison to dominant groups. However, this is not\\nthe case for Arabic LMs, where the bias is high against both marginalized and\\ndominant groups in relation to religion and ethnicity.\\n  Our results also show higher intersectional bias against Non-binary, LGBTQIA+\\nand Black women.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-04-17T09:05:50Z\"}"}
