{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11325v1\", \"title\": \"Crystal nucleation and growth in high-entropy alloys revealed by atomic\\n  electron tomography\", \"summary\": \"High-entropy alloys (HEAs) balance mixing entropy and intermetallic phase\\nformation enthalpy, creating a vast compositional space for structural and\\nfunctional materials (1-6). They exhibit exceptional strength-ductility\\ntrade-offs in metallurgy (4-10) and near-continuum adsorbate binding energies\\nin catalysis (11-16). A deep understanding of crystal nucleation and growth in\\nHEAs is essential for controlling their formation and optimizing their\\nstructural and functional properties. However, atomic-scale nucleation in HEAs\\nchallenges traditional theories based on one or two principal elements (17-23).\\nThe intricate interplay of structural and chemical orders among multiple\\nprincipal elements further obscures our understanding of nucleation pathways\\n(5,24-27). Due to the lack of direct three-dimensional (3D) atomic-scale\\nobservations, previous studies have relied on simulations and indirect\\nmeasurements (28-32), leaving HEA nucleation and growth fundamentally elusive.\\nHere, we advance atomic electron tomography (33,34) to resolve the 3D atomic\\nstructure and chemical composition of 7,662 HEA and 498 medium-entropy alloy\\nnuclei at different nucleation stages. We observe local structural order that\\ndecreases from core to boundary, correlating with local chemical order. As\\nnuclei grow, structural order improves. At later stages, most nuclei coalesce\\nwithout misorientation, while some form coherent twin boundaries. To explain\\nthese experimental observations, we propose the gradient nucleation pathways\\nmodel, in which the nucleation energy barrier progressively increases through\\nmultiple evolving intermediate states. We expect these findings to not only\\nprovide fundamental insights into crystal nucleation and growth in HEAs, but\\nalso offer a general framework for understanding nucleation mechanisms in other\\nmaterials.\", \"main_category\": \"cond-mat.mtrl-sci\", \"categories\": \"cond-mat.mtrl-sci,cond-mat.dis-nn,cond-mat.soft\", \"published\": \"2025-04-15T16:02:40Z\"}"}
