{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15644v1\", \"title\": \"On the Klein-Gordon bosonic fields in the Bonnor-Melvin spacetime with a\\n  cosmological constant in rainbow gravity: Bonnor-Melvin Domain Walls\", \"summary\": \"We investigate the effect of rainbow gravity on Klein-Gordon (KG) bosons in\\nthe background of the magnetized Bonnor-Melvin (BM) spacetime with a\\ncosmological constant. We first show that the very existence of the sinusoidal\\nterm \\\\(\\\\sin^2(\\\\sqrt{2\\\\Lambda}r)\\\\), in the BM space-time metric, suggests that\\n\\\\(\\\\sin^2(\\\\sqrt{2\\\\Lambda}r) \\\\in [0,1],\\\\) which consequently restricts the range\\nof the radial coordinate \\\\(r\\\\) to \\\\(r \\\\in [0,\\\\pi/\\\\sqrt{2\\\\Lambda}]\\\\). Moreover,\\nwe show that at \\\\(r = 0\\\\) and \\\\(r = \\\\pi/\\\\sqrt{2\\\\Lambda}\\\\), the magnetized\\nBM-spacetime introduces domain walls (infinitely impenetrable hard walls)\\nwithin which the KG bosonic fields are allowed to move. Interestingly, the\\nmagnetized BM-spacetime introduces not only two domain walls but a series of\\ndomain walls. However, we focus on the range \\\\(r \\\\in [0,\\\\pi/\\\\sqrt{2\\\\Lambda}]\\\\).\\nA quantum particle remains indefinitely confined within this range and cannot\\nbe found elsewhere. Based on these findings, we report the effects of rainbow\\ngravity on KG bosonic fields in BM-spacetime. We use three pairs of rainbow\\nfunctions: \\\\( f(\\\\chi) = \\\\frac{1}{1 - \\\\tilde{\\\\beta} |E|}, \\\\, h(\\\\chi) = 1 \\\\); \\\\(\\nf(\\\\chi) = (1 - \\\\tilde{\\\\beta} |E|)^{-1}, \\\\, h(\\\\chi) = 1 \\\\); and \\\\( f(\\\\chi) = 1,\\n\\\\, h(\\\\chi) = \\\\sqrt{1 - \\\\tilde{\\\\beta} |E|^\\\\upsilon} \\\\), with \\\\(\\\\upsilon = 1,2\\\\).\\nHere, \\\\(\\\\chi = |E| / E_p\\\\), \\\\(\\\\tilde{\\\\beta} = \\\\beta / E_p\\\\), and \\\\(\\\\beta\\\\) is\\nthe rainbow parameter. We found that while the pairs \\\\((f,h)\\\\) in the first and\\nthird cases fully comply with the theory of rainbow gravity and ensure that\\n\\\\(E_p\\\\) is the maximum possible energy for particles and antiparticles, the\\nsecond pair does not show any response to the effects of rainbow gravity. We\\nshow that the corresponding bosonic states can form magnetized, spinning\\nvortices in monolayer materials, and these vortices can be driven by adjusting\\nan out-of-plane aligned magnetic field.\", \"main_category\": \"gr-qc\", \"categories\": \"gr-qc,nucl-th\", \"published\": \"2025-04-22T07:03:05Z\"}"}
