{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11000v1\", \"title\": \"Why am I seeing this? Towards recognizing social media recommender\\n  systems with missing recommendations\", \"summary\": \"Social media plays a crucial role in shaping society, often amplifying\\npolarization and spreading misinformation. These effects stem from complex\\ndynamics involving user interactions, individual traits, and recommender\\nalgorithms driving content selection. Recommender systems, which significantly\\nshape the content users see and decisions they make, offer an opportunity for\\nintervention and regulation. However, assessing their impact is challenging due\\nto algorithmic opacity and limited data availability. To effectively model user\\ndecision-making, it is crucial to recognize the recommender system adopted by\\nthe platform.\\n  This work introduces a method for Automatic Recommender Recognition using\\nGraph Neural Networks (GNNs), based solely on network structure and observed\\nbehavior. To infer the hidden recommender, we first train a Recommender Neutral\\nUser model (RNU) using a GNN and an adapted hindsight academic network\\nrecommender, aiming to reduce reliance on the actual recommender in the data.\\nWe then generate several Recommender Hypothesis-specific Synthetic Datasets\\n(RHSD) by combining the RNU with different known recommenders, producing ground\\ntruths for testing. Finally, we train Recommender Hypothesis-specific User\\nmodels (RHU) under various hypotheses and compare each candidate with the\\noriginal used to generate the RHSD.\\n  Our approach enables accurate detection of hidden recommenders and their\\ninfluence on user behavior. Unlike audit-based methods, it captures system\\nbehavior directly, without ad hoc experiments that often fail to reflect real\\nplatforms. This study provides insights into how recommenders shape behavior,\\naiding efforts to reduce polarization and misinformation.\", \"main_category\": \"cs.IR\", \"categories\": \"cs.IR,cs.SI\", \"published\": \"2025-04-15T09:16:17Z\"}"}
