{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05007v1\", \"title\": \"Driving with Context: Online Map Matching for Complex Roads Using Lane\\n  Markings and Scenario Recognition\", \"summary\": \"Accurate online map matching is fundamental to vehicle navigation and the\\nactivation of intelligent driving functions. Current online map matching\\nmethods are prone to errors in complex road networks, especially in multilevel\\nroad area. To address this challenge, we propose an online Standard Definition\\n(SD) map matching method by constructing a Hidden Markov Model (HMM) with\\nmultiple probability factors. Our proposed method can achieve accurate map\\nmatching even in complex road networks by carefully leveraging lane markings\\nand scenario recognition in the designing of the probability factors. First,\\nthe lane markings are generated by a multi-lane tracking method and associated\\nwith the SD map using HMM to build an enriched SD map. In areas covered by the\\nenriched SD map, the vehicle can re-localize itself by performing Iterative\\nClosest Point (ICP) registration for the lane markings. Then, the probability\\nfactor accounting for the lane marking detection can be obtained using the\\nassociation probability between adjacent lanes and roads. Second, the driving\\nscenario recognition model is applied to generate the emission probability\\nfactor of scenario recognition, which improves the performance of map matching\\non elevated roads and ordinary urban roads underneath them. We validate our\\nmethod through extensive road tests in Europe and China, and the experimental\\nresults show that our proposed method effectively improves the online map\\nmatching accuracy as compared to other existing methods, especially in\\nmultilevel road area. Specifically, the experiments show that our proposed\\nmethod achieves $F_1$ scores of 98.04% and 94.60% on the Zenseact Open Dataset\\nand test data of multilevel road areas in Shanghai respectively, significantly\\noutperforming benchmark methods. The implementation is available at\\nhttps://github.com/TRV-Lab/LMSR-OMM.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-08T07:24:52Z\"}"}
