{"value":"{\"aid\": \"http://arxiv.org/abs/2505.03292v1\", \"title\": \"Understanding Decoherence of the Boron Vacancy Center in Hexagonal Boron\\n  Nitride\", \"summary\": \"Hexagonal boron nitride (hBN) has emerged as a significant material for\\nquantum sensing, particularly due to its ability to host spin active defects,\\nsuch as the negatively charged boron vacancy (V$_\\\\mathrm{B}^-$ center). The\\noptical addressability of the V$_\\\\mathrm{B}^-$ center and hBN's 2D structure\\nenable high spatial resolution and integration into various platforms. However,\\ndecoherence due to the strong magnetic noise in hBN imposes fundamental\\nlimitations on the sensitivity of V$_\\\\mathrm{B}^-$ center-based applications.\\nUnderstanding the phenomena behind decoherence and identifying parameter\\nsettings that provide the highest performance are essential for advancing\\nV$_\\\\mathrm{B}^-$ sensors. This study employs state-of-the-art computational\\nmethods to investigate the decoherence of the V$_\\\\mathrm{B}^-$ center in\\nhexagonal boron nitride across a wide range of magnetic field values from 0 T\\nup to 3 T. The provided in-depth numerical and analytical analysis reveals an\\nintricate interplay of various decoherence mechanisms. This study identifies\\nfive distinct magnetic field regions governed by different types of magnetic\\ninteractions with and within the abundant nuclear spin bath. In addition to\\nmagnetic field, the effects of zero-field splitting, nuclear polarization, and\\ndifferent hyperfine coupling terms are studied, representing an important step\\nforward in utilizing V$_\\\\mathrm{B}^-$ ensembles in sensing. In particular, this\\nstudy proposes operation in the moderate $180-350$ mT magnetic field range in\\nchemically pure h$^{11}$B$^{15}$N samples, where the coherence time can reach\\n$1-20$ $\\\\mu$s, significantly exceeding the $\\\\mathcal{O}( 100~\\\\text{ns})$\\nlow-field $T_2$ values.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cond-mat.mtrl-sci\", \"published\": \"2025-05-06T08:20:40Z\"}"}
