{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14930v1\", \"title\": \"Kernel-learning parameter prediction and evaluation in algebraic\\n  multigrid method for several PDEs\", \"summary\": \"This paper explores the application of kernel learning methods for parameter\\nprediction and evaluation in the Algebraic Multigrid Method (AMG), focusing on\\nseveral Partial Differential Equation (PDE) problems. AMG is an efficient\\niterative solver for large-scale sparse linear systems, particularly those\\nderived from elliptic and parabolic PDE discretizations. However, its\\nperformance heavily relies on numerous parameters, which are often set\\nempirically and are highly sensitive to AMG's effectiveness. Traditional\\nparameter optimization methods are either computationally expensive or lack\\ntheoretical support. To address this, we propose a Gaussian Process Regression\\n(GPR)-based strategy to optimize AMG parameters and introduce evaluation\\nmetrics to assess their effectiveness. Trained on small-scale datasets, GPR\\npredicts nearly optimal parameters, bypassing the time-consuming parameter\\nsweeping process. We also use kernel learning techniques to build a kernel\\nfunction library and determine the optimal kernel function through linear\\ncombination, enhancing prediction accuracy. In numerical experiments, we tested\\ntypical PDEs such as the constant-coefficient Poisson equation,\\nvariable-coefficient Poisson equation, diffusion equation, and Helmholtz\\nequation. Results show that GPR-predicted parameters match grid search results\\nin iteration counts while significantly reducing computational time. A\\ncomprehensive analysis using metrics like mean squared error, prediction\\ninterval coverage, and Bayesian information criterion confirms GPR's efficiency\\nand reliability. These findings validate GPR's effectiveness in AMG parameter\\noptimization and provide theoretical support for AMG's practical application.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA\", \"published\": \"2025-04-21T07:50:51Z\"}"}
