{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00670v1\", \"title\": \"TumorTwin: A python framework for patient-specific digital twins in\\n  oncology\", \"summary\": \"Background: Advances in the theory and methods of computational oncology have\\nenabled accurate characterization and prediction of tumor growth and treatment\\nresponse on a patient-specific basis. This capability can be integrated into a\\ndigital twin framework in which bi-directional data-flow between the physical\\ntumor and the digital tumor facilitate dynamic model re-calibration,\\nuncertainty quantification, and clinical decision-support via recommendation of\\noptimal therapeutic interventions. However, many digital twin frameworks rely\\non bespoke implementations tailored to each disease site, modeling choice, and\\nalgorithmic implementation.\\n  Findings: We present TumorTwin, a modular software framework for\\ninitializing, updating, and leveraging patient-specific cancer tumor digital\\ntwins. TumorTwin is publicly available as a Python package, with associated\\ndocumentation, datasets, and tutorials. Novel contributions include the\\ndevelopment of a patient-data structure adaptable to different disease sites, a\\nmodular architecture to enable the composition of different data, model,\\nsolver, and optimization objects, and CPU- or GPU-parallelized implementations\\nof forward model solves and gradient computations. We demonstrate the\\nfunctionality of TumorTwin via an in silico dataset of high-grade glioma growth\\nand response to radiation therapy.\\n  Conclusions: The TumorTwin framework enables rapid prototyping and testing of\\nimage-guided oncology digital twins. This allows researchers to systematically\\ninvestigate different models, algorithms, disease sites, or treatment decisions\\nwhile leveraging robust numerical and computational infrastructure.\", \"main_category\": \"physics.med-ph\", \"categories\": \"physics.med-ph,cs.MS\", \"published\": \"2025-05-01T17:20:20Z\"}"}
