{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04235v1\", \"title\": \"Decommissioning and Post-Irradiation Examination of the LHC Beam Dumps\", \"summary\": \"The LHC beam dumps are responsible for the safe absorption of the Large\\nHadron Collider (LHC) particle beams. In 2018, the two 6.4-tonne beam dumps\\nthat had been in operation since the LHC's startup in 2008 were removed and\\nreplaced with upgraded versions. Endoscopic inspections of these beam dumps and\\nexperimental high-intensity proton-beam irradiation of material samples raised\\nconcerns about the structural integrity of the carbon-based materials in their\\ncores. It was therefore decided to undertake an accelerated project of\\ndismantling and post-irradiation examination of the removed dumps as part of a\\nwider program of work to ensure the safe operation of the LHC beam dumps in the\\ncoming years. This paper describes the decommissioning process for the two beam\\ndumps carried out at CERN between 2021 and 2023, covering the preparatory\\nstudies, practical challenges encountered, and solutions implemented. It\\ndetails the establishment of an operational framework, including the\\npreparation of the working environment, the development of a method for cutting\\nthe irradiated 12-mm-thick duplex stainless-steel vessel, and the cut\\nsequencing. Additionally, the paper presents the findings derived from the\\npost-irradiation examination of the different carbon-based core materials\\nsubjected to deposited energy densities up to 1.5 kJ/g. The extruded graphite\\nplates within the vessel exhibited a cracking pattern, which was likely due to\\nthe dynamic response of the device upon beam impact, and their retaining rings\\nwere found to be displaced. Despite minor signs of surface deterioration, the\\nexpanded graphite sheets were intact, and the isostatic graphite blocks showed\\nno evidence of material degradation.\", \"main_category\": \"physics.acc-ph\", \"categories\": \"physics.acc-ph\", \"published\": \"2025-05-07T08:39:40Z\"}"}
