{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11074v1\", \"title\": \"Dynamical errors in machine learning forecasts\", \"summary\": \"In machine learning forecasting, standard error metrics such as mean absolute\\nerror (MAE) and mean squared error (MSE) quantify discrepancies between\\npredictions and target values. However, these metrics do not directly evaluate\\nthe physical and/or dynamical consistency of forecasts, an increasingly\\ncritical concern in scientific and engineering applications.\\n  Indeed, a fundamental yet often overlooked question is whether machine\\nlearning forecasts preserve the dynamical behavior of the underlying system.\\nAddressing this issue is essential for assessing the fidelity of machine\\nlearning models and identifying potential failure modes, particularly in\\napplications where maintaining correct dynamical behavior is crucial.\\n  In this work, we investigate the relationship between standard forecasting\\nerror metrics, such as MAE and MSE, and the dynamical properties of the\\nunderlying system. To achieve this goal, we use two recently developed\\ndynamical indices: the instantaneous dimension ($d$), and the inverse\\npersistence ($\\\\theta$). Our results indicate that larger forecast errors --\\ne.g., higher MSE -- tend to occur in states with higher $d$ (higher complexity)\\nand higher $\\\\theta$ (lower persistence). To further assess dynamical\\nconsistency, we propose error metrics based on the dynamical indices that\\nmeasure the discrepancy of the forecasted $d$ and $\\\\theta$ versus their correct\\nvalues. Leveraging these dynamical indices-based metrics, we analyze direct and\\nrecursive forecasting strategies for three canonical datasets -- Lorenz,\\nKuramoto-Sivashinsky equation, and Kolmogorov flow -- as well as a real-world\\nweather forecasting task. Our findings reveal substantial distortions in\\ndynamical properties in ML forecasts, especially for long forecast lead times\\nor long recursive simulations, providing complementary information on ML\\nforecast fidelity that can be used to improve ML models.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI,physics.comp-ph\", \"published\": \"2025-04-15T11:16:13Z\"}"}
