{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04567v1\", \"title\": \"Flexing RISC-V Instruction Subset Processors (RISPs) to Extreme Edge\", \"summary\": \"This paper presents a methodology for automatically generating processors\\nthat support a subset of the RISC-V instruction set for a new class of\\napplications at Extreme Edge. The electronics used in extreme edge applications\\nmust be power-efficient, but also provide additional qualities, such as low\\ncost, conformability, comfort and sustainability. Flexible electronics, rather\\nthan silicon-based electronics, will be capable of meeting these qualities. For\\nthis purpose, we propose a methodology to generate RISPs (RISC-V instruction\\nsubset processors) customised to extreme edge applications and to implement\\nthem as flexible integrated circuits (FlexICs). The methodology is unique in\\nthe sense that verification is an integral part of design. The RISP methodology\\ntreats each instruction in the ISA as a discrete, fully functional,\\npre-verified hardware block. It automatically builds a custom processor by\\nstitching together the hardware blocks of the instructions required by an\\napplication or a set of applications in a specific domain. This approach\\nsignificantly reduces the processor verification and its time-to-market. We\\ngenerate RISPs using this methodology for three extreme edge applications, and\\nembedded applications from the Embench benchmark suite, synthesize them as\\nFlexICs, and compare their power, performance and area to the baselines. Our\\nresults show that RISPs generated using this methodology achieve, on average,\\n30\\\\% reductions in power and area compared to a RISC-V processor supporting the\\nfull instruction set when synthesized, and are nearly 30 times more energy\\nefficient with respect to Serv - the world's smallest 32-bit RISC-V processor.\\nIn addition, the full physical implementation of RISPs show up to 21% and 26%\\nless area and power than Serv.\", \"main_category\": \"cs.AR\", \"categories\": \"cs.AR,cs.ET\", \"published\": \"2025-05-07T17:03:06Z\"}"}
