{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20419v1\", \"title\": \"Plant Disease Detection through Multimodal Large Language Models and\\n  Convolutional Neural Networks\", \"summary\": \"Automation in agriculture plays a vital role in addressing challenges related\\nto crop monitoring and disease management, particularly through early detection\\nsystems. This study investigates the effectiveness of combining multimodal\\nLarge Language Models (LLMs), specifically GPT-4o, with Convolutional Neural\\nNetworks (CNNs) for automated plant disease classification using leaf imagery.\\nLeveraging the PlantVillage dataset, we systematically evaluate model\\nperformance across zero-shot, few-shot, and progressive fine-tuning scenarios.\\nA comparative analysis between GPT-4o and the widely used ResNet-50 model was\\nconducted across three resolutions (100, 150, and 256 pixels) and two plant\\nspecies (apple and corn). Results indicate that fine-tuned GPT-4o models\\nachieved slightly better performance compared to the performance of ResNet-50,\\nachieving up to 98.12% classification accuracy on apple leaf images, compared\\nto 96.88% achieved by ResNet-50, with improved generalization and near-zero\\ntraining loss. However, zero-shot performance of GPT-4o was significantly\\nlower, underscoring the need for minimal training. Additional evaluations on\\ncross-resolution and cross-plant generalization revealed the models'\\nadaptability and limitations when applied to new domains. The findings\\nhighlight the promise of integrating multimodal LLMs into automated disease\\ndetection pipelines, enhancing the scalability and intelligence of precision\\nagriculture systems while reducing the dependence on large, labeled datasets\\nand high-resolution sensor infrastructure. Large Language Models, Vision\\nLanguage Models, LLMs and CNNs, Disease Detection with Vision Language Models,\\nVLMs\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-29T04:31:58Z\"}"}
