{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10011v1\", \"title\": \"KeyMPs: One-Shot Vision-Language Guided Motion Generation by Sequencing\\n  DMPs for Occlusion-Rich Tasks\", \"summary\": \"Dynamic Movement Primitives (DMPs) provide a flexible framework wherein\\nsmooth robotic motions are encoded into modular parameters. However, they face\\nchallenges in integrating multimodal inputs commonly used in robotics like\\nvision and language into their framework. To fully maximize DMPs' potential,\\nenabling them to handle multimodal inputs is essential. In addition, we also\\naim to extend DMPs' capability to handle object-focused tasks requiring\\none-shot complex motion generation, as observation occlusion could easily\\nhappen mid-execution in such tasks (e.g., knife occlusion in cake icing, hand\\nocclusion in dough kneading, etc.). A promising approach is to leverage\\nVision-Language Models (VLMs), which process multimodal data and can grasp\\nhigh-level concepts. However, they typically lack enough knowledge and\\ncapabilities to directly infer low-level motion details and instead only serve\\nas a bridge between high-level instructions and low-level control. To address\\nthis limitation, we propose Keyword Labeled Primitive Selection and Keypoint\\nPairs Generation Guided Movement Primitives (KeyMPs), a framework that combines\\nVLMs with sequencing of DMPs. KeyMPs use VLMs' high-level reasoning capability\\nto select a reference primitive through keyword labeled primitive selection and\\nVLMs' spatial awareness to generate spatial scaling parameters used for\\nsequencing DMPs by generalizing the overall motion through keypoint pairs\\ngeneration, which together enable one-shot vision-language guided motion\\ngeneration that aligns with the intent expressed in the multimodal input. We\\nvalidate our approach through an occlusion-rich manipulation task, specifically\\nobject cutting experiments in both simulated and real-world environments,\\ndemonstrating superior performance over other DMP-based methods that integrate\\nVLMs support.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-14T09:16:58Z\"}"}
