{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17692v1\", \"title\": \"User Profiles: The Achilles' Heel of Web Browsers\", \"summary\": \"Web browsers provide the security foundation for our online experiences.\\nSignificant research has been done into the security of browsers themselves,\\nbut relatively little investigation has been done into how they interact with\\nthe operating system or the file system. In this work, we provide the first\\nsystematic security study of browser profiles, the on-disk persistence layer of\\nbrowsers, used for storing everything from users' authentication cookies and\\nbrowser extensions to certificate trust decisions and device permissions. We\\nshow that, except for the Tor Browser, all modern browsers store sensitive data\\nin home directories with little to no integrity or confidentiality controls. We\\nshow that security measures like password and cookie encryption can be easily\\nbypassed. In addition, HTTPS can be sidestepped entirely by deploying malicious\\nroot certificates within users' browser profiles. The Public Key Infrastructure\\n(PKI), the backbone of the secure Web. HTTPS can be fully bypassed with the\\ndeployment of custom potentially malicious root certificates. More worryingly,\\nwe show how these powerful attacks can be fully mounted directly from web\\nbrowsers themselves, through the File System Access API, a recent feature added\\nby Chromium browsers that enables a website to directly manipulate a user's\\nfile system via JavaScript. In a series of case studies, we demonstrate how an\\nattacker can install malicious browser extensions, inject additional root\\ncertificates, hijack HTTPS traffic, and enable websites to access hardware\\ndevices like the camera and GPS. Based on our findings, we argue that\\nresearchers and browser vendors need to develop and deploy more secure\\nmechanisms for protecting users' browser data against file system attackers.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR\", \"published\": \"2025-04-24T16:01:48Z\"}"}
