{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14983v1\", \"title\": \"The Effect of Hydration and Dynamics on the Mass Density of Single\\n  Proteins\", \"summary\": \"The density of a protein molecule is a key property within a variety of\\nexperimental techniques. We present a computational method for determining\\nprotein mass density that explicitly incorporates hydration effects. Our\\napproach uses molecular dynamics simulations to quantify the volume of solvent\\nexcluded by a protein. Applied to a dataset of 260 soluble proteins, this\\nyields an average density of 1.296 g cm-3, notably lower than the widely cited\\nvalue of 1.35 g cm-3. Contrary to previous suggestions, we find no correlation\\nbetween protein density and molecular weight. We instead find correlations with\\nresidue composition, particularly with hydrophobic amino acid content. Using\\nthese correlations, we train a regressor capable of accurately predicting\\nprotein density from sequence-derived features alone. Examining the effect of\\nincorporating water molecules on the measured density, we find that water\\nmolecules buried in internal cavities have a negligible effect, whereas those\\nat the surface have a profound impact. Furthermore, by calculating the density\\nof a titin domain and of the Bovine Pancreatic Trypsin over molecular dynamics\\ntrajectories, we show that individual proteins can occupy states with close but\\ndistinguishable densities. Finally, we analyse the density of water in the\\nvicinity of proteins, showing that the first two hydration shells exhibit\\nhigher density than bulk water. When included in cumulative density\\ncalculations, these hydration layers contribute to a net increase in local\\nsolvent density. Overall, we find that proteins are less dense than previously\\nreported, which is offset by their ability to induce a higher density of water\\nin their vicinity.\", \"main_category\": \"physics.bio-ph\", \"categories\": \"physics.bio-ph\", \"published\": \"2025-04-21T09:23:05Z\"}"}
