{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19546v1\", \"title\": \"Crowd Detection Using Very-Fine-Resolution Satellite Imagery\", \"summary\": \"Accurate crowd detection (CD) is critical for public safety and historical\\npattern analysis, yet existing methods relying on ground and aerial imagery\\nsuffer from limited spatio-temporal coverage. The development of\\nvery-fine-resolution (VFR) satellite sensor imagery (e.g., ~0.3 m spatial\\nresolution) provides unprecedented opportunities for large-scale crowd activity\\nanalysis, but it has never been considered for this task. To address this gap,\\nwe proposed CrowdSat-Net, a novel point-based convolutional neural network,\\nwhich features two innovative components: Dual-Context Progressive Attention\\nNetwork (DCPAN) to improve feature representation of individuals by aggregating\\nscene context and local individual characteristics, and High-Frequency Guided\\nDeformable Upsampler (HFGDU) that recovers high-frequency information during\\nupsampling through frequency-domain guided deformable convolutions. To validate\\nthe effectiveness of CrowdSat-Net, we developed CrowdSat, the first VFR\\nsatellite imagery dataset designed specifically for CD tasks, comprising over\\n120k manually labeled individuals from multi-source satellite platforms\\n(Beijing-3N, Jilin-1 Gaofen-04A and Google Earth) across China. In the\\nexperiments, CrowdSat-Net was compared with five state-of-the-art point-based\\nCD methods (originally designed for ground or aerial imagery) using CrowdSat\\nand achieved the largest F1-score of 66.12% and Precision of 73.23%, surpassing\\nthe second-best method by 1.71% and 2.42%, respectively. Moreover, extensive\\nablation experiments validated the importance of the DCPAN and HFGDU modules.\\nFurthermore, cross-regional evaluation further demonstrated the spatial\\ngeneralizability of CrowdSat-Net. This research advances CD capability by\\nproviding both a newly developed network architecture for CD and a pioneering\\nbenchmark dataset to facilitate future CD development.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-28T07:51:26Z\"}"}
