{"value":"{\"aid\": \"http://arxiv.org/abs/2504.04954v1\", \"title\": \"GOTHAM: Graph Class Incremental Learning Framework under Weak\\n  Supervision\", \"summary\": \"Graphs are growing rapidly, along with the number of distinct label\\ncategories associated with them. Applications like e-commerce, healthcare,\\nrecommendation systems, and various social media platforms are rapidly moving\\ntowards graph representation of data due to their ability to capture both\\nstructural and attribute information. One crucial task in graph analysis is\\nnode classification, where unlabeled nodes are categorized into predefined\\nclasses. In practice, novel classes appear incrementally sometimes with just a\\nfew labels (seen classes) or even without any labels (unseen classes), either\\nbecause they are new or haven't been explored much. Traditional methods assume\\nabundant labeled data for training, which isn't always feasible. We investigate\\na broader objective: \\\\emph{Graph Class Incremental Learning under Weak\\nSupervision (GCL)}, addressing this challenge by meta-training on base classes\\nwith limited labeled instances. During the incremental streams, novel classes\\ncan have few-shot or zero-shot representation. Our proposed framework GOTHAM\\nefficiently accommodates these unlabeled nodes by finding the closest prototype\\nrepresentation, serving as class representatives in the attribute space. For\\nText-Attributed Graphs (TAGs), our framework additionally incorporates semantic\\ninformation to enhance the representation. By employing teacher-student\\nknowledge distillation to mitigate forgetting, GOTHAM achieves promising\\nresults across various tasks. Experiments on datasets such as Cora-ML, Amazon,\\nand OBGN-Arxiv showcase the effectiveness of our approach in handling evolving\\ngraph data under limited supervision. The repository is available here:\\n\\\\href{https://github.com/adityashahane10/GOTHAM--Graph-based-Class-Incremental-Learning-Framework-under-Weak-Supervision}{\\\\small\\n\\\\textcolor{blue}{Code}}\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI\", \"published\": \"2025-04-07T11:39:13Z\"}"}
