{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19649v1\", \"title\": \"Intelligent4DSE: Optimizing High-Level Synthesis Design Space\\n  Exploration with Graph Neural Networks and Large Language Models\", \"summary\": \"High-level synthesis (HLS) design space exploration (DSE) is an optimization\\nprocess in electronic design automation (EDA) that systematically explores\\nhigh-level design configurations to achieve Pareto-optimal hardware\\nimplementations balancing performance, area, and power (PPA). To optimize this\\nprocess, HLS prediction tasks often employ message-passing neural networks\\n(MPNNs), leveraging complex architectures to achieve high accuracy. These\\npredictors serve as evaluators in the DSE process, effectively bypassing the\\ntime-consuming estimations traditionally required by HLS tools. However,\\nexisting models often prioritize structural complexity and minimization of\\ntraining loss, overlooking task-specific characteristics. Additionally, while\\nevolutionary algorithms are widely used in DSE, they typically require\\nextensive domain-specific knowledge to design effective crossover and mutation\\noperators. To address these limitations, we propose CoGNNs-LLMEA, a framework\\nthat integrates a graph neural network with task-adaptive message passing and a\\nlarge language model-enhanced evolutionary algorithm. As a predictive model,\\nCoGNNs directly leverages intermediate representations generated from source\\ncode after compiler front-end processing, enabling prediction of quality of\\nresults (QoR) without invoking HLS tools. Due to its strong adaptability to\\ntasks, CoGNNs can be tuned to predict post-HLS and post-implementation\\noutcomes, effectively bridging the gap between high-level abstractions and\\nphysical implementation characteristics. CoGNNs achieves state-of-the-art\\nprediction accuracy in post-HLS QoR prediction, reducing mean prediction errors\\nby 2.8$\\\\times$ for latency and 3.4$\\\\times$ for resource utilization compared to\\nbaseline models.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AR\", \"published\": \"2025-04-28T10:08:56Z\"}"}
