{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16837v1\", \"title\": \"Approximating Optimal Labelings for Temporal Connectivity\", \"summary\": \"In a temporal graph the edge set dynamically changes over time according to a\\nset of time-labels associated with each edge that indicates at which time-steps\\nthe edge is available. Two vertices are connected if there is a path connecting\\nthem in which the edges are traversed in increasing order of their labels. We\\nstudy the problem of scheduling the availability time of the edges of a\\ntemporal graph in such a way that all pairs of vertices are connected within a\\ngiven maximum allowed time $a$ and the overall number of labels is minimized.\\n  The problem, known as \\\\emph{Minimum Aged Labeling} (MAL), has several\\napplications in logistics, distribution scheduling, and information spreading\\nin social networks, where carefully choosing the time-labels can significantly\\nreduce infrastructure costs, fuel consumption, or greenhouse gases.\\n  The problem MAL has previously been proved to be NP-complete on undirected\\ngraphs and \\\\APX-hard on directed graphs. In this paper, we extend our knowledge\\non the complexity and approximability of MAL in several directions. We first\\nshow that the problem cannot be approximated within a factor better than\\n$O(\\\\log n)$ when $a\\\\geq 2$, unless $\\\\text{P} = \\\\text{NP}$, and a factor better\\nthan $2^{\\\\log ^{1-\\\\epsilon} n}$ when $a\\\\geq 3$, unless $\\\\text{NP}\\\\subseteq\\n\\\\text{DTIME}(2^{\\\\text{polylog}(n)})$, where $n$ is the number of vertices in\\nthe graph. Then we give a set of approximation algorithms that, under some\\nconditions, almost match these lower bounds. In particular, we show that the\\napproximation depends on a relation between $a$ and the diameter of the input\\ngraph.\\n  We further establish a connection with a foundational optimization problem on\\nstatic graphs called \\\\emph{Diameter Constrained Spanning Subgraph} (DCSS) and\\nshow that our hardness results also apply to DCSS.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS,cs.AI\", \"published\": \"2025-04-23T16:00:33Z\"}"}
