{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10452v1\", \"title\": \"Integrating Vision and Location with Transformers: A Multimodal Deep\\n  Learning Framework for Medical Wound Analysis\", \"summary\": \"Effective recognition of acute and difficult-to-heal wounds is a necessary\\nstep in wound diagnosis. An efficient classification model can help wound\\nspecialists classify wound types with less financial and time costs and also\\nhelp in deciding on the optimal treatment method. Traditional machine learning\\nmodels suffer from feature selection and are usually cumbersome models for\\naccurate recognition. Recently, deep learning (DL) has emerged as a powerful\\ntool in wound diagnosis. Although DL seems promising for wound type\\nrecognition, there is still a large scope for improving the efficiency and\\naccuracy of the model. In this study, a DL-based multimodal classifier was\\ndeveloped using wound images and their corresponding locations to classify them\\ninto multiple classes, including diabetic, pressure, surgical, and venous\\nulcers. A body map was also created to provide location data, which can help\\nwound specialists label wound locations more effectively. The model uses a\\nVision Transformer to extract hierarchical features from input images, a\\nDiscrete Wavelet Transform (DWT) layer to capture low and high frequency\\ncomponents, and a Transformer to extract spatial features. The number of\\nneurons and weight vector optimization were performed using three swarm-based\\noptimization techniques (Monster Gorilla Toner (MGTO), Improved Gray Wolf\\nOptimization (IGWO), and Fox Optimization Algorithm). The evaluation results\\nshow that weight vector optimization using optimization algorithms can increase\\ndiagnostic accuracy and make it a very effective approach for wound detection.\\nIn the classification using the original body map, the proposed model was able\\nto achieve an accuracy of 0.8123 using image data and an accuracy of 0.8007\\nusing a combination of image data and wound location. Also, the accuracy of the\\nmodel in combination with the optimization models varied from 0.7801 to 0.8342.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-14T17:39:18Z\"}"}
