{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13057v1\", \"title\": \"Covariate balancing estimation and model selection for\\n  difference-in-differences approach\", \"summary\": \"In causal inference, remarkable progress has been made in\\ndifference-in-differences (DID) approaches to estimate the average effect of\\ntreatment on the treated (ATT). Of these, the semiparametric DID (SDID)\\napproach incorporates a propensity score analysis into the DID setup. Supposing\\nthat the ATT is a function of covariates, we estimate it by weighting the\\ninverse of the propensity score. As one method to make the estimation robust to\\nthe propensity score modeling, we incorporate covariate balancing. Then, by\\nattentively constructing the moment conditions used in the covariate balancing,\\nwe show that the proposed estimator has doubly robustness. In addition to the\\nestimation, model selection is also addressed. In practice, covariate selection\\nis an essential task in statistical analysis, but even in the basic setting of\\nthe SDID approach, there are no reasonable information criteria. Therefore, we\\nderive a model selection criterion as an asymptotically bias-corrected\\nestimator of risk based on the loss function used in the SDID estimation. As a\\nresult, we show that a penalty term is derived that is considerably different\\nfrom almost twice the number of parameters that often appears in AIC-type\\ninformation criteria. Numerical experiments show that the proposed method\\nestimates the ATT robustly compared to the method using propensity scores given\\nby the maximum likelihood estimation (MLE), and that the proposed criterion\\nclearly reduces the risk targeted in the SDID approach compared to the\\nintuitive generalization of the existing information criterion. In addition,\\nreal data analysis confirms that there is a large difference between the\\nresults of the proposed method and the existing method.\", \"main_category\": \"stat.ME\", \"categories\": \"stat.ME\", \"published\": \"2025-04-17T16:11:42Z\"}"}
