{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12861v1\", \"title\": \"Hardware Implementation of Tunable Fractional-Order Capacitors by\\n  Morphogenesis of Conducting Polymer Dendrites\", \"summary\": \"Conventional electronics is founded on a paradigm where shaping perfect\\nelectrical elements is done at the fabrication plant, so as to make devices and\\nsystems identical, \\\"eternally immutable\\\". In nature, morphogenic evolutions are\\nobserved in most living organisms and exploit topological plasticity as a\\nlow-resource mechanism for in operando manufacturing and computation. Often\\nfractal, the resulting topologies feature inherent disorder: a property which\\nis never exploited in conventional electronics manufacturing, while necessary\\nfor data generation and security in software. In this study, we present how\\nsuch properties can be exploited to implement long-term and evolvable synaptic\\nplasticity in an electronic hardware. The rich topology of conducting polymer\\ndendrites (CPDs) is exploited to program the non-ideality of their\\nelectrochemical capacitances containing constant-phase-elements. Their\\nevolution through structural changes alters the characteristic time constants\\nfor them to charge and discharge with the applied voltage stimuli. Under a\\ntrain of voltage spikes, the evolvable current relaxation of the\\nelectrochemical systems promotes short-term plasticity with timescales ranging\\nfrom milliseconds to seconds. This large window depends on the temporality of\\nthe voltage pulses used for reading, but also on the structure of a pair of\\nCPDs on two electrodes, grown by voltage pulses. This study demonstrates how\\nrelevant physically transient and non-ideal electrochemical components can be\\nexploited for unconventional electronics, with the aim to mimic a universal\\nproperty of living organisms which could barely be replicated in a silicon\\nmonocrystal.\", \"main_category\": \"physics.app-ph\", \"categories\": \"physics.app-ph\", \"published\": \"2025-04-17T11:38:43Z\"}"}
