{"value":"{\"aid\": \"http://arxiv.org/abs/2504.19555v1\", \"title\": \"Physical-Layer Security in Mixed Near-Field and Far-Field Communication\\n  Systems\", \"summary\": \"Extremely large-scale arrays (XL-arrays) have emerged as a promising\\ntechnology to improve the spectrum efficiency and spatial resolution of future\\nwireless systems. Different from existing works that mostly considered physical\\nlayer security (PLS) in either the far-field or near-field, we consider in this\\npaper a new and practical scenario, where legitimate users (Bobs) are located\\nin the far-field of a base station (BS) while eavesdroppers (Eves) are located\\nin the near-field for intercepting confidential information at short distance,\\nreferred to as the mixed near-field and far-field PLS. Specifically, we\\nformulate an optimization problem to maximize the sum-secrecy-rate of all Bobs\\nby optimizing the power allocation of the BS, subject to the constraint on the\\ntotal BS transmit power. To shed useful insights, we first consider a\\none-Bob-one-Eve system and characterize the insecure-transmission region of the\\nBob in closed form. Interestingly, we show that the insecure-transmission\\nregion is significantly \\\\emph{expanded} as compared to that in conventional\\nfar-field PLS systems, due to the energy-spread effect in the mixed-field\\nscenario. Then, we further extend the analysis to a two-Bob-one-Eve system. It\\nis revealed that as compared to the one-Bob system, the interferences from the\\nother Bob can be effectively used to weaken the capability of Eve for\\nintercepting signals of target Bobs, thus leading to enhanced secrecy rates.\\nFurthermore, we propose an efficient algorithm to obtain a high-quality\\nsolution to the formulated non-convex problem by leveraging the successive\\nconvex approximation (SCA) technique. Finally, numerical results demonstrate\\nthat our proposed algorithm achieves a higher sum-secrecy-rate than the\\nbenchmark scheme where the power allocation is designed based on the\\n(simplified) far-field channel model.\", \"main_category\": \"eess.SP\", \"categories\": \"eess.SP\", \"published\": \"2025-04-28T08:00:36Z\"}"}
