{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17375v1\", \"title\": \"Deep Reparameterization for Full Waveform Inversion: Architecture\\n  Benchmarking, Robust Inversion, and Multiphysics Extension\", \"summary\": \"Full waveform inversion (FWI) is a high-resolution subsurface imaging\\ntechnique, but its effectiveness is limited by challenges such as noise\\ncontamination, sparse acquisition, and artifacts from multiparameter coupling.\\nTo address these limitations, this study develops a deep reparameterized FWI\\n(DR-FWI) framework, in which subsurface parameters are represented by a deep\\nneural network. Instead of directly optimizing the parameters, DR-FWI optimizes\\nthe network weights to reconstruct them, thereby embedding structural priors\\nand facilitating optimization. To provide benchmark guidelines for the design\\nof DR-FWI, we conduct a comparative analysis of three representative\\narchitectures (U-Net, CNN, MLP) combined with two initial model embedding\\nstrategies: one pretraining the network to generate predefined initial models\\n(pretraining-based), while the other directly adds network outputs to the\\ninitial models. Extensive ablation experiments show that combining CNN with\\npretraining-based initialization significantly enhances inversion accuracy,\\noffering valuable insights into network design. To further understand the\\nmechanism of DR-FWI, spectral bias analysis reveals that the network first\\ncaptures low-frequency features and gradually reconstructs high-frequency\\ndetails, enabling an adaptive multi-scale inversion strategy. Notably, the\\nrobustness of DR-FWI is validated under various noise levels and sparse\\nacquisition scenarios, where its strong performance with limited shots and\\nreceivers demonstrates reduced reliance on dense observational data.\\nAdditionally, a backbone-branch structure is proposed to extend DR-FWI to\\nmultiparameter inversion, and its efficacy in mitigating cross-parameter\\ninterference is validated on a synthetic anomaly model and the Marmousi2 model.\\nThese results suggest a promising direction for joint inversion involving\\nmultiple parameters or multiphysics.\", \"main_category\": \"physics.geo-ph\", \"categories\": \"physics.geo-ph\", \"published\": \"2025-04-24T08:49:32Z\"}"}
