{"value":"{\"aid\": \"http://arxiv.org/abs/2504.16905v1\", \"title\": \"The Galactic inner spiral arms revealed by the Gaia ESO Survey chemical\\n  abundances. Metallicity and [Mg/Fe] ratios\", \"summary\": \"Recent observational advances, such as Gaia DR3 GSP-Spec, have highlighted\\nthe potential of chemical abundances in tracing and revealing the structure of\\nspiral arms. Building on these studies, we aim to trace the Milky Way's inner\\nspiral arms using chemical abundance data from the Gaia-ESO Survey (GES). By\\nmapping over-densities in [Fe/H] and [Mg/Fe], we seek to identify spiral arms\\nin both radial and vertical planes, detect substructures, and compare our\\nresults with recent Galactic chemical evolution models. We used chemical\\nabundance data from the Gaia-ESO Survey to create spatial maps of [Fe/H],\\n[Mg/H], and [Mg/Fe] excess across the Galactic inner disc. We compared our\\nresults with the spiral arm models proposed by Spitoni et al. (2023) and\\nBarbillon et al. (2024). For the first time, the inner spiral arms were\\nrevealed using chemical abundance patterns. We detected [Fe/H] enhancements and\\n[Mg/Fe] under-abundances that consistently trace the Scutum and Sagittarius\\narms. A connecting spur between these arms is observed in the [Mg/H] plane. The\\nalignment between our observations and the results of our 2D chemical evolution\\nmodels reinforces the significance of spiral arm transits in driving both\\nazimuthal and radial variations in chemical abundances. Our results confirm\\nthat spiral arms can be traced using stellar chemical abundances with GES data,\\nproviding a new perspective on the structure of the inner Galaxy. The\\nconsistency between enhanced [Fe/H] and lower [Mg/Fe] ratios, as observed in\\nprevious studies, further strengthens the reliability of our findings. The\\nobserved spur, bifurcation, and vertical substructures align well with recent\\nmodels and studies, indicating that chemical maps can significantly contribute\\nto our understanding of Galactic spiral arms.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-23T17:28:37Z\"}"}
