{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12938v1\", \"title\": \"Optimal analysis of penalized lowest-order mixed FEMs for the\\n  Stokes-Darcy model\", \"summary\": \"This paper is concerned with non-uniform fully-mixed FEMs for dynamic coupled\\nStokes-Darcy model with the well-known Beavers-Joseph-Saffman (BJS) interface\\ncondition. In particular, a decoupled algorithm with the lowest-order mixed\\nnon-uniform FE approximations (MINI for the Stokes equation and RT0-DG0 for the\\nDarcy equation) and the classical Nitsche-type penalty is studied. The method\\nwith the combined approximation of different orders is commonly used in\\npractical simulations. However, the optimal error analysis of methods with\\nnon-uniform approximations for the coupled Stokes-Darcy flow model has remained\\nchallenging, although the analysis for uniform approximations has been well\\ndone. The key question is how the lower-order approximation to the Darcy flow\\ninfluences the accuracy of the Stokes solution through the interface condition.\\nIn this paper, we prove that the decoupled algorithm provides a truly optimal\\nconvergence rate in L^2-norm in spatial direction: O(h^2) for Stokes velocity\\nand O(h) for Darcy flow in the coupled Stokes-Darcy model. This implies that\\nthe lower-order approximation to the Darcy flow does not pollute the accuracy\\nof numerical velocity for Stokes flow. The analysis presented in this paper is\\nbased on a well-designed Stokes-Darcy Ritz projection and given for a dynamic\\ncoupled model. The optimal error estimate holds for more general combined\\napproximations and more general coupled models, including the corresponding\\nmodel of steady-state Stokes-Darcy flows and the model of coupled dynamic\\nStokes and steady-state Darcy flows. Numerical results confirm our theoretical\\nanalysis and show that the decoupled algorithm is efficient.\", \"main_category\": \"math.NA\", \"categories\": \"math.NA,cs.NA\", \"published\": \"2025-04-17T13:37:39Z\"}"}
