{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21750v1\", \"title\": \"Online Knapsack Problems with Estimates\", \"summary\": \"Imagine you are a computer scientist who enjoys attending conferences or\\nworkshops within the year. Sadly, your travel budget is limited, so you must\\nselect a subset of events you can travel to.\\n  When you are aware of all possible events and their costs at the beginning of\\nthe year, you can select the subset of the possible events that maximizes your\\nhappiness and is within your budget.\\n  On the other hand, if you are blind about the options, you will likely have a\\nhard time when trying to decide if you want to register somewhere or not, and\\nwill likely regret decisions you made in the future.\\n  These scenarios can be modeled by knapsack variants, either by an offline or\\nan online problem. However, both scenarios are somewhat unrealistic:\\n  Usually, you will not know the exact costs of each workshop at the beginning\\nof the year. The online version, however, is too pessimistic, as you might\\nalready know which options there are and how much they cost roughly. At some\\npoint, you have to decide whether to register for some workshop, but then you\\nare aware of the conference fee and the flight and hotel prices.\\n  We model this problem within the setting of online knapsack problems with\\nestimates: in the beginning, you receive a list of potential items with their\\nestimated size as well as the accuracy of the estimates. Then, the items are\\nrevealed one by one in an online fashion with their actual size, and you need\\nto decide whether to take one or not. In this article, we show a best-possible\\nalgorithm for each estimate accuracy $\\\\delta$ (i.e., when each actual item size\\ncan deviate by $\\\\pm \\\\delta$ from the announced size) for both the simple\\nknapsack and the simple knapsack with removability.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS\", \"published\": \"2025-04-30T15:42:43Z\"}"}
