{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10337v1\", \"title\": \"Heimdall: test-time scaling on the generative verification\", \"summary\": \"An AI system can create and maintain knowledge only to the extent that it can\\nverify that knowledge itself. Recent work on long Chain-of-Thought reasoning\\nhas demonstrated great potential of LLMs on solving competitive problems, but\\ntheir verification ability remains to be weak and not sufficiently\\ninvestigated. In this paper, we propose Heimdall, the long CoT verification LLM\\nthat can accurately judge the correctness of solutions. With pure reinforcement\\nlearning, we boost the verification accuracy from 62.5% to 94.5% on competitive\\nmath problems. By scaling with repeated sampling, the accuracy further\\nincreases to 97.5%. Through human evaluation, Heimdall demonstrates impressive\\ngeneralization capabilities, successfully detecting most issues in challenging\\nmath proofs, the type of which is not included during training. Furthermore, we\\npropose Pessimistic Verification to extend the functionality of Heimdall to\\nscaling up the problem solving. It calls Heimdall to judge the solutions from a\\nsolver model and based on the pessimistic principle, selects the most likely\\ncorrect solution with the least uncertainty. Taking\\nDeepSeek-R1-Distill-Qwen-32B as the solver model, Pessimistic Verification\\nimproves the solution accuracy on AIME2025 from 54.2% to 70.0% with 16x compute\\nbudget and to 83.3% with more compute budget. With the stronger solver Gemini\\n2.5 Pro, the score reaches 93.0%. Finally, we prototype an automatic knowledge\\ndiscovery system, a ternary system where one poses questions, another provides\\nsolutions, and the third verifies the solutions. Using the data synthesis work\\nNuminaMath for the first two components, Heimdall effectively identifies\\nproblematic records within the dataset and reveals that nearly half of the data\\nis flawed, which interestingly aligns with the recent ablation studies from\\nNuminaMath.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,I.2.7\", \"published\": \"2025-04-14T15:46:33Z\"}"}
