{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15112v1\", \"title\": \"The phase diagram of CeRh$_{2}$As$_{2}$ for out-of-plane magnetic field\", \"summary\": \"The heavy-fermion superconductor CeRh$_{2}$As$_{2}$ ($T_{\\\\textrm{c}} = 0.35\\\\,\\n\\\\textrm{K}$) shows two superconducting (SC) phases, SC1 and SC2, when a\\nmagnetic field is applied parallel to the $c$ axis of the tetragonal unit cell.\\nAll experiments to date indicate that the change in SC order parameter detected\\nat $\\\\mu_{\\\\textrm{0}}H^{*} \\\\approx 4\\\\, \\\\textrm{T}$ is due to strong Rashba\\nspin-orbit coupling at the Ce sites caused by the locally non-centrosymmetric\\nenvironments of the otherwise globally centrosymmetric crystalline structure.\\nAnother phase (phase I) exists in this material below $T_{\\\\textrm{0}} = 0.54\\\\,\\n\\\\textrm{K}$. In a previous specific heat study [K. Semeniuk et al. Phys. Rev.\\nB, $107$, L220504 (2023)] we have shown that phase I persists up to a field\\n$\\\\mu_{\\\\textrm{0}}H_{0} \\\\approx 6\\\\, \\\\textrm{T}$, larger than $H^{*}$. From\\nthermodynamic arguments we expected the phase-I boundary line to cross phase\\nSC2 at a tetracritical point. However, we could not find any signature of the\\nphase-I line inside the SC2 phase and speculated that this was due to the fact\\nthat the $T_{0}(H)$ line is almost perpendicular to the $H$ axis and,\\ntherefore, invisible to $T$-dependent measurements. This would imply a weak\\ncompetition between the two order parameters. Here, we report magnetic field\\ndependent measurements of the magnetostriction and ac-susceptibility on\\nhigh-quality single crystals. We see clear evidence of the singularity at\\n$H_{0}$ inside the SC2 phase and confirm our previous prediction. Furthermore,\\nwe observe the transition across the $T^{*}(H)$ line in $T$-dependent specific\\nheat measurements, which show that the $T^{*}(H)$ line is not perpendicular to\\nthe field axis, but has a positive slope. Our work supports recent $\\\\mu$SR\\nresults which suggest coexistence of phase I with superconductivity.\", \"main_category\": \"cond-mat.str-el\", \"categories\": \"cond-mat.str-el,cond-mat.supr-con\", \"published\": \"2025-04-21T14:05:57Z\"}"}
