{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15074v1\", \"title\": \"The orientation dynamics of a massive ellipsoid in simple shear flow\", \"summary\": \"The orientation dynamics of a massive rigid ellipsoid in simple shear flow of\\na Newtonian fluid is investigated in detail. The term `massive' refers to\\ndominant particle inertia, as characterized by $St \\\\gg 1$, $St =\\n\\\\dot{\\\\gamma}l^2\\\\rho_p/\\\\nu \\\\rho_f$ being the Stokes number; here, $\\\\dot{\\\\gamma}$\\nis the shear rate, $\\\\nu$ is the kinematic viscosity, $l$ is a characteristic\\nellipsoidal dimension (taken to be the longest semi axis), and $\\\\rho_p$ and\\n$\\\\rho_f$ are the particle and fluid densities, respectively. Fluid inertial\\neffects are neglected, so the particle Reynolds number ($Re$) is zero. The\\nequations of motion of the ellipsoid in this limit reduce to those governing an\\nEuler top, supplemented by a weak viscous torque. The dynamics consists of a\\nfast conservative motion on time scales of $O(\\\\dot{\\\\gamma}^{-1})$ that, for an\\nellipsoid, involves a combination of spin, precession and nutation, and a\\nslower component driven by the viscous torque; the latter modulates the angular\\nmomentum and rotational kinetic energy on asymptotically longer time scales of\\n$O(St{\\\\dot{\\\\gamma}}^{-1})$. The separation of time scales for large $St$ allows\\nfor use of the method of averaging for a triaxial ellipsoid, to derive an\\nautonomous system of ODE's that govern motion on a four-dimensional slow\\nmanifold consisting of the three angular momenta and the rotational kinetic\\nenergy. There are three fixed points on the slow manifold, with rotation about\\nthe shortest axis being stable. The fixed point corresponding to rotation about\\nthe longest axis is a saddle point, while intermediate-axis-aligned rotation\\ncorresponds to a singular fixed point. For spheroids, the singular fixed point\\nmerges with one of the other two, leading to only two fixed points, one a\\nstable node and the other a saddle; the former corresponds to rotation about\\nthe shorter axis.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-21T13:03:22Z\"}"}
