{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15929v1\", \"title\": \"Meta-Entity Driven Triplet Mining for Aligning Medical Vision-Language\\n  Models\", \"summary\": \"Diagnostic imaging relies on interpreting both images and radiology reports,\\nbut the growing data volumes place significant pressure on medical experts,\\nyielding increased errors and workflow backlogs. Medical vision-language models\\n(med-VLMs) have emerged as a powerful framework to efficiently process\\nmultimodal imaging data, particularly in chest X-ray (CXR) evaluations, albeit\\ntheir performance hinges on how well image and text representations are\\naligned. Existing alignment methods, predominantly based on contrastive\\nlearning, prioritize separation between disease classes over segregation of\\nfine-grained pathology attributes like location, size or severity, leading to\\nsuboptimal representations. Here, we propose MedTrim (Meta-entity-driven\\nTriplet mining), a novel method that enhances image-text alignment through\\nmultimodal triplet learning synergistically guided by disease class as well as\\nadjectival and directional pathology descriptors. Unlike common alignment\\nmethods that separate broad disease classes, MedTrim leverages structured\\nmeta-entity information to preserve subtle but clinically significant\\nintra-class variations. For this purpose, we first introduce an ontology-based\\nentity recognition module that extracts pathology-specific meta-entities from\\nCXR reports, as annotations on pathology attributes are rare in public\\ndatasets. For refined sample selection in triplet mining, we then introduce a\\nnovel score function that captures an aggregate measure of inter-sample\\nsimilarity based on disease classes and adjectival/directional descriptors.\\nLastly, we introduce a multimodal triplet alignment objective for explicit\\nwithin- and cross-modal alignment between samples sharing detailed pathology\\ncharacteristics. Our demonstrations indicate that MedTrim improves performance\\nin downstream retrieval and classification tasks compared to state-of-the-art\\nalignment methods.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-22T14:17:51Z\"}"}
