{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04284v1\", \"title\": \"GASCADE: Grouped Summarization of Adverse Drug Event for Enhanced Cancer\\n  Pharmacovigilance\", \"summary\": \"In the realm of cancer treatment, summarizing adverse drug events (ADEs)\\nreported by patients using prescribed drugs is crucial for enhancing\\npharmacovigilance practices and improving drug-related decision-making. While\\nthe volume and complexity of pharmacovigilance data have increased, existing\\nresearch in this field has predominantly focused on general diseases rather\\nthan specifically addressing cancer. This work introduces the task of grouped\\nsummarization of adverse drug events reported by multiple patients using the\\nsame drug for cancer treatment. To address the challenge of limited resources\\nin cancer pharmacovigilance, we present the MultiLabeled Cancer Adverse Drug\\nReaction and Summarization (MCADRS) dataset. This dataset includes\\npharmacovigilance posts detailing patient concerns regarding drug efficacy and\\nadverse effects, along with extracted labels for drug names, adverse drug\\nevents, severity, and adversity of reactions, as well as summaries of ADEs for\\neach drug. Additionally, we propose the Grouping and Abstractive Summarization\\nof Cancer Adverse Drug events (GASCADE) framework, a novel pipeline that\\ncombines the information extraction capabilities of Large Language Models\\n(LLMs) with the summarization power of the encoder-decoder T5 model. Our work\\nis the first to apply alignment techniques, including advanced algorithms like\\nDirect Preference Optimization, to encoder-decoder models using synthetic\\ndatasets for summarization tasks. Through extensive experiments, we demonstrate\\nthe superior performance of GASCADE across various metrics, validated through\\nboth automated assessments and human evaluations. This multitasking approach\\nenhances drug-related decision-making and fosters a deeper understanding of\\npatient concerns, paving the way for advancements in personalized and\\nresponsive cancer care. The code and dataset used in this work are publicly\\navailable.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL,cs.AI\", \"published\": \"2025-05-07T09:40:18Z\"}"}
