{"value":"{\"aid\": \"http://arxiv.org/abs/2504.09971v1\", \"title\": \"Proofs of Useful Work from Arbitrary Matrix Multiplication\", \"summary\": \"We revisit the longstanding open problem of implementing Nakamoto's\\nproof-of-work (PoW) consensus based on a real-world computational task $T(x)$\\n(as opposed to artificial random hashing), in a truly permissionless setting\\nwhere the miner itself chooses the input $x$. The challenge in designing such a\\nProof-of-Useful-Work (PoUW) protocol, is using the native computation of $T(x)$\\nto produce a PoW certificate with prescribed hardness and with negligible\\ncomputational overhead over the worst-case complexity of $T(\\\\cdot)$ -- This\\nensures malicious miners cannot ``game the system\\\" by fooling the verifier to\\naccept with higher probability compared to honest miners (while using similar\\ncomputational resources). Indeed, obtaining a PoUW with $O(1)$-factor overhead\\nis trivial for any task $T$, but also useless.\\n  Our main result is a PoUW for the task of Matrix Multiplication $MatMul(A,B)$\\nof arbitrary matrices with $1+o(1)$ multiplicative overhead compared to naive\\n$MatMul$ (even in the presence of Fast Matrix Multiplication-style algorithms,\\nwhich are currently impractical). We conjecture that our protocol has optimal\\nsecurity in the sense that a malicious prover cannot obtain any significant\\nadvantage over an honest prover. This conjecture is based on reducing hardness\\nof our protocol to the task of solving a batch of low-rank random linear\\nequations which is of independent interest.\\n  Since $MatMul$s are the bottleneck of AI compute as well as countless\\nindustry-scale applications, this primitive suggests a concrete design of a new\\nL1 base-layer protocol, which nearly eliminates the energy-waste of Bitcoin\\nmining -- allowing GPU consumers to reduce their AI training and inference\\ncosts by ``re-using\\\" it for blockchain consensus, in exchange for block rewards\\n(2-for-1). This blockchain is currently under construction.\", \"main_category\": \"cs.CR\", \"categories\": \"cs.CR\", \"published\": \"2025-04-14T08:22:40Z\"}"}
