{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00378v1\", \"title\": \"Cues3D: Unleashing the Power of Sole NeRF for Consistent and Unique\\n  Instances in Open-Vocabulary 3D Panoptic Segmentation\", \"summary\": \"Open-vocabulary 3D panoptic segmentation has recently emerged as a\\nsignificant trend. Top-performing methods currently integrate 2D segmentation\\nwith geometry-aware 3D primitives. However, the advantage would be lost without\\nhigh-fidelity 3D point clouds, such as methods based on Neural Radiance Field\\n(NeRF). These methods are limited by the insufficient capacity to maintain\\nconsistency across partial observations. To address this, recent works have\\nutilized contrastive loss or cross-view association pre-processing for view\\nconsensus. In contrast to them, we present Cues3D, a compact approach that\\nrelies solely on NeRF instead of pre-associations. The core idea is that NeRF's\\nimplicit 3D field inherently establishes a globally consistent geometry,\\nenabling effective object distinction without explicit cross-view supervision.\\nWe propose a three-phase training framework for NeRF,\\ninitialization-disambiguation-refinement, whereby the instance IDs are\\ncorrected using the initially-learned knowledge. Additionally, an instance\\ndisambiguation method is proposed to match NeRF-rendered 3D masks and ensure\\nglobally unique 3D instance identities. With the aid of Cues3D, we obtain\\nhighly consistent and unique 3D instance ID for each object across views with a\\nbalanced version of NeRF. Our experiments are conducted on ScanNet v2,\\nScanNet200, ScanNet++, and Replica datasets for 3D instance, panoptic, and\\nsemantic segmentation tasks. Cues3D outperforms other 2D image-based methods\\nand competes with the latest 2D-3D merging based methods, while even surpassing\\nthem when using additional 3D point clouds. The code link could be found in the\\nappendix and will be released on\\n\\\\href{https://github.com/mRobotit/Cues3D}{github}\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-05-01T08:12:03Z\"}"}
