{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02539v1\", \"title\": \"The restoration of Book X of the Elements to its original Theaetetean\\n  form\", \"summary\": \"In the present work, we aim to restore Book X of the $\\\\it{Elements}$ to its\\noriginal Theaetetean, pre-Eudoxean form in two separate ways. First, we restore\\nthe considerable mathematical content of Book X, by correlating Book X with\\nPlato's account of Theaetetus' mathematical discoveries and Plato's imitations\\nof these discoveries for his philosophy. Thus, Theaetetus proved (i) the\\neventual periodicity of the anthyphairesis of lines a to b, satisfying $Ma^2 =\\nNb^2$, for MN not square number; (ii) the eventual periodic anthyphairesis of\\nlines a to b, satisfying more general quadratic expressions, including the\\nApplication of Areas in defect, and employing this to show that the 12 classes\\nof alogoi lines, including the minor, despite being alogoi, are determined by\\nan eventually periodic Application of Areas in defect; (iii) the anthyphairetic\\npalindromic periodicity of the anthyphairesis of the surds $\\\\sqrt{N}$ for any\\nnon-square number N, of relevance to the general Pell's Diophantine problem.\\nSecondly, we restore the proofs of all propositions of Book X, in such way that\\nthese are proofs based on Theaetetus', and not on Eudoxus' theory of proportion\\nof magnitudes, in particular not making any use of Eudoxus' condition (namely\\nof definition 4 of Book V). The restoration is based on our reconstruction of\\nTheaetetus' theory of proportion for magnitudes, for the limited class of\\nratios a/b such that either a, b are commensurable or the anthyphairesis of a\\nto b is eventually periodic, without employing Eudoxus' condition, and its\\nsuccess provides a confirmation of our reconstruction.\\n  The final version of this paper will appear as a chapter in the journal\\nGanita Bh\\\\=arat\\\\=i, Bulletin of the Indian Society for History of Mathematics,\\n(2) 45 (2023).\", \"main_category\": \"math.HO\", \"categories\": \"math.HO\", \"published\": \"2025-04-03T12:40:16Z\"}"}
