{"value":"{\"aid\": \"http://arxiv.org/abs/2504.05132v1\", \"title\": \"Oscillatory flows in three-dimensional deformable microchannels\", \"summary\": \"Deformable microchannels emulate a key characteristic of soft biological\\nsystems and flexible engineering devices: the flow-induced deformation of the\\nconduit due to slow viscous flow within. Elucidating the two-way coupling\\nbetween oscillatory flow and deformation of a three-dimensional (3D)\\nrectangular channel is crucial for designing lab- and organ-on-a-chip\\nmicrosystems and eventually understanding flow-structure instabilities that can\\nenhance mixing and transport. We determine the axial variations of the primary\\nflow, pressure, and deformation for Newtonian fluids in the canonical geometry\\nof a slender (long) and shallow (wide) 3D rectangular channel with a deformable\\ntop wall under the assumption of weak compliance and without restriction on the\\noscillation frequency (i.e., on the Womersley number). Unlike rigid conduits,\\nthe pressure distribution is not linear with the axial coordinate. To validate\\nthis prediction, we design a PDMS-based experimental platform with a\\nspeaker-based flow-generation apparatus and a pressure acquisition system with\\nmultiple ports along the axial length of the channel. The experimental\\nmeasurements show good agreement with the predicted pressure profiles across a\\nwide range of the key dimensionless quantities: the Womersley number, the\\ncompliance number, and the elastoviscous number. Finally, we explore how the\\nnonlinear flow -- deformation coupling leads to self-induced streaming\\n(rectification of the oscillatory flow). Following Zhang and Rallabandi (J.\\nFluid Mech., 996, 2024, A16), we develop a theory for the cycle-averaged\\npressure based on the primary problem's solution, and we validate the\\npredictions for the axial distribution of the streaming pressure against\\nhigh-precision experimental measurements.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-04-07T14:35:46Z\"}"}
