{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10428v1\", \"title\": \"Learning with Positive and Imperfect Unlabeled Data\", \"summary\": \"We study the problem of learning binary classifiers from positive and\\nunlabeled data when the unlabeled data distribution is shifted, which we call\\nPositive and Imperfect Unlabeled (PIU) Learning. In the absence of covariate\\nshifts, i.e., with perfect unlabeled data, Denis (1998) reduced this problem to\\nlearning under Massart noise; however, that reduction fails under even slight\\nshifts.\\n  Our main results on PIU learning are the characterizations of the sample\\ncomplexity of PIU learning and a computationally and sample-efficient algorithm\\nachieving a misclassification error $\\\\varepsilon$. We further show that our\\nresults lead to new algorithms for several related problems.\\n  1. Learning from smooth distributions: We give algorithms that learn\\ninteresting concept classes from only positive samples under smooth feature\\ndistributions, bypassing known existing impossibility results and contributing\\nto recent advances in smoothened learning (Haghtalab et al, J.ACM'24)\\n(Chandrasekaran et al., COLT'24).\\n  2. Learning with a list of unlabeled distributions: We design new algorithms\\nthat apply to a broad class of concept classes under the assumption that we are\\ngiven a list of unlabeled distributions, one of which--unknown to the\\nlearner--is $O(1)$-close to the true feature distribution.\\n  3. Estimation in the presence of unknown truncation: We give the first\\npolynomial sample and time algorithm for estimating the parameters of an\\nexponential family distribution from samples truncated to an unknown set\\napproximable by polynomials in $L_1$-norm. This improves the algorithm by Lee\\net al. (FOCS'24) that requires approximation in $L_2$-norm.\\n  4. Detecting truncation: We present new algorithms for detecting whether\\ngiven samples have been truncated (or not) for a broad class of non-product\\ndistributions, including non-product distributions, improving the algorithm by\\nDe et al. (STOC'24).\", \"main_category\": \"stat.ML\", \"categories\": \"stat.ML,cs.DS,cs.LG,math.ST,stat.TH\", \"published\": \"2025-04-14T17:19:29Z\"}"}
