{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02553v1\", \"title\": \"Exploring Individual Factors in the Adoption of LLMs for Specific\\n  Software Engineering Tasks\", \"summary\": \"The advent of Large Language Models (LLMs) is transforming software\\ndevelopment, significantly enhancing software engineering processes. Research\\nhas explored their role within development teams, focusing on specific tasks\\nsuch as artifact generation, decision-making support, and information\\nretrieval. Despite the growing body of work on LLMs in software engineering,\\nmost studies have centered on broad adoption trends, neglecting the nuanced\\nrelationship between individual cognitive and behavioral factors and their\\nimpact on task-specific adoption. While factors such as perceived effort and\\nperformance expectancy have been explored at a general level, their influence\\non distinct software engineering tasks remains underexamined. This gap hinders\\nthe development of tailored LLM-based systems (e.g., Generative AI Agents) that\\nalign with engineers' specific needs and limits the ability of team leaders to\\ndevise effective strategies for fostering LLM adoption in targeted workflows.\\nThis study bridges this gap by surveying N=188 software engineers to test the\\nrelationship between individual attributes related to technology adoption and\\nLLM adoption across five key tasks, using structural equation modeling (SEM).\\nThe Unified Theory of Acceptance and Use of Technology (UTAUT2) was applied to\\ncharacterize individual adoption behaviors. The findings reveal that\\ntask-specific adoption is influenced by distinct factors, some of which\\nnegatively impact adoption when considered in isolation, underscoring the\\ncomplexity of LLM integration in software engineering. To support effective\\nadoption, this article provides actionable recommendations, such as seamlessly\\nintegrating LLMs into existing development environments and encouraging\\npeer-driven knowledge sharing to enhance information retrieval.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-03T13:07:04Z\"}"}
