{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21735v1\", \"title\": \"GateLens: A Reasoning-Enhanced LLM Agent for Automotive Software Release\\n  Analytics\", \"summary\": \"Ensuring the reliability and effectiveness of software release decisions is\\ncritical, particularly in safety-critical domains like automotive systems.\\nPrecise analysis of release validation data, often presented in tabular form,\\nplays a pivotal role in this process. However, traditional methods that rely on\\nmanual analysis of extensive test datasets and validation metrics are prone to\\ndelays and high costs. Large Language Models (LLMs) offer a promising\\nalternative but face challenges in analytical reasoning, contextual\\nunderstanding, handling out-of-scope queries, and processing structured test\\ndata consistently; limitations that hinder their direct application in\\nsafety-critical scenarios. This paper introduces GateLens, an LLM-based tool\\nfor analyzing tabular data in the automotive domain. GateLens translates\\nnatural language queries into Relational Algebra (RA) expressions and then\\ngenerates optimized Python code. It outperforms the baseline system on\\nbenchmarking datasets, achieving higher F1 scores and handling complex and\\nambiguous queries with greater robustness. Ablation studies confirm the\\ncritical role of the RA module, with performance dropping sharply when omitted.\\nIndustrial evaluations reveal that GateLens reduces analysis time by over 80%\\nwhile maintaining high accuracy and reliability. As demonstrated by presented\\nresults, GateLens achieved high performance without relying on few-shot\\nexamples, showcasing strong generalization across various query types from\\ndiverse company roles. Insights from deploying GateLens with a partner\\nautomotive company offer practical guidance for integrating AI into critical\\nworkflows such as release validation. Results show that by automating test\\nresult analysis, GateLens enables faster, more informed, and dependable release\\ndecisions, and can thus advance software scalability and reliability in\\nautomotive systems.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE,cs.AI,cs.CL,cs.MA\", \"published\": \"2025-03-27T17:48:32Z\"}"}
