{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21562v1\", \"title\": \"eNCApsulate: NCA for Precision Diagnosis on Capsule Endoscopes\", \"summary\": \"Wireless Capsule Endoscopy is a non-invasive imaging method for the entire\\ngastrointestinal tract, and is a pain-free alternative to traditional\\nendoscopy. It generates extensive video data that requires significant review\\ntime, and localizing the capsule after ingestion is a challenge. Techniques\\nlike bleeding detection and depth estimation can help with localization of\\npathologies, but deep learning models are typically too large to run directly\\non the capsule. Neural Cellular Automata (NCA) for bleeding segmentation and\\ndepth estimation are trained on capsule endoscopic images. For monocular depth\\nestimation, we distill a large foundation model into the lean NCA architecture,\\nby treating the outputs of the foundation model as pseudo ground truth. We then\\nport the trained NCA to the ESP32 microcontroller, enabling efficient image\\nprocessing on hardware as small as a camera capsule. NCA are more accurate\\n(Dice) than other portable segmentation models, while requiring more than 100x\\nfewer parameters stored in memory than other small-scale models. The visual\\nresults of NCA depth estimation look convincing, and in some cases beat the\\nrealism and detail of the pseudo ground truth. Runtime optimizations on the\\nESP32-S3 accelerate the average inference speed significantly, by more than\\nfactor 3. With several algorithmic adjustments and distillation, it is possible\\nto eNCApsulate NCA models into microcontrollers that fit into wireless capsule\\nendoscopes. This is the first work that enables reliable bleeding segmentation\\nand depth estimation on a miniaturized device, paving the way for precise\\ndiagnosis combined with visual odometry as a means of precise localization of\\nthe capsule -- on the capsule.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI\", \"published\": \"2025-04-30T12:06:56Z\"}"}
