{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02594v1\", \"title\": \"Hofstadter butterflies in phononic structures: commensurate spectra,\\n  wave localization and metal-insulator transitions\", \"summary\": \"We present a new simple and easy-to-implement one-dimensional phononic system\\nwhose spectrum exactly corresponds to the Hofstadter butterfly when a parameter\\nis modulated. The system consists of masses that are coupled by linear springs\\nand are mounted on flexural beams whose cross section (and, hence, stiffness)\\nis modulated. We show that this system is the simplest version possible to\\nachieve the Hofstadter butterfly exactly; in particular, the local resonances\\ndue to the beams are an essential component for this. We examine the various\\napproaches to producing spectral butterflies, including Bloch spectra for\\nrational parameter choices, resonances of finite-sized systems and transmission\\ncoefficients of sections of finite length. For finite-size systems, we study\\nthe localisation of the modes by calculating the inverse participation ratio,\\nand detect a phase transition characterised by a critical value of the\\nstiffness modulation amplitude, where the state of the system changes from\\nmainly extended to localised, corresponding to a metal-insulator phase\\ntransition. The obtained results offer a practical strategy to realize\\nexperimentally a system with similar dynamical properties. The transmission\\ncoefficient for sections of finite length is benchmarked through the comparison\\nwith Bloch spectra of the same finite-sized systems. The numerical results for\\nthe transmission spectra confirms the evidence of a phase transition in the\\ndynamical state of the system. Our approach opens significant new perspectives\\nin order to design mechanical systems able to support phase transitions in\\ntheir vibrational properties.\", \"main_category\": \"physics.app-ph\", \"categories\": \"physics.app-ph\", \"published\": \"2025-04-03T13:55:49Z\"}"}
