{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17650v1\", \"title\": \"Near-Term Pseudorandom and Pseudoresource Quantum States\", \"summary\": \"A pseudorandom quantum state (PRS) is an ensemble of quantum states\\nindistinguishable from Haar-random states to observers with efficient quantum\\ncomputers. It allows one to substitute the costly Haar-random state with\\nefficiently preparable PRS as a resource for cryptographic protocols, while\\nalso finding applications in quantum learning theory, black hole physics,\\nmany-body thermalization, quantum foundations, and quantum chaos. All existing\\nconstructions of PRS equate the notion of efficiency to quantum computers which\\nruntime is bounded by a polynomial in its input size. In this work, we relax\\nthe notion of efficiency for PRS with respect to observers with near-term\\nquantum computers implementing algorithms with runtime that scales slower than\\npolynomial-time. We introduce the $\\\\mathbf{T}$-PRS which is indistinguishable\\nto quantum algorithms with runtime $\\\\mathbf{T}(n)$ that grows slower than\\npolynomials in the input size $n$. We give a set of reasonable conditions that\\na $\\\\mathbf{T}$-PRS must satisfy and give two constructions by using\\nquantum-secure pseudorandom functions and pseudorandom functions. For\\n$\\\\mathbf{T}(n)$ being linearithmic, linear, polylogarithmic, and logarithmic\\nfunction, we characterize the amount of quantum resources a $\\\\mathbf{T}$-PRS\\nmust possess, particularly on its coherence, entanglement, and magic. Our\\nquantum resource characterization applies generally to any two state ensembles\\nthat are indistinguishable to observers with computational power\\n$\\\\mathbf{T}(n)$, giving a general necessary condition of whether a low-resource\\nensemble can mimic a high-resource ensemble, forming a\\n$\\\\mathbf{T}$-pseudoresource pair. We demonstate how the necessary amount of\\nresource decreases as the observer's computational power is more restricted,\\ngiving a $\\\\mathbf{T}$-pseudoresource pair with larger resource gap for more\\ncomputationally limited observers.\", \"main_category\": \"quant-ph\", \"categories\": \"quant-ph,cs.CR\", \"published\": \"2025-04-24T15:21:29Z\"}"}
