{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10391v1\", \"title\": \"LLM-driven Constrained Copy Generation through Iterative Refinement\", \"summary\": \"Crafting a marketing message (copy), or copywriting is a challenging\\ngeneration task, as the copy must adhere to various constraints. Copy creation\\nis inherently iterative for humans, starting with an initial draft followed by\\nsuccessive refinements. However, manual copy creation is time-consuming and\\nexpensive, resulting in only a few copies for each use case. This limitation\\nrestricts our ability to personalize content to customers. Contrary to the\\nmanual approach, LLMs can generate copies quickly, but the generated content\\ndoes not consistently meet all the constraints on the first attempt (similar to\\nhumans). While recent studies have shown promise in improving constrained\\ngeneration through iterative refinement, they have primarily addressed tasks\\nwith only a few simple constraints. Consequently, the effectiveness of\\niterative refinement for tasks such as copy generation, which involves many\\nintricate constraints, remains unclear. To address this gap, we propose an\\nLLM-based end-to-end framework for scalable copy generation using iterative\\nrefinement. To the best of our knowledge, this is the first study to address\\nmultiple challenging constraints simultaneously in copy generation. Examples of\\nthese constraints include length, topics, keywords, preferred lexical ordering,\\nand tone of voice. We demonstrate the performance of our framework by creating\\ncopies for e-commerce banners for three different use cases of varying\\ncomplexity. Our results show that iterative refinement increases the copy\\nsuccess rate by $16.25-35.91$% across use cases. Furthermore, the copies\\ngenerated using our approach outperformed manually created content in multiple\\npilot studies using a multi-armed bandit framework. The winning copy improved\\nthe click-through rate by $38.5-45.21$%.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-04-14T16:38:28Z\"}"}
