{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02578v1\", \"title\": \"Helium escape signatures are generally strongest during younger ages but\\n  this age dependence is lost in the diversity of observed exoplanets\", \"summary\": \"Highly irradiated exoplanets undergo extreme hydrodynamic atmospheric escape,\\ndue to their high level of received XUV flux. Over their lifetime, this escape\\nvaries significantly, making evolution studies essential for interpreting the\\ngrowing number of observations of escaping planetary atmospheres. In a previous\\nwork, we modelled this evolving escape, alongside one of its observable\\ntracers, the helium triplet transit signature at 1083nm. Using hydrodynamic and\\nray-tracing models, we demonstrated that atmospheric escape and the\\ncorresponding He 1083nm signature are stronger at younger ages, for a\\n0.3$~M_\\\\text{J}$ gas-giant. Yet, the current literature includes several young\\n(<1Gyr) planets with weak or non-detections in He 1083nm. To understand this\\napparent discrepancy, we now perform detailed modelling for many of these\\nsystems. The resulting He 1083nm predictions align relatively well with the\\nobservations. From our two studies, we conclude that for any given planet,\\nstronger atmospheric escape during younger ages produces deeper He 1083nm\\nabsorption. However, for a population of exoplanets, the relation between\\nyounger ages and stronger He absorptions is lost to the broad diversity of\\ntheir various other system parameters. Accordingly, for the current sample of\\nyoung, 1083nm-observed exoplanets, alternative trends take precedence. One such\\ntrend is that planets with deeper geometrical transits exhibit more favourable\\ndetections. Our modelling also agrees with the strong empirical trend in the\\nliterature between $ EW \\\\cdot R_{*}^{2}$ and $F_{\\\\text{xuv}} \\\\cdot\\nR_{\\\\text{pl}}^2 / \\\\Phi_{g}$. Additionally, we show that the coupling between\\nthe lower and upper atmospheres is necessary for a robust prediction of the\\n1083nm signature.\", \"main_category\": \"astro-ph.EP\", \"categories\": \"astro-ph.EP\", \"published\": \"2025-04-03T13:41:16Z\"}"}
