{"value":"{\"aid\": \"http://arxiv.org/abs/2504.01456v1\", \"title\": \"Multiscale exploration of SMACS J0723.3--7327's intracluster light and\\n  past dynamical history\", \"summary\": \"In this work an analysis of the intracluster light (ICL) in the galaxy\\ncluster SMACS J0723.3-7327 (hereafter, SMACS J0723) using JWST/NIRCam deep\\nimaging in six filters (F090W to F444W) is presented. The images were processed\\nfor low surface brightness (LSB) science, with additional correction for\\ninstrumental scattering in the short-wavelength channels, and analysed using\\nwavelet-based decomposition. The ICL, brightest cluster galaxy (BCG), and\\nsatellite galaxies were extracted and modelled, with 2D maps for each\\ncomponent. ICL and ICL+BCG fractions, computed across all filters within a 400\\nkpc radius, exhibit a flat trend with wavelength, averaging 28% and 34%,\\nrespectively. Flux ratios between the BCG and the next brightest members\\n(M$_{12}$, M$_{13}$ and M$_{14}$) also display minimal wavelength dependence.\\nThese results indicate that SMACS J0723 is a dynamically evolved cluster with a\\ndominant BCG and well-developed ICL. Five prominent ICL substructures are\\nanalysed, contributing to 10-12% of the total ICL+BCG flux budget, slightly\\nexceeding simulation predictions. Their short dynamical timescales suggest an\\ninstantaneous ICL injection rate of several $10^3 L_{\\\\odot}\\\\,{\\\\rm yr}^{-1}$,\\nconsistent with active dynamical assembly. These findings support a scenario\\nwhere SMACS J0723's ICL growth is currently driven by galaxy mergers involving\\nthe BCG and other bright satellites, rather than by the accretion of\\npre-processed ICL from a recent cluster merger. However, extrapolating the\\ncurrent injection rate to the cluster's lifetime indicates that additional\\nmechanisms are required to match the growth observed in other clusters over\\ncosmic times.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-02T08:10:05Z\"}"}
