{"value":"{\"aid\": \"http://arxiv.org/abs/2504.11377v1\", \"title\": \"Improving Swimming Performance in Soft Robotic Fish with Distributed\\n  Muscles and Embedded Kinematic Sensing\", \"summary\": \"Bio-inspired underwater vehicles could yield improved efficiency,\\nmaneuverability, and environmental compatibility over conventional\\npropeller-driven underwater vehicles. However, to realize the swimming\\nperformance of biology, there is a need for soft robotic swimmers with both\\ndistributed muscles and kinematic feedback. This study presents the design and\\nswimming performance of a soft robotic fish with independently controllable\\nmuscles and embedded kinematic sensing distributed along the body. The soft\\nswimming robot consists of an interior flexible spine, three axially\\ndistributed sets of HASEL artificial muscles, embedded strain gauges, a\\nstreamlined silicone body, and off-board electronics. In a fixed configuration,\\nthe soft robot generates a maximum thrust of 7.9 mN when excited near its first\\nresonant frequency (2 Hz) with synchronized antagonistic actuation of all\\nmuscles. When excited near its second resonant frequency (8 Hz), synchronized\\nmuscle actuation generates 5.0 mN of thrust. By introducing a sequential phase\\noffset into the muscle actuation, the thrust at the second resonant frequency\\nincreases to 7.2 mN, a 44% increase from simple antagonistic activation. The\\nsequential muscle activation improves the thrust by increasing 1) the tail-beat\\nvelocity and 2) traveling wave content in the swimming kinematics by four\\ntimes. Further, the second resonant frequency (8 Hz) generates nearly as much\\nthrust as the first resonance (2 Hz) while requiring only $\\\\approx25$% of the\\ntail displacement, indicating that higher resonant frequencies have benefits\\nfor swimming in confined environments where a smaller kinematic envelope is\\nnecessary. These results demonstrate the performance benefits of independently\\ncontrollable muscles and distributed kinematic sensing, and this type of soft\\nrobotic swimmer provides a platform to address the open challenge of\\nsensorimotor control.\", \"main_category\": \"cs.RO\", \"categories\": \"cs.RO\", \"published\": \"2025-04-15T16:48:08Z\"}"}
