{"value":"{\"aid\": \"http://arxiv.org/abs/2504.12071v1\", \"title\": \"Generalized Restart Mechanism for Successive-Cancellation Flip Decoding\\n  of Polar Codes\", \"summary\": \"Polar codes are a class of linear error-correction codes that have received a\\nlot of attention due to their ability to achieve channel capacity in an\\narbitrary binary discrete memoryless channel (B-DMC) with low-complexity\\nsuccessive-cancellation (SC) decoding. However, practical implementations often\\nrequire better error-correction performance than what SC decoding provides,\\nparticularly at short to moderate code lengths. Successive-cancellation flip\\n(SCF) decoding algorithm was proposed to improve error-correction performance\\nwith an aim to detect and correct the first wrongly estimated bit in a codeword\\nbefore resuming SC decoding. At each additional SC decoding trial, i.e.,\\ndecoding attempt beyond the initial unsuccessful trial, one bit estimated as\\nthe least reliable is flipped. Dynamic SCF (DSCF) is a variation of SCF, where\\nmultiple bits may be flipped simultaneously per trial. Despite the improved\\nerror-correction performance compared to the SC decoder, SCF-based decoders\\nhave variable execution time, which leads to high average execution time and\\nlatency. In this work, we propose the generalized restart mechanism (GRM) that\\nallows to skip decoding computations that are identical between the initial\\ntrial and any additional trial. Under DSCF decoding with up to 3-bit flips per\\ndecoding trial, our proposed GRM is shown to reduce the average execution time\\nby 25% to 60% without any negative effect on error-correction performance. The\\nproposed mechanism is adaptable to state-of-the-art latency-reduction\\ntechniques. When applied to Fast-DSCF-3 decoding, the additional reduction\\nbrought by the GRM is 15% to 22%. For the DSCF-3 decoder, the proposed\\nmechanism requires approximately 4% additional memory.\", \"main_category\": \"cs.IT\", \"categories\": \"cs.IT,math.IT\", \"published\": \"2025-04-16T13:26:30Z\"}"}
