{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21317v1\", \"title\": \"Redundancy Analysis and Mitigation for Machine Learning-Based Process\\n  Monitoring of Additive Manufacturing\", \"summary\": \"The deployment of machine learning (ML)-based process monitoring systems has\\nsignificantly advanced additive manufacturing (AM) by enabling real-time defect\\ndetection, quality assessment, and process optimization. However, redundancy is\\na critical yet often overlooked challenge in the deployment and operation of\\nML-based AM process monitoring systems. Excessive redundancy leads to increased\\nequipment costs, compromised model performance, and high computational\\nrequirements, posing barriers to industrial adoption. However, existing\\nresearch lacks a unified definition of redundancy and a systematic framework\\nfor its evaluation and mitigation. This paper defines redundancy in ML-based AM\\nprocess monitoring and categorizes it into sample-level, feature-level, and\\nmodel-level redundancy. A comprehensive multi-level redundancy mitigation\\n(MLRM) framework is proposed, incorporating advanced methods such as data\\nregistration, downscaling, cross-modality knowledge transfer, and model pruning\\nto systematically reduce redundancy while improving model performance. The\\nframework is validated through an ML-based in-situ defect detection case study\\nfor directed energy deposition (DED), demonstrating a 91% reduction in latency,\\na 47% decrease in error rate, and a 99.4% reduction in storage requirements.\\nAdditionally, the proposed approach lowers sensor costs and energy consumption,\\nenabling a lightweight, cost-effective, and scalable monitoring system. By\\ndefining redundancy and introducing a structured mitigation framework, this\\nstudy establishes redundancy analysis and mitigation as a key enabler of\\nefficient ML-based process monitoring in production environments.\", \"main_category\": \"cs.CE\", \"categories\": \"cs.CE,cs.LG,eess.SP\", \"published\": \"2025-04-30T05:04:53Z\"}"}
