{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00375v1\", \"title\": \"Learning to Estimate Package Delivery Time in Mixed Imbalanced Delivery\\n  and Pickup Logistics Services\", \"summary\": \"Accurately estimating package delivery time is essential to the logistics\\nindustry, which enables reasonable work allocation and on-time service\\nguarantee. This becomes even more necessary in mixed logistics scenarios where\\ncouriers handle a high volume of delivery and a smaller number of pickup\\nsimultaneously. However, most of the related works treat the pickup and\\ndelivery patterns on couriers' decision behavior equally, neglecting that the\\npickup has a greater impact on couriers' decision-making compared to the\\ndelivery due to its tighter time constraints. In such context, we have three\\nmain challenges: 1) multiple spatiotemporal factors are intricately\\ninterconnected, significantly affecting couriers' delivery behavior; 2) pickups\\nhave stricter time requirements but are limited in number, making it\\nchallenging to model their effects on couriers' delivery process; 3) couriers'\\nspatial mobility patterns are critical determinants of their delivery behavior,\\nbut have been insufficiently explored. To deal with these, we propose TransPDT,\\na Transformer-based multi-task package delivery time prediction model. We first\\nemploy the Transformer encoder architecture to capture the spatio-temporal\\ndependencies of couriers' historical travel routes and pending package sets.\\nThen we design the pattern memory to learn the patterns of pickup in the\\nimbalanced dataset via attention mechanism. We also set the route prediction as\\nan auxiliary task of delivery time prediction, and incorporate the prior\\ncourier spatial movement regularities in prediction. Extensive experiments on\\nreal industry-scale datasets demonstrate the superiority of our method. A\\nsystem based on TransPDT is deployed internally in JD Logistics to track more\\nthan 2000 couriers handling hundreds of thousands of packages per day in\\nBeijing.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-05-01T08:00:22Z\"}"}
