{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10969v1\", \"title\": \"RF Sensing Security and Malicious Exploitation: A Comprehensive Survey\", \"summary\": \"Radio Frequency (RF) sensing technologies have experienced significant growth\\ndue to the widespread adoption of RF devices and the Internet of Things (IoT).\\nThese technologies enable numerous applications across healthcare, smart homes,\\nindustrial automation, and human-computer interaction. However, the\\nnon-intrusive and ubiquitous nature of RF sensing - combined with its\\nenvironmental sensitivity and data dependency - makes these systems inherently\\nvulnerable not only as attack targets, but also as powerful attack vectors.\\nThis survey presents a comprehensive analysis of RF sensing security, covering\\nboth system-level vulnerabilities - such as signal spoofing, adversarial\\nperturbations, and model poisoning - and the misuse of sensing capabilities for\\nattacks like cross-boundary surveillance, side-channel inference, and semantic\\nprivacy breaches. We propose unified threat models to structure these attack\\nvectors and further conduct task-specific vulnerability assessments across key\\nRF sensing applications, identifying their unique attack surfaces and risk\\nprofiles. In addition, we systematically review defense strategies across\\nsystem layers and threat-specific scenarios, incorporating both active and\\npassive paradigms to provide a structured and practical view of protection\\nmechanisms. Compared to prior surveys, our work distinguishes itself by\\noffering a multi-dimensional classification framework based on task type,\\nthreat vector, and sensing modality, and by providing fine-grained,\\nscenario-driven analysis that bridges theoretical models and real-world\\nimplications. This survey aims to serve as a comprehensive reference for\\nresearchers and practitioners seeking to understand, evaluate, and secure the\\nevolving landscape of RF sensing technologies.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-04-15T08:20:53Z\"}"}
