{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17563v1\", \"title\": \"The Case for External Graph Sketching\", \"summary\": \"Algorithms in the data stream model use $O(polylog(N))$ space to compute some\\nproperty of an input of size $N$, and many of these algorithms are implemented\\nand used in practice. However, sketching algorithms in the graph semi-streaming\\nmodel use $O(V polylog(V))$ space for a $V$-vertex graph, and the fact that\\nimplementations of these algorithms are not used in the academic literature or\\nin industrial applications may be because this space requirement is too large\\nfor RAM on today's hardware.\\n  In this paper we introduce the external semi-streaming model, which addresses\\nthe aspects of the semi-streaming model that limit its practical impact. In\\nthis model, the input is in the form of a stream and $O(V polylog(V))$ space is\\navailable, but most of that space is accessible only via block I/O operations\\nas in the external memory model. The goal in the external semi-streaming model\\nis to simultaneously achieve small space and low I/O cost.\\n  We present a general transformation from any vertex-based sketch algorithm to\\none which has a low sketching cost in the new model. We prove that this\\nautomatic transformation is tight or nearly (up to a $O(\\\\log(V))$ factor) tight\\nvia an I/O lower bound for the task of sketching the input stream.\\n  Using this transformation and other techniques, we present external\\nsemi-streaming algorithms for connectivity, bipartiteness testing,\\n$(1+\\\\epsilon)$-approximating MST weight, testing k-edge connectivity,\\n$(1+\\\\epsilon)$-approximating the minimum cut of a graph, computing\\n$\\\\epsilon$-cut sparsifiers, and approximating the density of the densest\\nsubgraph. These algorithms all use $O(V poly(\\\\log(V), \\\\epsilon^{-1},k)$ space.\\nFor many of these problems, our external semi-streaming algorithms outperform\\nthe state of the art algorithms in both the sketching and external-memory\\nmodels.\", \"main_category\": \"cs.DS\", \"categories\": \"cs.DS\", \"published\": \"2025-04-24T13:56:47Z\"}"}
