{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05108v1\", \"title\": \"Multi-agent Embodied AI: Advances and Future Directions\", \"summary\": \"Embodied artificial intelligence (Embodied AI) plays a pivotal role in the\\napplication of advanced technologies in the intelligent era, where AI systems\\nare integrated with physical bodies that enable them to perceive, reason, and\\ninteract with their environments. Through the use of sensors for input and\\nactuators for action, these systems can learn and adapt based on real-world\\nfeedback, allowing them to perform tasks effectively in dynamic and\\nunpredictable environments. As techniques such as deep learning (DL),\\nreinforcement learning (RL), and large language models (LLMs) mature, embodied\\nAI has become a leading field in both academia and industry, with applications\\nspanning robotics, healthcare, transportation, and manufacturing. However, most\\nresearch has focused on single-agent systems that often assume static, closed\\nenvironments, whereas real-world embodied AI must navigate far more complex\\nscenarios. In such settings, agents must not only interact with their\\nsurroundings but also collaborate with other agents, necessitating\\nsophisticated mechanisms for adaptation, real-time learning, and collaborative\\nproblem-solving. Despite increasing interest in multi-agent systems, existing\\nresearch remains narrow in scope, often relying on simplified models that fail\\nto capture the full complexity of dynamic, open environments for multi-agent\\nembodied AI. Moreover, no comprehensive survey has systematically reviewed the\\nadvancements in this area. As embodied AI rapidly evolves, it is crucial to\\ndeepen our understanding of multi-agent embodied AI to address the challenges\\npresented by real-world applications. To fill this gap and foster further\\ndevelopment in the field, this paper reviews the current state of research,\\nanalyzes key contributions, and identifies challenges and future directions,\\nproviding insights to guide innovation and progress in this field.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI,cs.MA\", \"published\": \"2025-05-08T10:13:53Z\"}"}
