{"value":"{\"aid\": \"http://arxiv.org/abs/2504.10046v1\", \"title\": \"CodeRAG: Supportive Code Retrieval on Bigraph for Real-World Code\\n  Generation\", \"summary\": \"Large language models (LLMs) have shown promising performance in automated\\ncode generation, especially excelling in simple tasks such as generating\\nstandalone codes. Different from simple tasks, real-world code generation\\nusually depends on specific programming environment (e.g., code repositories).\\nIt contains complex dependencies and domain knowledge, which is needed for LLMs\\nwhen generating target code snippets. In this paper, we propose CodeRAG, a\\nretrieval-augmented code generation (RAG) framework to comprehensively retrieve\\nsupportive codes for real-world code generation. Beginning with the\\nrequirement, CodeRAG first constructs a requirement graph for the current\\nrepository, and retrieves sub- and similar- requirement nodes of the target\\nrequirement on the graph. Meanwhile, it models the repository into a DS-code\\ngraph. CodeRAG then maps these relevant requirement nodes into their\\ncorresponding code nodes, and treats these code nodes as archors for LLM\\nreasoning on DS-code graph. Finally, CodeRAG introduces a code-oriented agentic\\nreasoning process, seamlessly allowing LLMs to reason and comprehensively\\nretrieve for supportive codes which LLMs' need for generating correct programs.\\nExperiments show that CodeRAG achieves significant improvements (i.e.,\\nincreasing 40.90 and 37.79 Pass@1 on GPT-4o and Gemini-Pro on DevEval) compared\\nto no RAG scenarios. Further tests on reasoning LLMs (i.e., QwQ-32B) confirm\\nCodeRAG's adaptability and efficacy across various types of LLMs. In addition,\\nCodeRAG outperforms commercial programming products such as Copilit and Cursor.\\nWe further investigate the performance of our framework on different dependency\\ntypes, and observe that CodeRAG is superior in generating examples where target\\ncodes invoke predefined cross-file code snippets. These results demonstrate\\nCodeRAG's potential in solving real-world repo-level coding challenges.\", \"main_category\": \"cs.SE\", \"categories\": \"cs.SE\", \"published\": \"2025-04-14T09:51:23Z\"}"}
