{"value":"{\"aid\": \"http://arxiv.org/abs/2505.05073v1\", \"title\": \"RepSNet: A Nucleus Instance Segmentation model based on Boundary\\n  Regression and Structural Re-parameterization\", \"summary\": \"Pathological diagnosis is the gold standard for tumor diagnosis, and nucleus\\ninstance segmentation is a key step in digital pathology analysis and\\npathological diagnosis. However, the computational efficiency of the model and\\nthe treatment of overlapping targets are the major challenges in the studies of\\nthis problem. To this end, a neural network model RepSNet was designed based on\\na nucleus boundary regression and a structural re-parameterization scheme for\\nsegmenting and classifying the nuclei in H\\\\&E-stained histopathological images.\\nFirst, RepSNet estimates the boundary position information (BPI) of the parent\\nnucleus for each pixel. The BPI estimation incorporates the local information\\nof the pixel and the contextual information of the parent nucleus. Then, the\\nnucleus boundary is estimated by aggregating the BPIs from a series of pixels\\nusing a proposed boundary voting mechanism (BVM), and the instance segmentation\\nresults are computed from the estimated nucleus boundary using a connected\\ncomponent analysis procedure. The BVM intrinsically achieves a kind of\\nsynergistic belief enhancement among the BPIs from various pixels. Therefore,\\ndifferent from the methods available in literature that obtain nucleus\\nboundaries based on a direct pixel recognition scheme, RepSNet computes its\\nboundary decisions based on some guidances from macroscopic information using\\nan integration mechanism. In addition, RepSNet employs a re-parametrizable\\nencoder-decoder structure. This model can not only aggregate features from some\\nreceptive fields with various scales which helps segmentation accuracy\\nimprovement, but also reduce the parameter amount and computational burdens in\\nthe model inference phase through the structural re-parameterization technique.\\nExtensive experiments demonstrated the superiorities of RepSNet compared to\\nseveral typical benchmark models.\", \"main_category\": \"eess.IV\", \"categories\": \"eess.IV,cs.CV\", \"published\": \"2025-05-08T09:08:58Z\"}"}
