{"value":"{\"aid\": \"http://arxiv.org/abs/2504.14905v1\", \"title\": \"CRAVE: A Conflicting Reasoning Approach for Explainable Claim\\n  Verification Using LLMs\", \"summary\": \"The rapid spread of misinformation, driven by digital media and AI-generated\\ncontent, has made automatic claim verification essential. Traditional methods,\\nwhich depend on expert-annotated evidence, are labor-intensive and not\\nscalable. Although recent automated systems have improved, they still struggle\\nwith complex claims that require nuanced reasoning. To address this, we propose\\nCRAVE, a Conflicting Reasoning Approach for explainable claim VErification,\\nthat verify the complex claims based on the conflicting rationales reasoned by\\nlarge language models (LLMs). Specifically, CRAVE introduces a three-module\\nframework. Ambiguity Elimination enchanced Evidence Retrieval module performs\\nambiguity elimination and entity-based search to gather relevant evidence\\nrelated to claim verification from external sources like Wikipedia. Conflicting\\nPerspective Reasoning and Preliminary Judgment module with LLMs adopts LLMs to\\nreason rationales with conflicting stances about claim verification from\\nretrieved evidence across four dimensions, i.e., direct evidence, semantic\\nrelationships, linguistic patterns, and logical reasoning and make a\\npreliminary judgment. Finally, Small Language Model (SLM) based Judge module is\\nfine-tuned to make use of preliminary judgment from LLMs to assess the\\nconfidence of the conflicting rationales and make a final authenticity\\njudgment. This methodology allows CRAVE to capture subtle inconsistencies in\\ncomplex claims, improving both the accuracy and transparency of claim\\nverification. Extensive experiments on two public claim verification datasets\\ndemonstrate that our CRAVE model achieves much better performance than\\nstate-of-the-art methods and exhibits a superior capacity for finding relevant\\nevidence and explaining the model predictions. The code is provided at\\nhttps://github.com/8zym/CRAVE.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-04-21T07:20:31Z\"}"}
