{"value":"{\"aid\": \"http://arxiv.org/abs/2503.21706v1\", \"title\": \"Flashlights: Prospects for constraining the Initial Mass Function around\\n  cosmic noon with caustic-crossing events\", \"summary\": \"The Flashlights program with the Hubble Space Telescope imaged the six Hubble\\nFrontier Fields galaxy clusters in two epochs and detected twenty transients.\\nThese are primarily expected to be caustic-crossing events (CCEs) where bright\\nstars in distant lensed galaxies, typically at redshift $z\\\\approx1$--3, get\\ntemporarily magnified close to cluster caustics. Since CCEs are generally\\nbiased toward more massive and luminous stars, they offer a unique route for\\nprobing the high end of the stellar mass function. We take advantage of the\\nFlashlights event statistics to place preliminary constraints on the stellar\\ninitial mass function (IMF) around cosmic noon. The photometry (along with\\nspectral information) of lensed arcs is used to infer their various stellar\\nproperties, and stellar synthesis models are used to evolve a recent stellar\\npopulation in them. We estimate the microlens surface density near each arc\\nand, together with existing lens models and simple formalism for CCEs,\\ncalculate the expected rate for a given IMF. We find that, on average, a\\nSalpeter-like IMF ($\\\\alpha=2.35$) underpredicts the number of observed CCEs by\\na factor of ${\\\\sim}0.7$, and a top-heavy IMF ($\\\\alpha=1.00$) overpredicts by a\\nfactor of ${\\\\sim}1.7$, suggesting that the average IMF slope may lie somewhere\\nin between. However, given the large uncertainties associated with estimating\\nthe stellar populations, these results are strongly model-dependent.\\nNevertheless, we introduce a useful framework for constraining the IMF using\\nCCEs. Observations with JWST are already yielding many more CCEs and will soon\\nenable more stringent constraints on the IMF at a range of redshifts.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA,astro-ph.CO\", \"published\": \"2025-03-27T17:20:35Z\"}"}
