{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23910v1\", \"title\": \"Droplet breakup morphologies and the resultant size distribution in an\\n  opposed-flow airstream at different Weber numbers\", \"summary\": \"The present study investigates the morphology and breakup dynamics of a\\nfreely falling drop in a vertical airstream using shadowgraphy and in-line\\nholography. The in-line holography provides the temporal evolution of the\\nvolumetric size distribution of child droplets formed during various\\nfragmentation processes at different Weber numbers (We). The droplet undergoes\\ndifferent fragmentation processes at significantly lower Weber numbers in\\nopposed-flow configurations compared to cross-flow configurations. Our findings\\nreveal distinct fragmentation modes, namely bag, bag-stamen, and dual-bag\\nbreakup, observed at We=9.38, 16.9, and 18.9, respectively. At We = 9.38, the\\ncombined effects of bag rupture, rim breakup, and node fragmentation generate\\nchild droplets of varying sizes, driven by the interplay of the\\nRayleigh-Plateau and Rayleigh-Taylor instabilities. At We = 16.9, the\\ninteraction of aerodynamic and shear forces leads to bag-stamen fragmentation,\\ncharacterized by forming a stamen-like structure along with the bag. Both bag\\nand bag-stamen breakups result in tri-modal size distributions. However, at We\\n= 16.9, fewer tiny droplets are produced compared to the bag breakup observed\\nat lower Weber numbers. In contrast, at We = 18.9, a dual-bag breakup occurs,\\nwhere both bags inflate and burst simultaneously. This process generates tiny\\nchild droplets in the early stages, while larger child droplets form later due\\nto the fragmentation of the rim and nodes, resulting in a bi-modal size\\ndistribution. We have performed a theoretical analysis using a two-parameter\\ngamma distribution, which satisfactorily predicts the size distributions\\nobserved experimentally at different Weber numbers.\", \"main_category\": \"physics.flu-dyn\", \"categories\": \"physics.flu-dyn\", \"published\": \"2025-03-31T10:02:22Z\"}"}
