{"value":"{\"aid\": \"http://arxiv.org/abs/2503.23731v1\", \"title\": \"Investigation of intelligent barbell squat coaching system based on\\n  computer vision and machine learning\", \"summary\": \"Purpose: Research has revealed that strength training can reduce the\\nincidence of chronic diseases and physical deterioration at any age. Therefore,\\nhaving a movement diagnostic system is crucial for training alone. Hence, this\\nstudy developed an artificial intelligence and computer vision-based barbell\\nsquat coaching system with a real-time mode that immediately diagnoses the\\nissue and provides feedback after each squat. In addition, a replay mode allows\\nusers to examine their previous squats and check their comments. Initially,\\nfour primary characteristics of the barbell squat were identified: body joint\\nangles, dorsiflexion, the ratio of knee-to-hip movement, and barbell stability.\\nMethods: We collect 8,151 squats from 77 participants, categorizing them as\\ngood squats and six issues. Then, we trained the diagnosis models with three\\nmachine-learning architectures. Furthermore, this research applied the SHapley\\nAdditive exPlanations (SHAP) method to enhance the accuracy of issue prediction\\nand reduce the computation time by feature selection. Results: The F1 score of\\nthe six issues reached 86.86%, 69.01%, 77.42%, 90.74%, 95.83%, and 100%. Each\\nsquat diagnosis took less than 0.5 seconds. Finally, this study examined the\\nefficacy of the proposed system with two groups of participants trained with\\nand without the system. Subsequently, participants trained with the system\\nexhibited substantial improvements in their squat technique, as assessed both\\nby the system itself and by a professional weightlifting coach. Conclusion:\\nThis is a comprehensive study that integrates artificial intelligence, computer\\nvision and multivariable processing technologies, aimed at building a\\nreal-time, user-friendly barbell squat feedback and training system.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV,cs.AI,eess.IV\", \"published\": \"2025-03-31T05:08:52Z\"}"}
