{"value":"{\"aid\": \"http://arxiv.org/abs/2504.17343v1\", \"title\": \"TimeChat-Online: 80% Visual Tokens are Naturally Redundant in Streaming\\n  Videos\", \"summary\": \"The rapid growth of online video platforms, particularly live streaming\\nservices, has created an urgent need for real-time video understanding systems.\\nThese systems must process continuous video streams and respond to user queries\\ninstantaneously, presenting unique challenges for current Video Large Language\\nModels (VideoLLMs). While existing VideoLLMs excel at processing complete\\nvideos, they face significant limitations in streaming scenarios due to their\\ninability to handle dense, redundant frames efficiently. We introduce\\nTimeChat-Online, a novel online VideoLLM that revolutionizes real-time video\\ninteraction. At its core lies our innovative Differential Token Drop (DTD)\\nmodule, which addresses the fundamental challenge of visual redundancy in\\nstreaming videos. Drawing inspiration from human visual perception's Change\\nBlindness phenomenon, DTD preserves meaningful temporal changes while filtering\\nout static, redundant content between frames. Remarkably, our experiments\\ndemonstrate that DTD achieves an 82.8% reduction in video tokens while\\nmaintaining 98% performance on StreamingBench, revealing that over 80% of\\nvisual content in streaming videos is naturally redundant without requiring\\nlanguage guidance. To enable seamless real-time interaction, we present\\nTimeChat-Online-139K, a comprehensive streaming video dataset featuring diverse\\ninteraction patterns including backward-tracing, current-perception, and\\nfuture-responding scenarios. TimeChat-Online's unique Proactive Response\\ncapability, naturally achieved through continuous monitoring of video scene\\ntransitions via DTD, sets it apart from conventional approaches. Our extensive\\nevaluation demonstrates TimeChat-Online's superior performance on streaming\\nbenchmarks (StreamingBench and OvOBench) and maintaining competitive results on\\nlong-form video tasks such as Video-MME and MLVU.\", \"main_category\": \"cs.CV\", \"categories\": \"cs.CV\", \"published\": \"2025-04-24T07:59:46Z\"}"}
