{"value":"{\"aid\": \"http://arxiv.org/abs/2504.21457v1\", \"title\": \"xEEGNet: Towards Explainable AI in EEG Dementia Classification\", \"summary\": \"This work presents xEEGNet, a novel, compact, and explainable neural network\\nfor EEG data analysis. It is fully interpretable and reduces overfitting\\nthrough major parameter reduction. As an applicative use case, we focused on\\nclassifying common dementia conditions, Alzheimer's and frontotemporal\\ndementia, versus controls. xEEGNet is broadly applicable to other neurological\\nconditions involving spectral alterations. We initially used ShallowNet, a\\nsimple and popular model from the EEGNet-family. Its structure was analyzed and\\ngradually modified to move from a \\\"black box\\\" to a more transparent model,\\nwithout compromising performance. The learned kernels and weights were examined\\nfrom a clinical standpoint to assess medical relevance. Model variants,\\nincluding ShallowNet and the final xEEGNet, were evaluated using robust\\nNested-Leave-N-Subjects-Out cross-validation for unbiased performance\\nestimates. Variability across data splits was explained using embedded EEG\\nrepresentations, grouped by class and set, with pairwise separability to\\nquantify group distinction. Overfitting was assessed through\\ntraining-validation loss correlation and training speed. xEEGNet uses only 168\\nparameters, 200 times fewer than ShallowNet, yet retains interpretability,\\nresists overfitting, achieves comparable median performance (-1.5%), and\\nreduces variability across splits. This variability is explained by embedded\\nEEG representations: higher accuracy correlates with greater separation between\\ntest set controls and Alzheimer's cases, without significant influence from\\ntraining data. xEEGNet's ability to filter specific EEG bands, learn\\nband-specific topographies, and use relevant spectral features demonstrates its\\ninterpretability. While large deep learning models are often prioritized for\\nperformance, this study shows smaller architectures like xEEGNet can be equally\\neffective in EEG pathology classification.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG,cs.AI\", \"published\": \"2025-04-30T09:24:50Z\"}"}
