{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02798v1\", \"title\": \"North+Lone Star Supernova Host Survey I: Local Host-Galaxy H$\\u03b1$\\n  Surface Brightness and the Hubble Residuals of Type Ia Supernovae\", \"summary\": \"We present optical integral-field unit (IFU) spectroscopy acquired with the\\nGeorge and Cynthia Mitchell Spectrograph on the Harlan J. Smith telescope at\\nMcDonald Observatory of 94 galaxies (0.01 < z < 0.058) that have hosted Type Ia\\nsupernovae (SNe Ia). We selected host galaxies with star-forming morphology,\\nconsistent with the criteria used by Riess et al. (2022). We measured the\\nH${\\\\alpha}$ surface brightness of each host galaxy within 1 kpc of the location\\nof the supernova. Using distances from the Pantheon+ sample, we find a step in\\nHubble residuals compared to local H${\\\\alpha}$ surface brightness of -0.097\\n$\\\\pm$ 0.051 mag at 1.9${\\\\sigma}$ significance in a sample of 73 host galaxies,\\nwhere SNe in environments with smaller H${\\\\alpha}$ surface brightness are, on\\naverage, less luminous after correction for light-curve shape and color. Almost\\nall of the SNe in our sample were discovered by targeted surveys. Using an\\nindependent sample primarily from the untargeted Nearby Supernova Factory\\nsurvey, Rigault et al. (2020) found a step of 0.045 $\\\\pm$ 0.029 mag where SNe\\nin passive environments are instead brighter, which is in 2.4${\\\\sigma}$ tension\\nwith our measurement. Rigault et al. (2013) designated SNe Ia comparatively\\nsmall HRs (< -0.1) and faint local H${\\\\alpha}$ surface brightness (SB)\\n(<log10(H${\\\\alpha}$ SB/(erg$^{-1}$s$^{-1}$kpc$^2$))=38.32 as the M$_2$\\npopulation. SNe that would be classified as M$_2$ are less highly represented\\nin our sample (7% versus 21%). When we include an additional twelve early-type\\ngalaxies, the number of M$_2$ SNe is almost doubled, although the tension with\\nthe HR step measured by Rigault et al. (2020) persists at 1.7${\\\\sigma}$.\", \"main_category\": \"astro-ph.GA\", \"categories\": \"astro-ph.GA\", \"published\": \"2025-04-03T17:42:16Z\"}"}
