{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00392v1\", \"title\": \"Equatorial African Lightning: Past. Present and Future\", \"summary\": \"Lightning strikes are one of the leading causes of death among natural\\ndisasters in tropical regions. The Congo rainforests host the highest rates of\\nlightning flashes in the world and the lightning properties in this region have\\na strong seasonality owing to the cross-equatorial movements of the Inter\\nTropical Convergence Zone (ITCZ) throughout the year. The Lightning Flash Rates\\n(LFR) are found to peak during the Equinoctial months while lightning radiance\\nassumes the strongest values during the Boreal Summer months. Across the\\nTropical Rainfall Measuring Mission (TRMM) duration, (1998-2015), annual LFR in\\nthe Congo rainforest increases steadily, however, the average and the peak\\nlightning radiances decrease by ~1%/year and ~1.5%/year respectively which is\\ncounter-intuitive to the expected intensification in weather extremes in a\\nwarming climate. An in-depth analysis highlighted the influence of moisture\\nconvergence over the Congo Basin from the Atlantic as the primary contributor\\nto lightning compared to the aerosol nucleation and thermodynamic instability\\neffects during the boreal summers. Further, it has been proposed that in a\\ngradually warming climate, the strength of the prevailing ITCZ over Sahel\\nregion has intensified thereby weakening the moisture ingress towards the Congo\\nBasin, and this resulted in the observed reduction in lightning intensity in\\nrecent years. Consequently, the long-term projections of lightning properties\\nfrom global model simulations revealed a prominent weakening in lightning\\n(~50%) over the Congo Basin by the year 2100 assuming the Representative\\nConcentration Pathways (RCP) 8.5 emission scenarios. Key Words: Lightning, LIS,\\nCongo Basin, Sahel, Moisture Flux, Future projections.\", \"main_category\": \"physics.ao-ph\", \"categories\": \"physics.ao-ph\", \"published\": \"2025-05-01T08:29:53Z\"}"}
