{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20914v1\", \"title\": \"Relativistic ejecta from stellar mass black holes: insights from\\n  simulations and synthetic radio images\", \"summary\": \"We present numerical simulations of discrete relativistic ejecta from an\\nX-ray binary (XRB) with initial conditions directly informed by observations.\\nXRBs have been observed to launch powerful discrete plasma ejecta during state\\ntransitions, which can propagate up to parsec distances. Understanding these\\nejection events unveils new understanding of jet-launching, jet power, and\\njet-ISM interaction among other implications. Multi-frequency\\nquasi-simultaneous radio observations of ejecta from the black hole XRB MAXI\\nJ1820+070 produced both size and calorimetry constraints, which we use as\\ninitial conditions of a relativistic hydrodynamic simulation. We qualitatively\\nreproduce the observed deceleration of the ejecta in a homogeneous interstellar\\nmedium (ISM). Our simulations demonstrate that the ejecta must be denser than\\nthe ISM, the ISM be significantly low-density, and the launch be extremely\\npowerful, in order to propagate to the observed distances. The blob propagates\\nand clears out a high-pressure low-density cavity in its wake, providing an\\nexplanation for this pre-existing low-density environment, as well as\\n'bubble-like' environments in the vicinity of XRBs inferred from other studies.\\nAs the blob decelerates, we observe the onset of instabilities and a long-lived\\nreverse shock -- these mechanisms convert kinetic to internal energy in the\\nblob, responsible for in-situ particle acceleration. We transform the outputs\\nof our simulation into pseudo-radio images, incorporating the u,v coverage of\\nthe MeerKAT and e-MERLIN telescopes from the original observations with\\nreal-sky background. Through this, we maximize the interpretability of the\\nresults and provide direct comparison to current data, as well as provide\\nprediction capabilities.\", \"main_category\": \"astro-ph.HE\", \"categories\": \"astro-ph.HE\", \"published\": \"2025-04-29T16:33:54Z\"}"}
