{"value":"{\"aid\": \"http://arxiv.org/abs/2504.07492v1\", \"title\": \"Homogeneous nucleation rate of carbon dioxide hydrate formation under\\n  experimental condition from Seeding simulations\", \"summary\": \"We investigate the nucleation of carbon dioxide (CO$_2$) hydrates from carbon\\ndioxide aqueous solutions by means of molecular dynamics simulations using the\\nTIP4P/Ice and the TraPPE models for water and CO$_2$ respectively. We work at\\n400 bar and different temperatures and CO$_2$ concentrations. We use brute\\nforce molecular dynamics when the supersaturation or the supercooling are so\\nhigh so that nucleation occurs spontaneously and Seeding otherwise. We used\\nboth methods for a particular state and we get a rate of\\n10$^{25}\\\\,\\\\text{m}^{-3}\\\\text{s}^{-1}$ for nucleation in a CO$_2$ saturated\\nsolution at 255 K (35 K of supercooling). By comparison with our previous work\\non methane hydrates, we conclude that nucleation of CO$_2$ hydrates is several\\norders of magnitude faster due to a lower interfacial free energy between the\\ncrystal and the solution. By combining our nucleation studies with a recent\\ncalculation of the hydrate-solution interfacial free energy at coexistence, we\\nobtain a prediction of the nucleation rate temperature dependence for\\nCO$_{2}$-saturated solutions (the experimentally relevant concentration). On\\nthe one hand, we open the window for comparison with experiments for\\nsupercooling larger than 25 K. On the other hand, we conclude that homogeneous\\nnucleation is impossible for supercooling lower than 20 K. Therefore,\\nnucleation must be heterogeneous in typical experiments where hydrate formation\\nis observed at low supercooling. To assess the hypothesis that nucleation\\noccurs at the solution-CO$_2$ interface we run spontaneous nucleation\\nsimulations in two-phase systems and find, by comparison with single-phase\\nsimulations, that the interface does not affect hydrate nucleation, at least at\\nthe deep supercooling at which this study was carried out (40 and 45 K).\\nOverall, our work sheds light on molecular and thermodynamic aspects of hydrate\\nnucleation.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-04-10T06:49:16Z\"}"}
