{"value":"{\"aid\": \"http://arxiv.org/abs/2504.13080v1\", \"title\": \"Instability and stress fluctuations of a probe driven through a\\n  worm-like micellar fluid\", \"summary\": \"A particle moving through a worm-like micellar fluid (WLM) shows instability\\nand large fluctuations beyond a threshold. Despite many detailed studies, a\\ndirect measurement of the time-dependent stress on the probe particle remains\\nunexplored. To address this, we have designed a measuring geometry coupled with\\na commercial rheometer to study the dynamics of a cylindrical probe through a\\nWLM system of 2 wt.\\\\% cetyltrimethyl ammonium tosylate(CTAT) + 100 mM sodium\\nchloride(NaCl) for a wide range of velocity and stress scales. We map out the\\nin-situ velocity distribution using particle imaging velocimetry. Beyond a\\ncertain velocity threshold, we observe large stress fluctuation events with\\ngradual stress build-up followed by sudden stress drop indicating the storage\\nand release of elastic energy. The length scale constructed from the stress\\nbuild-up time scale and the probe's velocity match the length scale of\\nextensile deformation in the sample just before the stress drop, further\\nconfirming the strong correlation of such storage and release of energy with\\nthe unstable motion of the probe. Interestingly, despite their significant\\ndifference in magnitudes, the Weissenberg number ($Wi$) for the onset of flow\\ninstability obtained from the shear and extensile components remains almost the\\nsame. We also find that the turbulent motion of the probe at higher $Wi$\\nresults from the complex mixing of the stick-slip events originating from the\\npartial release of the stored elastic energy. Further, we show that the\\nmagnitude of the stick-slip events depends on the detailed micellar structure\\nand dynamics controlled by salt concentration and temperature.\", \"main_category\": \"cond-mat.soft\", \"categories\": \"cond-mat.soft\", \"published\": \"2025-04-17T16:46:19Z\"}"}
