{"value":"{\"aid\": \"http://arxiv.org/abs/2504.02459v1\", \"title\": \"A Physics-Informed Meta-Learning Framework for the Continuous Solution\\n  of Parametric PDEs on Arbitrary Geometries\", \"summary\": \"In this work, we introduce implicit Finite Operator Learning (iFOL) for the\\ncontinuous and parametric solution of partial differential equations (PDEs) on\\narbitrary geometries. We propose a physics-informed encoder-decoder network to\\nestablish the mapping between continuous parameter and solution spaces. The\\ndecoder constructs the parametric solution field by leveraging an implicit\\nneural field network conditioned on a latent or feature code. Instance-specific\\ncodes are derived through a PDE encoding process based on the second-order\\nmeta-learning technique. In training and inference, a physics-informed loss\\nfunction is minimized during the PDE encoding and decoding. iFOL expresses the\\nloss function in an energy or weighted residual form and evaluates it using\\ndiscrete residuals derived from standard numerical PDE methods. This approach\\nresults in the backpropagation of discrete residuals during both training and\\ninference.\\n  iFOL features several key properties: (1) its unique loss formulation\\neliminates the need for the conventional encode-process-decode pipeline\\npreviously used in operator learning with conditional neural fields for PDEs;\\n(2) it not only provides accurate parametric and continuous fields but also\\ndelivers solution-to-parameter gradients without requiring additional loss\\nterms or sensitivity analysis; (3) it can effectively capture sharp\\ndiscontinuities in the solution; and (4) it removes constraints on the geometry\\nand mesh, making it applicable to arbitrary geometries and spatial sampling\\n(zero-shot super-resolution capability). We critically assess these features\\nand analyze the network's ability to generalize to unseen samples across both\\nstationary and transient PDEs. The overall performance of the proposed method\\nis promising, demonstrating its applicability to a range of challenging\\nproblems in computational mechanics.\", \"main_category\": \"cs.LG\", \"categories\": \"cs.LG\", \"published\": \"2025-04-03T10:24:00Z\"}"}
