{"value":"{\"aid\": \"http://arxiv.org/abs/2504.15047v1\", \"title\": \"RainbowPlus: Enhancing Adversarial Prompt Generation via Evolutionary\\n  Quality-Diversity Search\", \"summary\": \"Large Language Models (LLMs) exhibit remarkable capabilities but are\\nsusceptible to adversarial prompts that exploit vulnerabilities to produce\\nunsafe or biased outputs. Existing red-teaming methods often face scalability\\nchallenges, resource-intensive requirements, or limited diversity in attack\\nstrategies. We propose RainbowPlus, a novel red-teaming framework rooted in\\nevolutionary computation, enhancing adversarial prompt generation through an\\nadaptive quality-diversity (QD) search that extends classical evolutionary\\nalgorithms like MAP-Elites with innovations tailored for language models. By\\nemploying a multi-element archive to store diverse high-quality prompts and a\\ncomprehensive fitness function to evaluate multiple prompts concurrently,\\nRainbowPlus overcomes the constraints of single-prompt archives and pairwise\\ncomparisons in prior QD methods like Rainbow Teaming. Experiments comparing\\nRainbowPlus to QD methods across six benchmark datasets and four open-source\\nLLMs demonstrate superior attack success rate (ASR) and diversity\\n(Diverse-Score $\\\\approx 0.84$), generating up to 100 times more unique prompts\\n(e.g., 10,418 vs. 100 for Ministral-8B-Instruct-2410). Against nine\\nstate-of-the-art methods on the HarmBench dataset with twelve LLMs (ten\\nopen-source, two closed-source), RainbowPlus achieves an average ASR of 81.1%,\\nsurpassing AutoDAN-Turbo by 3.9%, and is 9 times faster (1.45 vs. 13.50 hours).\\nOur open-source implementation fosters further advancements in LLM safety,\\noffering a scalable tool for vulnerability assessment. Code and resources are\\npublicly available at https://github.com/knoveleng/rainbowplus, supporting\\nreproducibility and future research in LLM red-teaming.\", \"main_category\": \"cs.CL\", \"categories\": \"cs.CL\", \"published\": \"2025-04-21T12:04:57Z\"}"}
