{"value":"{\"aid\": \"http://arxiv.org/abs/2504.20465v1\", \"title\": \"Exact multiple complex mobility edges and quantum state engineering in\\n  coupled 1D quasicystals\", \"summary\": \"The key concept of mobility edge, which marks the critical transition between\\nextended and localized states in energy domain, has attracted significant\\ninterest in the cutting-edge frontiers of modern physics due to its profound\\nimplications for understanding localization and transport properties in\\ndisordered systems. However, a generic way to construct multiple mobility edges\\n(MME) is still ambiguous and lacking. In this work, we propose a brief scheme\\nto engineer both real and complex exact multiple mobility edges exploiting a\\nfew coupled one-dimensional quasiperiodic chains. We study the\\nextended-localized transitions of coupled one-dimensional quasiperiodic chains\\nalong the chain direction. The model combines both the well-established\\nquasiperiodicity and a kind of freshly introduced staggered non-reciprocity,\\nwhich are aligned in two mutually perpendicular directions, within a unified\\nframework. Based on analytical analysis, we predict that when the couplings\\nbetween quasiperiodic chains are weak, the system will be in a mixed phase in\\nwhich the localized states and extended states coexist and intertwine, thus\\nlacking explicit energy separations. However, as the inter-chain couplings\\nincrease to certain strength, exact multiple mobility edges emerge. This\\nprediction is clearly verified by concrete numerical calculations of the\\nFractal Dimension and the scaling index $\\\\beta$. Moreover, we show that the\\ncombination of quasiperiodicity and the staggered non-reciprocity can be\\nutilized to design and realize quantum states of various configurations. Our\\nresults reveal a brief and general scheme to implement exact multiple mobility\\nedges for synthetic materials engineering.\", \"main_category\": \"cond-mat.dis-nn\", \"categories\": \"cond-mat.dis-nn\", \"published\": \"2025-04-29T06:57:04Z\"}"}
