{"value":"{\"aid\": \"http://arxiv.org/abs/2505.00278v1\", \"title\": \"DeCo: Defect-Aware Modeling with Contrasting Matching for Optimizing\\n  Task Assignment in Online IC Testing\", \"summary\": \"In the semiconductor industry, integrated circuit (IC) processes play a vital\\nrole, as the rising complexity and market expectations necessitate improvements\\nin yield. Identifying IC defects and assigning IC testing tasks to the right\\nengineers improves efficiency and reduces losses. While current studies\\nemphasize fault localization or defect classification, they overlook the\\nintegration of defect characteristics, historical failures, and the insights\\nfrom engineer expertise, which restrains their effectiveness in improving IC\\nhandling. To leverage AI for these challenges, we propose DeCo, an innovative\\napproach for optimizing task assignment in IC testing. DeCo constructs a novel\\ndefect-aware graph from IC testing reports, capturing co-failure relationships\\nto enhance defect differentiation, even with scarce defect data. Additionally,\\nit formulates defect-aware representations for engineers and tasks, reinforced\\nby local and global structure modeling on the defect-aware graph. Finally, a\\ncontrasting-based assignment mechanism pairs testing tasks with QA engineers by\\nconsidering their skill level and current workload, thus promoting an equitable\\nand efficient job dispatch. Experiments on a real-world dataset demonstrate\\nthat DeCo achieves the highest task-handling success rates in different\\nscenarios, exceeding 80\\\\%, while also maintaining balanced workloads on both\\nscarce or expanded defect data. Moreover, case studies reveal that DeCo can\\nassign tasks to potentially capable engineers, even for their unfamiliar\\ndefects, highlighting its potential as an AI-driven solution for the real-world\\nIC failure analysis and task handling.\", \"main_category\": \"cs.AI\", \"categories\": \"cs.AI\", \"published\": \"2025-05-01T04:01:14Z\"}"}
