{"value":"{\"aid\": \"http://arxiv.org/abs/2505.04273v1\", \"title\": \"With Friends Like These, Who Needs Explanations? Evaluating User\\n  Understanding of Group Recommendations\", \"summary\": \"Group Recommender Systems (GRS) employing social choice-based aggregation\\nstrategies have previously been explored in terms of perceived consensus,\\nfairness, and satisfaction. At the same time, the impact of textual\\nexplanations has been examined, but the results suggest a low effectiveness of\\nthese explanations. However, user understanding remains fairly unexplored, even\\nif it can contribute positively to transparent GRS. This is particularly\\ninteresting to study in more complex or potentially unfair scenarios when user\\npreferences diverge, such as in a minority scenario (where group members have\\nsimilar preferences, except for a single member in a minority position). In\\nthis paper, we analyzed the impact of different types of explanations on user\\nunderstanding of group recommendations. We present a randomized controlled\\ntrial (n = 271) using two between-subject factors: (i) the aggregation strategy\\n(additive, least misery, and approval voting), and (ii) the modality of\\nexplanation (no explanation, textual explanation, or multimodal explanation).\\nWe measured both subjective (self-perceived by the user) and objective\\nunderstanding (performance on model simulation, counterfactuals and error\\ndetection). In line with recent findings on explanations for machine learning\\nmodels, our results indicate that more detailed explanations, whether textual\\nor multimodal, did not increase subjective or objective understanding. However,\\nwe did find a significant effect of aggregation strategies on both subjective\\nand objective understanding. These results imply that when constructing GRS,\\npractitioners need to consider that the choice of aggregation strategy can\\ninfluence the understanding of users. Post-hoc analysis also suggests that\\nthere is value in analyzing performance on different tasks, rather than through\\na single aggregated metric of understanding.\", \"main_category\": \"cs.HC\", \"categories\": \"cs.HC\", \"published\": \"2025-05-07T09:22:44Z\"}"}
